
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>什么是垃圾回收 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="Published:  02 Jun 2015  Category:  GC
&amp;#x672C;&amp;#x6587;&amp;#x6458;&amp;#x81EA;&amp;#x6211;&amp;#x4EEC;&amp;#x51E0;&amp;#x5468;&amp;#x540E;&amp;#x5373;&amp;#x5C06;&amp;#x51FA;&amp;#x7248;&amp;#x7684;Garbage Collection Handbook&amp;#x4E00;&amp;#x4E66;&amp;#x768">
<meta property="og:type" content="article">
<meta property="og:title" content="什么是垃圾回收 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/02/ddb4872/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="Published:  02 Jun 2015  Category:  GC
&amp;#x672C;&amp;#x6587;&amp;#x6458;&amp;#x81EA;&amp;#x6211;&amp;#x4EEC;&amp;#x51E0;&amp;#x5468;&amp;#x540E;&amp;#x5373;&amp;#x5C06;&amp;#x51FA;&amp;#x7248;&amp;#x7684;Garbage Collection Handbook&amp;#x4E00;&amp;#x4E66;&amp;#x768">
<meta property="og:image" content="http://taojinke.github.io/img/20150702/ddb4601.png">
<meta property="og:image" content="http://taojinke.github.io/img/20150702/ddb4872.png">
<meta property="og:image" content="http://taojinke.github.io/img/20150702/ddb4872.png">
<meta property="og:updated_time" content="2015-07-01T23:49:51.965Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="什么是垃圾回收 -">
<meta name="twitter:description" content="Published:  02 Jun 2015  Category:  GC
&amp;#x672C;&amp;#x6587;&amp;#x6458;&amp;#x81EA;&amp;#x6211;&amp;#x4EEC;&amp;#x51E0;&amp;#x5468;&amp;#x540E;&amp;#x5373;&amp;#x5C06;&amp;#x51FA;&amp;#x7248;&amp;#x7684;Garbage Collection Handbook&amp;#x4E00;&amp;#x4E66;&amp;#x768">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
                        <a href="http://nodejs-xx.sblig.club/" target="_blank">NodeJs</a>
                    </li>
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ddb4872/" title="什么是垃圾回收 -" itemprop="url">什么是垃圾回收 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:49:51.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#手动管理内存"><span class="toc-number">1.</span> <span class="toc-text">手动管理内存</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#智能指针"><span class="toc-number">1.1.</span> <span class="toc-text">智能指针</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#自动内存管理"><span class="toc-number">2.</span> <span class="toc-text">自动内存管理</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#引用计数"><span class="toc-number">2.1.</span> <span class="toc-text">引用计数</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#标记删除"><span class="toc-number">3.</span> <span class="toc-text">标记删除</span></a></li></ol>
		
		</div>
		
		<p> Published:  02 Jun 2015  Category:  <a href="http://it.deepinmind.com/categories.html#GC-ref" target="_blank" rel="external">GC</a></p>
<p>&#x672C;&#x6587;&#x6458;&#x81EA;&#x6211;&#x4EEC;&#x51E0;&#x5468;&#x540E;&#x5373;&#x5C06;&#x51FA;&#x7248;&#x7684;Garbage Collection Handbook&#x4E00;&#x4E66;&#x7684;&#x6837;&#x7AE0;&#x3002;&#x540C;&#x65F6;&#x4E5F;&#x8BA9;&#x4F60;&#x80FD;&#x719F;&#x6089;&#x4E0B;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x2014;&#x2014;&#x8FD9;&#x9009;&#x81EA;&#x8BE5;&#x4E66;&#x7684;&#x7B2C;&#x4E00;&#x7AE0;&#x3002;</p>
<p>&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6240;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5E94;&#x5F53;&#x6070;&#x5982;&#x5176;&#x540D;&#x2014;&#x2014;&#x67E5;&#x627E;&#x5E76;&#x6E05;&#x9664;&#x5783;&#x573E;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x5374;&#x6070;&#x6070;&#x76F8;&#x53CD;&#x3002;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4F1A;&#x8DDF;&#x8E2A;&#x6240;&#x6709;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x5269;&#x4F59;&#x7684;&#x5BF9;&#x8C61;&#x6807;&#x8BB0;&#x4E3A;&#x5783;&#x573E;&#x3002;&#x7262;&#x8BB0;&#x4E86;&#x8FD9;&#x70B9;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x6DF1;&#x5165;&#x5730;&#x4E86;&#x89E3;&#x4E0B;&#x8FD9;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x201D;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x5185;&#x5B58;&#x56DE;&#x6536;&#x5728;JVM&#x4E2D;&#x5230;&#x5E95;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<h3 id="&#x624B;&#x52A8;&#x7BA1;&#x7406;&#x5185;&#x5B58;">&#x624B;&#x52A8;&#x7BA1;&#x7406;&#x5185;&#x5B58;</h3><p>&#x5728;&#x4ECB;&#x7ECD;&#x73B0;&#x4EE3;&#x7248;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x7B80;&#x5355;&#x5730;&#x56DE;&#x987E;&#x4E0B;&#x9700;&#x8981;&#x624B;&#x52A8;&#x5730;&#x663E;&#x5F0F;&#x5206;&#x914D;&#x53CA;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x7684;&#x90A3;&#x4E9B;&#x65E5;&#x5B50;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5FD8;&#x4E86;&#x53BB;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5757;&#x5185;&#x5B58;&#x5C31;&#x65E0;&#x6CD5;&#x91CD;&#x7528;&#x4E86;&#x3002;&#x8FD9;&#x5757;&#x5185;&#x5B58;&#x88AB;&#x5360;&#x6709;&#x4E86;&#x5374;&#x6CA1;&#x88AB;&#x4F7F;&#x7528;&#x3002;&#x8FD9;&#x79CD;&#x573A;&#x666F;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A; <strong>&#x5185;&#x5B58;&#x6CC4;&#x9732;</strong> &#x3002; </p>
<p>&#x4E0B;&#x9762;&#x662F;&#x7528;C&#x5199;&#x7684;&#x4E00;&#x4E2A;&#x624B;&#x52A8;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#x7684;&#x7B80;&#x5355;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code><span class="function"><span class="keyword">int</span> <span class="title">send_request</span><span class="params">()</span> </span>{
    <span class="keyword">size_t</span> n = read_size();
    <span class="keyword">int</span> *elements = <span class="built_in">malloc</span>(n * <span class="keyword">sizeof</span>(<span class="keyword">int</span>));
    <span class="keyword">if</span>(read_elements(n, elements) &amp;lt; n) {
        <span class="comment">// elements not freed!</span>
        <span class="keyword">return</span> -<span class="number">1</span>;
    }
    <span class="comment">// &amp;#x2026;</span>
    <span class="built_in">free</span>(elements)
    <span class="keyword">return</span> <span class="number">0</span>;
}
</code></pre><p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4F60;&#x5F88;&#x5BB9;&#x6613;&#x5C31;&#x4F1A;&#x5FD8;&#x4E86;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x3002;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x66FE;&#x7ECF;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x666E;&#x904D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x4F60;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x5730;&#x4FEE;&#x590D;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x6765;&#x4E0E;&#x5B83;&#x4EEC;&#x8FDB;&#x884C;&#x6297;&#x4E89;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x4E00;&#x79CD;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x65E0;&#x7528;&#x5185;&#x5B58;&#xFF0C;&#x4EE5;&#x4FBF;&#x51CF;&#x5C11;&#x4EBA;&#x4E3A;&#x9519;&#x8BEF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x8FD9;&#x79CD;&#x81EA;&#x52A8;&#x5316;&#x8FC7;&#x7A0B;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF08;&#x7B80;&#x79F0;GC&#xFF09;&#x3002;</p>
<h4 id="&#x667A;&#x80FD;&#x6307;&#x9488;">&#x667A;&#x80FD;&#x6307;&#x9488;</h4><p>&#x81EA;&#x52A8;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65E9;&#x671F;&#x7684;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x4FBF;&#x662F;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x3002;&#x4F60;&#x77E5;&#x6653;&#x6BCF;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x5F15;&#x7528;&#x4E86;&#x51E0;&#x6B21;&#xFF0C;&#x5F53;&#x8BA1;&#x6570;&#x5668;&#x5F52;0&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x5B89;&#x5168;&#x5730;&#x56DE;&#x6536;&#x6389;&#x4E86;&#x3002;C++&#x7684;&#x5171;&#x4EAB;&#x6307;&#x9488;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x8457;&#x540D;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<pre><code><span class="keyword">int</span> send_request() {
    size_t n = read_size();
    stared_ptr&amp;<span class="keyword">lt</span>;vector&amp;<span class="keyword">lt</span>;<span class="keyword">int</span>&amp;<span class="keyword">gt</span>;&amp;<span class="keyword">gt</span>; elements 
              = make_shared&amp;<span class="keyword">lt</span>;vector&amp;<span class="keyword">lt</span>;<span class="keyword">int</span>&amp;<span class="keyword">gt</span>;&amp;amp;<span class="keyword">gt</span>();
    <span class="keyword">if</span>(read_elements(n, elements) &amp;<span class="keyword">lt</span>; n) {
        <span class="keyword">return</span> -<span class="number">1</span>;
    }
    <span class="keyword">return</span> <span class="number">0</span>;
}
</code></pre><p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;shared <em>ptr&#x4F1A;&#x8BB0;&#x5F55;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x6B21;&#x6570;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5C06;&#x5B83;&#x4F20;&#x9012;&#x7ED9;&#x522B;&#x4EBA;&#x5219;&#x8BA1;&#x6570;&#x52A0;&#x4E00;&#xFF0C;&#x5F53;&#x5B83;&#x79BB;&#x5F00;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#x540E;&#x4FBF;&#x4F1A;&#x51CF;&#x4E00;&#x3002;&#x4E00;&#x65E6;&#x8FD9;&#x4E2A;&#x8BA1;&#x6570;&#x4E3A;0&#xFF0C;shared</em> ptr&#x4F1A;&#x81EA;&#x52A8;&#x5730;&#x5220;&#x9664;&#x5E95;&#x5C42;&#x5BF9;&#x5E94;&#x7684;vector&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x53EA;&#x662F;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x56E0;&#x4E3A;&#x4E5F;&#x6709;&#x8BFB;&#x8005;&#x6307;&#x51FA;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5728;&#x73B0;&#x5B9E;&#x4E2D;&#x662F;&#x4E0D;&#x592A;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x6F14;&#x793A;&#x662F;&#x8DB3;&#x591F;&#x4E86;&#x3002; </p>
<h3 id="&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;">&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;</h3><p>&#x5728;&#x4E0A;&#x9762;&#x7684;C++&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5F97;&#x663E;&#x5F0F;&#x5730;&#x58F0;&#x660E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3002;&#x90A3;&#x5982;&#x679C;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x91C7;&#x7528;&#x8FD9;&#x4E2A;&#x673A;&#x5236;&#x4F1A;&#x600E;&#x6837;&#x5462;&#xFF1F;&#x90A3;&#x7B80;&#x76F4;&#x5C31;&#x592A;&#x65B9;&#x4FBF;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4FBF;&#x65E0;&#x9700;&#x8003;&#x8651;&#x6E05;&#x7406;&#x5185;&#x5B58;&#x7684;&#x4E8B;&#x60C5;&#x4E86;&#x3002;&#x8FD0;&#x884C;&#x65F6;&#x4F1A;&#x81EA;&#x52A8;&#x77E5;&#x6653;&#x54EA;&#x4E9B;&#x5185;&#x5B58;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x91CA;&#x653E;&#x6389;&#x5B83;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B83;&#x81EA;&#x52A8;&#x5730;&#x56DE;&#x6536;&#x4E86;&#x8FD9;&#x4E9B;&#x5783;&#x573E;&#x3002;&#x7B2C;&#x4E00;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x662F;1959&#x5E74;Lisp&#x5F15;&#x5165;&#x7684;&#xFF0C;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x8FC4;&#x4ECA;&#x4E3A;&#x6B62;&#x4E00;&#x76F4;&#x5728;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#x3002;</p>
<h4 id="&#x5F15;&#x7528;&#x8BA1;&#x6570;">&#x5F15;&#x7528;&#x8BA1;&#x6570;</h4><p>&#x521A;&#x624D;&#x6211;&#x4EEC;&#x7528;C++&#x7684;&#x5171;&#x4EAB;&#x6307;&#x9488;&#x6240;&#x6F14;&#x793A;&#x7684;&#x60F3;&#x6CD5;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x4E0A;&#x6765;&#x3002;&#x8BB8;&#x591A;&#x8BED;&#x8A00;&#x6BD4;&#x5982;&#x8BF4;Perl, Python&#x4EE5;&#x53CA;PHP&#xFF0C;&#x91C7;&#x7528;&#x7684;&#x90FD;&#x662F;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x901A;&#x8FC7;&#x4E00;&#x5F20;&#x56FE;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x8BF4;&#x660E;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/ddb4601.png" alt=""></p>
<p>&#x7EFF;&#x8272;&#x7684;&#x4E91;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x7A0B;&#x5E8F;&#x4E2D;&#x4ECD;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4ECE;&#x6280;&#x672F;&#x5C42;&#x9762;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x6709;&#x70B9;&#x50CF;&#x662F;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x91CC;&#x9762;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x4EA6;&#x6216;&#x662F;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x4E4B;&#x7C7B;&#x7684;&#x3002;&#x4E0D;&#x540C;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x7684;&#x60C5;&#x51B5;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x91CD;&#x70B9;&#x3002;</p>
<p>&#x84DD;&#x8272;&#x7684;&#x5706;&#x5708;&#x4EE3;&#x8868;&#x7684;&#x662F;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;&#x591A;&#x5C11;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x4E86;&#x5B83;&#x4EEC;&#x3002;&#x7070;&#x8272;&#x5706;&#x5708;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EBA;&#x5F15;&#x7528;&#x7684;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B83;&#x4EEC;&#x5C5E;&#x4E8E;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6E05;&#x7406;&#x6389;&#x3002;</p>
<p>&#x770B;&#x8D77;&#x6765;&#x8FD8;&#x4E0D;&#x9519;&#x5BF9;&#x5427;&#xFF1F;&#x6CA1;&#x9519;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x91CC;&#x5B58;&#x5728;&#x7740;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x7684;&#x7F3A;&#x9677;&#x3002;&#x5F88;&#x5BB9;&#x6613;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x5B64;&#x7ACB;&#x7684;&#x73AF;&#xFF0C;&#x5B83;&#x4EEC;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4E0D;&#x5728;&#x4EFB;&#x4F55;&#x57DF;&#x5185;&#xFF0C;&#x4F46;&#x5F7C;&#x6B64;&#x5374;&#x4E92;&#x76F8;&#x5F15;&#x7528;&#x5BFC;&#x81F4;&#x5F15;&#x7528;&#x6570;&#x4E0D;&#x4E3A;0&#x3002;&#x4E0B;&#x9762;&#x4FBF;&#x662F;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/ddb4872.png" alt=""></p>
<p>&#x770B;&#x5230;&#x4E86;&#x5427;&#xFF0C;&#x7EA2;&#x8272;&#x90E8;&#x5206;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#x3002;&#x7531;&#x4E8E;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x7684;&#x7F3A;&#x9677;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x3002;</p>
<p>&#x6709;&#x51E0;&#x79CD;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x201C;&#x5F31;&#x201D;&#x5F15;&#x7528;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x7B97;&#x6CD5;&#x56DE;&#x6536;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x3002;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;Perl,Python&#x4EE5;&#x53CA;PHP&#x7B49;&#x8BED;&#x8A00;&#xFF0C;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x56DE;&#x6536;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x5DF2;&#x7ECF;&#x8D85;&#x51FA;&#x672C;&#x6587;&#x8BB2;&#x8FF0;&#x7684;&#x8303;&#x56F4;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x51C6;&#x5907;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E0B;JVM&#x6240;&#x91C7;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="&#x6807;&#x8BB0;&#x5220;&#x9664;">&#x6807;&#x8BB0;&#x5220;&#x9664;</h3><p>&#x9996;&#x5148;&#xFF0C;JVM&#x5BF9;&#x4E8E;&#x5BF9;&#x8C61;&#x53EF;&#x8FBE;&#x6027;&#x7684;&#x5B9A;&#x4E49;&#x8981;&#x660E;&#x786E;&#x4E00;&#x4E9B;&#x3002;&#x5B83;&#x53EF;&#x4E0D;&#x50CF;&#x524D;&#x9762;&#x90A3;&#x6837;&#x7528;&#x7EFF;&#x8272;&#x7684;&#x4E91;&#x4FBF;&#x542B;&#x7CCA;&#x4E86;&#x4E8B;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x6709;&#x7740;&#x975E;&#x5E38;&#x660E;&#x786E;&#x53CA;&#x5177;&#x4F53;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6839;&#x5BF9;&#x8C61;&#xFF08;Garbage Collection Roots&#xFF09;&#x7684;&#x5B9A;&#x4E49;&#xFF1A;</p>
<ul>
<li>&#x5C40;&#x90E8;&#x53D8;&#x91CF;</li>
<li>&#x6D3B;&#x52A8;&#x7EBF;&#x7A0B;</li>
<li>&#x9759;&#x6001;&#x5B57;&#x6BB5;</li>
<li>JNI&#x5F15;&#x7528;</li>
<li>&#x5176;&#x5B83;&#xFF08;&#x540E;&#x9762;&#x5C06;&#x4F1A;&#x8BA8;&#x8BBA;&#x5230;&#xFF09;</li>
</ul>
<p>JVM&#x901A;&#x8FC7;&#x6807;&#x8BB0;&#x5220;&#x9664;&#x7684;&#x7B97;&#x6CD5;&#x6765;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x53EF;&#x8FBE;&#xFF08;&#x5B58;&#x6D3B;&#xFF09;&#x5BF9;&#x8C61;&#xFF0C;&#x540C;&#x65F6;&#x786E;&#x4FDD;&#x4E0D;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#x7684;&#x90A3;&#x4E9B;&#x5185;&#x5B58;&#x80FD;&#x591F;&#x88AB;&#x91CD;&#x7528;&#x3002;&#x8FD9;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ul>
<li>&#x6807;&#x8BB0;&#x662F;&#x6307;&#x904D;&#x5386;&#x6240;&#x6709;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x8BB0;&#x5F55;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x7684;&#x4FE1;&#x606F;</li>
<li>&#x5220;&#x9664;&#x4F1A;&#x786E;&#x4FDD;&#x4E0D;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x5728;&#x4E0B;&#x4E00;&#x6B21;&#x5185;&#x5B58;&#x5206;&#x914D;&#x4E2D;&#x4F7F;&#x7528;&#x3002;</li>
</ul>
<p>JVM&#x4E2D;&#x7684;&#x4E0D;&#x540C;GC&#x7B97;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;Parallel Scavenge&#xFF0C;Parallel Mark+Copy&#xFF0C; CMS&#x90FD;&#x662F;&#x8FD9;&#x4E00;&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#xFF0C;&#x53EA;&#x662F;&#x5404;&#x9636;&#x6BB5;&#x7565;&#x6709;&#x4E0D;&#x540C;&#x800C;&#x5DF2;&#xFF0C;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x6765;&#x8BB2;&#x4ECD;&#x7136;&#x662F;&#x5BF9;&#x5E94;&#x7740;&#x4E0A;&#x9762;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5B9E;&#x73B0;&#x6700;&#x91CD;&#x8981;&#x7684;&#x5C31;&#x662F;&#x4E0D;&#x4F1A;&#x518D;&#x51FA;&#x73B0;&#x6CC4;&#x9732;&#x7684;&#x5BF9;&#x8C61;&#x73AF;&#x4E86;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/ddb4872.png" alt=""></p>
<p>&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x88AB;&#x6682;&#x505C;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x56DE;&#x6536;&#xFF0C;&#x5982;&#x679C;&#x5F15;&#x7528;&#x4E00;&#x76F4;&#x5728;&#x53D8;&#x7684;&#x8BDD;&#x4F60;&#x662F;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x8BA1;&#x6570;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x88AB;&#x6682;&#x505C;&#x4EE5;&#x4FBF;JVM&#x53EF;&#x4EE5;&#x6536;&#x62FE;&#x5BB6;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#x53C8;&#x88AB;&#x79F0;&#x4E3A;Stop The World pause(STW)&#x3002;&#x8FD9;&#x79CD;&#x6682;&#x505C;&#x88AB;&#x89E6;&#x53D1;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4E0D;&#x8FC7;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5E94;&#x8BE5;&#x662F;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x4E00;&#x79CD;&#x3002;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/JVM/">JVM</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/02/dd8bc97/" title="企业级 Java 应用最重要的4个性能指标 -">
  <strong>上一篇：</strong><br/>
  <span>
  企业级 Java 应用最重要的4个性能指标 -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/02/ddbf5c9/"  title="深入理解JVM结构   转自Sunnier的博客 -">
 <strong>下一篇：</strong><br/> 
 <span>深入理解JVM结构   转自Sunnier的博客 -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#手动管理内存"><span class="toc-number">1.</span> <span class="toc-text">手动管理内存</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#智能指针"><span class="toc-number">1.1.</span> <span class="toc-text">智能指针</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#自动内存管理"><span class="toc-number">2.</span> <span class="toc-text">自动内存管理</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#引用计数"><span class="toc-number">2.1.</span> <span class="toc-text">引用计数</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#标记删除"><span class="toc-number">3.</span> <span class="toc-text">标记删除</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>606</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>17</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/MySQL/" title="MySQL">MySQL<sup>10</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
