
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="edwin jin dianzi blog">
<meta property="og:type" content="website">
<meta property="og:title" content="dianzi blog">
<meta property="og:url" content="http://taojinke.github.io/page/17/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="edwin jin dianzi blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="dianzi blog">
<meta name="twitter:description" content="edwin jin dianzi blog">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f942128/" title="OS X 10.10.4发布：提高网络可靠性，移除Discoveryd -" itemprop="url">OS X 10.10.4发布：提高网络可靠性，移除Discoveryd -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x82F9;&#x679C;&#x4ECA;&#x5929;&#x53D1;&#x5E03;&#x4E86; OS X Yosemite 10.10.4&#xFF0C;&#x8FD9;&#x6B21;&#x5347;&#x7EA7;&#x5BF9;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#xFF0C;&#x4FEE;&#x590D;&#x4E86;&#x4E00;&#x4E9B;&#x4E25;&#x91CD;&#x7684; Bug &#x5E76;&#x6539;&#x8FDB;&#x4E86;&#x6027;&#x80FD;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;OS X 10.10.4 &#x79FB;&#x9664;&#x4E86; Discoveryd &#x8FDB;&#x7A0B;&#xFF0C;Discoveryd DNS &#x89E3;&#x6790;&#x8FDB;&#x7A0B;&#x5728; OS X Yosemite &#x4E2D;&#x9020;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x3002;OS X 10.10.4 &#x53EF;&#x4EE5;&#x901A;&#x8FC7; Mac App Store &#x5B8C;&#x6210;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x79FB;&#x9664;&#x4E86; Discoveryd DNS &#x89E3;&#x6790;&#x8FDB;&#x7A0B;&#x540E;&#xFF0C; OS X 10.10.4 &#x91CD;&#x65B0;&#x5F00;&#x59CB;&#x4F7F;&#x7528; mDNSresponder &#x8FDB;&#x7A0B;&#x3002;Discoveryd &#x8FDB;&#x7A0B;&#x9020;&#x6210;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x6BD4;&#x5982;&#x4ECE;&#x4F11;&#x7720;&#x4E2D;&#x5524;&#x9192;&#x901F;&#x5EA6;&#x51CF;&#x6162;&#xFF0C;&#x65E0;&#x6CD5;&#x8857;&#x673A; DNS&#xFF0C;&#x7F51;&#x7EDC;&#x91CD;&#x540D;&#xFF0C;WiFi &#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#xFF0C;CPU &#x5360;&#x7528;&#x8FC7;&#x9AD8;&#xFF0C;&#x7535;&#x6C60;&#x6D88;&#x8017;&#x8FC7;&#x5FEB;&#x7B49;&#x3002;OS X 10.10.4 &#x6D4B;&#x8BD5;&#x8FDB;&#x884C;&#x4E86;2&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x6D4B;&#x8BD5;&#x7248;&#x5728;4&#x6708;&#x4E2D;&#x65EC;&#x53D1;&#x5E03;&#x3002;&#x76F8;&#x4FE1;&#x5728; OS X El Capitan &#x53D1;&#x5E03;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x4F1A;&#x8FCE;&#x6765;&#x6700;&#x540E;&#x4E00;&#x4E2A; OS X Yosemite &#x5347;&#x7EA7;&#x8865;&#x4E01;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/f941764.jpg" alt="&#x5C4F;&#x5E55;&#x5FEB;&#x7167; 2015-06-30 &#x4E0B;&#x5348;11.06.17.jpg"></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Mac-OS-X/">Mac OS X</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f944aa9/" title="“集群和负载均衡”的通俗版解释 -" itemprop="url">“集群和负载均衡”的通俗版解释 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5728;&#x201C;&#x9AD8;&#x5E76;&#x53D1;&#xFF0C;&#x6D77;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;NoSql&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;……&#x201D;&#x6982;&#x5FF5;&#x6EE1;&#x5929;&#x98DE;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x76F8;&#x4FE1;&#x4E0D;&#x5C11;&#x670B;&#x53CB;&#x90FD;&#x542C;&#x8BF4;&#x8FC7;&#x751A;&#x81F3;&#x5E38;&#x4E0E;&#x4EBA;&#x63D0;&#x8D77;&#x201C;&#x96C6;&#x7FA4;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x201D;&#x7B49;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x771F;&#x6B63;&#x63A5;&#x89E6;&#x5230;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x201C;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x725B;&#x7684;&#x201D;&#x6280;&#x672F;&#x540D;&#x8BCD;&#x3002;&#x4E0B;&#x9762;&#x7B80;&#x5355;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x5427;&#x3002;</p>
<h4 id="&#x96C6;&#x7FA4;(Cluster)">&#x96C6;&#x7FA4;(Cluster)</h4><p>&#x6240;&#x8C13;&#x96C6;&#x7FA4;&#x662F;&#x6307;&#x4E00;&#x7EC4;&#x72EC;&#x7ACB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x6784;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x677E;&#x8026;&#x5408;&#x7684;&#x591A;&#x5904;&#x7406;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x4F20;&#x9001;&#xFF0C;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x901A;&#x4FD7;&#x4E00;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x82E5;&#x5E72;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x8054;&#x5408;&#x8D77;&#x6765;&#x5DE5;&#x4F5C;(&#x670D;&#x52A1;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x505A;&#x5907;&#x4EFD;&#x3002;</p>
<h4 id="&#x8D1F;&#x8F7D;&#x5747;&#x8861;(Load_Balance)">&#x8D1F;&#x8F7D;&#x5747;&#x8861;(Load Balance)</h4><p>&#x7F51;&#x7EDC;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x662F;&#x4E00;&#x79CD;&#x52A8;&#x6001;&#x5747;&#x8861;&#x6280;&#x672F;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x5B9E;&#x65F6;&#x5730;&#x5206;&#x6790;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x638C;&#x63E1;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#x91CF;&#x72B6;&#x51B5;&#xFF0C;&#x628A;&#x4EFB;&#x52A1;&#x5408;&#x7406;&#x5747;&#x8861;&#x5730;&#x5206;&#x914D;&#x51FA;&#x53BB;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x57FA;&#x4E8E;&#x73B0;&#x6709;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6269;&#x5C55;&#x670D;&#x52A1;&#x5668;&#x5E26;&#x5BBD;&#x548C;&#x589E;&#x52A0;&#x670D;&#x52A1;&#x5668;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5EC9;&#x4EF7;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x52A0;&#x5F3A;&#x4E86;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7F51;&#x7EDC;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x3002;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x5230;&#x5904;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x201C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x201D;&#xFF0C;&#x4E00;&#x4E2A;&#x8D85;&#x5E02;&#x7684;&#x6536;&#x8425;&#x5458;&#x9AD8;&#x5CF0;&#x671F;&#x53EA;&#x80FD;&#x670D;&#x52A1;10&#x4F4D;&#x987E;&#x5BA2;&#xFF0C;&#x5F53;&#x505A;&#x6D3B;&#x52A8;&#x65F6;&#x6709;20&#x4F4D;&#x987E;&#x5BA2;&#x9700;&#x8981;&#x670D;&#x52A1;&#x7684;&#x8BDD;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x6392;&#x957F;&#x961F;&#xFF0C;&#x8FD9;&#x6837;&#x8D2D;&#x7269;&#x4F53;&#x9A8C;&#x5C06;&#x4F1A;&#x5F88;&#x5DEE;&#xFF08;&#x5C31;&#x50CF;&#x5BA2;&#x6237;&#x62B1;&#x6028;&#x7CFB;&#x7EDF;/&#x7F51;&#x7AD9;&#x8BBF;&#x95EE;&#x592A;&#x6162;&#xFF09;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x518D;&#x62DB;&#x4E2A;&#x8425;&#x4E1A;&#x5458;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x901A;&#x4E00;&#x4E2A;&#x51FA;&#x53E3;&#x3002;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x201C;&#x5206;&#x644A;&#x538B;&#x529B;&#x201D;&#x3002;</p>
<h4 id="&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF1A;">&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF1A;</h4><p>(1)&#x9AD8;&#x53EF;&#x9760;&#x6027;(HA)&#x5229;&#x7528;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x5F53;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x5907;&#x4EFD;&#x670D;&#x52A1;&#x5668;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x63A5;&#x7BA1;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x53CA;&#x65F6;&#x5207;&#x6362;&#x8FC7;&#x53BB;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x4E0D;&#x95F4;&#x65AD;&#x670D;&#x52A1;&#x3002; </p>
<p>(2)&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;(HP)&#x5373;&#x5145;&#x5206;&#x5229;&#x7528;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x8FD0;&#x7B97;&#x7684;&#x5E76;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x56E0;&#x5206;&#x6790;&#x3001;&#x5316;&#x5B66;&#x5206;&#x6790;&#x7B49;&#x3002; </p>
<p>(3)&#x8D1F;&#x8F7D;&#x5E73;&#x8861;(LB)&#x5373;&#x628A;&#x8D1F;&#x8F7D;&#x538B;&#x529B;&#x6839;&#x636E;&#x67D0;&#x79CD;&#x7B97;&#x6CD5;&#x5408;&#x7406;&#x5206;&#x914D;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x964D;&#x4F4E;&#x5BF9;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x8981;&#x6C42;&#x3002; </p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4EE5;&#x4E0A;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x9002;&#x5E94;&#x573A;&#x5408;&#x4E0B;&#x662F;&#x9700;&#x8981;&#x540C;&#x65F6;&#x5177;&#x5907;&#x7684;&#x3002;&#x5E38;&#x7528;&#x7684;&#x96C6;&#x7FA4;&#x53C8;&#x5206;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<h4 id="load_balance_cluster&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;&#xFF09;">load balance cluster&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;&#xFF09;</h4><p>&#x4E00;&#x5171;&#x6709;&#x56DB;&#x5144;&#x5F1F;&#x5F00;&#x88C1;&#x7F1D;&#x94FA;&#xFF0C;&#x751F;&#x610F;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E0D;&#x4E0B;&#x6765;&#xFF0C;&#x8001;&#x662F;&#x5EF6;&#x8BEF;&#x5DE5;&#x671F;&#xFF0C;&#x4E8E;&#x662F;&#x56DB;&#x4E2A;&#x5144;&#x5F1F;&#x5546;&#x91CF;&#xFF1A;&#x8001;&#x5927;&#x63A5;&#x8BA2;&#x5355;, &#x4E09;&#x4E2A;&#x5144;&#x5F1F;&#x6765;&#x5E72;&#x6D3B;&#x3002; &#x5BA2;&#x6237;&#x591A;&#x8D77;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x8001;&#x5927;&#x6839;&#x636E;&#x4E00;&#x5B9A;&#x7684;&#x539F;&#x5219;(policy) &#x6839;&#x636E;&#x4E09;&#x5144;&#x5F1F;&#x624B;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x6765;&#x5206;&#x6D3E;&#x65B0;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="High_availability_cluster&#xFF08;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#xFF09;">High availability cluster&#xFF08;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#xFF09;</h4><p>&#x4E24;&#x5144;&#x5F1F;&#x5F00;&#x65E9;&#x9910;&#x94FA;&#xFF0C;&#x751F;&#x610F;&#x4E0D;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;7&#x70B9;&#x5230;9&#x70B9;&#x4E4B;&#x95F4;&#x5BA2;&#x6237;&#x5F88;&#x591A;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x4E2D;&#x65AD;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;2&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x8FD9;&#x4E2A;&#x65E9;&#x9910;&#x94FA;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x6301;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x4E24;&#x5144;&#x5F1F;&#x5546;&#x91CF;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;:</p>
<p>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5728;&#x5BB6;&#x7B49;&#x5019;&#xFF0C;&#x4E00;&#x65E6;&#x8001;&#x5927;&#x65E0;&#x6CD5;&#x505A;&#x751F;&#x610F;&#x4E86;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x51FA;&#x6765;&#x9876;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A; Active/Standby.&#xFF08;&#x53CC;&#x673A;&#x70ED;&#x5907;&#xFF09;</p>
<p>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x5728;&#x65C1;&#x8FB9;&#x5E2E;&#x5DE5;&#xFF0C;&#x4E00;&#x65E6;&#x8001;&#x5927;&#x65E0;&#x6CD5;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x9A6C;&#x4E0A;&#x9876;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;Active/Passive.&#xFF08;&#x53CC;&#x673A;&#x53CC;&#x5DE5;&#xFF09;</p>
<p>&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x8001;&#x4E8C;&#x4E5F;&#x5728;&#x65C1;&#x8FB9;&#x5356;&#x8C46;&#x6D46;&#xFF0C;&#x8001;&#x5927;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x53C8;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x53C8;&#x5356;&#x8C46;&#x6D46;&#xFF0C;&#x8001;&#x4E8C;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x8001;&#x5927;&#x5C31;&#x53C8;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x53C8;&#x5356;&#x8C46;&#x6D46;.&#x8FD9;&#x4E2A;&#x53EB;&#x505A;Active/Active (dual Active)&#xFF08;&#x53CC;&#x673A;&#x4E92;&#x5907;&#xFF09;</p>
<p>(&#x5305;&#x5B50;= application package, &#x4E92;&#x76F8;&#x7167;&#x5E94;&#x53EB;&#x505A;heartbeat, &#x9876;&#x66FF;&#x5BF9;&#x65B9;&#x5DE5;&#x4F5C;&#x53EB;&#x505A; failover/takeover. &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5144;&#x5F1F;&#x7A81;&#x7136;&#x90FD;&#x778E;&#x4E86;&#x804B;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x5BF9;&#x65B9;&#x5230;&#x5E95;&#x662F;&#x5426;&#x6B63;&#x5728;&#x5E72;&#x6D3B;&#xFF0C;&#x90FD;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x8981;&#x9876;&#x5BF9;&#x65B9;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;brain-split, &#x7136;&#x540E;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x8005;&#xFF0C;&#x6BD4;&#x5982;&#x4ED6;&#x4EEC;&#x7684;&#x8001;&#x7239;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;tier-breaker, &#x6216;&#x8005;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E24;&#x4E2A;&#x7684;&#x5AB3;&#x5987;&#x8FC7;&#x6765;&#x62C9;&#x8D70;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;fency&#x3002;)</p>
<h4 id="high_computing_clustering&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#xFF09;">high computing clustering&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#xFF09;</h4><p>10&#x4E2A;&#x5144;&#x5F1F;&#x4E00;&#x8D77;&#x505A;&#x624B;&#x5DE5;&#x5BB6;&#x5177;&#x751F;&#x610F;&#xFF0C;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x6765;&#x627E;&#x4ED6;&#x4EEC;&#x7684;&#x8001;&#x7239;&#x8981;&#x6C42;&#x505A;&#x4E00;&#x5957;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x4EFF;&#x53E4;&#x5BB6;&#x5177;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x4E0D;&#x8FC7;&#x8981;&#x505A;&#x5F88;&#x4E45;&#x5F88;&#x4E45;&#xFF0C;&#x4E3A;&#x4E86;1&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x4EA4;&#x51FA;&#x8FD9;&#x4E00;&#x5957;&#x5BB6;&#x5177;&#xFF0C;10&#x4E2A;&#x5144;&#x5F1F;&#x51B3;&#x5B9A;&#x4E00;&#x8D77;&#x505A;&#x3002;</p>
<p>&#x8001;&#x7239;&#x628A;&#x8FD9;&#x5957;&#x5BB6;&#x5177;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x5206;&#x5F00;&#x4EA4;&#x7ED9;&#x513F;&#x5B50;&#x4EEC;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x4E2A;&#x513F;&#x5B50;&#x90FD;&#x5728;&#x505A;&#x6728;&#x5236;&#x5BB6;&#x5177;&#x7684;&#x52A0;&#x5DE5;&#xFF0C;&#x6700;&#x540E;&#x62FC;&#x5728;&#x4E00;&#x8D77;&#x53EB;&#x8D27;&#x3002;</p>
<p>&#x8001;&#x7239;&#x662F;scheduler&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x513F;&#x5B50;&#x4EEC;&#x662F;compute node. &#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x53EB;&#x505A;&#x4F5C;&#x4E1A;&#x3002;</p>
<p>&#xFF08;&#x5176;&#x5B9E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x76F8;&#x5173;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x5E94;&#x7528;&#x4E8E;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x7F51;&#x7AD9;&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x7B49;&#x7B49;&#x3002;&#x6D89;&#x53CA;&#x70B9;&#x5B58;&#x50A8;&#x65B9;&#x9762;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x4ECB;&#x7ECD;&#x4E86;&#xFF09;</p>
<p>&#x4E25;&#x683C;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4E86;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x77E5;&#x8BC6;&#x8303;&#x7574;&#x4E86;&#xFF0C;&#x60F3;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x771F;&#x6B63;&#x7684;&#x5B9E;&#x8DF5;&#x800C;&#x4E0D;&#x662F;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x3002;&#x4ECE;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x548C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x5177;&#x5907;&#x4E30;&#x5BCC;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x548C;&#x7BA1;&#x7406;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x66F4;&#x8981;&#x5177;&#x5907;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3001;&#x5B58;&#x50A8;&#x7B49;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#xFF08;&#x61C2;&#x7B97;&#x6CD5;&#x548C;&#x5E95;&#x5C42;&#x7684;&#x5C31;&#x66F4;&#x5B8C;&#x7F8E;&#x4E86;&#xFF09;&#x3002;&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x91CD;&#x70B9;&#x53C8;&#x4E0D;&#x540C;&#x4E86;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FDC;&#x8FDC;&#x4E0D;&#x6B62;&#x6211;&#x6240;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x3002;&#x73B0;&#x5728;&#x7684;Web&#x5E94;&#x7528;&#x4E00;&#x822C;&#x90FD;&#x6BD4;&#x8F83;&#x4F9D;&#x8D56;&#x4E8E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x8D8A;&#x6765;&#x8D8A;&#x8131;&#x79BB;&#x4E86;&#x201D;&#x7EAF;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201C;&#x7684;&#x672C;&#x8D28;&#x3002;&#x96C6;&#x7FA4;&#x4E0D;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x786E;&#x5B9E;&#x76F8;&#x5F53;&#x6709;&#x7528;&#x3002;&#x7531;&#x4E8E;&#x9879;&#x76EE;&#x548C;&#x5DE5;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x672C;&#x4EBA;&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5FAE;&#x8F6F;&#x7684;&#x6280;&#x672F;&#x4F53;&#x7CFB;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x90FD;&#x662F;&#x57FA;&#x4E8E;windows&#x5E73;&#x53F0;&#x7684;&#xFF09;&#x3002;&#x6709;&#x673A;&#x4F1A;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5B9E;&#x8DF5;&#x5206;&#x4EAB;&#x51FA;&#x6765;&#xFF0C;&#x66F4;&#x5E0C;&#x671B;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x5728;&#x4E00;&#x5757;&#x5206;&#x4EAB;&#x548C;&#x4EA4;&#x6D41;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/负载均衡/">负载均衡</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f94ebcb/" title="大话重构 之 防止“加个需求，到处改代码” -" itemprop="url">大话重构 之 防止“加个需求，到处改代码” -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> &#x4E0A;&#x4E00;&#x7BC7;&#x300A; <a href="http://www.cnblogs.com/yoyaprogrammer/p/srp.html" target="_blank" rel="external">&#x804C;&#x8D23;&#x5355;&#x4E00;&#x539F;&#x5219;&#x771F;&#x7684;&#x7B80;&#x5355;&#x5417;</a> &#x300B;&#x4E2D;&#x6211;&#x4EEC;&#x8BA4;&#x8BC6;&#x4E86; <strong>&#x53D1;&#x6563;&#x5F0F;&#x53D8;&#x5316;</strong> &#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x804C;&#x8D23;&#x4E0D;&#x5355;&#x4E00;&#x3002;&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x7684;&#x4EE3;&#x7801;&#x574F;&#x5473;&#x9053;&#x662F; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#xFF0C;&#x4E0E; <strong>&#x53D1;&#x6563;&#x5F0F;&#x53D8;&#x5316;</strong> &#x6070;&#x597D;&#x76F8;&#x53CD;&#xFF0C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x6D89;&#x53CA;&#x5230;&#x591A;&#x4E2A;&#x7C7B;&#x3002; </p>
<p>&#x5728;&#x5546;&#x4E1A;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x78B0;&#x5230;&#x201C;&#x52A0;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x5230;&#x5904;&#x6539;&#x4EE3;&#x7801;&#x201D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#xFF0C;&#x5178;&#x578B;&#x540E;&#x679C;&#x662F;&#x6F0F;&#x6539;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#xFF0C;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8868;&#x73B0;&#x4E0D;&#x4E00;&#x81F4;&#x3002; </p>
<p>&#x8981;&#x89E3;&#x51B3; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#xFF0C;&#x5BF9;&#x91CD;&#x6784;/&#x8BBE;&#x8BA1;&#x6280;&#x80FD;&#x6709;&#x8F83;&#x9AD8;&#x8981;&#x6C42;&#x3002;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#xFF0C;&#x4E00;&#x7801;&#x4E0A;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0E;&#x4F60;&#x5206;&#x4EAB;&#x5176;&#x4E2D;&#x9700;&#x8981;&#x7406;&#x89E3;&#x7684;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x3002; </p>
<h2 id="&#x4F8B;&#x5B50;&#x7684;&#x80CC;&#x666F;">&#x4F8B;&#x5B50;&#x7684;&#x80CC;&#x666F;</h2><p>&#x8BE5;&#x4F8B;&#x5B50;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x63A8;&#x8350;&#x548C;&#x8BA2;&#x5355;&#x7684;&#x62A5;&#x8868;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#xFF0C;&#x62A5;&#x8868;&#x7CFB;&#x7EDF;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x5C55;&#x793A;&#x5404;&#x79CD;&#x6307;&#x6807;&#x3002;&#x7B80;&#x5355;&#x70B9;&#xFF0C;&#x5047;&#x8BBE;&#x76EE;&#x524D;&#x53EA;&#x6709;&#x4E0B;&#x9762;&#x4E09;&#x4E2A;&#x6307;&#x6807;&#xFF1A;</p>
<ol>
<li>UM&#xFF08;Unique Member&#xFF09;&#xFF0C;&#x552F;&#x4E00;&#x8EAB;&#x4EFD;&#x7684;&#x7528;&#x6237;&#x6570;&#xFF0C;&#x4E0D;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x7EBF;&#x4E0B;</li>
<li>Order&#xFF0C;&#x8BA2;&#x5355;&#x6570;&#xFF0C;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;</li>
<li>Revenue&#xFF0C;&#x9500;&#x552E;&#x989D;&#xFF0C;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;</li>
</ol>
<p>&#x6BCF;&#x4E2A;&#x6307;&#x6807;&#x9700;&#x8981;&#x5230;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#x53BB;&#x67E5;&#x8BE2;&#x5177;&#x4F53;&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x754C;&#x9762;&#x4E0A;&#x5C55;&#x793A;&#x51FA;&#x6765;&#x3002;</p>
<h2 id="&#x539F;&#x59CB;&#x4EE3;&#x7801;">&#x539F;&#x59CB;&#x4EE3;&#x7801;</h2><pre><code>object QueryFieldBuilder {
  <span class="function"><span class="keyword">def</span> <span class="title">build</span><span class="params">(fieldName: String)</span>:</span> Array[String] = {
    <span class="keyword">if</span> (fieldName.equalsIgnoreCase(&amp;quot;order&amp;quot;)
      || fieldName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      Array(&amp;quot;online&amp;quot;, &amp;quot;instore&amp;quot;).map(_ + fieldName.toLowerCase)
    <span class="keyword">else</span>
      Array(fieldName.toLowerCase)
  }
}
</code></pre><p>&#x67E5;&#x8BE2;&#x6307;&#x6807;&#x503C;&#x65F6;&#xFF0C;&#x8981;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#x5904;&#x7406;&#x3002;&#x4E00;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x5982;UM&#xFF0C;&#x76F4;&#x63A5;&#x62FF;um&#x4F5C;&#x4E3A;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x5373;&#x53EF;&#xFF1B;&#x4E00;&#x662F;&#x9700;&#x8981;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x5982;Order&#xFF0C;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;onlineorder&#x548C;instoreorder&#x3002;</p>
<pre><code>object FiledValueFormatter {
  <span class="function"><span class="keyword">def</span> <span class="title">format</span><span class="params">(filedName: String, value: String)</span>:</span> String = {
    <span class="keyword">if</span> (filedName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      &amp;quot;$&amp;quot; + value
    <span class="keyword">else</span>
      value
  }
}
</code></pre><p>&#x5C55;&#x793A;&#x6307;&#x6807;&#x503C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x94B1;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x524D;&#x9762;&#x52A0;&#x4E0A;&#x7F8E;&#x5143;&#x7B26;&#x53F7;$&#x3002;&#xFF08;&#x5982;&#x679C;&#x5DE5;&#x8D44;&#x524D;&#x9762;&#x76F4;&#x63A5;&#x52A0;$&#x3002;&#x3002;&#x3002;&#xFF09;</p>
<h2 id="&#x52A0;&#x65B0;&#x6307;&#x6807;Profit">&#x52A0;&#x65B0;&#x6307;&#x6807;Profit</h2><p>Profit&#xFF0C;&#x5229;&#x6DA6;&#x989D;&#xFF0C;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5728;&#x539F;&#x59CB;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x52A0;&#x4E0A;&#x65B0;&#x6307;&#x6807;Profit&#xFF0C;&#x9700;&#x8981;&#x5728;QueryFiledBuilder&#x548C;FiledValueFormatter&#x4E24;&#x4E2A;&#x4E3B;&#x4F53;&#x4E2D;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x989D;&#x3002;&#x3002;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E0D;&#x597D;&#x3002;</p>
<h2 id="&#x5408;&#x5E76;">&#x5408;&#x5E76;</h2><p>&#x901A;&#x8FC7; <em>&#x79FB;&#x52A8;&#x65B9;&#x6CD5;</em> &#x7684;&#x91CD;&#x6784;&#x624B;&#x6CD5;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x5316;&#x7EF4;&#x5EA6;&#x4E0A;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x79FB;&#x52A8;&#x5230;&#x4E00;&#x4E2A;&#x4E3B;&#x4F53;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x4E3B;&#x4F53;&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x4E3B;&#x4F53;&#x3002; </p>
<pre><code>object FieldContext {
  <span class="function"><span class="keyword">def</span> <span class="title">buildQueryField</span><span class="params">(fieldName: String)</span>:</span> Array[String] = {
    <span class="keyword">if</span> (fieldName.equalsIgnoreCase(&amp;quot;order&amp;quot;)
      || fieldName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      Array(&amp;quot;online&amp;quot;, &amp;quot;instore&amp;quot;).map(_ + fieldName.toLowerCase)
    <span class="keyword">else</span>
      Array(fieldName.toLowerCase)
  }

  <span class="function"><span class="keyword">def</span> <span class="title">formatValue</span><span class="params">(filedName: String, value: String)</span>:</span> String = {
    <span class="keyword">if</span> (filedName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      &amp;quot;$&amp;quot; + value
    <span class="keyword">else</span>
      value
  }
}
</code></pre><p>&#x65B0;&#x521B;&#x5EFA;&#x4E86;FieldContext&#x4F5C;&#x4E3A;&#x4E3B;&#x4F53;&#xFF0C;&#x627F;&#x8F7D;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x4E00;&#x773C;&#x770B;&#x8FC7;&#x53BB;&#xFF0C;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x6613;&#x61C2;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#x7684;&#x574F;&#x5473;&#x9053;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x804C;&#x8D23;&#x5355;&#x4E00;&#x5417;&#xFF1F;No </p>
<p>FieldContext&#x5305;&#x542B;&#x4E86;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#xFF1A;</p>
<ol>
<li>&#x6307;&#x6807;&#x5230;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x7684;&#x6620;&#x5C04;</li>
<li>&#x6307;&#x6807;&#x503C;&#x7684;&#x683C;&#x5F0F;&#x5316;</li>
<li>&#x6DFB;&#x52A0;&#x6307;&#x6807;</li>
</ol>
<p>&#x89E3;&#x51B3; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x70B9; <strong>&#x53D1;&#x6563;&#x5F0F;&#x53D8;&#x5316;</strong> &#xFF0C;&#x90A3;&#x5C31;&#x53C8;&#x62C6;&#x5F00;&#x5457;&#x3002; </p>
<h2 id="&#x5408;&#x4E45;&#x5FC5;&#x5206;">&#x5408;&#x4E45;&#x5FC5;&#x5206;</h2><p>&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x8026;&#x5408;&#x592A;&#x7D27;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x804C;&#x8D23;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x7B2C;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/f94bfd9.jpg" alt=""></p>
<p>&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x6307;&#x6807;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;&#x6765;&#x5012;&#x8F6C;&#x4F9D;&#x8D56;&#xFF0C;&#x4ECE;&#x800C;&#x5206;&#x79BB;&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/f94bfd9.jpg" alt=""></p>
<p>&#x6307;&#x6807;&#x6709;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;FieldChannel&#x4E3A;OI&#x8868;&#x793A;&#x9700;&#x8981;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x7EBF;&#x4E0B;&#xFF0C;&#x4E3A;Single&#x8868;&#x793A;&#x4E0D;&#x533A;&#x5206;&#x3002;ValueType&#x4E3A;Money&#x8868;&#x793A;&#x6307;&#x6807;&#x503C;&#x662F;&#x94B1;&#xFF0C;&#x4E3A;Normal&#x8868;&#x793A;&#x4E0D;&#x662F;&#x94B1;&#x3002;&#xFF08;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x8003;&#x8651;&#x4EE5;&#x540E;&#x7684;&#x6269;&#x5C55;&#xFF09;</p>
<pre><code><span class="keyword">case</span> <span class="keyword">class</span> Field(name: <span class="keyword">String</span>, channel: FieldChannel, valueType: ValueType)
</code></pre><p>&#x6307;&#x6807;&#x6709;&#x4E86;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x7279;&#x6027;&#x540E;&#xFF0C;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x90FD;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56;&#x6307;&#x6807;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x8026;&#x3002;</p>
<pre><code>object QueryFieldBuilder {
  <span class="function"><span class="keyword">def</span> <span class="title">build</span><span class="params">(filedName: String)</span>:</span> Array[String] = {
    val filed = FieldContext.getByName(filedName)
    val lowerCaseFiledName = filedName.toLowerCase

    <span class="keyword">if</span> (filed.exists(_.channel.equals(OI)))
      Array(&amp;quot;online&amp;quot;, &amp;quot;instore&amp;quot;).map(_ + lowerCaseFiledName)
    <span class="keyword">else</span>
      Array(lowerCaseFiledName)
  }
}
</code></pre><p>QueryFieldBuilder&#x4F9D;&#x8D56;&#x4E8E;&#x6307;&#x6807;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;FieldChannel&#xFF0C;&#x627F;&#x62C5;&#x804C;&#x8D23;&#x201C;&#x6307;&#x6807;&#x5230;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x7684;&#x6620;&#x5C04;&#x201D;&#x3002;</p>
<pre><code>object FieldValueFormatter {
  <span class="function"><span class="keyword">def</span> <span class="title">format</span><span class="params">(filedName: String, value: String)</span>:</span> String = {
    val filed = FieldContext.getByName(filedName)

    <span class="keyword">if</span> (filed.exists(_.valueType.equals(Money)))
      &amp;quot;$&amp;quot; + value
    <span class="keyword">else</span>
      value
  }
}
</code></pre><p>FieldValueFormatter&#x4F9D;&#x8D56;&#x4E8E;&#x6307;&#x6807;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;ValueType&#xFF0C;&#x627F;&#x62C5;&#x804C;&#x8D23;&#x201C;&#x6307;&#x6807;&#x503C;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x201D;&#x3002;</p>
<pre><code>object FieldContext {
  private val fields = List(
    Field(&amp;quot;UM&amp;quot;, Single, Normal),
    Field(&amp;quot;Order&amp;quot;, OI, Normal),
    Field(&amp;quot;Revenue&amp;quot;, OI, Money),
    Field(&amp;quot;Profit&amp;quot;, OI, Money)
  )

  private val filedMap = fields
    .map(field =&amp;gt; (field.name.toLowerCase, field))
    .toMap

  <span class="function"><span class="keyword">def</span> <span class="title">getByName</span><span class="params">(name: String)</span>:</span> Option[Field] = {
    filedMap.get(name)
  }
}
</code></pre><p>FieldContext&#x901A;&#x8FC7;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x6307;&#x6807;&#x914D;&#x7F6E;&#x5408;&#x9002;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;&#x6765;&#x63A7;&#x5236;&#x6307;&#x6807;&#x5728;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x6620;&#x5C04;&#x548C;&#x503C;&#x683C;&#x5F0F;&#x5316;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x884C;&#x4E3A;&#xFF0C;&#x5B8C;&#x7F8E;&#x627F;&#x8F7D;&#x804C;&#x8D23;&#x201C;&#x65B0;&#x589E;&#x6307;&#x6807;&#x201D;&#x3002;</p>
<p>&#x65B0;&#x6307;&#x6807;Profit&#x7684;&#x52A0;&#x5165;&#xFF0C;&#x53EA;&#x662F;FieldContext&#x4E2D;&#x7684;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x800C;&#x5DF2;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x6709;&#x5B66;&#x540D;&#x7684;&#xFF0C; <strong>&#x8868;&#x9A71;&#x52A8;&#x6A21;&#x5F0F;</strong> &#x3002; </p>
<p>&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x4F60;&#x638C;&#x63E1;&#x4E86;&#x5417;&#xFF1F;</p>
<h2 id="&#x63A8;&#x8350;">&#x63A8;&#x8350;</h2><p><a href="http://www.cnblogs.com/yoyaprogrammer/p/eliminate_long_method.html" target="_blank" rel="external">&#x6D88;&#x9664;&#x8FC7;&#x957F;&#x65B9;&#x6CD5;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/eliminate_long_class.html" target="_blank" rel="external">&#x6D88;&#x9664;&#x8FC7;&#x957F;&#x7C7B;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/eliminate_duplicate_code.html" target="_blank" rel="external">&#x6D88;&#x9664;&#x91CD;&#x590D;&#x4EE3;&#x7801;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/refactor_answer.html" target="_blank" rel="external">&#x7B54;&#x7C89;&#x4E1D;&#x95EE;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/long_method_parameters.html" target="_blank" rel="external">&#x4F60;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x50CF;&#x86AF;&#x8693;&#x4E00;&#x6837;&#x8BA9;&#x4EBA;&#x538C;&#x6076;&#x5417;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/srp.html" target="_blank" rel="external">&#x804C;&#x8D23;&#x5355;&#x4E00;&#x539F;&#x5219;&#x771F;&#x7684;&#x7B80;&#x5355;&#x5417;</a></p>
<p>&#x67E5;&#x770B;&#x300A;&#x5927;&#x8BDD;&#x91CD;&#x6784;&#x300B;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#xFF0C;&#x8BF7;&#x8FDB;&#x5165;YoyaProgrammer&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x70B9;&#x51FB; &#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF0C;&#x70B9;&#x51FB; &#x5927;&#x8BDD;&#x91CD;&#x6784;&#x3002;</p>
<p>&#x5206;&#x7C7B; &#x5927;&#x8BDD;&#x91CD;&#x6784;</p>
<p>&#x4F18;&#x96C5;&#x7A0B;&#x5E8F;&#x5458; &#x539F;&#x521B; &#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;</p>
<p><img src="http://taojinke.github.io/img/20150701/f94c24a.jpg" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/软件开发/">软件开发</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f955737/" title="ICEfaces EE 1.8.2.GA_P08 发布 -" itemprop="url">ICEfaces EE 1.8.2.GA_P08 发布 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>ICEfaces EE 1.8.2.GA_P08 &#x53D1;&#x5E03;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x8BA4;&#x8BC1;&#x7684;&#x7EF4;&#x62A4;&#x7248;&#x672C;&#xFF0C;&#x66F4;&#x65B0;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p>
<h3 id="Notable_ICEfaces_Changes_In_This_Release_*_ICEfaces_Component_Suite_&#xA0;">Notable ICEfaces Changes In This Release * ICEfaces Component Suite  &#xA0;</h3><ul>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10492" target="_blank" rel="external">ICE-10492</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:inputRichText - IE11 Support</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10708" target="_blank" rel="external">ICE-10708</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:selectInputText arrow keys selection not working &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;(IE11)</li>
<li><p>[ <a href="http://jira.icesoft.org/browse/ICE-10355" target="_blank" rel="external">ICE-10355</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:inputFile - update commons-fileupload library to &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;v1.3.1 for security fix</p>
<ul>
<li>Note that the commons-fileUpload.jar v1.3.1 requires JDK &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;1.5+, and the commons-io.jar.&#xA0; If you are deploying &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;to a JDK 1.4 environment, you must substitute v1.2.2 of &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;the commons-fileUpload.jar (available from the <a href="http://archive.apache.org/dist/commons/fileupload/binaries/" target="_blank" rel="external">Apache &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;Commons FileUpload site</a> ).</li>
</ul>
</li>
<li><p>[ <a href="http://jira.icesoft.org/browse/ICE-9604" target="_blank" rel="external">ICE-9604</a> ]&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:inputFile fileEntryListener/rowSelectListener &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;validation fails</p>
</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-1755" target="_blank" rel="external">ICE-1755</a> ]&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:outputLink incorrectly encodes space as &quot;+&quot; in path</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10553" target="_blank" rel="external">ICE-10553</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:panelGroup revert Draggable position when Escape key &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;is pressed while dragging</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10699" target="_blank" rel="external">ICE-10699</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:panelGroup revert feature doesn&apos;t position elements &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;correctly when using dragGhost or ghosting</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10305" target="_blank" rel="external">ICE-10305</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:panelCollapsible - Expanded panel sets inline padding</li>
</ul>
<ul>
<li><p>Core Framework</p>
<ul>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9583" target="_blank" rel="external">ICE-9583</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Stuck threads reported with WeakHashMap.get() on Facelets &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;classes</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9627" target="_blank" rel="external">ICE-9627</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Deadlock during session invalidation</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9804" target="_blank" rel="external">ICE-9804</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- CLONE - Deadlock on Session invalidation/logout on &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;WebSphere</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9836" target="_blank" rel="external">ICE-9836</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Classpath.getAlternativeJarFile(…) causes Bad file &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;descriptor under WebSphere 8.5</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9842" target="_blank" rel="external">ICE-9842</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ClassCastException thrown when loading non-ICEfaces pages</li>
</ul>
</li>
<li><p>Samples</p>
<ul>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10410" target="_blank" rel="external">ICE-10410</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Component Showcase image preloading fails on Chrome for &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;missing images</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10412" target="_blank" rel="external">ICE-10412</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Component-showcase Google Maps missing controls</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10622" target="_blank" rel="external">ICE-10622</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- IE11 specific issues with samples/component-showcase</li>
</ul>
</li>
</ul>
<h3 id="Notable_ICEpack_Changes_In_This_Release">Notable ICEpack Changes In This Release</h3><ul>
<li>[ <a href="http://jira.icesoft.org/browse/IPCK-472" target="_blank" rel="external">IPCK-472</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- cc:inputFile: JS error occuring in Composite Showcase File &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;Upload Demo</li>
<li>[ <a href="http://jira.icesoft.org/browse/IPCK-474" target="_blank" rel="external">IPCK-474</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- EE Composite Showcase - File Upload cannot handle files &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;containing special characters</li>
<li>[ <a href="http://jira.icesoft.org/browse/IPCK-488" target="_blank" rel="external">IPCK-488</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- richDataGrid - Decrease button icon title references the &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;increase title</li>
<li><p>[ <a href="http://jira.icesoft.org/browse/IPCK-510" target="_blank" rel="external">IPCK-510</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- NPE thrown when starting EPS</p>
</li>
<li><p>Platform Support</p>
<ul>
<li>Certify ICEfaces EE 1.8.2 on Internet Explorer 11 (IE 11).</li>
</ul>
</li>
</ul>
<p>&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x8BF7;&#x67E5;&#x770B; <a href="http://res.icesoft.org/releasenotes/ICEfaces-EE-1.8.2.GA_P08-RN.html#Changes_182EEP08" target="_blank" rel="external">&#x53D1;&#x884C;&#x65E5;&#x5FD7;</a> &#x3002; </p>
<p>&#x8BE5;&#x7248;&#x672C;&#x4E0B;&#x8F7D;&#x8BF7;&#x70B9;&#xFF1A; <a href="http://www.icesoft.org/downloads/icefaces-1.8-downloads.jsf" target="_blank" rel="external">ICEfaces 1.x download page</a> . </p>
<p>ICEfaces &#x5546;&#x4E1A;&#x7248;&#x63D0;&#x4F9B;&#x989D;&#x5916;&#x7684;&#x7279;&#x6027;&#x548C;&#x9762;&#x5411;&#x53EF;&#x9760;&#x548C;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x53D1;&#x5E03;&#x3002;ICEfaces EE &#x662F;&#x5B8C;&#x5168;&#x6D4B;&#x8BD5;&#x548C;&#x8BA4;&#x8BC1;&#x7684;&#x4F01;&#x4E1A;&#x7EA7;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>ICEfaces&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;Ajax&#x7684;JSF&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x3002;ICEfaces&#x539F;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x4EA7;&#x54C1;&#xFF0C;&#x73B0;&#x5DF2;&#x57FA;&#x4E8E;Mozilla Public License&#x534F;&#x8BAE;&#x5F00;&#x6E90;&#x4E86;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E00;&#x6574;&#x5957;&#x5B8C;&#x6574;&#x7684;Java EE&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x7EC4;&#x4EF6;&#xFF0C;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7528;&#x7EAF;Java(not JavaScript)&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x7626;&#x5BA2;&#x6237;&#x7AEF;&#x80D6;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;(Rich Internet Applications:RIA)&#x3002;&#x53E6;&#x5916;&#x53EF;&#x901A;&#x8FC7;&#x5728;&#x7EBF; <a href="http://component-showcase.icefaces.org/" target="_blank" rel="external">Demo</a> &#x4F53;&#x9A8C;&#x4E00;&#x4E0B;ICEfaces&#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#x3002; </p>
<p><img src="http://taojinke.github.io/img/20150701/f954620.gif" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/ICE/">ICE</a><a href="/tags/Java/">Java</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f9580b8/" title="利用 Buck进行高效Android编译 -" itemprop="url">利用 Buck进行高效Android编译 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><a href="http://buckbuild.com/" target="_blank" rel="external">Buck</a> &#x662F;Facebook&#x51FA;&#x54C1;&#x7684;&#x9AD8;&#x6548; <a href="https://github.com/facebook/buck" target="_blank" rel="external">&#x5F00;&#x6E90;</a> Android&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#xFF0C;&#x65E8;&#x5728;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x8005;&#x6784;&#x5EFA;&#x5C0F;&#x89C4;&#x6A21;&#x53EF;&#x91CD;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#xFF0C;2013&#x5E74;&#x53D1;&#x5E03;&#x65F6;&#xFF0C;InfoQ&#x5BF9;&#x6B64;&#x6709;&#x8FC7;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#x7684;&#x62A5;&#x9053;&#x3002; &#x968F;&#x7740;&#x7248;&#x672C;&#x7684;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#x548C;&#x529F;&#x80FD;&#x7684;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x56E2;&#x961F;&#x5F00;&#x59CB;&#x5229;&#x7528;Buck&#x6539;&#x8FDB;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#xFF0C;Vine&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#xFF0C;&#x8BE5;&#x56E2;&#x961F;&#x8FD1;&#x671F;&#x5728; <a href="http://engineering.vine.co/post/117873038742/reducing-build-times-by-adopting-buck" target="_blank" rel="external">&#x535A;&#x5BA2;</a> &#x4E2D;&#x5206;&#x4EAB;&#x4E86;Buck&#x4F7F;&#x7528;&#x7684;&#x7ECF;&#x9A8C;&#x3002; </p>
<p>&#x76F8;&#x6BD4;&#x4F20;&#x7EDF;&#x7684;Android&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#xFF0C;Buck&#x51ED;&#x501F;&#x591A;&#x6838;&#x53CA;&#x5E76;&#x884C;&#x6280;&#x672F;&#xFF0C;&#x6781;&#x5927;&#x52A0;&#x901F;&#x4E86;Android&#x5DE5;&#x7A0B;&#x7684;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x591A;&#x6B21;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x4F1A;&#x5BF9;&#x672A;&#x53D8;&#x52A8;&#x7684;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#xFF0C;&#x4EE5;&#x589E;&#x91CF;&#x5F0F;&#x7F16;&#x8BD1;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#x3002;Buck&#x81EA;&#x5E26;&#x7F16;&#x8BD1;&#x811A;&#x672C;&#x751F;&#x6210;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x4EE3;&#x7801;&#x8986;&#x76D6;&#x7387;&#x7B49;&#x6570;&#x636E;&#x8868;&#x5355;&#xFF0C;&#x8FD8;&#x4E3A;&#x65E0;&#x6CD5;&#x7528;Ant&#x5DE5;&#x5177;&#x7F16;&#x8BD1;&#x7684;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x6377;&#x7684;&#x7F16;&#x8BD1;&#x65B9;&#x5F0F;&#x3002;Buck&#x8DDF;IntelliJ&#x7ED3;&#x5408;&#x7D27;&#x5BC6;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x7F16;&#x8BD1;&#x811A;&#x672C;&#x751F;&#x6210;&#x8BE5;IDE&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x7A0B;&#xFF0C;&#x6781;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x672C;&#x5730;IDE&#x5F00;&#x53D1;&#x540E;&#x5411;&#x670D;&#x52A1;&#x5668;&#x8FC1;&#x79FB;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<p>Vine&#x56E2;&#x961F;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E86;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x5305;&#x62EC;Android Studio&#x3001;Gradle&#x7F16;&#x8BD1;&#x7CFB;&#x7EDF;&#x3001;Crashlytics&#x7B49;&#x7B2C;&#x4E09;&#x65B9;&#x63D2;&#x4EF6;&#x4EE5;&#x53CA;Jenkins&#x6301;&#x7EED;&#x96C6;&#x6210;&#x5DE5;&#x5177;&#x3002;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Vine&#x53D1;&#x73B0;&#x867D;&#x7136;Gradle&#x7F16;&#x8BD1;&#x7CFB;&#x7EDF;&#x652F;&#x6301;&#x591A;&#x5E73;&#x53F0;&#x914D;&#x7F6E;&#xFF0C;&#x4F46;&#x662F;Vine&#x7684;Android&#x7248;&#x672C;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x9047;&#x5230;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x662F;App&#x7684;&#x4F53;&#x79EF;&#x4F1A;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x5730;&#x589E;&#x957F;&#xFF0C;&#x4E8C;&#x662F;&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7F16;&#x8BD1;&#x6B65;&#x9AA4;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x8D8A;&#x6765;&#x8D8A;&#x957F;&#x3002;&#x5728;&#x5F15;&#x5165;Buck&#x524D;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x8D8A;&#x6765;&#x8D8A;&#x4E25;&#x91CD;&#xFF0C;&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x7F16;&#x8BD1;&#x8981;&#x82B1;&#x8D39;5&#x5206;&#x949F;&#x5DE6;&#x53F3;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x54EA;&#x6015;&#x4FEE;&#x6539;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x8BD1;&#x90FD;&#x9700;&#x8981;1&#x5206;&#x949F;&#x3002;&#x5BF9;&#x4E8E;Vine&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x578B;&#x56E2;&#x961F;&#x6765;&#x8BB2;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x82B1;&#x8D39;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5728;&#x7B49;&#x5F85;&#x7F16;&#x8BD1;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x8BA9;&#x4ED6;&#x4EEC;&#x975E;&#x5E38;&#x7EA0;&#x7ED3;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x8FC7;&#x7A0B;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;Vine&#x53D1;&#x73B0;dex&#x6587;&#x4EF6;&#x5408;&#x5E76;&#x4EE5;&#x53CA;&#x901A;&#x8FC7;USB&#x5B89;&#x88C5;App&#x7684;&#x65F6;&#x95F4;&#x5360;&#x53BB;&#x4E86;&#x6574;&#x4E2A;&#x7684;90%&#xFF0C;&#x56E0;&#x6B64;&#x51B3;&#x5B9A;&#x4EE5;&#x6B64;&#x4F5C;&#x4E3A;&#x7A81;&#x7834;&#x53E3;&#xFF0C;&#x8FD9;&#x65F6;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x6765;&#x81EA;Facebook&#x7684;Buck&#x5F88;&#x7CBE;&#x51C6;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x80FD;&#x591F;&#x901A;&#x8FC7;ExoPackage&#x6A21;&#x5F0F;&#x6765;&#x7F29;&#x77ED;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x3002;Buck&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x6709;&#x5F88;&#x591A;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x5982;&#x6700;&#x5C0F;&#x7F16;&#x8BD1;&#x4F9D;&#x8D56;&#x3001;&#x6700;&#x5C0F;dex&#x4F20;&#x8F93;&#x7B49;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;Buck&#x5F15;&#x5165;&#x4E86;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x85C9;&#x6B64;&#x5B8C;&#x6210;&#x9AD8;&#x6548;&#x7F16;&#x8BD1;&#x3002;&#x7F16;&#x8BD1;&#x89C4;&#x5219;&#xFF08;rule&#xFF09;&#xFF0C;&#x89C4;&#x5B9A;Buck&#x5728;&#x7ED9;&#x5B9A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x540E;&#x751F;&#x6210;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x7F16;&#x8BD1;&#x76EE;&#x6807;&#xFF08;target&#xFF09;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x91C7;&#x7528;&#x54EA;&#x4E2A;&#x89C4;&#x5219;&#x7F16;&#x8BD1;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x7F16;&#x8BD1;&#x6587;&#x4EF6;&#xFF08;file&#xFF09;&#xFF0C;&#x53EF;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7F16;&#x8BD1;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x7C7B;&#x6BD4;&#x4E3A;Make&#x6280;&#x672F;&#x4E2D;&#x7684;Makefile&#x3002;&#x5728;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;Buck&#x4F1A;&#x6839;&#x636E;file&#x4E2D;&#x7ED9;&#x5B9A;&#x7684;target&#x5BFB;&#x627E;&#x7279;&#x5B9A;&#x7F16;&#x8BD1;&#x89C4;&#x5219;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x89C4;&#x5219;&#x6765;&#x5BF9;Android&#x5DE5;&#x7A0B;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x7F16;&#x8BD1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;Buck&#x5185;&#x90E8;&#x4EE5;&#x4F9D;&#x8D56;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x6A21;&#x5757;&#x5E76;&#x884C;&#x7F16;&#x8BD1;&#xFF0C;&#x8282;&#x7EA6;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x5BF9;&#x672A;&#x6539;&#x52A8;&#x6A21;&#x5757;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x901F;&#x3002;</p>
<p>&#x6700;&#x540E;Vine&#x56E2;&#x961F;&#x7528;&#x4E86;&#x4E09;&#x4E2A;&#x5DE5;&#x4F5C;&#x65E5;&#x6765;&#x5C06;&#x7F16;&#x8BD1;&#x73AF;&#x5883;&#x8FC1;&#x79FB;&#x81F3;Buck&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5C06;&#x8FDC;&#x7A0B;jar&#x5168;&#x90E8;&#x653E;&#x7F6E;&#x672C;&#x5730;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x4FEE;&#x6539;R&#x503C;&#xFF0C;&#x521B;&#x5EFA;&#x6DF7;&#x5408;AndroidManifest.xml&#x6587;&#x4EF6;&#x548C;&#x521B;&#x5EFA;Buck&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7B49;&#x3002;&#x6B64;&#x65F6;&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x95F4;&#x5DF2;&#x964D;&#x4F4E;&#x81F3;40&#x79D2;&#x949F;&#xFF0C;&#x800C;&#x4E14;&#x672C;&#x6B21;&#x8FC1;&#x79FB;&#x5E76;&#x672A;&#x7834;&#x574F;&#x548C;&#x5F71;&#x54CD;Gradle&#x539F;&#x672C;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x6210;&#x529F;&#xFF0C;Vine&#x56E2;&#x961F;&#x6253;&#x7B97;&#x4E0B;&#x4E00;&#x6B65;&#x5C06;Buck&#x548C;Gradle&#x4E4B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x66F4;&#x52A0;&#x81EA;&#x52A8;&#x5316;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;Buck&#x9762;&#x5411;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x662F;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x4ECE;&#x5355;&#x4E00;&#x4EE3;&#x7801;&#x5E93;&#x7F16;&#x8BD1;&#x591A;&#x4E2A;&#x4E0D;&#x540C;target&#x7684;&#x4EBA;&#xFF0C;&#x9002;&#x5408;&#x8FDB;&#x884C;&#x591A;&#x5E73;&#x53F0;&#x5F00;&#x53D1;&#x7684;&#x56E2;&#x961F;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x76EE;&#x524D;Buck&#x4E0D;&#x652F;&#x6301;Window&#x5E73;&#x53F0;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x80FD;&#x901A;&#x8FC7;Mac&#x6216;Linux&#x5E73;&#x53F0;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x3002;&#x5BF9;Buck&#x5B89;&#x88C5;&#x3001;&#x5FEB;&#x901F;&#xFFFD;&#xFFFD;&#xFFFD;&#x95E8;&#x3001;&#x4EE5;&#x53CA;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x53C2;&#x8003;Buck&#x5B98;&#x65B9;&#x7ED9;&#x51FA;&#x7684; <a href="http://buckbuild.com/setup/quick_start.html" target="_blank" rel="external">&#x6559;&#x7A0B;</a> &#x3002; </p>
<p>&#x611F;&#x8C22;&#x5F90;&#x5DDD;&#x5BF9;&#x672C;&#x6587;&#x7684;&#x5BA1;&#x6821;&#x3002; </p>
<p>&#x7ED9;InfoQ&#x4E2D;&#x6587;&#x7AD9;&#x6295;&#x7A3F;&#x6216;&#x8005;&#x53C2;&#x4E0E;&#x5185;&#x5BB9;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x90AE;&#x4EF6;&#x81F3;editors@cn.infoq.com&#x3002;&#x4E5F;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#xFF08;@InfoQ&#xFF0C;@&#x4E01;&#x6653;&#x6600;&#xFF09;&#xFF0C;&#x5FAE;&#x4FE1;&#xFF08;&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; <a href="http://weixin.sogou.com/gzh?openid=oIWsFt0HnZ93MfLi3pW2ggVJFRxY" target="_blank" rel="external">InfoQChina</a> &#xFF09;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x7F16;&#x8F91;&#x548C;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#xFF08;&#x6B22;&#x8FCE;&#x52A0;&#x5165;InfoQ&#x8BFB;&#x8005;&#x4EA4;&#x6D41;&#x7FA4; </p>
<p><img src="http://taojinke.github.io/img/20150701/f95684e.png" alt="InfoQ&#x597D;&#x8BFB;&#x8005;"></p>
<p>&#xFF09;&#x3002; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/安卓开发/">安卓开发</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf44413/" title="OS X El Capitan发布：秋季正式推出 -" itemprop="url">OS X El Capitan发布：秋季正式推出 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="OS_X_El_Capitan&#x53D1;&#x5E03;&#xFF1A;&#x79CB;&#x5B63;&#x6B63;&#x5F0F;&#x63A8;&#x51FA;">OS X El Capitan&#x53D1;&#x5E03;&#xFF1A;&#x79CB;&#x5B63;&#x6B63;&#x5F0F;&#x63A8;&#x51FA;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 01:32:47  <a href="/sites/fYzqie">&#x7F51;&#x6613;&#x79D1;&#x6280;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://tech.163.com/15/0609/01/ARKOG52G000915BD.html?utm_source=tuicool" target="_blank" rel="external">http://tech.163.com/15/0609/01/ARKOG52G000915BD.html</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11250029">Mac OS X</a></p>
<p><img src="http://taojinke.github.io/img/20150609/cf4356d.jpg" alt=""></p>
<p>&#x7F51;&#x6613;&#x79D1;&#x6280;&#x8BAF; 6&#x6708;9&#x65E5;&#x51CC;&#x6668;&#x6D88;&#x606F;2015&#x82F9;&#x679C;&#x5168;&#x7403;&#x5F00;&#x53D1;&#x8005;&#x5927;&#x4F1A;&#xFF08;WWDC 2015&#xFF09;&#x5728;&#x65E7;&#x91D1;&#x5C71;&#x53EC;&#x5F00;&#xFF0C;&#x7F51;&#x6613;&#x79D1;&#x6280;&#x8FDB;&#x884C;&#x4E86;&#x5168;&#x7A0B;&#x56FE;&#x6587;&#x76F4;&#x64AD;&#x3002;&#x5927;&#x4F1A;&#x4E0A;&#xFF0C;&#x82F9;&#x679C;&#x53D1;&#x5E03;&#x4E86;&#x6700;&#x65B0;&#x7684;OS X El Capitan&#xFF0C;&#x5BD3;&#x610F;&#x961F;&#x957F;&#x3001;&#x8239;&#x957F;&#x4E4B;&#x610F;&#x3002;&#x65B0;&#x7248;OS X&#x5C06;&#x4E8E;&#x4ECA;&#x5E74;&#x79CB;&#x5B63;&#x6B63;&#x5F0F;&#x63A8;&#x51FA;&#x3002; </p>
<p>&#x82F9;&#x679C;Craig Federighi&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E86;OS X Yosemite &#x7684;&#x66F4;&#x65B0;&#x7387;&#xFF0C;&#x521B;&#x4E0B;&#x4E86;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x53F2;&#x4E0A;&#x7684;&#x65B0;&#x7EAA;&#x5F55;&#x3002;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x6709;55%&#x7684;Mac&#x6D3B;&#x8DC3;&#x7528;&#x6237;&#x91C7;&#x7528;Yosemite&#x7CFB;&#x7EDF;&#x3002;&#x5927;&#x4F1A;&#x4E0A;&#xFF0C;&#x82F9;&#x679C;&#x8FD8;&#x53D1;&#x5E03;&#x4E86;&#x4E0B;&#x4E00;&#x4EE3;OS X&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF; EI Capitan&#x3002;</p>
<p>El Capitan&#x662F;&#x897F;&#x73ED;&#x7259;&#x8BED;&#x7684;&#x201C;&#x961F;&#x957F;&#x201D;&#x3001;&#x201C;&#x8239;&#x957F;&#x201D;&#x4E4B;&#x610F;&#xFF0C;&#x8FD9;&#x4E00;&#x7248;&#x672C;&#x4E3B;&#x8981;&#x7740;&#x91CD;&#x63D0;&#x5347;Mac&#x7684;&#x4F53;&#x9A8C;&#x548C;&#x6027;&#x80FD;&#x3002;</p>
<p>OS X El Capitan&#x6027;&#x80FD;&#x63D0;&#x5347;</p>
<p>OS X El Capitan &#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5728;&#x8FDB;&#x884C;&#x4E86;&#x63D0;&#x5347;&#xFF0C;&#x4F7F;&#x5176;&#x66F4;&#x4E3A;&#x5F3A;&#x5927;&#xFF0C;&#x8BA9;&#x4F60;&#x80FD;&#x4EE5;&#x66F4;&#x667A;&#x80FD;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x5904;&#x7406;&#x65E5;&#x5E38;&#x4E8B;&#x52A1;&#x3002;OS X El Capitan&#x624B;&#x52BF;&#x64CD;&#x4F5C;&#x529F;&#x80FD;&#x8BA9;&#x8BB8;&#x591A;&#x5FEB;&#x901F;&#x64CD;&#x4F5C;&#x53D8;&#x5F97;&#x66F4;&#x4E3A;&#x7B80;&#x5355;&#xFF1A;&#x4F8B;&#x5982;&#x4ECE;&#x90AE;&#x4EF6; app &#x91CC;&#x5220;&#x9664;&#x67D0;&#x5C01;&#x90AE;&#x4EF6;&#x3002;Safari &#x4E0A;&#x7684;&#x56FA;&#x5B9A;&#x6807;&#x7B7E;&#x9875;&#x529F;&#x80FD;&#xFF0C;&#x8BA9;&#x4F60;&#x80FD;&#x5C06;&#x65F6;&#x5E38;&#x6D4F;&#x89C8;&#x7684;&#x7F51;&#x7AD9;&#x4FDD;&#x6301;&#x6253;&#x5F00;&#x548C;&#x66F4;&#x65B0;&#x3002;</p>
<p>&#x641C;&#x7D22;&#x529F;&#x80FD;Spotlight&#x589E;&#x5F3A;&#xFF0C;&#x5C06;&#x4ECE;&#x66F4;&#x591A;&#x6765;&#x6E90;&#x4E3A;&#x7528;&#x6237;&#x641C;&#x7D22;&#x51FA;&#x66F4;&#x6709;&#x6548;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x60F3;&#x67E5;&#x770B;&#x5929;&#x6C14;&#x72B6;&#x51B5;&#x8FD8;&#x662F;&#x8981;&#x8FFD;&#x8E2A;&#x4F53;&#x80B2;&#x8D5B;&#x4E8B;&#x7684;&#x6BD4;&#x5206;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x4F18;&#x5316;&#x7684;&#x90AE;&#x4EF6; app &#x5168;&#x5C4F;&#x663E;&#x793A;&#x529F;&#x80FD;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5728;&#x65B0;&#x7684;&#x90AE;&#x4EF6;&#x7A97;&#x53E3;&#x4E2D;&#x6DFB;&#x52A0;&#x591A;&#x4E2A;&#x6807;&#x7B7E;&#x9875;&#x3002;</p>
<p>&#x65B0;OS X&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x7A97;&#x53E3;&#x81EA;&#x9002;&#x5E94;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x6709;&#x70B9;&#x50CF;Windows&#x7684;&#x7A97;&#x53E3;&#x5E76;&#x5217;&#x6392;&#x653E;&#x3002; </p>
<p>Spaces Bar &#x8BA9;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#xFFFD;&#xFFFD;&#xFFFD;&#x677E;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x5C4F;&#x5E55;&#xFF0C;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x64CD;&#x4F5C;&#x7A7A;&#x95F4;&#x3002;Split View &#x5C06;&#x81EA;&#x52A8;&#x5E76;&#x6392;&#x4E24;&#x4E2A; app &#x6765;&#x5171;&#x7528;&#x4E00;&#x4E2A;&#x5C4F;&#x5E55;&#xFF0C;&#x8BA9; Mac &#x663E;&#x793A;&#x5C4F;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x50CF;&#x7D20;&#x90FD;&#x7269;&#x5C3D;&#x5176;&#x7528;&#x3002;</p>
<p>&#x5728;&#x65B0;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;El Capitan&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x542F;&#x52A8;&#x901F;&#x5EA6;&#x662F;Yosemite&#x7684;&#x81F3;&#x5C11;1.4&#x500D;&#x3002;</p>
<p>&#x65B0;&#x7248;OS X&#x5F15;&#x5165;Metal&#x6280;&#x672F;</p>
<p>Metal &#x662F;&#x4E00;&#x79CD;&#x6838;&#x5FC3;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x8BA9;&#x5404;&#x79CD;app&#x90FD;&#x80FD;&#x66F4;&#x5FEB;&#x6377;&#x5730;&#x8BBF;&#x95EE;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x5668;&#x3002;Metal&#x7EFC;&#x5408;&#x4E86;OpenCL&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x548C;OpenGL&#x7684;&#x56FE;&#x5F62;&#x80FD;&#x529B;&#xFF0C;&#x4F7F;&#x6E32;&#x67D3;&#x6548;&#x679C;&#x63D0;&#x5347;40%&#xFF0C;Adobe&#x7684;&#x6E32;&#x67D3;&#x6548;&#x679C;&#x5F97;&#x5230;&#x4E86;8&#x500D;&#x63D0;&#x5347;&#x3002; </p>
<p>&#x636E;&#x900F;&#x9732;&#xFF0C;&#x65B0;&#x7684;El Capitan&#x7CFB;&#x7EDF;&#x5C06;&#x4E8E;&#x4ECA;&#x5E74;&#x79CB;&#x5B63;&#x6B63;&#x5F0F;&#x63A8;&#x51FA;&#xFF0C;&#x9762;&#x5411;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;beta&#x7248;OS X El Capitan&#x5219;&#x4F1A;&#x4E8E;&#x4ECA;&#x5929;&#x63A8;&#x51FA;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf437de.png" alt=""></p>
<p><a href="http://tech.163.com/15/0609/01/tech.163.com/special/wwdc2015/" target="_blank" rel="external">&#x3010;&#x4E13;&#x9898;&#x3011;2015&#x82F9;&#x679C;&#x5168;&#x7403;&#x5F00;&#x53D1;&#x8005;&#x5927;&#x4F1A;</a></p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/BBFzY3">&#x8FDB;&#x5316;&#x4F46;&#x6539;&#x53D8;&#x4E0D;&#x4E86;&#x4E16;&#x754C; &#x7B80;&#x8BC4;&#x82F9;&#x679C;WWDC2015</a></li>
<li>2.<a href="/articles/juq6Jbn">&#x300C;WWDC &#x603B;&#x7ED3;&#x300D;&#x65B0; OSX El Capitan &#x4FE1;&#x606F;&#x5927;&#x6C47;&#x603B;</a></li>
<li>3.<a href="/articles/YFBZVfv">OS X 10.11 &#x53D1;&#x5E03;&#xFF0C;&#x4EE3;&#x53F7; &#xFF1A;&#x4EE3;&#x53F7; El Capitan</a></li>
<li>4.<a href="/articles/73uYrar">iOS &#x548C; Mac &#x5F00;&#x53D1;&#x8005;&#x9879;&#x76EE;&#x5408;&#x5E76;&#xFF0C;&#x6210;&#x4E3A;&#x82F9;&#x679C;&#x5F00;&#x53D1;&#x8005;&#x9879;&#x76EE;</a></li>
<li>5.<a href="/articles/biMVb2A">&#x82F9;&#x679C;&#x66F4;&#x65B0;OS X&#x7248;&#x672C; &#x547D;&#x540D;&#x4E3A;EI Capitan</a></li>
<li><p>6.<a href="/articles/3UraQr3">&#x6548;&#x7387;&#x63D0;&#x5347; Swift&#x8BED;&#x8A00;&#x5C06;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/qyQfY3">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;qyQfY3&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Mac-OS-X/">Mac OS X</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf2ff5e/" title="Debian 8.1 发布， -" itemprop="url">Debian 8.1 发布， -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="Debian_8-1_&#x53D1;&#x5E03;&#xFF0C;">Debian 8.1 &#x53D1;&#x5E03;&#xFF0C;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 07:24:22  <a href="/sites/JNzQre">&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x65B0;&#x95FB;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.oschina.net/news/63183/debian-8-1?utm_source=tuicool" target="_blank" rel="external">http://www.oschina.net/news/63183/debian-8-1</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11200040">Debian</a></p>
<p><a href="http://www.oschina.net/question/1765084_236572" target="_blank" rel="external">6&#x6708;14&#x65E5;&#x4E0A;&#x6D77; OSC &#x6E90;&#x521B;&#x4F1A;&#x5F00;&#x59CB;&#x62A5;&#x540D;&#xFF0C;&#x9001;&#x673A;&#x68B0;&#x952E;&#x76D8;&#x548C;&#x5F00;&#x6E90;&#x65E0;&#x7801;&#x5185;&#x88E4;</a></p>
<p>Debian 8.1 &#x53D1;&#x5E03;&#xFF0C;&#x6539;&#x7248;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x6742;&#x9879;&#x9519;&#x8BEF;&#x4FEE;&#x6B63;&#xFF0C;&#x4EE5;&#x53CA;&#x5B89;&#x5168;&#x5347;&#x7EA7;&#x7B49;&#x3002;</p>
<p>&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x8BF7;&#x67E5;&#x770B;&#x8F6F;&#x4EF6;&#x4E3B;&#x9875;&#xFF1A; <a href="https://www.debian.org/" target="_blank" rel="external">https://www.debian.org/</a></p>
<p>&#x8BE5;&#x7248;&#x672C;&#x4E0B;&#x8F7D;&#x9875;&#x9762;&#x8BF7;&#x70B9; <a href="https://www.debian.org/mirror/list" target="_blank" rel="external">&#x8FD9;&#x91CC;</a> &#x3002; </p>
<p><img src="http://taojinke.github.io/img/20150609/cf2d36c.png" alt=""></p>
<p><img src="http://taojinke.github.io/img/20150609/cf2dd30.png" alt=""></p>
<p>Debian &#x8BA1;&#x5212; &#x662F;&#x4E00;&#x4E2A;&#x81F4;&#x529B;&#x4E8E;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x81EA;&#x7531;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x5408;&#x4F5C;&#x7EC4; &#x7EC7;&#x3002;&#x6211;&#x4EEC;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x540D;&#x4E3A; <strong>Debian GNU/Linux</strong> &#xFF0C;&#x7B80;&#x79F0;&#x4E3A; <strong>Debian</strong> &#x3002; </p>
<p>&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x662F;&#x4F7F;&#x8BA1;&#x7B97;&#x673A;&#x8FD0;&#x884C;&#x7684;&#x57FA;&#x672C;&#x7A0B;&#x5E8F;&#x548C;&#x5DE5;&#x5177;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x90E8;&#x5206;&#x79F0;&#x4E3A;&#x5185;&#x6838; (kernel)&#x3002;&#x5185;&#x6838;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x8D1F;&#x8D23;&#x4E00;&#x5207;&#x57FA;&#x672C;&#x7684;&#x8C03;&#x5EA6;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76; &#x8BA9;&#x60A8;&#x8FD0;&#x884C;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>Debian &#x7CFB;&#x7EDF;&#x76EE;&#x524D;&#x91C7;&#x7528; Linux &#x5185;&#x6838;&#x3002;Linux &#x662F;&#x4E00;&#x4E2A;&#x6700;&#x521D;&#x7531; Linus Torvalds &#x521B;&#x5EFA;&#xFF0C;&#x76EE;&#x524D;&#x7531;&#x5168;&#x7403;&#x6210;&#x5343;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5171;&#x540C;&#x7EF4;&#x62A4;&#x7684;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x8BA9; Debian &#x652F;&#x6301;&#x5176;&#x4ED6;&#x5185;&#x6838;&#x7684;&#x5DE5;&#x4F5C;&#x4E5F;&#x6B63;&#x5728;&#x8FDB;&#x884C;&#xFF0C;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x5C31;&#x662F; Hurd&#x3002;Hurd &#x662F;&#x4E00;&#x7EC4;&#x5728;&#x5FAE;&#x5185; &#x6838; (&#x4F8B;&#x5982; Mach) &#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B; &#x3002;Hurd &#x662F;&#x7531; GNU &#x8BA1;&#x5212; &#x6240;&#x8BBE;&#x8BA1; &#x7684;&#x81EA;&#x7531;&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5927;&#x90E8;&#x5206;&#x57FA;&#x672C;&#x5DE5;&#x5177;&#x6765;&#x81EA;&#x4E8E; GNU &#x8BA1;&#x5212;&#xFF1B;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x628A;&#x5B83;&#x4EEC;&#x547D;&#x540D;&#x4E3A; GNU/Linux &#x548C; GNU/Hurd&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x540C;&#x6837;&#x90FD;&#x662F;&#x81EA;&#x7531;&#x7684;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4EBA;&#x4EEC;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x662F;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5E2E;&#x52A9;&#x4ED6;&#x4EEC;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x7684;&#x7A0B;&#x5E8F;: &#x4ECE;&#x6587;&#x6863;&#x7F16;&#x8F91;&#xFF0C; &#x5230;&#x7535;&#x5B50;&#x5546;&#x52A1;&#xFF0C;&#x5230;&#x6E38;&#x620F;&#x5A31;&#x4E50;&#xFF0C;&#x5230;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3002;Debian &#x5E26;&#x6765;&#x4E86;&#x8D85;&#x8FC7; 25113 &#x4E2A; &#x8F6F;&#x4EF6;&#x5305; (&#x4E3A;&#x4E86;&#x80FD;&#x5728;&#x60A8;&#x7684;&#x673A;&#x5668;&#x4E0A; &#x8F7B;&#x677E;&#x7684;&#x5B89;&#x88C5;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x5305;&#x90FD;&#x5DF2;&#x7ECF;&#x88AB;&#x7F16;&#x8BD1;&#x5305;&#x88C5;&#x4E3A;&#x4E00;&#x79CD;&#x65B9;&#x4FBF;&#x7684;&#x683C;&#x5F0F;) &#x2014; &#x8FD9;&#x4E9B;&#x5168;&#x90E8;&#x90FD;&#x662F; &#x81EA;&#x7531; &#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x8FD9;&#x6709;&#x70B9;&#x50CF;&#x4E00;&#x4E2A;&#x9AD8;&#x5854;: &#x5728;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x662F;&#x5185;&#x6838;&#xFF0C;&#x5728;&#x5185;&#x6838;&#x4E0A;&#x9762;&#x7684;&#x662F;&#x6240;&#x6709;&#x7684;&#x57FA;&#x672C;&#x5DE5;&#x5177;&#xFF0C;&#x7136;&#x540E;&#x662F;&#x6240; &#x6709;&#x60A8;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x9AD8;&#x5854;&#x9876;&#x7AEF;&#x7684;&#x5C31;&#x662F; Debian &#x2014; &#x628A;&#x6BCF;&#x4EF6;&#x4E8B;&#x60C5;&#x8C28;&#x614E;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x914D;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4F7F;&#x5F97;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x5728;&#x4E00;&#x8D77;&#x548C;&#x8C10;&#x5730;&#x8FD0;&#x4F5C;&#x3002;</p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/aAR7rij">&#x4F7F;&#x7528; Ansible &#x7BA1;&#x7406; CoreOS</a></li>
<li>2.<a href="/articles/BfuU3m">Linux Module</a></li>
<li>3.<a href="/articles/RnUbeqr">Linux Shell &#x7A0B;&#x5E8F;&#x8C03;&#x8BD5;</a></li>
<li>4.<a href="/articles/BFNRFvj">&#x5229;&#x7528;bat&#x6279;&#x5904;&#x7406;&#x505A;&#x542F;&#x52A8;mongodb&#x811A;&#x672C;</a></li>
<li>5.<a href="/articles/raiQfeJ">&#x5927;&#x6587;&#x4EF6;&#x7684;&#x5E76;&#x884C;&#x5904;&#x7406;&#x95EE;&#x9898;</a></li>
<li><p>6.<a href="/articles/yme2M3a">Vim&#x63D2;&#x4EF6;&#x5B66;&#x4E60;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/Y3Ibea">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;Y3Ibea&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Debian/">Debian</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf33ed8/" title="门头沟信息网 1.2 发布，资讯网站开源啦 -" itemprop="url">门头沟信息网 1.2 发布，资讯网站开源啦 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="&#x95E8;&#x5934;&#x6C9F;&#x4FE1;&#x606F;&#x7F51;_1-2_&#x53D1;&#x5E03;&#xFF0C;&#x8D44;&#x8BAF;&#x7F51;&#x7AD9;&#x5F00;&#x6E90;&#x5566;">&#x95E8;&#x5934;&#x6C9F;&#x4FE1;&#x606F;&#x7F51; 1.2 &#x53D1;&#x5E03;&#xFF0C;&#x8D44;&#x8BAF;&#x7F51;&#x7AD9;&#x5F00;&#x6E90;&#x5566;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 08:10:17  <a href="/sites/JNzQre">&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x65B0;&#x95FB;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.oschina.net/news/63199/jflyfox_mtgxxw-1-2?utm_source=tuicool" target="_blank" rel="external">http://www.oschina.net/news/63199/jflyfox_mtgxxw-1-2</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11080038">&#x5F00;&#x6E90;</a><a href="/topics/11000064">&#x6570;&#x636E;&#x5E93;</a></p>
<p><a href="http://www.oschina.net/question/1765084_236572" target="_blank" rel="external">6&#x6708;14&#x65E5;&#x4E0A;&#x6D77; OSC &#x6E90;&#x521B;&#x4F1A;&#x5F00;&#x59CB;&#x62A5;&#x540D;&#xFF0C;&#x9001;&#x673A;&#x68B0;&#x952E;&#x76D8;&#x548C;&#x5F00;&#x6E90;&#x65E0;&#x7801;&#x5185;&#x88E4;</a></p>
<h4 id="&#x95E8;&#x5934;&#x6C9F;&#x4FE1;&#x606F;&#x7F51;_1-2_&#x53D1;&#x5E03;&#x4E86;&#xFF0C;&#x66F4;&#x65B0;&#x8BF4;&#x660E;&#xFF1A;">&#x95E8;&#x5934;&#x6C9F;&#x4FE1;&#x606F;&#x7F51; 1.2 &#x53D1;&#x5E03;&#x4E86;&#xFF0C;&#x66F4;&#x65B0;&#x8BF4;&#x660E;&#xFF1A;</h4><p>1.&#x53BB;&#x9664;&#x5BF9;&#x4E4B;&#x524D;CRUD&#x4F9D;&#x8D56;&#xFF0C;&#x8BA9;&#x4EE3;&#x7801;&#x66F4;&#x7B80;&#x5355;&#x66F4;&#x6613;&#x61C2;&#x3002;</p>
<p>2.&#x4FEE;&#x590D;&#x7528;&#x6237;&#x540D;&#x70B9;&#x51FB;&#x62A5;&#x9519;&#x95EE;&#x9898;&#xFF0C;&#x52A0;&#x5165;&#x70B9;&#x51FB;&#x7528;&#x6237;&#x67E5;&#x770B;&#x9875;&#x9762;&#x3002;</p>
<p>3.&#x4FEE;&#x6539;&#x767B;&#x5F55;&#x6587;&#x5B57;&#x9519;&#x8BEF;&#xFF0C;&#x6587;&#x7AE0;&#x6DFB;&#x52A0;&#x9875;&#x9762;&#x4F18;&#x5316;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5BC6;&#x7801;&#x9519;&#x8BEF;&#x95EE;&#x9898;&#x4FEE;&#x590D;&#xFF08;&#x4E4B;&#x524D;&#x7531;&#x4E8E;&#x79D8;&#x94A5;&#x4FEE;&#x6539;&#x65E0;&#x6CD5;&#x767B;&#x9646;&#xFF0C;&#x5B9E;&#x5728;&#x62B1;&#x6B49;&#xFF09;&#xFF0C;&#x4E00;&#x4E9B;&#x6613;&#x7528;&#x6027;&#x4F18;&#x5316;&#x3002;</p>
<p>4.&#x90E8;&#x7F72;&#x540E;&#xFF0C;&#x7BA1;&#x7406;&#x5458;&#x767B;&#x9646;&#x8D26;&#x53F7;&#x5BC6;&#x7801;&#xFF1A;admin/admin123&#xFF1B;&#x8FD9;&#x4E2A;&#x4E4B;&#x524D;&#x5199;&#x7684;&#x5730;&#x65B9;&#x4E0D;&#x660E;&#x663E;&#xFF0C;&#x603B;&#x4F1A;&#x88AB;&#x95EE;&#x5230;&#x3002;</p>
<p>&#x611F;&#x8C22;&#x5927;&#x5BB6;&#x7684;&#x53CD;&#x9988;&#x4E0E;&#x652F;&#x6301;&#xFF1B;&#x9769;&#x547D;&#x5C1A;&#x672A;&#x6210;&#x529F;&#xFF0C;&#x4ECD;&#x9700;&#x7EE7;&#x7EED;&#x52AA;&#x529B;&#x3002;</p>
<h4 id="&#x8F6F;&#x4EF6;&#x8BF4;&#x660E;&#xFF1A;">&#x8F6F;&#x4EF6;&#x8BF4;&#x660E;&#xFF1A;</h4><p>&#x95E8;&#x5934;&#x6C9F;&#x4FE1;&#x606F;&#x7F51;&#x6700;&#x5168;&#x9762;&#x7684;&#x751F;&#x6D3B;&#x3001;&#x65B0;&#x95FB;&#x3001;&#x7F8E;&#x98DF;&#x3001;&#x65C5;&#x6E38;&#x3001;&#x6559;&#x80B2;&#x7B49;&#x8D44;&#x8BAF;&#x3002;</p>
<p>&#x7F51;&#x7AD9;&#x91C7;&#x7528;&#x4E86;&#x7B80;&#x6D01;&#x5F3A;&#x5927;&#x7684;JFinal&#x4F5C;&#x4E3A;web&#x6846;&#x67B6;&#xFF0C;&#x6A21;&#x677F;&#x5F15;&#x64CE;&#x7528;&#x7684;&#x662F;beetl&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7528;mysql&#xFF0C;&#x524D;&#x7AEF;bootstrap&#x6846;&#x67B6;&#x3002; &#x652F;&#x6301;oauth2&#x8BA4;&#x8BC1;&#x3001;&#x5E10;&#x53F7;&#x6CE8;&#x518C;&#x3001;&#x5BC6;&#x7801;&#x52A0;&#x5BC6;&#x3001;&#x8BC4;&#x8BBA;&#x53CA;&#x56DE;&#x590D;&#xFF0C;&#x6D88;&#x606F;&#x63D0;&#x793A;&#xFF0C;&#x7F51;&#x7AD9;&#x8BBF;&#x95EE;&#x91CF;&#x7EDF;&#x8BA1;&#xFF0C;&#x6587;&#x7AE0;&#x8BC4;&#x8BBA;&#x6570;&#x548C;&#x6D4F;&#x89C8;&#x91CF;&#x7EDF;&#x8BA1;&#xFF0C;&#x56DE;&#x590D;&#x7BA1;&#x7406;&#xFF0C;&#x652F;&#x6301;&#x6743;&#x9650;&#x7BA1;&#x7406;&#x3002; </p>
<p>&#x6E90;&#x7801;&#x91C7;&#x7528;jflyfox&#x535A;&#x5BA2;&#x4EE3;&#x7801;&#xFF0C;&#x524D;&#x53F0;&#x9875;&#x9762;&#x91C7;&#x7528;bootstrap3&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x5E03;&#x5C40;&#x3002;</p>
<p>&#x9996;&#x9875;&#x6548;&#x679C;&#xFF1A; <a href="http://www.jflyfox.com/mtg" target="_blank" rel="external">http://www.jflyfox.com/mtg</a></p>
<p>&#x6B22;&#x8FCE;&#x9875;&#xFF1A; <a href="http://www.jflyfox.com/" target="_blank" rel="external">http://www.jflyfox.com</a></p>
<p>&#x6E90;&#x7801;&#x5730;&#x5740;&#xFF1A; <a href="https://git.oschina.net/flyfox/jflyfox_mtgxxw" target="_blank" rel="external">https://git.oschina.net/flyfox/jflyfox_mtgxxw</a></p>
<p>&#x7F51;&#x7AD9;&#x9996;&#x9875;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf31a39.jpg" alt=""></p>
<p>&#x767B;&#x9646;&#x9875;&#x9762;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf31caa.jpg" alt=""></p>
<p>&#x540E;&#x53F0;&#x9875;&#x9762;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf31caa.jpg" alt=""></p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/6fIruaU">Appweb 5.4.2 &#x53D1;&#x5E03;&#xFF0C;&#x5D4C;&#x5165;&#x5F0F; Web &#x670D;&#x52A1;&#x5668;</a></li>
<li>2.<a href="/articles/j6Fvau">&#x4F7F;&#x7528; BLU Acceleration &#x63D0;&#x9AD8; ETL &#x6027;&#x80FD;</a></li>
<li>3.<a href="/articles/Zz26Bfb">kubernetes 0.18.1 &#x521D;&#x8BD5;</a></li>
<li>4.<a href="/articles/63eueiU">&#x5F00;&#x6E90;&#x56FE;&#x8BA1;&#x7B97;&#x6846;&#x67B6;GraphLab&#x4ECB;&#x7ECD;</a></li>
<li>5.<a href="/articles/nYZvEjJ">PHP FastCGI RCE Vul</a></li>
<li><p>6.<a href="/articles/m6VvYf">Greenplum &#x6570;&#x636E;&#x5E93;&#x5B89;&#x88C5;&#x90E8;&#x7F72;&#xFF08;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#xFF09;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/zuI3IvM">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;zuI3IvM&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/开源/">开源</a><a href="/tags/数据库/">数据库</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf36d3b/" title="效率提升 Swift语言将开放源代码 -" itemprop="url">效率提升 Swift语言将开放源代码 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="&#x6548;&#x7387;&#x63D0;&#x5347;_Swift&#x8BED;&#x8A00;&#x5C06;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;">&#x6548;&#x7387;&#x63D0;&#x5347; Swift&#x8BED;&#x8A00;&#x5C06;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 02:39:36  <a href="/sites/7vQnUb">cnBeta</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.cnbeta.com/articles/400863.htm?utm_source=tuicool" target="_blank" rel="external">http://www.cnbeta.com/articles/400863.htm</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/10000098">IT</a></p>
<p>2015&#x5E74;&#x82F9;&#x679C;&#x5168;&#x7403;&#x5F00;&#x53D1;&#x8005;&#x5927;&#x4F1A;(WWDC 2015)&#x5728;&#x7F8E;&#x56FD;&#x65E7;&#x91D1;&#x5C71;&#x6B63;&#x5F0F;&#x5F00;&#x5E55;&#x672C;&#x5C4A;&#x4E3B;&#x9898;&#x4E3A;&#x201C;the epicenter of change.&#xFF08;&#x53D8;&#x9769;&#x7684;&#x4E2D;&#x5FC3;&#xFF09;&#x201D;&#x3002;&#x65B0;&#x7684;Swift&#x8BED;&#x8A00;&#x8BB2;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x4E3A;APP&#x7F16;&#x7A0B;&#x5E26;&#x6765;&#x66F4;&#x591A;&#x53EF;&#x80FD;&#x3002;App Store&#x76EE;&#x524D;&#x6709;&#x8D85;&#x8FC7;15000&#x4E2A;&#x5E94;&#x7528;&#x662F;&#x7528;Swift&#x6765;&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x5E94;&#x7528;&#x91C7;&#x7528;&#x4E86;&#x82F9;&#x679C;&#x81EA;&#x5BB6;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x65B0;&#x7684;Swift 2&#x8BED;&#x8A00;&#x53D1;&#x5E03;&#xFF0C;&#x9664;&#x4E86;&#x7F16;&#x8BD1;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x5404;&#x79CD;&#x65B0;&#x529F;&#x80FD;&#x4E5F;&#x5C06;&#x6709;&#x6548;&#x63D0;&#x5347;&#x5F00;&#x53D1;&#x8005;&#x6548;&#x7387;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf35742.jpg" alt="apple-wwdc-2015_1480.jpg"></p>
<p><img src="http://taojinke.github.io/img/20150609/cf359b3.jpg" alt="apple-wwdc-2015_1474.jpg"></p>
<p><img src="http://taojinke.github.io/img/20150609/cf35c24.jpg" alt="apple-wwdc-2015_1490.jpg"></p>
<p>&#x5728;&#x4ECA;&#x5E74;&#x665A;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;Swift&#x4F1A;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5BF9;iOS&#x3001;OS X&#x548C;Linux&#x5E73;&#x53F0;&#x90FD;&#x9002;&#x7528;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x6765;&#x8BF4;&#x65E0;&#x7591;&#x662F;&#x4E00;&#x4E2A;&#x4EE4;&#x4EBA;&#x60CA;&#x559C;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf35c24.jpg" alt="apple-wwdc-2015_1471.jpg"></p>
<p>&#x6700;&#x540E;iOS 9&#x786E;&#x8BA4;&#x5C06;&#x4E8E;&#x4ECA;&#x5E74;&#x79CB;&#x5B63;&#x968F;&#x7740;&#x65B0;&#x8BBE;&#x5907;&#x7684;&#x53D1;&#x5E03;&#x6B63;&#x5F0F;&#x63A8;&#x51FA;&#xFF0C;&#x800C;&#x9762;&#x5411;&#x975E;&#x5F00;&#x53D1;&#x8005;&#x7684;beta&#x7248;&#x5728;7&#x6708;&#x5C31;&#x80FD;&#x4E0B;&#x8F7D;&#x4F53;&#x9A8C;&#x3002;</p>
<h4 id="&#x8BBF;&#x95EE;:">&#x8BBF;&#x95EE;:</h4><p><a href="http://aos.prf.hn/click/camref:100lcC/" target="_blank" rel="external">&#x82F9;&#x679C;&#x5728;&#x7EBF;&#x5546;&#x5E97;(&#x4E2D;&#x56FD;)</a></p>
<p>cnBeta &#x5DF2;&#x7ECF;&#x5165;&#x9A7B;&#x8C4C;&#x8C46;&#x835A;&#x5566;&#xFF0C;&#x626B;&#x63CF;&#x5DE6;&#x4FA7;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x8C4C;&#x8C46;&#x835A;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#x3002;&#x6700;&#x61C2;&#x5E94;&#x7528;&#x7684;&#x8C4C;&#x8C46;&#x835A;&#xFF0C;&#x53D1;&#x73B0;&#x65E0;&#x6570;&#x597D;&#x5E94;&#x7528;&#x3002; </p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/BBFzY3">&#x8FDB;&#x5316;&#x4F46;&#x6539;&#x53D8;&#x4E0D;&#x4E86;&#x4E16;&#x754C; &#x7B80;&#x8BC4;&#x82F9;&#x679C;WWDC2015</a></li>
<li>2.<a href="/articles/juq6Jbn">&#x300C;WWDC &#x603B;&#x7ED3;&#x300D;&#x65B0; OSX El Capitan &#x4FE1;&#x606F;&#x5927;&#x6C47;&#x603B;</a></li>
<li>3.<a href="/articles/YFBZVfv">OS X 10.11 &#x53D1;&#x5E03;&#xFF0C;&#x4EE3;&#x53F7; &#xFF1A;&#x4EE3;&#x53F7; El Capitan</a></li>
<li>4.<a href="/articles/73uYrar">iOS &#x548C; Mac &#x5F00;&#x53D1;&#x8005;&#x9879;&#x76EE;&#x5408;&#x5E76;&#xFF0C;&#x6210;&#x4E3A;&#x82F9;&#x679C;&#x5F00;&#x53D1;&#x8005;&#x9879;&#x76EE;</a></li>
<li>5.<a href="/articles/biMVb2A">&#x82F9;&#x679C;&#x66F4;&#x65B0;OS X&#x7248;&#x672C; &#x547D;&#x540D;&#x4E3A;EI Capitan</a></li>
<li><p>6.<a href="/articles/3aUfyi">&#x82F9;&#x679C;&#xFF1A;55% MAC&#x7528;&#x6237;&#x91C7;&#x7528;Yosemite&#x7CFB;&#x7EDF;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/3UraQr3">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;3UraQr3&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/IT/">IT</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf3a2f1/" title="REMnux 6.0 发布，基于 Ubuntu 的 Linux 发行 -" itemprop="url">REMnux 6.0 发布，基于 Ubuntu 的 Linux 发行 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="REMnux_6-0_&#x53D1;&#x5E03;&#xFF0C;&#x57FA;&#x4E8E;_Ubuntu_&#x7684;_Linux_&#x53D1;&#x884C;">REMnux 6.0 &#x53D1;&#x5E03;&#xFF0C;&#x57FA;&#x4E8E; Ubuntu &#x7684; Linux &#x53D1;&#x884C;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 07:53:52  <a href="/sites/JNzQre">&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x65B0;&#x95FB;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.oschina.net/news/63196/remnux-6-0?utm_source=tuicool" target="_blank" rel="external">http://www.oschina.net/news/63196/remnux-6-0</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11200002">Ubuntu</a></p>
<p><a href="http://www.oschina.net/question/1765084_236572" target="_blank" rel="external">6&#x6708;14&#x65E5;&#x4E0A;&#x6D77; OSC &#x6E90;&#x521B;&#x4F1A;&#x5F00;&#x59CB;&#x62A5;&#x540D;&#xFF0C;&#x9001;&#x673A;&#x68B0;&#x952E;&#x76D8;&#x548C;&#x5F00;&#x6E90;&#x65E0;&#x7801;&#x5185;&#x88E4;</a></p>
<p> REMnux 6.0 &#x53D1;&#x5E03;&#xFF0C;&#x6B64;&#x7248;&#x672C;&#x66F4;&#x65B0;&#x4E86;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5F15;&#x5165;&#x4E86;&#x4E00;&#x4E9B;&#x65B0;&#x5E94;&#x7528;&#x3002;&#x6B64;&#x7248;&#x672C;&#x4E3B;&#x8981;&#x7684;&#x6539;&#x8FDB;&#x662F;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x66F4;&#x7B80;&#x5355;&#x7684;&#x66F4;&#x65B0;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x6574;&#x4E2A; REMnux &#x73AF;&#x5883;&#x3002;&#x83B7;&#x53D6;&#x6700;&#x65B0; REMnux &#x7248;&#x672C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4E0B;&#x8F7D;&#x865A;&#x62DF;&#x8BBE;&#x5907; OVA &#x6587;&#x4EF6;&#xFF0C;&#x5BFC;&#x5165;&#x5230;&#x559C;&#x6B22;&#x7684;&#x865A;&#x62DF;&#x5316;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x6BD4;&#x5982; VMware &#x548C; VirtualBox&#x3002;&#x5BFC;&#x5165;&#x540E;&#x8FD0;&#x884C; `update-remnux full&apos; &#x547D;&#x4EE4;&#x6765;&#x66F4;&#x65B0;&#x8F6F;&#x4EF6;&#x3002;&#x66F4;&#x591A;&#x5B89;&#x88C5;&#x6559;&#x7A0B;&#x8BF7;&#x770B; <a href="https://remnux.org/docs/distro/get/#download-the-remnux-virtual-appliance" target="_blank" rel="external">REMnux &#x5B89;&#x88C5;&#x6307;&#x5357;</a>&#x3002;&#x66F4;&#x591A;&#x66F4;&#x65B0;&#x5185;&#x5BB9;&#x8BF7;&#x770B; <a href="https://zeltser.com/remnux-v6-release-for-malware-analysis/" target="_blank" rel="external">&#x53D1;&#x884C;&#x8BF4;&#x660E;</a> &#x3002; <a href="https://sourceforge.net/projects/remnux/files/version6/" target="_blank" rel="external">Download (MD5)</a> : <a href="http://downloads.sourceforge.net/remnux/remnux-6.0-ova-public.ova" target="_blank" rel="external">remnux-6.0-ova-public.ova</a> (2,033MB)&#x3002; </p>
<p>via <a href="http://distrowatch.com/?newsid=08971" target="_blank" rel="external">distrowatch.com</a></p>
<p>REMnux&#x662F;&#x4E00;&#x4EFD;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x3001;&#x57FA;&#x4E8E;Ubuntu&#x7684;Linux&#x53D1;&#x884C;&#xFF0C;&#x7528;&#x4E8E;&#x8F85;&#x4F50;&#x5206;&#x6790;&#x4EBA;&#x5458;&#x5BF9;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x5DE5;&#x7A0B;&#x3002;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5DE5;&#x5177;&#x4EE5;&#x8FDB;&#x884C;&#x6076;&#x610F;&#x53EF;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x5206; &#x6790;&#xFF0C;&#x800C;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x4E8E;&#x5FAE;&#x8F6F;Windows&#x7CFB;&#x7EDF;&#x53CA;&#x6D4F;&#x89C8;&#x5668;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;Flash&#x7A0B;&#x5E8F;&#x53CA;&#x52A0;&#x6270;&#x8FC7;&#x7684;JavaScript&#x811A;&#x672C;&#x3002;&#x8BE5;&#x5DE5;&#x5177;&#x96C6;&#x8FD8;&#x5305;&#x542B;&#x7528;&#x4E8E;&#x5206;&#x6790;&#x5305;&#x62EC;PDF&#x683C;&#x5F0F; &#x5728;&#x5185;&#x7684;&#x6076;&#x610F;&#x6587;&#x6863;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4EE5;&#x53CA;&#x901A;&#x8FC7;&#x5185;&#x5B58;&#x53D6;&#x8BC1;&#x6765;&#x5BF9;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x53CD;&#x5411;&#x5DE5;&#x7A0B;&#x7684;&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150609/cf38334.png" alt=""></p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/EnqEVn">Swift 2.0&#x53D1;&#x5E03;&#xFF1A;&#x5373;&#x5C06;&#x5F00;&#x6E90;&#xFF0C;&#x652F;&#x6301;Linux</a></li>
<li>2.<a href="/articles/reEFbeV">&#x5BF9;Linux&#x521D;&#x5B66;&#x8005;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;</a></li>
<li>3.<a href="/articles/3UFFvi">Electron &#x5B9E;&#x9A8C;&#x9879;&#x76EE;&#xFF1A;&#x96EA;&#x7403;&#x80A1;&#x7968;&#x52A9;&#x624B;</a></li>
<li>4.<a href="/articles/6NraQbE">&#x4ECE; 0 &#x5F00;&#x59CB;&#x642D;&#x5EFA; Vim &#x7F16;&#x8F91;&#x5668;</a></li>
<li>5.<a href="/articles/qUNVFrI">&#x5982;&#x4F55;&#x4ECE;&#x6E90;&#x4EE3;&#x7801;&#x6784;&#x5EFA; Go 1.5 &#x5F00;&#x53D1;&#x73AF;&#x5883;</a></li>
<li><p>6.<a href="/articles/MNb2Ifu">FlashSim&#x5B89;&#x88C5;&#x53CA;&#x6D4B;&#x8BD5;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/rayauyF">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;rayauyF&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Ubuntu/">Ubuntu</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/16/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/15/">15</a><a class="page-number" href="/page/16/">16</a><span class="page-number current">17</span><a class="page-number" href="/page/18/">18</a><a class="page-number" href="/page/19/">19</a><span class="space">&hellip;</span><a class="page-number" href="/page/22/">22</a><a class="extend next" rel="next" href="/page/18/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>215</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/IT/" title="IT">IT<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Debian/" title="Debian">Debian<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/WildFly/" title="WildFly">WildFly<sup>3</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
