
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>C++基础回顾2（函数, 指针和引用） - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x63A5;&amp;#x7740;&amp;#x56DE;&amp;#x987E;&amp;#x51FD;&amp;#x6570;&amp;#x3001;&amp;#x6307;&amp;#x9488;&amp;#x548C;&amp;#x5E94;&amp;#x7528;&amp;#x3002;
&amp;#x51FD;&amp;#x6570; 
1&amp;#x3001;&amp;#x591A;&amp;#x7EF4;&amp;#x6570;&amp;#x7EC4;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5F62;&amp;#x53C2;&amp;#x6">
<meta property="og:type" content="article">
<meta property="og:title" content="C++基础回顾2（函数, 指针和引用） -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/03/e90e3a7/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x63A5;&amp;#x7740;&amp;#x56DE;&amp;#x987E;&amp;#x51FD;&amp;#x6570;&amp;#x3001;&amp;#x6307;&amp;#x9488;&amp;#x548C;&amp;#x5E94;&amp;#x7528;&amp;#x3002;
&amp;#x51FD;&amp;#x6570; 
1&amp;#x3001;&amp;#x591A;&amp;#x7EF4;&amp;#x6570;&amp;#x7EC4;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5F62;&amp;#x53C2;&amp;#x6">
<meta property="og:updated_time" content="2015-07-03T14:07:59.468Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="C++基础回顾2（函数, 指针和引用） -">
<meta name="twitter:description" content="&amp;#x63A5;&amp;#x7740;&amp;#x56DE;&amp;#x987E;&amp;#x51FD;&amp;#x6570;&amp;#x3001;&amp;#x6307;&amp;#x9488;&amp;#x548C;&amp;#x5E94;&amp;#x7528;&amp;#x3002;
&amp;#x51FD;&amp;#x6570; 
1&amp;#x3001;&amp;#x591A;&amp;#x7EF4;&amp;#x6570;&amp;#x7EC4;&amp;#x4F5C;&amp;#x4E3A;&amp;#x5F62;&amp;#x53C2;&amp;#x6">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/03/e90e3a7/" title="C++基础回顾2（函数, 指针和引用） -" itemprop="url">C++基础回顾2（函数, 指针和引用） -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-03T02:07:59.000Z" itemprop="datePublished"> 发表于 2015-07-03</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#define_S(R)_=_PI_R_R"><span class="toc-number">1.</span> <span class="toc-text">define S(R) = PI  R  R</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#指针和引用"><span class="toc-number">1.0.0.1.</span> <span class="toc-text">指针和引用</span></a></li></ol></li></ol></li></ol></li></ol>
		
		</div>
		
		<p>&#x63A5;&#x7740;&#x56DE;&#x987E;&#x51FD;&#x6570;&#x3001;&#x6307;&#x9488;&#x548C;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x51FD;&#x6570; </p>
<p>1&#x3001;&#x591A;&#x7EF4;&#x6570;&#x7EC4;&#x4F5C;&#x4E3A;&#x5F62;&#x53C2;&#x65F6;&#xFF0C;&#x7B2C;&#x4E00;&#x7EF4;&#x7684;&#x5927;&#x5C0F;&#x53EF;&#x4EE5;&#x7701;&#x7565;&#xFF08;&#x4E5F;&#x53EF;&#x4EE5;&#x4E0D;&#x7701;&#x7565;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x5176;&#x4ED6;&#x7EF4;&#x7684;&#x5927;&#x5C0F;&#x5FC5;&#x987B;&#x6307;&#x5B9A;&#x3002;&#x6BD4;&#x5982;&#x4E8C;&#x7EF4;&#x6570;&#x7EC4;&#x5F62;&#x53C2;&#xFF0C;int array[3][]&#x4E0D;&#x6B63;&#x786E;&#xFF0C;int arry[][10]&#x6B63;&#x786E;&#x3002;&#x56E0;&#x4E3A;&#x5B9E;&#x53C2;&#x4F20;&#x6765;&#x7684;&#x662F;&#x6570;&#x7EC4;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#xFF0C;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x6309;&#x884C;&#x5B58;&#x653E;&#xFF0C;&#x4F46;&#x5E76;&#x4E0D;&#x533A;&#x5206;&#x884C;&#x548C;&#x5217;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x5F62;&#x53C2;&#x4E2D;&#x4E0D;&#x6307;&#x5B9A;&#x5217;&#x6570;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x786E;&#x5B9A;&#x5E94;&#x4E3A;&#x591A;&#x5C11;&#x884C;&#x591A;&#x5C11;&#x5217;&#x3002;</p>
<p>2&#x3001;&#x5728;C++&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x4E3A;&#x53C2;&#x6570;&#x6307;&#x5B9A;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x4E0E;&#x5F62;&#x53C2;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x5B9E;&#x53C2;&#x5C31;&#x81EA;&#x52A8;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#x3002;C++&#x51FD;&#x6570;&#x7684;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x53EF;&#x4EE5;&#x662F;&#x5E38;&#x6570;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6216;&#x5168;&#x5C40;&#x5E38;&#x91CF;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x3002;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x53EA;&#x80FD;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x51FD;&#x6570;&#x539F;&#x578B;&#x4E2D;&#x7ED9;&#x51FA;&#xFF0C;&#x5219;&#x5728;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x4E0D;&#x80FD;&#x518D;&#x6B21;&#x7ED9;&#x51FA;&#x3002;&#x5982;&#x679C;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x4E4B;&#x524D;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E2D;&#x6CA1;&#x6709;&#x8FDB;&#x884C;&#x51FD;&#x6570;&#x58F0;&#x660E;&#xFF0C;&#x5219;&#x5E94;&#x5728;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#x4E2D;&#x7ED9;&#x51FA;&#x9ED8;&#x8BA4;&#x503C;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x51FD;&#x6570;&#x539F;&#x578B;&#x4E2D;&#x6CA1;&#x6709;&#x6307;&#x5B9A;&#x51FD;&#x6570;&#x7684;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x800C;&#x5728;&#x5B9A;&#x4E49;&#x4E2D;&#x4E3A;&#x53C2;&#x6570;&#x7ED9;&#x51FA;&#x4E86;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5219;&#x8C03;&#x7528;&#x65F6;&#x9ED8;&#x8BA4;&#x503C;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x6709;&#x591A;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x5E94;&#x4ECE;&#x53F3;&#x81F3;&#x5DE6;&#x9010;&#x4E2A;&#x5B9A;&#x4E49;&#x3002;</p>
<p>3&#x3001;&#x5185;&#x8054;&#x51FD;&#x6570;&#x7684;&#x5B9A;&#x4E49;&#x5FC5;&#x987B;&#x51FA;&#x73B0;&#x5728;&#x5185;&#x8054;&#x51FD;&#x6570;&#x7B2C;&#x4E00;&#x6B21;&#x88AB;&#x8C03;&#x7528;&#x4E4B;&#x524D;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#xFF0C;&#x7528;&#x5185;&#x8054;&#x51FD;&#x6570;&#x7684;&#x51FD;&#x6570;&#x4F53;&#x66FF;&#x6362;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8BED;&#x53E5;&#x3002;</p>
<p>4&#x3001;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x4E0D;&#x80FD;&#x65E2;&#x4F5C;&#x4E3A;&#x91CD;&#x8F7D;&#x51FD;&#x6570;&#xFF0C;&#x53C8;&#x4F5C;&#x4E3A;&#x6709;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#x3002;&#x5982;&#xFF1A;int myMax(int x, inty); int myMax(int x, int y, int z = 100);&#xFF0C;&#x5F53;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x5982;&#x679C;&#x5C11;&#x4E9B;&#x4E86;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#xFF0C;&#x5982;&#x8C03;&#x7528;&#x201C;myMax(1,2)&#x201D;&#xFF0C;&#x7F16;&#x8BD1;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x5224;&#x5B9A;&#x662F;&#x5229;&#x7528;&#x91CD;&#x8F7D;&#x51FD;&#x6570;&#x8FD8;&#x662F;&#x5229;&#x7528;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x51FA;&#x73B0;&#x4E8C;&#x4E49;&#x6027;&#xFF0C;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x6267;&#x884C;&#x3002;</p>
<p>5&#x3001;&#x8FD0;&#x7528;&#x5168;&#x5C40;&#x8FD0;&#x7B97;&#x7B26;&#x201C;::&quot;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5C40;&#x90E8;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x8BBF;&#x95EE;&#x5230;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#x6709;&#x5168;&#x5C40;&#x53D8;&#x91CF;x&#xFF0C;&#x5E76;&#x4E14;&#x53C8;&#x6709;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;x&#xFF0C;&#x5728;&#x8BE5;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x4E2D;&#x60F3;&#x8981;&#x4F7F;&#x7528;&#x5230;&#x5168;&#x5C40;&#x53D8;&#x91CF;x&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F7F;&#x7528;&#x201C;::x&#x201D;&#x3002;</p>
<p>6&#x3001;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x5728;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x65F6;&#x9884;&#x5206;&#x914D;&#xFF0C;&#x5E76;&#x5728;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x5C31;&#x88AB;&#x786E;&#x5B9A;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x3002;&#x5B9A;&#x4E49;&#x9759;&#x6001;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x540C;&#x65F6;&#x5236;&#x5B9A;&#x521D;&#x503C;&#xFF0C;&#x8BE5;&#x521D;&#x503C;&#x662F;&#x5728;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x524D;&#x5C31;&#x88AB;&#x8BBE;&#x5B9A;&#x7684;&#xFF0C;&#x4EE5;&#x540E;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#x4E0D;&#x518D;&#x91CD;&#x65B0;&#x8BBE;&#x5B9A;&#x521D;&#x503C;&#xFF0C;&#x800C;&#x662F;&#x4FDD;&#x7559;&#x4E0A;&#x6B21;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7ED3;&#x675F;&#x65F6;&#x7684;&#x503C;&#x3002;</p>
<p>7&#x3001;&#x5982;&#x679C;&#x5728;&#x5B9A;&#x4E49;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x672A;&#x6307;&#x5B9A;&#x521D;&#x503C;&#xFF0C;&#x5219;&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x7ED9;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x8D4B;&#x4E00;&#x4E2A;&#x4E8C;&#x8FDB;&#x5236;&#x4FE1;&#x606F;&#x5168;&#x4E3A;0&#x7684;&#x521D;&#x503C;&#x3002;&#xFF08;&#x4F46;&#x4E3A;&#x4E86;&#x7A0B;&#x5E8F;&#x4FBF;&#x4E8E;&#x79FB;&#x690D;&#x3001;&#x9605;&#x8BFB;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x5E94;&#x660E;&#x786E;&#x7ED9;&#x51FA;&#x9759;&#x6001;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x503C;&#xFF09;</p>
<p>8&#x3001;&#x9759;&#x6001;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5BF9;&#x4E8E;&#x540C;&#x4E00;&#x6E90;&#x7A0B;&#x5E8F;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x662F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#xFF0C;&#x4F46;&#x4E0E;&#x4E00;&#x822C;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x88AB;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6E90;&#x7A0B;&#x5E8F;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x8BBF;&#x95EE;&#x3002;&#xFF08;&#x9759;&#x6001;&#x51FD;&#x6570;&#x4E5F;&#x5177;&#x6709;&#x540C;&#x6837;&#x7684;&#x8BBF;&#x95EE;&#x9650;&#x5236;&#xFF09;</p>
<p>9&#x3001;&#x5BC4;&#x5B58;&#x5668;&#x53D8;&#x91CF;(register)&#xFF1A;&#x53EA;&#x6709;int/char/&#x6307;&#x9488;&#x578B;&#x7684;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x548C;&#x5F62;&#x53C2;&#x624D;&#x53EF;&#x4EE5;&#x662F;&#x5BC4;&#x5B58;&#x5668;&#x5B58;&#x50A8;&#x7C7B;&#x7684;&#x3002;&#x5C06;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x7C7B;&#x6307;&#x5B9A;&#x4E3A;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#xFF0C;&#x662F;&#x63D0;&#x9192;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x5341;&#x5206;&#x9891;&#x7E41;&#xFF0C;&#x5728;&#x4E3A;&#x8BE5;&#x53D8;&#x91CF;&#x5206;&#x914D;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x7684;&#x8BDD;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x4E3A;&#x5B83;&#x5206;&#x914D;&#x5BC4;&#x5B58;&#x5668;&#xFF0C;&#x56E0;&#x4E3A;&#x8BBF;&#x95EE;&#x5BC4;&#x5B58;&#x5668;&#x8981;&#x6BD4;&#x8BBF;&#x95EE;&#x5B58;&#x50A8;&#x5355;&#x5143;&#x6765;&#x5F97;&#x5FEB;&#x3002;&#x5C06;&#x4E00;&#x4E2A;&#x5F62;&#x53C2;&#x7684;&#x5B58;&#x50A8;&#x7C7B;&#x6307;&#x5B9A;&#x4E3A;&#x5BC4;&#x5B58;&#x5668;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x8981;&#x8BBF;&#x95EE;&#x67D0;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8BBE;&#x5907;&#x7684;&#x9A71;&#x52A8;&#x7A0B;&#x5E8F;&#x8981;&#x6C42;&#x4EE5;&#x5BC4;&#x5B58;&#x5668;&#x4E3A;&#x53C2;&#x6570;&#x4E0E;&#x7CFB;&#x7EDF;&#x4F20;&#x9012;&#x4FE1;&#x606F;&#x3002;</p>
<p>10&#x3001;&#x53EF;&#x4EE5;&#x7528;&#x201C;# undef &#x6807;&#x8BC6;&#x7B26;&#x201D; &#x547D;&#x4EE4;&#x7EC8;&#x6B62;&#x5B8F;&#x5B9A;&#x4E49;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x3002;</p>
<p>11&#x3001;&#x5E26;&#x53C2;&#x6570;&#x7684;&#x5B8F;&#xFF0C;&#x5B8F;&#x5C55;&#x5F00;&#x662F;&#x5C06;&#x7A0B;&#x5E8F;&#x4E2D;&#x5B8F;&#x540D;&#x540E;&#x7684;&#x5706;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x5B9E;&#x53C2;&#x4ECE;&#x5DE6;&#x5230;&#x53F3;&#x539F;&#x5C01;&#x4E0D;&#x52A8;&#x66FF;&#x4EE3;&#x5B8F;&#x9898;&#x4E2D;&#x7684;&#x5F62;&#x53C2;&#x3002;</p>
<p>&#x4F8B;&#xFF1A;#define PI 3.1415</p>
<h1 id="define_S(R)_=_PI_R_R">define S(R) = PI <em> R </em> R</h1><p>&#x5982;&#x679C;&#x8C03;&#x7528;S(10.0 + 10.0)&#xFF0C;&#x5219;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x5B9E;&#x9645;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A; 3.1415 <em> 10.0 + 10.0 </em> 10.0 + 10.0&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5185;&#x8054;&#x51FD;&#x6570;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<h4 id="&#x6307;&#x9488;&#x548C;&#x5F15;&#x7528;">&#x6307;&#x9488;&#x548C;&#x5F15;&#x7528;</h4><p>1&#x3001;&#x7528;&#x6307;&#x9488;&#x6216;&#x8005;&#x4E0B;&#x6807;&#x90FD;&#x80FD;&#x627E;&#x5230;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x3002;&#x7528;&#x4E0B;&#x6807;&#x6CD5;&#x6BD4;&#x8F83;&#x76F4;&#x89C2;&#xFF0C;&#x4F46;&#x662F;&#x5BFB;&#x627E;&#x6570;&#x7EC4;&#x5143;&#x7D20;&#x8D39;&#x65F6;&#x8F83;&#x591A;&#x3002;&#x7279;&#x522B;&#x662F;&#x5728;&#x5FAA;&#x73AF;&#x5F15;&#x7528;&#x6570;&#x7EC4;&#x4E2D;&#x7684;&#x5143;&#x7D20;&#x503C;&#x65F6;&#xFF0C;&#x7528;&#x6307;&#x9488;&#x6CD5;&#x5219;&#x4E0D;&#x5FC5;&#x6BCF;&#x6B21;&#x90FD;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x5730;&#x5740;&#x3002;</p>
<p>2&#x3001;&#x6307;&#x5411;&#x5E38;&#x91CF;&#x7684;&#x6307;&#x9488;&#xFF1A;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5E38;&#x91CF;&#x7684;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x3002;&#x4F8B;&#xFF1A;const char *name = &quot;fang&quot;; &#x63A5;&#x7740;&#x4E0D;&#x80FD;&#x7528;&#x4EE5;&#x4E0B;&#x7C7B;&#x4F3C;&#x8BED;&#x53E5;name[3] = &apos;a&apos;; &#x4F46;&#x662F;&#x7531;&#x4E8E;name&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5E38;&#x91CF;&#x7684;&#x666E;&#x901A;&#x6307;&#x9488;&#x53D8;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5E38;&#x6307;&#x9488;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x6539;&#x53D8;name&#x7684;&#x6307;&#x5411;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#x662F;&#x5141;&#x8BB8;&#x7684;name = &quot;pei&quot;&#x3002;</p>
<p>3&#x3001;&#x5E38;&#x6307;&#x9488;&#xFF1A;&#x5C06;&#x6307;&#x9488;&#x672C;&#x8EAB;&#x58F0;&#x660E;&#x4E3A;&#x5E38;&#x91CF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5C06;&#x5B83;&#x6307;&#x5411;&#x7684;&#x5BF9;&#x8C61;&#x751F;&#x547D;&#x4E3A;&#x5E38;&#x91CF;&#x3002;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5E38;&#x6307;&#x9488;&#x5C31;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4E0D;&#x80FD;&#x79FB;&#x52A8;&#x7684;&#x56FA;&#x5B9A;&#x6307;&#x9488;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x6240;&#x6307;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x6539;&#x53D8;&#x3002;&#x5728;&#x5B9A;&#x4E49;&#x6307;&#x9488;&#x5E38;&#x91CF;&#x65F6;&#x5FC5;&#x987B;&#x521D;&#x59CB;&#x5316;&#x3002;&#x4F8B;&#xFF1A;char * const name = &quot;fang&quot;; &#xA0;&#x5141;&#x8BB8;name[3] = &apos;n&apos;&#xFF0C;&#x4E0D;&#x5141;&#x8BB8;name = &quot;pei&quot;&#x3002;</p>
<p>4&#x3001;&#x6307;&#x5411;&#x5E38;&#x91CF;&#x7684;&#x5E38;&#x6307;&#x9488;&#xFF1A;&#x6307;&#x9488;&#x672C;&#x8EAB;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#xFF0C;&#x6307;&#x5411;&#x7684;&#x503C;&#x4E5F;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x3002;&#x4F8B;&#xFF1A;const char * const name = &quot;fang&quot;&#x3002;</p>
<p>5&#x3001;&#x5F15;&#x7528;&#xFF1A;&#x5F15;&#x7528;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x6216;&#x8005;&#x5E38;&#x91CF;&#x6807;&#x8BC6;&#x7B26;&#x8D77;&#x7684;&#x522B;&#x540D;&#x3002;int val; int &amp;rval =val; &#x5219;val&#x548C;rval&#x6307;&#x7684;&#x5C31;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x4E5F;&#x5B8C;&#x5168;&#x4E00;&#x6837;&#x3002;</p>
<p>6&#x3001;&#x5F53;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x770B;&#x5230;&quot;&amp;&quot;&#x65F6;&#xFF0C;&#x5C31;&#x4E0D;&#x4E3A;&#x5176;&#x540E;&#x9762;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x5B83;&#x6240;&#x5F15;&#x7528;&#x7684;&#x90A3;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;&#x6240;&#x5177;&#x6709;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x8D4B;&#x7ED9;&#x5B83;&#x3002;</p>
<p>7&#x3001;&#x5728;&#x58F0;&#x660E;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x540C;&#x65F6;&#x5BF9;&#x5B83;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5373;&#x5FC5;&#x987B;&#x5728;&#x58F0;&#x660E;&#x5F15;&#x7528;&#x65F6;&#x8BF4;&#x660E;&#x5B83;&#x6240;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x6240;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x5FC5;&#x987B;&#x662F;&#x5DF2;&#x7ECF;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x7684;&#x3002;&#xFF08;&#x51FD;&#x6570;&#x5F62;&#x53C2;&#x4E3A;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#xFF0C;&quot;&#x6CA1;&#x6709;&#x521D;&#x59CB;&#x5316;&quot;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x8C03;&#x7528;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x5B9E;&#x53C2;&#x8D4B;&#x7ED9;&#x4E86;&#x5F62;&#x53C2;&#xFF09;</p>
<p>8&#x3001;&#x4E0D;&#x80FD;&#x58F0;&#x660E;void&#x7C7B;&#x578B;&#x7684;&#x5F15;&#x7528;&#xFF08;&#x56E0;&#x4E3A;void&#x672C;&#x8EAB;&#x5C31;&#x8868;&#x793A;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;&#x5BF9;&#x5B83;&#x7684;&#x5F15;&#x7528;&#x4E5F;&#x5C31;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#xFF09;&#xFF1B;&#x4E0D;&#x80FD;&#x5BF9;&#x6570;&#x7EC4;&#x540D;&#x5F15;&#x7528;&#xFF08;&#x56E0;&#x4E3A;&#x6570;&#x7EC4;&#x540D;&#x8868;&#x793A;&#x7684;&#x8D77;&#x59CB;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#xFF09;&#xFF1B;&#x4E0D;&#x80FD;&#x5B9A;&#x4E49;&#x6307;&#x5411;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x7684;&#x6307;&#x9488;&#xFF08;&#x56E0;&#x4E3A;&#x5F15;&#x7528;&#x672C;&#x8EAB;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7B26;&#x53F7;&#xFF0C;&#x5B83;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF09;&#x3002;</p>
<p>9&#x3001;&#x5F53;&#x7528;const&#x6765;&#x9650;&#x5B9A;&#x5F15;&#x7528;&#x65F6;&#xFF0C;&#x8868;&#x793A;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x6539;&#x53D8;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x7684;&#x503C;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5BF9;&#x4E00;&#x4E2A;&#x5E38;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x5F15;&#x7528;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x5C06;&#x8FD9;&#x4E2A;&#x5F15;&#x7528;&#x5B9A;&#x4E49;&#x4E3A;const&#x7684;&#x3002;</p>
<p>10&#x3001;&#x5F15;&#x7528;&#x6700;&#x5927;&#x7684;&#x7528;&#x9014;&#x662F;&#x4F5C;&#x4E3A;&#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x6216;&#x8005;&#x8FD4;&#x56DE;&#x503C;&#x7C7B;&#x578B;&#xFF0C;&#x4ECE;&#x800C;&#x6269;&#x5145;&#x51FD;&#x6570;&#x4F20;&#x9012;&#x6570;&#x636E;&#x7684;&#x529F;&#x80FD;&#x3002;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF1A;&#x5F15;&#x7528;&#x53C2;&#x6570;&#x5BF9;&#x5E94;&#x7684;&#x5B9E;&#x53C2;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x5BF9;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5373;&#x5B9E;&#x53C2;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x5408;&#x6CD5;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x80FD;&#x591F;&#x5BF9;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x5F15;&#x7528;&#x3002;&#x5F15;&#x7528;&#x4F5C;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x901A;&#x5E38;&#x5728;&#x4E0B;&#x9762;&#x4E24;&#x4E2A;&#x573A;&#x5408;&#xFF1A;1)&#x51FD;&#x6570;&#x9700;&#x8981;&#x8FD4;&#x56DE;&#x591A;&#x4E2A;&#x503C;&#x7684;&#x573A;&#x5408;; 2) &#x51FD;&#x6570;&#x7684;&#x53C2;&#x6570;&#x662F;&#x7ED3;&#x6784;&#x6216;&#x8005;&#x7C7B;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x4E00;&#x822C;&#x4F1A;&#x5360;&#x7528;&#x8F83;&#x591A;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5982;&#x679C;&#x6309;&#x503C;&#x4F20;&#x9012;&#x5C06;&#x9700;&#x8981;&#x5206;&#x914D;&#x8F83;&#x591A;&#x7684;&#x6808;&#x7A7A;&#x95F4;&#x6765;&#x5B58;&#x653E;&#x5F62;&#x53C2;&#x7684;&#x503C;&#xFF0C;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x590D;&#x5236;&#x64CD;&#x4F5C;&#xFF0C;&#x4F1A;&#x6D88;&#x8017;&#x8F83;&#x591A;&#x7684;&#x7A7A;&#x95F4;&#x548C;&#x65F6;&#x95F4;&#x3002;&#xFF08;&#x5176;&#x5B9E;&#x8FD9;&#x4E24;&#x4E2A;&#x573A;&#x5408;&#x4F7F;&#x7528;&#x6307;&#x9488;&#x90FD;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x76F8;&#x540C;&#x7684;&#x6548;&#x679C;&#xFF09;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/C/">C++</a><a href="/tags/指针/">指针</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/03/e8e9c28/" title="2015-06学习总结——c++ -">
  <strong>上一篇：</strong><br/>
  <span>
  2015-06学习总结——c++ -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/03/e9038c1/"  title="GitHub 通告：整理了一个 C 和 C++ 开源库的清单（含示例代码） -">
 <strong>下一篇：</strong><br/> 
 <span>GitHub 通告：整理了一个 C 和 C++ 开源库的清单（含示例代码） -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-1"><a class="toc-link" href="#define_S(R)_=_PI_R_R"><span class="toc-number">1.</span> <span class="toc-text">define S(R) = PI  R  R</span></a><ol class="toc-child"><li class="toc-item toc-level-4"><a class="toc-link" href="#指针和引用"><span class="toc-number">1.0.0.1.</span> <span class="toc-text">指针和引用</span></a></li></ol></li></ol></li></ol></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>587</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>32</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>23</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>9</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
