
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>人脸识别：应用开启创新潮，算法进展才起步 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;&amp;#x5FAE;&amp;#x8F6F;&amp;#x4E9A;&amp;#x6D32;&amp;#x7814;&amp;#x7A76;&amp;#x9662;&amp;#x89C6;&amp;#x89C9;&amp;#x8BA1;&amp;#x7B97;&amp;#x7EC4;&amp;#x9996;&amp;#x5E2D;&amp;#x7814;&amp;#x7A76;&amp;#x5458;&amp;#x5B59;&amp;#x5251;
 &amp;#x8FD1;&amp;#x671F;&amp;#xFF0">
<meta property="og:type" content="article">
<meta property="og:title" content="人脸识别：应用开启创新潮，算法进展才起步 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/01/9ef6fa6/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;&amp;#x5FAE;&amp;#x8F6F;&amp;#x4E9A;&amp;#x6D32;&amp;#x7814;&amp;#x7A76;&amp;#x9662;&amp;#x89C6;&amp;#x89C9;&amp;#x8BA1;&amp;#x7B97;&amp;#x7EC4;&amp;#x9996;&amp;#x5E2D;&amp;#x7814;&amp;#x7A76;&amp;#x5458;&amp;#x5B59;&amp;#x5251;
 &amp;#x8FD1;&amp;#x671F;&amp;#xFF0">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/9ef39f0.jpg">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/9ef3c61.png">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/9ef3ed2.jpg">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/9ef4143.png">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/9ef4625.jpg">
<meta property="og:updated_time" content="2015-06-30T23:06:21.054Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="人脸识别：应用开启创新潮，算法进展才起步 -">
<meta name="twitter:description" content="&amp;#x4F5C;&amp;#x8005;&amp;#xFF1A;&amp;#x5FAE;&amp;#x8F6F;&amp;#x4E9A;&amp;#x6D32;&amp;#x7814;&amp;#x7A76;&amp;#x9662;&amp;#x89C6;&amp;#x89C9;&amp;#x8BA1;&amp;#x7B97;&amp;#x7EC4;&amp;#x9996;&amp;#x5E2D;&amp;#x7814;&amp;#x7A76;&amp;#x5458;&amp;#x5B59;&amp;#x5251;
 &amp;#x8FD1;&amp;#x671F;&amp;#xFF0">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/9ef6fa6/" title="人脸识别：应用开启创新潮，算法进展才起步 -" itemprop="url">人脸识别：应用开启创新潮，算法进展才起步 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:06:20.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			
		
		</div>
		
		<p><img src="http://taojinke.github.io/img/20150701/9ef39f0.jpg" alt="&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1A;&#x5E94;&#x7528;&#x5F00;&#x542F;&#x521B;&#x65B0;&#x6F6E;&#xFF0C;&#x7B97;&#x6CD5;&#x8FDB;&#x5C55;&#x624D;&#x8D77;&#x6B65;"></p>
<p>&#x4F5C;&#x8005;&#xFF1A;&#x5FAE;&#x8F6F;&#x4E9A;&#x6D32;&#x7814;&#x7A76;&#x9662;&#x89C6;&#x89C9;&#x8BA1;&#x7B97;&#x7EC4;&#x9996;&#x5E2D;&#x7814;&#x7A76;&#x5458;&#x5B59;&#x5251;</p>
<p> &#x8FD1;&#x671F;&#xFF0C;&#x5FAE;&#x8F6F;&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x6B3E;&#x6709;&#x8DA3;&#x7684;&#x5E94;&#x7528; &#x2014;&#x2014;&#x201C;  <a href="https://www.twinsornot.net/" target="_blank" rel="external">&#x5FAE;&#x8F6F;&#x6211;&#x4EEC;</a> &#x201D;&#xFF08; TwinsOrNot.net &#xFF09;&#xFF0C;&#x53EA;&#x9700;&#x4EFB;&#x610F;&#x4E0A;&#x4F20;&#x4E24;&#x5F20;&#x4EBA;&#x7269;&#x7167;&#x7247;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x957F;&#x7684;&#x6709;&#x591A;&#x50CF;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6D4B;&#x8BD5;&#x4F60;&#x662F;&#x5426;&#x548C;&#x67D0;&#x4E2A;&#x660E;&#x661F;&#x957F;&#x5F97;&#x5F88;&#x50CF;&#xFF0C;&#x6216;&#x8005;&#x592B;&#x59BB; / &#x7537;&#x5973;&#x670B;&#x53CB;&#x662F;&#x4E0D;&#x662F;&#x6709;&#x592B;&#x59BB;&#x76F8;&#x7B49;&#x3002;&#x4E0E;&#x524D;&#x4E00;&#x9635;&#x98CE;&#x9761;&#x5168;&#x7403;&#x7684; <a href="http://cn.how-old.net/" target="_blank" rel="external">How-Old.net</a> &#x76F8;&#x4F3C;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x5F88;&#x5DE7;&#x5999;&#x5730;&#x5C06;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4E0E;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4EBA;&#x9645;&#x4EA4;&#x5F80;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x867D;&#x7136;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x767E;&#x5206;&#x4E4B;&#x767E;&#x7CBE;&#x786E;&#xFF0C;&#x4F46;&#x9AD8;&#x79D1;&#x6280;&#x52A0;&#x8BD9;&#x8C10;&#x7684;&#x4EBA;&#x9645;&#x4EA4;&#x5F80;&#x548C;&#x4F20;&#x64AD;&#x6548;&#x679C;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x548C;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x53D1;&#x5C55;&#x5230;&#x4E00;&#x5B9A;&#x9636;&#x6BB5;&#x3001;&#x81EA;&#x7136;&#x800C;&#x7136;&#x7684;&#x5E94;&#x7528;&#x521B;&#x65B0;&#x3002;</p>
<p> <img src="http://taojinke.github.io/img/20150701/9ef3c61.png" alt="&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1A;&#x5E94;&#x7528;&#x5F00;&#x542F;&#x521B;&#x65B0;&#x6F6E;&#xFF0C;&#x7B97;&#x6CD5;&#x8FDB;&#x5C55;&#x624D;&#x8D77;&#x6B65;"></p>
<p> &#x5728;&#x53EF;&#x4EE5;&#x9884;&#x89C1;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x521B;&#x65B0;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x800C;&#x4E14;&#x5C06;&#x4E0D;&#x4EC5;&#x9650;&#x4E8E;&#x5A31;&#x4E50;&#x6216;&#x662F;&#x521B;&#x9020;&#x8336;&#x4F59;&#x996D;&#x540E;&#x7684;&#x8C08;&#x8D44;&#x3002;&#x5728;  Build 2015 &#x5F00;&#x53D1;&#x8005;&#x5927;&#x4F1A;&#x4E0A;&#xFF0C;&#x5FAE;&#x8F6F;&#x63A8;&#x51FA;&#x4E86;&#x57FA;&#x4E8E;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0; Azure &#x7684; <a href="https://cn.projectoxford.ai/" target="_blank" rel="external">&#x725B;&#x6D25;&#x8BA1;&#x5212;</a> &#xFF08; Project Oxford &#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x7CFB;&#x5217;&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x6280;&#x672F;&#x670D;&#x52A1;&#xFF0C;&#x9664;&#x4E86;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF0C;&#x8FD8;&#x6709;&#x8BED;&#x97F3;&#x5904;&#x7406;&#x3001;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x548C;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x7B49;&#x667A;&#x80FD;&#x670D;&#x52A1;&#xFF0C;&#x8D4B;&#x4E88;&#x5F00;&#x53D1;&#x8005;&#x5F00;&#x53D1;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E94;&#x7528;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6BCF;&#x4E2A;&#x5F00;&#x53D1;&#x8005;&#x90FD;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E9B;&#x6C47;&#x805A;&#x5FAE;&#x8F6F;&#x7814;&#x7A76;&#x9662;&#x591A;&#x5E74;&#x7814;&#x7A76;&#x6210;&#x679C;&#x7684; API &#x8BBE;&#x8BA1;&#x3001;&#x5F00;&#x53D1;&#x81EA;&#x5DF1;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x6210;&#x4E3A;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#x6216;&#x8005;&#x638C;&#x63E1;&#x76F8;&#x5173;&#x57FA;&#x7840;&#x6280;&#x672F;&#x3002;&#x57FA;&#x4E8E;&#x725B;&#x6D25;&#x8BA1;&#x5212;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B; API &#xFF0C;&#x5FAE;&#x8F6F;&#x5DE5;&#x7A0B;&#x5E08;&#x4EC5;&#x7528;&#x4E86;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5C31;&#x5F00;&#x53D1;&#x51FA;&#x524D;&#x6587;&#x63D0;&#x5230;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x6700;&#x521D;&#x7684;&#x6F14;&#x793A;&#x7248;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/9ef3ed2.jpg" alt="&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1A;&#x5E94;&#x7528;&#x5F00;&#x542F;&#x521B;&#x65B0;&#x6F6E;&#xFF0C;&#x7B97;&#x6CD5;&#x8FDB;&#x5C55;&#x624D;&#x8D77;&#x6B65;"></p>
<p> &#x5F00;&#x53D1;&#x8005;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x725B;&#x6D25;&#x8BA1;&#x5212;&#x7684;  API &#x5B9E;&#x73B0;&#x5F88;&#x591A;&#x6709;&#x8DA3;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x800C;&#x4F5C;&#x4E3A;&#x63D0;&#x4F9B;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7684;&#x4E2D;&#x56FD;&#x7814;&#x7A76;&#x56E2;&#x961F;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x505A;&#x7684;&#x9664;&#x4E86;&#x6839;&#x636E;&#x7528;&#x6237;&#x53CD;&#x9988;&#x5FEB;&#x901F;&#x8FED;&#x4EE3;&#x7CBE;&#x8FDB; API &#xFF0C;&#x66F4;&#x8981;&#x4ECE;&#x7814;&#x7A76;&#x672C;&#x6E90;&#x4E0A;&#x4E0D;&#x65AD;&#x4F18;&#x5316;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x5927;&#x91CF;&#x201D;&#x9605;&#x8BFB;&#x201C;&#x7167;&#x7247;&#x5B66;&#x4E60;&#x8FA8;&#x8BC6;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6210;&#x4E3B;&#x6D41;&#x8BC6;&#x522B;&#x65B9;&#x5F0F;</p>
<p> &#x5FAE;&#x8F6F;&#x4E9A;&#x6D32;&#x7814;&#x7A76;&#x9662;&#x5728;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x9886;&#x57DF;&#x5DF2;&#x7ECF;&#x8015;&#x8018;&#x4E86;&#x8FD1;  20 &#x5E74;&#x65F6;&#x95F4;&#xFF0C;&#x4ECE;&#x6700;&#x65E9;&#x7684;&#x5B50;&#x7A7A;&#x95F4;&#x65B9;&#x6CD5;&#xFF0C;&#x5230;&#x540E;&#x6765;&#x7684;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x5B50;&#x65B9;&#x6CD5;&#xFF0C;&#x518D;&#x5230;&#x73B0;&#x5728;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5386;&#x7ECF;&#x4E86;&#x6240;&#x6709;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x7684;&#x4E3B;&#x6D41;&#x7814;&#x7A76;&#x65B9;&#x6CD5;&#x3002;</p>
<p> &#x5728;  20 &#x4E16;&#x7EAA; 80 &#x3001; 90 &#x5E74;&#x4EE3;&#xFF0C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x8BEF;&#x5DEE;&#x8FD8;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x4E5F;&#x5F88;&#x6709;&#x9650;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x68C0;&#x67E5;&#x8BC1;&#x4EF6;&#x7167;&#x7B49;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x624D;&#x4F1A;&#x4F7F;&#x7528;&#x3002;&#x5F53;&#x65F6;&#x7684;&#x6280;&#x672F;&#x9887;&#x4E3A;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5C06;&#x56FE;&#x50CF;&#x7ECF;&#x7B80;&#x5355;&#x7684;&#x9884;&#x5904;&#x7406;&#x540E;&#x7EBF;&#x6027;&#x5730;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x9AD8;&#x7EF4;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x4E2D;&#x3002;&#x7531;&#x4E8E;&#x53EA;&#x662F;&#x7EBF;&#x6027;&#x6A21;&#x578B;&#x80FD;&#x529B;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x90A3;&#x65F6;&#x7684;&#x8BC6;&#x522B;&#x51C6;&#x786E;&#x7387;&#x4E0E;&#x4ECA;&#x5929;&#x76F8;&#x6BD4;&#x5927;&#x6982;&#x662F;&#x6570; 10 &#x500D;&#x7684;&#x5DEE;&#x8DDD;&#x3002;</p>
<p> &#x5728;  2000 &#x5E74;&#xFF5E; 2010 &#x5E74;&#xFF0C;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x5B50;&#x65B9;&#x6CD5;&#x6210;&#x4E3A;&#x7814;&#x7A76;&#x4E3B;&#x6D41;&#x3002;&#x5B83;&#x5728;&#x4EBA;&#x8138;&#x7684;&#x5C40;&#x90E8;&#x533A;&#x57DF;&#xFF08;&#x5982;&#x7709;&#x3001;&#x773C;&#x3001;&#x9F3B;&#x3001;&#x5634;&#x7B49;&#xFF09;&#x62BD;&#x53D6;&#x5C40;&#x90E8;&#x63CF;&#x8FF0;&#x5B50;&#xFF0C;&#x518D;&#x7EBF;&#x6027;&#x6216;&#x975E;&#x7EBF;&#x6027;&#x5730;&#x6620;&#x5C04;&#x5230;&#x9AD8;&#x7EF4;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x4E2D;&#x53BB;&#x3002;&#x8FD9;&#x7C7B;&#x65B9;&#x6CD5;&#x7684;&#x8BC6;&#x522B;&#x51C6;&#x786E;&#x7387;&#x8F83;&#x4E0A;&#x4E00;&#x9636;&#x6BB5;&#x7684;&#x5B50;&#x7A7A;&#x95F4;&#x65B9;&#x6CD5;&#x6709;&#x5F88;&#x5927;&#x63D0;&#x5347;&#x3002;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x7279;&#x5F81;&#x548C;&#x6A21;&#x578B;&#x59CB;&#x7EC8;&#x662F;&#x4EBA;&#x5DE5;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#x4E00;&#x5B9A;&#x7684;&#x5C40;&#x9650;&#x6027;&#x3002;</p>
<p> &#x4ECE;  2012 &#x5E74;&#x81F3;&#x4ECA;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5728;&#x5B66;&#x672F;&#x754C;&#x88AB;&#x8FC5;&#x901F;&#x5730;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;&#x901A;&#x8FC7;&#x6DF1;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x8BC6;&#x522B;&#x7CBE;&#x5EA6;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x5DF2;&#x7ECF;&#x5728;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x4E2D;&#x9884;&#x8BBE;&#x4E86;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5148;&#x9A8C;&#x77E5;&#x8BC6;&#x7684;&#x795E;    &#x7ECF;&#x7F51;&#x7EDC;&#x5927;&#x91CF;&#x201C;&#x9605;&#x8BFB;&#x201D;&#x5F88;&#x591A;&#x4EBA;&#x5728;&#x5404;&#x79CD;&#x73AF;&#x5883;&#xFF08;&#x4F8B;&#x5982;&#x5149;&#x7167;&#xFF0C;&#x89C6;&#x89D2;&#xFF0C;&#x8868;&#x60C5;&#xFF09;&#x4E0B;&#x62CD;&#x6444;&#x5230;&#x7684;&#x4E0D;&#x540C;&#x4EBA;&#x8138;&#x7167;&#x7247;&#xFF0C;&#x81EA;&#x52A8;&#x5B66;&#x4E60;&#x5E76;&#x63D0;&#x53D6;&#x4EBA;&#x8138;&#x5404;&#x4E2A;&#x90E8;&#x4F4D;&#x548C;&#x5C3A;&#x5EA6;&#x7684;&#x4F4E;&#xFF0C;&#x4E2D;&#xFF0C;&#x9AD8;&#x5C42;&#x7279;&#x5F81;&#x3002;&#x5728;&#x5927;&#x91CF;&#x5B66;&#x4E60;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4FBF;&#x80FD;&#x6839;&#x636E;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x76D1;&#x7763;&#x4FE1;&#x606F;&#x5C06;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x5206;&#x5F00;&#x3002;</p>
<p> &#x968F;&#x7740;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x5EC9;&#x4EF7;&#x7684;  PC+GPU &#x7684;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E0A;&#x5343;&#x4E2A;&#x5E76;&#x884C;&#x7684;&#x8BA1;&#x7B97;&#x5355;&#x5143;&#xFF0C;&#x8FD9;&#x8BA9;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E00;&#x4E0B;&#x5B50;&#x5728;&#x591A;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x5F02;&#x519B;&#x7A81;&#x8D77;&#xFF0C;&#x6210;&#x5C31;&#x4E86;&#x76F8;&#x5F53;&#x591A;&#x5168;&#x65B0;&#x7684;&#x7814;&#x7A76;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7684;&#x57FA;&#x7840;&#x73AF;&#x8282;</p>
<p>How-Old.net &#x548C;&#x201C;&#x5FAE;&#x8F6F;&#x6211;&#x4EEC;&#x201D;&#x4E3B;&#x8981;&#x662F;&#x5BF9;&#x9759;&#x6001;&#x7684;&#x4EBA;&#x8138;&#x7167;&#x7247;&#x8FDB;&#x884C;&#x8BC6;&#x522B;&#xFF0C;&#x8FD9;&#x53EA;&#x4F7F;&#x7528;&#x4E86;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x4E2D;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x3002;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x542B;&#x6709;&#x4EBA;&#x8138;&#x7684;&#x56FE;&#x7247;&#x6216;&#x89C6;&#x9891;&#x6D41;&#x4E2D;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#x548C;&#x8DDF;&#x8E2A;&#x4EBA;&#x8138;&#xFF0C;&#x8FDB;&#x800C;&#x8FBE;&#x5230;&#x8BC6;&#x522B;&#x76EE;&#x7684;&#xFF0C;&#x901A;&#x5E38;&#x4E5F;&#x53EB;&#x505A;&#x4EBA;&#x50CF;&#x8BC6;&#x522B;&#x3001;&#x9762;&#x90E8;&#x8BC6;&#x522B;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x5206;&#x4E3A;&#x4EE5;&#x4E0B;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;</p>
<p><strong>&#x9996;&#x5148;&#xFF0C;&#x68C0;&#x6D4B;&#x4EBA;&#x8138;&#x5728;&#x54EA;&#x91CC;&#x3002;</strong> &#x9996;&#x5148;&#x8981;&#x4ECE;&#x7167;&#x7247;&#x4E2D;&#x8BC6;&#x522B;&#x51FA;&#x4EBA;&#x8138;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x3001;&#x4F4D;&#x7F6E;&#x7B49;&#x3002;&#x76EE;&#x524D;&#x5E38;&#x7528;&#x7684;&#x662F;&#x7EA7;&#x8054;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x4EBA;&#x5DE5;&#x8BBE;&#x8BA1;&#x7684;&#x7279;&#x5F81;&#x6A21;&#x578B;&#x6216;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x4E00;&#x7EA7;&#x4E00;&#x7EA7;&#x7684;&#x7B5B;&#x9009;&#x3002;&#x82E5;&#x8981;&#x52A0;&#x5FEB;&#x901F;&#x5EA6;&#xFF0C;&#x53EF;&#x5728;&#x524D;&#x671F;&#x4F7F;&#x7528;&#x4EBA;&#x5DE5;&#x8BBE;&#x8BA1;&#x7684;&#x7279;&#x5F81;&#x6A21;&#x578B;&#xFF0C;&#x5FEB;&#x901F;&#x7B5B;&#x53BB;&#x4E0D;&#x662F;&#x4EBA;&#x8138;&#x7684;&#x90E8;&#x4F4D;&#xFF0C;&#x540E;&#x671F;&#x5229;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53BB;&#x7CBE;&#x7EC6;&#x5316;&#x5730;&#x5224;&#x65AD;&#x6BCF;&#x4E00;&#x4E2A;&#x7559;&#x4E0B;&#x7684;&#x90E8;&#x4F4D;&#x662F;&#x5426;&#x662F;&#x4EBA;&#x8138;&#x3002;</p>
<p><strong>&#x5176;&#x6B21;&#xFF0C;&#x5B9A;&#x4F4D;&#x4EBA;&#x8138;&#x548C;&#x5404;&#x4E2A;&#x90E8;&#x4F4D;&#x3002;</strong> &#x5728;&#x7ED9;&#x5B9A;&#x4EBA;&#x8138;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x786E;&#x5B9A;&#x51FA;&#x9F3B;&#x5B50;&#x3001;&#x773C;&#x775B;&#x3001;&#x5634;&#x5DF4;&#x7B49;&#xFF0C;&#x8FD9;&#x901A;&#x5E38;&#x91C7;&#x7528;&#x56DE;&#x5F52;&#x9884;&#x6D4B;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x56DE;&#x5F52;&#x5668;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x79CD;&#xFF0C;&#x968F;&#x673A;&#x68EE;&#x6797;&#x65B9;&#x6CD5;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x90FD;&#x80FD;&#x5B9E;&#x73B0;&#x3002;&#x4EE5;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E3A;&#x4F8B;&#xFF0C;&#x8BAD;&#x7EC3;&#x7684;&#x65F6;&#x5019;&#x544A;&#x8BC9;&#x56DE;&#x5F52;&#x5668;&#x5230;&#x5E95;&#x773C;&#x775B;&#x5728;&#x54EA;&#x91CC;&#x3001;&#x9F3B;&#x5C16;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x9884;&#x6D4B;&#x503C;&#x548C;&#x771F;&#x5B9E;&#x503C;&#x7684;&#x8DDD;&#x79BB;&#x8D8A;&#x5C0F;&#x8D8A;&#x597D;&#xFF0C;&#x5E76;&#x636E;&#x6B64;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x56DE;&#x5F52;&#x5668;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x7528;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x4EBA;&#x8138;&#x7167;&#x7247;&#x53CD;&#x590D;&#x8BAD;&#x7EC3;&#xFF0C;&#x76F4;&#x5230;&#x56DE;&#x5F52;&#x5668;&#x80FD;&#x591F;&#x51C6;&#x786E;&#x8F93;&#x51FA;&#x4EBA;&#x8138;&#x5404;&#x4E2A;&#x5668;&#x5B98;&#x7684;&#x51C6;&#x786E;&#x4F4D;&#x7F6E;&#x4FE1;&#x606F;&#x3002; </p>
<p><strong>&#x7B2C;&#x4E09;&#xFF0C;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x7684;&#x5339;&#x914D;&#x4E0E;&#x8BC6;&#x522B;&#x3002;</strong> &#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x5C06;&#x5F85;&#x8BC6;&#x522B;&#x7684;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x4E0E;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x7684;&#x4EBA;&#x8138;&#x7279;&#x5F81;&#x6A21;&#x677F;&#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#xFF0C;&#x6839;&#x636E;&#x8BE6;&#x7EC6;&#x7A0B;&#x5EA6;&#x5BF9;&#x4EBA;&#x8138;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x7B80;&#x5316;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x7684;&#x7279;&#x5F81;&#x5339;&#x914D;&#x90FD;&#x662F;&#x7531;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x81EA;&#x52A8;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x76EE;&#x524D;&#x6700;&#x6709;&#x6548;&#x7684;&#x8BC6;&#x522B;&#x65B9;&#x6CD5;&#x3002;</p>
<p><strong>&#x6700;&#x540E;&#xFF0C;&#x4EBA;&#x8138;&#x5C5E;&#x6027;&#x7684;&#x8BC6;&#x522B;&#x3002;</strong> &#x7528;&#x6237;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x4EBA;&#x8138;&#x5C5E;&#x6027;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x5F88;&#x591A;&#xFF0C;&#x6BD4;&#x5982;&#x5E74;&#x9F84;&#xFF08;&#x4F7F;&#x7528;&#x5728;  <a href="http://cn.how-old.net/" target="_blank" rel="external">How-Old.net</a> &#x4E2D;&#xFF09;&#xFF0C;&#x6027;&#x522B;&#xFF0C;&#x8868;&#x60C5;&#xFF0C;&#x79CD;&#x65CF;&#xFF0C;&#x53D1;&#x578B;&#xFF0C;&#x662F;&#x5426;&#x6234;&#x773C;&#x955C;&#xFF0C;&#x80E1;&#x5B50;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x8FD9;&#x7C7B;&#x5C5E;&#x6027;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x53EF;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x6216;&#x56DE;&#x5F52;&#x3002;</p>
<p>&#x9AD8;&#x8BC6;&#x522B;&#x7387;&#x4E0E;&#x7528;&#x6237;&#x4F53;&#x9A8C;</p>
<p>&#x867D;&#x7136;&#x7ECF;&#x5E38;&#x542C;&#x8BF4;&#x6709;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x7684;&#x51C6;&#x786E;&#x7387;&#x5728;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8BC4;&#x6D4B;&#x6570;&#x636E;&#x5E93;&#x4E0A;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4EBA;&#x7C7B;&#x7684;&#x8BC6;&#x522B;&#x7387;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x573A;&#x666F;&#x4E2D;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x653E;&#x4E4B;&#x56DB;&#x6D77;&#x7684;&#x57FA;&#x51C6;&#x53EF;&#x4EE5;&#x53BB;&#x8861;&#x91CF;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x7684;&#x51C6;&#x786E;&#x7387;&#x3002;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x548C;&#x7B97;&#x6CD5;&#x5171;&#x540C;&#x51B3;&#x5B9A;&#x4E86;&#x8BC6;&#x522B;&#x7387;&#x548C;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<p> &#x9519;&#x8BEF;&#x63A5;&#x53D7;&#x7387;&#x662F;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x6307;&#x6807;&#xFF0C;&#x901A;&#x5E38;&#x9519;&#x8BEF;&#x63A5;&#x53D7;&#x7387;&#x8D8A;&#x4F4E;&#x8D8A;&#x597D;&#x3002;&#x4E0D;&#x80FD;&#x9519;&#x653E;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x8FDB;&#x53BB;&#xFF0C;&#x4E25;&#x683C;&#x786E;&#x4FDD;&#x5B89;&#x5168;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4E5F;&#x53EF;&#x80FD;&#x610F;&#x5473;&#x7740;&#x771F;&#x6B63;&#x7684;&#x7528;&#x6237;&#x5728;&#x591A;&#x6B21;&#x5C1D;&#x8BD5;&#x5237;&#x8138;&#x4E4B;&#x540E;&#x4E5F;&#x8FDB;&#x4E0D;&#x53BB;&#xFF0C;&#x8FD9;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x6700;&#x7EC8;&#x7684;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;&#x6240;&#x4EE5;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#xFF0C;&#x5B89;&#x5168;&#x4E0E;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x7684;&#x8C28;&#x614E;&#x5E73;&#x8861;&#x662F;&#x5FC5;&#x987B;&#x8981;&#x8003;&#x8651;&#x7684;&#x91CD;&#x8981;&#x56E0;&#x7D20;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x7684;&#x5DE8;&#x5927;&#x8FDB;&#x6B65;&#x65F6;&#xFF0C;&#x4ECD;&#x9700;&#x8981;&#x5BA2;&#x89C2;&#x3001;&#x4E25;&#x8C28;&#x5730;&#x5BF9;&#x5F85;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x672C;&#x8EAB;&#xFF0C;&#x65F6;&#x523B;&#x63D0;&#x9192;&#x81EA;&#x5DF1;&#xFF0C;&#x5B83;&#x7684;&#x5C40;&#x9650;&#x6027;&#x72B9;&#x5B58;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4E0D;&#x65AD;&#x5BFB;&#x6C42;&#x66F4;&#x591A;&#x3001;&#x66F4;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#x53BB;&#x63D0;&#x5347;&#x5B83;  &#x3002;</p>
<p>&#x7ED3;&#x675F;&#x8BED;</p>
<p>&#x79D1;&#x5B66;&#x7814;&#x7A76;&#x7684;&#x6BCF;&#x4E00;&#x6B21;&#x8FDB;&#x6B65;&#xFF0C;&#x90FD;&#x4F1A;&#x50AC;&#x751F;&#x591A;&#x79CD;&#x591A;&#x6837;&#x7684;&#x521B;&#x65B0;&#x5E94;&#x7528;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3001;&#x793E;&#x4EA4;&#x7F51;&#x7EDC;&#x3001;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5174;&#x8D77;&#x76F8;&#x4E92;&#x4EA4;&#x53C9;&#xFF0C;&#x52A0;&#x4E4B;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7814;&#x7A76;&#x591A;&#x5E74;&#x7684;&#x79EF;&#x7D2F;&#xFF0C;&#x5F00;&#x542F;&#x4E86;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x5E94;&#x7528;&#x7684;&#x521B;&#x65B0;&#x6F6E;&#xFF0C;&#x5B83;&#x4EEC;&#x6216;&#x6709;&#x8DA3;&#x3001;&#x6216;&#x5B9E;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x4E00;&#x5B9A;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;&#x6216;&#x8BB8;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x672A;&#x6765;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5C31;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x4EBA;&#x7C7B;&#x7684;&#x8868;&#x60C5;&#x548C;&#x80A2;&#x4F53;&#x8BED;&#x8A00;&#x4F53;&#x4F1A;&#x4EBA;&#x7C7B;&#x7684;&#x559C;&#x6012;&#x54C0;&#x4E50;&#x3002;</p>
<p>&#x76F8;&#x5173;&#x9605;&#x8BFB;</p>
<p> <a href="http://blog.sina.com.cn/s/blog_4caedc7a0102vqdl.html" target="_blank" rel="external">&#x4F60;&#x7684;&#x5206;&#x8EAB;&#x662F;&#x8C01;&#xFF1F;&#x2014;&#x2014; # &#x5FAE;&#x8F6F;&#x6211;&#x4EEC; # &#x544A;&#x8BC9;&#x4F60;</a></p>
<p><a href="http://blog.sina.com.cn/s/blog_4caedc7a0102vnup.html" target="_blank" rel="external">&#x5FAE;&#x8F6F; Project&#xA0;Oxford &#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x521B;&#x5EFA;&#x66F4;&#x667A;&#x80FD;&#x7684;&#x5E94;&#x7528;</a></p>
<p><img src="http://taojinke.github.io/img/20150701/9ef4143.png" alt="&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1A;&#x5E94;&#x7528;&#x5F00;&#x542F;&#x521B;&#x65B0;&#x6F6E;&#xFF0C;&#x7B97;&#x6CD5;&#x8FDB;&#x5C55;&#x624D;&#x8D77;&#x6B65;"></p>
<p>&#x6B22;&#x8FCE;&#x5173;&#x6CE8;</p>
<p> &#x5FAE;&#x8F6F;&#x4E9A;&#x6D32;&#x7814;&#x7A76;&#x9662;&#x5B98;&#x65B9;&#x7F51;&#x7AD9;&#xFF1A; <a href="http://www.msra.cn/" target="_blank" rel="external">http://www.msra.cn</a></p>
<p> &#x5FAE;&#x8F6F;&#x4E9A;&#x6D32;&#x7814;&#x7A76;&#x9662;&#x4EBA;&#x4EBA;&#x7F51;&#x4E3B;&#x9875;&#xFF1A; <a href="http://page.renren.com/600674137" target="_blank" rel="external">http://page.renren.com/600674137</a></p>
<p> &#x5FAE;&#x8F6F;&#x4E9A;&#x6D32;&#x7814;&#x7A76;&#x9662;&#x5FAE;&#x535A;&#xFF1A; <a href="http://t.sina.com.cn/msra" target="_blank" rel="external">http://t.sina.com.cn/msra</a></p>
<p> &#x5FAE;&#x8F6F;&#x4E9A;&#x6D32;&#x7814;&#x7A76;&#x9662;&#x5FAE;&#x4FE1;&#xFF1A;&#x641C;&#x7D22;&#x201C;&#x5FAE;&#x8F6F;&#x7814;&#x7A76;&#x9662;&#x201C;&#x6216;&#x626B;&#x63CF;&#x4E0B;&#x65B9;&#x4E8C;&#x7EF4;&#x7801;  :</p>
<p><img src="http://taojinke.github.io/img/20150701/9ef4625.jpg" alt="&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#xFF1A;&#x5E94;&#x7528;&#x5F00;&#x542F;&#x521B;&#x65B0;&#x6F6E;&#xFF0C;&#x7B97;&#x6CD5;&#x8FDB;&#x5C55;&#x624D;&#x8D77;&#x6B65;"></p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/人脸识别/">人脸识别</a><a href="/tags/算法/">算法</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/01/9ee56e3/" title="ES6 的功能侦测库 ES-Checker -">
  <strong>上一篇：</strong><br/>
  <span>
  ES6 的功能侦测库 ES-Checker -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/01/9ef8a81/"  title="Android开发周报：Android Studio取代Eclipse，MVP架构解析 -">
 <strong>下一篇：</strong><br/> 
 <span>Android开发周报：Android Studio取代Eclipse，MVP架构解析 -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>68</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/IT/" title="IT">IT<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/算法/" title="算法">算法<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Debian/" title="Debian">Debian<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/WildFly/" title="WildFly">WildFly<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/ETL/" title="ETL">ETL<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/iOS开发/" title="iOS开发">iOS开发<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/Twitter/" title="Twitter">Twitter<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/ECMAScript/" title="ECMAScript">ECMAScript<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/前端开发/" title="前端开发">前端开发<sup>2</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
