
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>IT 工程师文化碎碎念 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x5728;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#xFF0C;&amp;#x9119;&amp;#x4EBA;&amp;#x5C06;&amp;#x7ED9;&amp;#x5927;&amp;#x5BB6;&amp;#x5206;&amp;#x4EAB;&amp;#x4E0B;&amp;#x6211;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5BF9;&amp;#x4E8E;IT&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x4E8">
<meta property="og:type" content="article">
<meta property="og:title" content="IT 工程师文化碎碎念 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/03/232e244/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x5728;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#xFF0C;&amp;#x9119;&amp;#x4EBA;&amp;#x5C06;&amp;#x7ED9;&amp;#x5927;&amp;#x5BB6;&amp;#x5206;&amp;#x4EAB;&amp;#x4E0B;&amp;#x6211;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5BF9;&amp;#x4E8E;IT&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x4E8">
<meta property="og:updated_time" content="2015-07-03T14:09:36.948Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="IT 工程师文化碎碎念 -">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x8FD9;&amp;#x7BC7;&amp;#x6587;&amp;#x7AE0;&amp;#x91CC;&amp;#xFF0C;&amp;#x9119;&amp;#x4EBA;&amp;#x5C06;&amp;#x7ED9;&amp;#x5927;&amp;#x5BB6;&amp;#x5206;&amp;#x4EAB;&amp;#x4E0B;&amp;#x6211;&amp;#x4E2A;&amp;#x4EBA;&amp;#x5BF9;&amp;#x4E8E;IT&amp;#x5DE5;&amp;#x7A0B;&amp;#x5E08;&amp;#x4E8">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
                        <a href="http://nodejs-xx.sblig.club/" target="_blank">NodeJs</a>
                    </li>
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/03/232e244/" title="IT 工程师文化碎碎念 -" itemprop="url">IT 工程师文化碎碎念 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-03T02:09:36.000Z" itemprop="datePublished"> 发表于 2015-07-03</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#项目_+_任务驱动制"><span class="toc-number">1.</span> <span class="toc-text">项目 + 任务驱动制</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#总结和回顾"><span class="toc-number">2.</span> <span class="toc-text">总结和回顾</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#积极了解行业变化"><span class="toc-number">3.</span> <span class="toc-text">积极了解行业变化</span></a></li></ol>
		
		</div>
		
		<p>&#x5728;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x91CC;&#xFF0C;&#x9119;&#x4EBA;&#x5C06;&#x7ED9;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E0B;&#x6211;&#x4E2A;&#x4EBA;&#x5BF9;&#x4E8E;IT&#x5DE5;&#x7A0B;&#x5E08;&#x4E8B;&#x52A1;&#x89C4;&#x5212;&#x4E0A;&#x7684;&#x4E00;&#x4E9B;&#x4F53;&#x609F;&#x611F;&#x53D7;&#xFF0C;&#x6B22;&#x8FCE;&#x62CD;&#x7816;&#x3002;</p>
<h4 id="&#x9879;&#x76EE;_+_&#x4EFB;&#x52A1;&#x9A71;&#x52A8;&#x5236;">&#x9879;&#x76EE; + &#x4EFB;&#x52A1;&#x9A71;&#x52A8;&#x5236;</h4><p>&#x4EE5;&#x8FD0;&#x7EF4;&#xFF08;&#x5F00;&#x53D1;&#xFF09;&#x4EBA;&#x5458;&#x7684;&#x89C6;&#x89D2;&#x6765;&#x770B;&#xFF0C;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x4E0A;&#x7684;&#x4E8B;&#x52A1;&#x53EF;&#x4EE5;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x5927;&#x7C7B;&#xFF1A;Project &amp; Ticket.</p>
<p>&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x9879;&#x76EE;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x8BA1;&#x5212;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x96C6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x662F;&#x7C7B;&#x4F3C;&#x722C;&#x866B;&#x5E94;&#x7528;&#x8FD9;&#x6837;&#x7684;&#x7814;&#x53D1;&#x9879;&#x76EE;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x50CF;Memcached&#x8FD0;&#x7EF4;&#x8FD9;&#x6837;&#x7684;&#x8FD0;&#x7EF4;&#x9879;&#x76EE;&#x3002;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x610F;&#x5473;&#x7740;&#x5F88;&#x591A;&#x7684;&#x65E5;&#x5E38;&#x4E8B;&#x52A1;&#xFF0C;&#x4E5F;&#x662F;&#x65E5;&#x5E38;&#x5DE5;&#x4F5C;&#x4E2D;&#x6700;&#x82B1;&#x65F6;&#x95F4;&#x7684;&#x3002;</p>
<p>&#x5DE5;&#x5355;&#xFF08;&#x53EF;&#x4EE5;&#x662F;&#x903B;&#x8F91;&#x62BD;&#x8C61;&#x5C42;&#x9762;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x7528;&#x6237;&#x7684;&#x4E00;&#x4E2A;&#x9700;&#x6C42;&#xFF09;&#x5219;&#x662F;&#x4E00;&#x4E9B;&#x6765;&#x81EA;&#x5404;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x6211;&#x4EEC;&#x652F;&#x6301;&#x7684;&#x9879;&#x76EE;&#x96C6;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x4ED6;&#x4EEC;&#x7684;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x4E14;&#x76F8;&#x5E94;&#x7684;&#x8BC4;&#x4F30; &amp; &#x8DDF;&#x8FDB;&#x3002;</p>
<p>&#x9664;&#x6B64;&#x4E4B;&#x5916;&#xFF0C;&#x6211;&#x5B9E;&#x5728;&#x60F3;&#x4E0D;&#x5230;&#x66F4;&#x591A;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x4E86; :)</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5DE5;&#x4F5C;&#x4E0A;&#x7684;&#x4E8B;&#x60C5;&#x4E5F;&#x8BB8;&#x4F1A;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<ul>
<li>&#x722C;&#x866B;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#xFF1B;</li>
<li>&#x722C;&#x866B;&#x9879;&#x76EE;&#x8FD0;&#x7EF4;&#xFF1B;</li>
<li>Memcached &#x8C03;&#x4F18;&#xFF1B;</li>
<li>&#x8001;&#x5927;&#x8981;&#x6C42;&#x6536;&#x96C6;&#x6240;&#x6709;&#x673A;&#x5668;&#x7684;&#x67D0;&#x4E9B;&#x53C2;&#x6570;&#x6307;&#x6807;&#x6C47;&#x603B;&#x6210;&#x62A5;&#x8868;&#x7ED9;&#x4ED6;&#x770B;&#x4E00;&#x4E0B;&#x3002;</li>
</ul>
<p>&#x90A3;&#x4E48;&#xFF0C;Project + Ticket&#x80FD;&#x5426;&#x518D;&#x7EC6;&#x5316;&#x62BD;&#x8C61;&#x4E00;&#x4E0B;&#x5462;? &#x6211;&#x60F3;&#xFF0C;&#x5B83;&#x5F53;&#x7136;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x9879;&#x76EE;&#x548C;&#x5DE5;&#x5355;&#x7684;&#x6240;&#x8C13;&#x201C;&#x9700;&#x6C42;&#x201D;&#xFF0C;&#x6BD4;&#x5982;&#x67D0;&#x5E94;&#x7528;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x67D0;&#x4E9B;&#x529F;&#x80FD;&#x3001;&#x8FD0;&#x7EF4;&#x624B;&#x4E0A;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#x7684;&#x6539;&#x9020;&#x8C03;&#x4F18;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7528;&#x6237;&#x7684;&#x7279;&#x6B8A;&#x9700;&#x6C42;&#xFF08;&#x5373;&#x4E2A;&#x6027;&#x5316;&#x7684;ticket&#xFF09;&#x7EDF;&#x4E00;&#x62BD;&#x8C61;&#x6210;&#x201C;&#x4EFB;&#x52A1;&#x201D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5F88;&#x660E;&#x4E86;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4E8B;&#x60C5;&#x7684;&#x89C4;&#x5212;&#x6700;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x53D8;&#x6210;&#x8FD9;&#x6837;&#xFF1A;</p>
<ul>
<li>&#xFF08;&#x722C;&#x866B;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#xFF09;&#x4E3A;&#x67D0;&#x4E1A;&#x52A1;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x4FEE;&#x6539;&#x722C;&#x866B;&#x4EE3;&#x7801;&#x6293;&#x53D6;&#x903B;&#x8F91;&#xFF1B;</li>
<li>&#xFF08;&#x722C;&#x866B;&#x9879;&#x76EE;&#x8FD0;&#x7EF4;&#xFF09;&#x4E3A;&#x67D0;&#x4E9B;&#x722C;&#x866B;&#x5BA2;&#x6237;&#x7AEF;&#x673A;&#x5668;&#x5B89;&#x88C5;&#x6307;&#x5B9A;&#x7684;&#x5305;&#x5E76;&#x505A;&#x914D;&#x7F6E;&#xFF1B;</li>
<li>&#xFF08;Memcached&#x8FD0;&#x7EF4;&#xFF09;&#x4E3A;Memcached&#x673A;&#x5668;&#x8C03;&#x6574;Linux&#x5185;&#x6838;&#x53C2;&#x6570;&#x548C;swap&#x8BBE;&#x7F6E;&#xFF1B;</li>
<li>&#xFF08;&#x989D;&#x5916;ticket&#xFF09;&#x6536;&#x96C6;&#x673A;&#x5668;&#x53C2;&#x6570;&#x6307;&#x6807;&#xFF0C;&#x6C47;&#x603B;&#x62A5;&#x8868;&#xFF1B;</li>
</ul>
<p>&#x6240;&#x4EE5;&#xFF0C;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x4E8B;&#x60C5;&#x3002; Ps. &#x5370;&#x8C61;&#x7B14;&#x8BB0;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;APP&#xFF0C;&#x4E5F;&#x8BB8;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x505A;&#x8F7D;&#x4F53; :)</p>
<h4 id="&#x603B;&#x7ED3;&#x548C;&#x56DE;&#x987E;">&#x603B;&#x7ED3;&#x548C;&#x56DE;&#x987E;</h4><p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6E05;&#x695A;&#x7684;&#x77E5;&#x9053;&#x4E86;&#x81EA;&#x5DF1;&#x6240;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x7136;&#x5F97;&#x9700;&#x8981;&#x8FDB;&#x4E00;&#x6B65;&#xFF0C;&#x6211;&#x4EEC;&#x5F97;&#x505A;&#x56DE;&#x987E;&#x548C;&#x603B;&#x7ED3;&#xFF0C;&#x6BD4;&#x5982;&#x8BF4; Memcached &#x8FD0;&#x7EF4; &#x8FD9;&#x6574;&#x4E2A;&#x7684;&#x9879;&#x76EE;&#x96C6;&#x8017;&#x8D39;&#x4E86;&#x81EA;&#x8EAB;&#x5F88;&#x591A;&#x7CBE;&#x529B;&#xFF0C;&#x90A3;&#x4E48;&#x6216;&#x8BB8;&#x5E94;&#x8BE5;&#x95EE;&#x81EA;&#x5DF1;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A; </p>
<ul>
<li>&#x662F;&#x5426;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x90FD;&#x662F;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5462;?</li>
</ul>
<p>&#x5F53;&#x6211;&#x4EEC;&#x505A;&#x4E00;&#x4E9B;&#x603B;&#x7ED3;&#x548C;&#x56DE;&#x987E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9996;&#x5148;&#x5F97;&#x5224;&#x65AD;&#x505A;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x7684; &#x6536;&#x76CA; &#x662F;&#x5426;&#x8FBE;&#x5230;&#x9884;&#x671F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x662F;&#x5426;&#x5728;&#x505A;&#x4E00;&#x4E9B;&#x672C;&#x4E0D;&#x9700;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5462;? &#x6BD4;&#x5982;&#x4E00;&#x4E9B;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#x4EA4;&#x7ED9;crontab&#x4E4B;&#x7C7B;&#x7684;&#x8BA1;&#x5212;&#x4EFB;&#x52A1;&#x6765;&#x505A;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x624B;&#x5DE5;&#x505A;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x4FBF;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4EF7;&#x503C;&#xFF0C;&#x53C8;&#x6BD4;&#x5982;&#x5236;&#x9020;&#x51FA;&#x4E00;&#x4E9B;&#x6CA1;&#x6709;&#x4EBA;&#x6D88;&#x8D39;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6CA1;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x3002; </p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x8BC4;&#x5224;&#x4E00;&#x4EF6;&#x4E8B;&#x60C5;&#x662F;&#x5426;&#x505A;&#x7684;&#x6709;&#x4EF7;&#x503C;&#xFF0C;&#x9996;&#x5148;&#x4E00;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x8DDF;&#x8001;&#x5927;&#x6C47;&#x62A5;&#x8BF4;&#xFF0C;&#x6211;&#x6B63;&#x5728;&#x505A;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#xFF0C;&#x8001;&#x5927;&#x4F1A;&#x4E0D;&#x4F1A;&#x8BA4;&#x53EF;? &#x5176;&#x6B21;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#x505A;&#x5B8C;&#x4E86;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x79EF;&#x6781;&#x7684;&#x53D8;&#x5316;? &#x6700;&#x540E;&#xFF0C;&#x82B1;&#x8D39;&#x5728;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x5B9E;&#x9645;&#x7684;&#x6536;&#x76CA;&#x662F;&#x5426;&#x6210;&#x6BD4;&#x4F8B;?</p>
<p>&#x5728;&#x7406;&#x6E05;&#x8FD9;&#x4E9B;&#x4E4B;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5B8C;&#x6210; &#x4EFB;&#x52A1; &#x7684;&#x6548;&#x7387;&#x53CA;&#x83B7;&#x53D6;&#x7684;&#x6536;&#x76CA;&#x4E5F;&#x8BB8;&#x4F1A;&#x66F4;&#x9AD8;&#x3002; </p>
<ul>
<li>&#x662F;&#x5426;&#x505A;&#x7684;&#x4E8B;&#x60C5;&#x5B58;&#x5728; &gt; 10&#x6B21;&#x7684;&#x91CD;&#x590D;&#x5462;?</li>
</ul>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x88AB;&#x91CD;&#x590D;&#x7684;&#x64CD;&#x4F5C;&#x8D85;&#x8FC7;10&#x6B21;&#x4EE5;&#x4E0A;&#x800C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6539;&#x8FDB;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x5F97;&#x8B66;&#x9192;&#x4E86;&#xFF0C;&#x662F;&#x5426;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x8FD8;&#x503C;&#x5F97;&#x7EE7;&#x7EED;&#x8FD9;&#x6837;&#x7684;&#x91CD;&#x590D;&#x52B3;&#x52A8;&#x5462;?</p>
<p>IT &#x754C;&#x8FD1;&#x51E0;&#x5E74;&#x63D0;&#x51FA;&#x7684;xx&#x81EA;&#x52A8;&#x5316;&#x6B63;&#x662F;&#x6E90;&#x4E8E;&#x5BF9;&#x91CD;&#x590D;&#x52B3;&#x52A8;&#x7684;&#x6DF1;&#x5165;&#x6539;&#x9020;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x534A;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x8FD8;&#x662F;&#x5168;&#x81EA;&#x52A8;&#x5316;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x9A71;&#x52A8;&#x4FBF;&#x662F;&#x201C;&#x5B83;&#x5B9E;&#x5728;&#x88AB;&#x91CD;&#x590D;&#x592A;&#x591A;&#x6B21;&#x6570;&#x4E86;&#x201D;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x524D;&#x63D0;&#xFF0C;&#x672C;&#x4EBA;&#x603B;&#x7ED3;&#x4E3A;&#xFF1A; &#x6807;&#x51C6;&#x5316; &amp; &#x6D41;&#x7A0B;&#x5316; &#x3002; </p>
<p>&#x4EE5;&#x722C;&#x866B;&#x81EA;&#x52A8;&#x6293;&#x53D6;&#x7F51;&#x9875;&#x6570;&#x636E;&#x4E3A;&#x4F8B;&#xFF0C;&#x5982;&#x679C;HTML&#x7684;&#x4EE3;&#x7801;&#x7ED3;&#x6784;&#x4E0D;&#x662F;&#x89C4;&#x6574;&#x7684;XML&#x683C;&#x5F0F;&#xFF0C;&#x5982;&#x679C;&#x6293;&#x53D6;&#x7684;&#x76EE;&#x6807;&#x6E90;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x6B63;&#x5219;&#x5339;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#x5F88;&#x597D;&#x7684;&#x6293;&#x53D6;&#x51FA;&#x5B9E;&#x9645;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x722C;&#x866B;&#x7684;&#x81EA;&#x52A8;&#x5316;&#x6293;&#x53D6;&#x4FBF;&#x6C38;&#x8FDC;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x68A6;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684; &#x6807;&#x51C6;&#x5316; &#xFF0C;&#x4F60;&#x9996;&#x5148;&#x5F97;&#x4FDD;&#x8BC1;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x662F;&#x975E;&#x5E38;&#x6807;&#x51C6;&#x7684;&#x5E76;&#x4E14;&#x80FD;&#x5F88;&#x597D;&#x88AB;&#x62C6;&#x89E3;&#x7684;&#x3002; </p>
<p>&#x800C; &#x6D41;&#x7A0B;&#x5316; &#x5219;&#x662F;&#x6307;&#x8FD9;&#x4E2A;&#x91CD;&#x590D;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x672C;&#x8EAB;&#x662F;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x56FA;&#x5B9A;&#x7684;&#x6D41;&#x7A0B;&#x6216;&#x8005;&#x5DE5;&#x5E8F;&#x53BB;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x7684;&#x89E3;&#x9898;&#x903B;&#x8F91;&#x662F;&#x975E;&#x5E38;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x5018;&#x82E5;&#x65E0;&#x6CD5;&#x8FBE;&#x6210;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x81EA;&#x52A8;&#x5316;&#x4E5F;&#x662F;&#x5F88;&#x96BE;&#x63A8;&#x52A8;&#x7684;&#x3002; </p>
<p>&#x5176;&#x5B9E;&#x5982;&#x679C;&#x80FD;&#x591F;&#x505A;&#x5230; &#x534A;&#x81EA;&#x52A8;&#x5316; &#xFF0C;&#x76F8;&#x4FE1;&#x4E5F;&#x662F;&#x6709;&#x5DE8;&#x5927;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x518D;&#x5173;&#x5FC3;&#x5177;&#x4F53;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6309;&#x7167;&#x9700;&#x6C42;&#xFF0C;&#x5728;Web&#x4E0A;&#x70B9;&#x51E0;&#x4E2A;&#x6309;&#x94AE;&#x5373;&#x53EF;&#x5B8C;&#x6210;&#xFF0C;&#x518D;&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5F00;&#x653E;Web&#x5DE5;&#x5177;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x76F4;&#x63A5;&#x66B4;&#x9732;&#x7ED9;&#x6700;&#x7EC8;&#x7684;&#x9700;&#x6C42;&#x7528;&#x6237;&#xFF0C;&#x8BA9;&#x4ED6;&#x4EEC; &#x81EA;&#x52A9;&#x670D;&#x52A1; &#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x89E3;&#x653E;&#x53CC;&#x624B;&#x7684;&#x76EE;&#x7684;&#x3002; </p>
<h4 id="&#x79EF;&#x6781;&#x4E86;&#x89E3;&#x884C;&#x4E1A;&#x53D8;&#x5316;">&#x79EF;&#x6781;&#x4E86;&#x89E3;&#x884C;&#x4E1A;&#x53D8;&#x5316;</h4><p>IT &#x884C;&#x4E1A;&#x65E5;&#x65B0;&#x6708;&#x5F02;&#xFF0C;&#x6BCF;&#x5206;&#x6BCF;&#x79D2;&#x90FD;&#x5728;&#x53D1;&#x751F;&#x5DE8;&#x5927;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x5173;&#x6CE8;&#x5230;&#x8FD9;&#x4E9B;&#xFF0C;&#x90A3;&#x53EF;&#x80FD;&#x4F1A;&#x91CD;&#x590D;&#x9020;&#x4E00;&#x4E9B;&#x8F6E;&#x5B50;&#xFF0C;&#x4E25;&#x91CD;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x65F6;&#x4EE3;&#x6240;&#x629B;&#x5F03;&#x3002;</p>
<p>&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x5F53;&#x5F00;&#x6E90;&#x754C;&#x5DF2;&#x7ECF;&#x8BDE;&#x751F;&#x4E86;Linux&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x9020;&#x4E00;&#x4E2A;OS&#x4FBF;&#x662F;&#x611A;&#x8822;&#x4E4B;&#x4E3E;&#x4E86;&#x3002;&#x53C8;&#x6216;&#x8005;&#xFF0C;&#x5F53;&#x4E1A;&#x754C;&#x51FA;&#x73B0;&#x79CD;&#x7C7B;&#x7E41;&#x591A;&#x7684;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x56FA;&#x6267;&#x7684;&#x4F7F;&#x7528;&#x7740;&#x5355;&#x4E00;&#x8BED;&#x8A00;&#x505A;&#x5F00;&#x53D1;&#x4FBF;&#x53C8;&#x662F;&#x663E;&#x5F97;&#x8FC7;&#x65F6;&#x4E86;&#x3002;</p>
<p>&#x65F6;&#x65F6;&#x523B;&#x523B;&#x7684;&#x5173;&#x6CE8;&#x81EA;&#x8EAB;&#x6240;&#x5728;&#x7684;&#x884C;&#x4E1A;&#x7684;&#x53D8;&#x9769;&#xFF0C;&#x5173;&#x6CE8;Github&#x3001;InfoQ&#x3001;51CTO&#x7B49;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x7AD9;&#x70B9;&#x7684;&#x8D44;&#x8BAF;&#x4EE5;&#x53CA;&#x65B0;&#x5174;&#x6280;&#x672F;&#xFF0C;&#x65E0;&#x7591;&#x4F1A;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x52A9;&#x529B;&#x3002;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4F60;&#x4ECE;&#x4E8B;&#x67D0;&#x9879;&#x804C;&#x4E1A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x878D;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x804C;&#x4E1A;&#x7684;&#x5708;&#x5B50;&#x4E5F;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x6BD4;&#x5982;&#x8FD0;&#x7EF4;&#x559C;&#x6B22;&#x52A0;&#x4E00;&#x4E9B;QQ&#x7FA4;&#xFF0C;&#x559C;&#x6B22;&#x53C2;&#x4E0E;&#x4E00;&#x4E9B;&#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x559C;&#x6B22;&#x53C2;&#x52A0;QCon&#x4EE5;&#x53CA;&#x901B; <a href="https://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=2&amp;cad=rja&amp;uact=8&amp;ved=0CCcQFjAB&amp;url=http%3A%2F%2Fbbs.linuxtone.org%2F&amp;ei=xXomVfuGBomqoQTZk4KIDw&amp;usg=AFQjCNEqhLo9k3D7DeA3MQYOIr_bLjBZIQ&amp;sig2=xO1PyvM3VUv6-HiEkqpdVg" target="_blank" rel="external">Linux Tone</a> &#xFF0C;&#x591A;&#x548C;&#x4E1A;&#x754C;&#x7684;&#x540C;&#x50DA;&#x6C9F;&#x901A;&#x4EA4;&#x6D41;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED9;&#x81EA;&#x5DF1;&#x66F4;&#x591A;&#x7684;&#x7075;&#x611F;&#x548C;&#x673A;&#x4F1A;&#xFF08;&#x6BD4;&#x5982;&#x8DF3;&#x69FD;~&#xFF09;&#xFF01; </p>
<p>&#x5C31;&#x662F;&#x8FD9;&#x4E9B;&#x4E86;&#xFF0C;&#x4EE5;&#x4E0A;&#x4EC5;&#x4EC5;&#x662F;&#x9119;&#x4EBA;&#x7684;&#x4E00;&#x4E9B;&#x4E2A;&#x4EBA;&#x611F;&#x53D7;&#xFF0C;&#x4E0D;&#x559C;&#x52FF;&#x55B7;~</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Memcached/">Memcached</a><a href="/tags/操作系统/">操作系统</a><a href="/tags/运维技术/">运维技术</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/03/23337b7/" title="Memcached 1.4.24 发布，集中式缓存系统 -">
  <strong>上一篇：</strong><br/>
  <span>
  Memcached 1.4.24 发布，集中式缓存系统 -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/03/232b170/"  title="用Varnish和Memcached给WordPress网站提速 -">
 <strong>下一篇：</strong><br/> 
 <span>用Varnish和Memcached给WordPress网站提速 -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#项目_+_任务驱动制"><span class="toc-number">1.</span> <span class="toc-text">项目 + 任务驱动制</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#总结和回顾"><span class="toc-number">2.</span> <span class="toc-text">总结和回顾</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#积极了解行业变化"><span class="toc-number">3.</span> <span class="toc-text">积极了解行业变化</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>606</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>17</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/MySQL/" title="MySQL">MySQL<sup>10</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
