
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>在业余项目使用 Node.js - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x672C;&amp;#x6587;&amp;#x662F;&amp;#x7FFB;&amp;#x8BD1;&amp;#xFF0C;&amp;#x7248;&amp;#x6743;&amp;#x5F52;&amp;#x539F;&amp;#x4F5C;&amp;#x8005;&amp;#x6240;&amp;#x6709;
&amp;#x539F;&amp;#x6587;&amp;#x5730;&amp;#x5740;&amp;#xFF08;original source&amp;#xFF09;&amp;#xFF1A; http://jkchu.co">
<meta property="og:type" content="article">
<meta property="og:title" content="在业余项目使用 Node.js -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/02/2ddbaf1/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x672C;&amp;#x6587;&amp;#x662F;&amp;#x7FFB;&amp;#x8BD1;&amp;#xFF0C;&amp;#x7248;&amp;#x6743;&amp;#x5F52;&amp;#x539F;&amp;#x4F5C;&amp;#x8005;&amp;#x6240;&amp;#x6709;
&amp;#x539F;&amp;#x6587;&amp;#x5730;&amp;#x5740;&amp;#xFF08;original source&amp;#xFF09;&amp;#xFF1A; http://jkchu.co">
<meta property="og:updated_time" content="2015-07-02T15:01:12.982Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="在业余项目使用 Node.js -">
<meta name="twitter:description" content="&amp;#x672C;&amp;#x6587;&amp;#x662F;&amp;#x7FFB;&amp;#x8BD1;&amp;#xFF0C;&amp;#x7248;&amp;#x6743;&amp;#x5F52;&amp;#x539F;&amp;#x4F5C;&amp;#x8005;&amp;#x6240;&amp;#x6709;
&amp;#x539F;&amp;#x6587;&amp;#x5730;&amp;#x5740;&amp;#xFF08;original source&amp;#xFF09;&amp;#xFF1A; http://jkchu.co">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/2ddbaf1/" title="在业余项目使用 Node.js -" itemprop="url">在业余项目使用 Node.js -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T03:01:12.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#本文是翻译，版权归原作者所有"><span class="toc-number">1.</span> <span class="toc-text">本文是翻译，版权归原作者所有</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#1-Node-js_究竟是什么？"><span class="toc-number"></span> <span class="toc-text">1.Node.js 究竟是什么？</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#2-你不应该使用_Node-js_的场景"><span class="toc-number"></span> <span class="toc-text">2.你不应该使用 Node.js 的场景</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#3-JavaScript_——前端和后端"><span class="toc-number"></span> <span class="toc-text">3.JavaScript ——前端和后端</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#4-JSON——数据丛林之王"><span class="toc-number"></span> <span class="toc-text">4.JSON——数据丛林之王</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#5-模块——取你所需"><span class="toc-number"></span> <span class="toc-text">5.模块——取你所需</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#6-总结"><span class="toc-number"></span> <span class="toc-text">6.总结</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#7-我的下一步规划"><span class="toc-number"></span> <span class="toc-text">7.我的下一步规划</span></a>
		
		</div>
		
		<h4 id="&#x672C;&#x6587;&#x662F;&#x7FFB;&#x8BD1;&#xFF0C;&#x7248;&#x6743;&#x5F52;&#x539F;&#x4F5C;&#x8005;&#x6240;&#x6709;">&#x672C;&#x6587;&#x662F;&#x7FFB;&#x8BD1;&#xFF0C;&#x7248;&#x6743;&#x5F52;&#x539F;&#x4F5C;&#x8005;&#x6240;&#x6709;</h4><ul>
<li>&#x539F;&#x6587;&#x5730;&#x5740;&#xFF08;original source&#xFF09;&#xFF1A; <a href="http://jkchu.com/2015/06/23/node-js-for-side-projects/" target="_blank" rel="external">http://jkchu.com/2015/06/23/node-js-for-side-projects/</a></li>
</ul>
<p>&#x6709;&#x4E00;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x628A;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x7684;&#x4EBA;&#x4EEC;&#x8054;&#x7CFB;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF1A;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x521B;&#x9020;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x3001;&#x6216;&#x521A;&#x597D;&#x7B26;&#x5408;&#x9884;&#x671F;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x662F;&#x6700;&#x8BA9;&#x4EBA;&#x6EE1;&#x610F;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x7684;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#xFF08;side projects&#xFF09;&#xFF0C;&#x6211;&#x70ED;&#x7231;&#x5B66;&#x4E60;&#x65B0;&#x6846;&#x67B6;&#x3001;&#x6280;&#x672F;&#x548C;&#x8BED;&#x8A00;&#x3002;&#x4F46;&#x662F;&#x5230;&#x4E86;&#x6700;&#x540E;&#xFF0C;&#x6700;&#x6709;&#x6536;&#x83B7;&#x548C;&#x6B23;&#x6170;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x662F;&#x5B8C;&#x6210;&#x4E86;&#x9879;&#x76EE;&#x5E76;&#x5BF9;&#x5916;&#x53D1;&#x5E03;&#x4E86;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x8001;&#x5B9E;&#x8BB2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5168;&#x804C;&#x5DE5;&#x4F5C;&#xFF0C; <a href="http://www.labazhou.net/2014/09/work-life-imbalance/" target="_blank" rel="external">&#x62C5;&#x5FC3;&#x953B;&#x70BC;&#x8EAB;&#x4F53;&#x3001;&#x6742;&#x4E8B;&#x548C;&#x53EF;&#x80FD;&#x8FD8;&#x8981;&#x7761;&#x89C9;</a> &#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5E38;&#x5E38;&#x96BE;&#x4EE5;&#x627E;&#x5230;&#x5B8C;&#x6210;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5F53;&#x6211;&#x8C08;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x7406;&#x89E3;&#x7684;&#x3002;&#x501F;&#x52A9;&#x63D0;&#x524D;&#x89C4;&#x5212;&#xFF0C;&#x6216;&#x8BB8;&#x5229;&#x7528;&#x4E00;&#x4E9B;&#x4E0D;&#x9519;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x81EA;&#x5DF1;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x6808;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x5982;&#x679C;&#x5B8C;&#x6210;&#x5E76;&#x53D1;&#x5E03;&#x9879;&#x76EE;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x90A3;&#x4E48;&#x6311;&#x9009;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x8F83;&#x597D;&#x9002;&#x5E94;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x7684;&#x6280;&#x672F;&#x6808;&#x5C31;&#x663E;&#x5F97;&#x5341;&#x5206;&#x91CD;&#x8981;&#x4E86;&#x3002; </p>
<p><a href="https://nodejs.org/" target="_blank" rel="external">Node.js</a> &#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x6D41;&#x884C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5E73;&#x53F0;&#xFF0C;&#x7528;&#x4F5C;&#x5F88;&#x591A;&#x73B0;&#x4EE3; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684; web &#x670D;&#x52A1;&#x5668;&#x3002;&#x5728;&#x5F00;&#x53D1; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4F60;&#x5C06;&#x4F7F;&#x7528; JavaScript &#x7F16;&#x5199;&#x6240;&#x6709;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF08;Windows&#x3001;Mac &#x6216; Linux&#xFF09;&#x4E0A;&#x8FD0;&#x884C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;Node.js &#x7531;&#x5927;&#x91CF;&#x7684;&#x9650;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x6A21;&#x5757;&#xFF08;module&#xFF09; &#x548C; &#x5305;&#xFF08;package&#xFF09; &#x7EC4;&#x6210;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x5229;&#x7528;&#x8D77;&#x6765;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4F60;&#x6700;&#x597D;&#x53D6;&#x4F60;&#x6240;&#x9700;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;&#x5728;&#x4E00;&#x5929;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4EAB;&#x53D7;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#xFF0C;Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5199;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x6709;&#x4E50;&#x8DA3;&#x3002; </p>
<h3 id="1-Node-js_&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">1.Node.js &#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h3><p>Node.js &#x672C;&#x8EAB;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#xFF0C;&#x9002;&#x5408;&#x4F7F;&#x7528; JavaScript &#x6765;&#x7F16;&#x5199;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002; Node.js &#x4E0D;&#x662F; JavaScript &#x6846;&#x67B6;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x90E8;&#x5206; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E86;&#x6846;&#x67B6; &#x3002; <a href="http://expressjs.com/" target="_blank" rel="external">Express.js</a> &#x662F;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684; Node.js &#x6846;&#x67B6;&#xFF0C;&#x6709;&#x7740;&#x51FA;&#x8272;&#x7684;&#x6587;&#x6863;&#x548C;&#x6D77;&#x91CF;&#x7684;&#x4F18;&#x79C0;&#x8D44;&#x6E90;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E; Node.js web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6808;&#x800C;&#x8A00;&#xFF0C;&#x4F60;&#x5E94;&#x5B89;&#x88C5; Node.js &#x548C; Express.js &#x6765;&#x8FD0;&#x884C;&#x4F60;&#x7684; web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x5C06;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x4E2D;&#x95F4;&#x4EBA;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x5728;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x8FC5;&#x901F;&#x5730;&#x4F20;&#x9012;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x3002; </p>
<h3 id="2-&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;_Node-js_&#x7684;&#x573A;&#x666F;">2.&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js &#x7684;&#x573A;&#x666F;</h3><p>&#x5728;&#x6211;&#x4EEC;&#x6DF1;&#x5165; Node.js &#x5F00;&#x53D1;&#x7684;&#x7CBE;&#x5F69;&#x90E8;&#x5206;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BF4;&#x6E05;&#x695A;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js &#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6D89;&#x53CA;&#x5230; CPU &#x5BC6;&#x96C6;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js&#x3002;Node.js &#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x8981;&#x8017;&#x8D39;&#x592A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x4F1A;&#x62D6;&#x57AE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x4EFB;&#x4F55;&#x79CD;&#x7C7B;&#x7684;&#x5927;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x3002;&#x8981;&#x4E48;&#x628A;&#x8FD9;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x8F6C;&#x79FB;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8981;&#x4E48;&#x7C97;&#x66B4;&#x5730;&#x5207;&#x6362;&#x5230;&#x66F4;&#x9002;&#x5408;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x559C;&#x6B22; JavaScript &#x5F00;&#x53D1;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x4EAB;&#x53D7;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#xFF0C;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x7F51;&#x4E0A;&#x6709;&#x4EBA;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5C31;&#x628A;&#x4E0D;&#x6109;&#x5FEB;&#x7684;&#x4E1C;&#x897F;&#x5F3A;&#x52A0;&#x7ED9;&#x81EA;&#x5DF1;&#x3002;&#x4F46;&#x662F;&#x5728;&#x4F60;&#x653E;&#x5F03;&#x4E4B;&#x524D;&#xFF0C;&#x542C;&#x6211;&#x628A;&#x8BDD;&#x8BF4;&#x5B8C;&#xFF0C;&#x6211;&#x9047;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x6F20;&#x89C6;&#x7740; JavaScript&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x7ED9; JavaScript &#x4E00;&#x4E2A;&#x516C;&#x5E73;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;JavaScript &#x8C8C;&#x4F3C;&#x72C2;&#x91CE;&#x3001;&#x96BE;&#x4EE5;&#x9A7E;&#x9A6D;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x4F60;&#x5B66;&#x4F1A;&#x4E86;&#x5982;&#x4F55;&#x6B63;&#x786E;&#x5730;&#x4F7F;&#x7528;&#xFF0C;&#x4F60;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5B83;&#x7684;&#x529B;&#x91CF;&#x6709;&#x591A;&#x5927;&#x4E86;&#x3002;JavaScript &#x662F;&#x5E94;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E4B;&#x4E00;&#xFF0C;&#x968F;&#x7740; <a href="https://github.com/lukehoban/es6features" target="_blank" rel="external">ECMAScript 6</a> &#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x5B83;&#x5C06;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002; </p>
<h3 id="3-JavaScript_&#x2014;&#x2014;&#x524D;&#x7AEF;&#x548C;&#x540E;&#x7AEF;">3.JavaScript &#x2014;&#x2014;&#x524D;&#x7AEF;&#x548C;&#x540E;&#x7AEF;</h3><p>&#x8BA9;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;Node.js &#x6700;&#x5927;&#x5316;&#x4F60;&#x7684;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x751F;&#x4EA7;&#x529B;&#x7684;&#x65B9;&#x5F0F;&#x3002;JavaScript &#x5DF2;&#x7ECF;&#x63A5;&#x7BA1;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4E0D;&#x518D;&#x5355;&#x7EAF;&#x7528;&#x4E8E;&#x7410;&#x788E;&#x529F;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x73B0;&#x4EE3; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD0;&#x884C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x662F;&#x7531; JavaScript &#x63D0;&#x4F9B;&#x7684;&#x3002;&#x9664;&#x4E86;&#x6539;&#x5584;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5B83;&#x8FD8;&#x4ECE; web &#x670D;&#x52A1;&#x5668;&#x5206;&#x62C5;&#x4E86;&#x5927;&#x91CF;&#x5DE5;&#x4F5C;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5417;&#xFF1F;&#x8BA9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x627F;&#x62C5;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x5145;&#x5206;&#x5229;&#x7528; Node.js &#x7684;&#x6700;&#x5927;&#x529B;&#x91CF;&#x2014;&#x2014;&#x51CF;&#x8F7B;&#x5FEB;&#x6377;&#x7684; I/O&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#x5728;&#x524D;&#x540E;&#x7AEF;&#x4E4B;&#x95F4;&#x4F20;&#x64AD;&#xFF1B;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B; Node.js &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5E78;&#x8FD0;&#x5730;&#x5728;&#x524D;&#x540E;&#x7AEF;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5927;&#x90E8;&#x5206;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x4E8E;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x4E0D;&#x5F97;&#x4E0D;&#x628A;&#x4F60;&#x7684;&#x601D;&#x7EF4;&#x91CD;&#x65B0;&#x805A;&#x7126;&#x548C;&#x8C03;&#x6574;&#x5728;&#x65B0;&#x4EFB;&#x52A1;&#x3001;&#x65B0;&#x8BED;&#x8A00;&#x3001;&#x4EE5;&#x53CA;&#x65B0;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x5E38;&#x5E38;&#x4F1A;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8017;&#x8D39;&#x4E00;&#x4E9B;&#x5B9D;&#x8D35;&#x7684;&#x6709;&#x6548;&#x7387;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x51CF;&#x5C11;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x5728;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#x7684;&#x5904;&#x7406;&#x4E0A;&#x6E38;&#x5203;&#x6709;&#x4F59;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x4E5F;&#x66F4;&#x52A0;&#x8FC5;&#x901F;&#x3002;</p>
<h3 id="4-JSON&#x2014;&#x2014;&#x6570;&#x636E;&#x4E1B;&#x6797;&#x4E4B;&#x738B;">4.JSON&#x2014;&#x2014;&#x6570;&#x636E;&#x4E1B;&#x6797;&#x4E4B;&#x738B;</h3><p>&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;JSON&#xFF08;JavaScript Object Notation&#xFF09;&#x3010;&#x6CE8;1&#x3011;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x3002;&#x6839;&#x636E;&#x6211;&#x5728;&#x5176;&#x5B83;&#x5E73;&#x53F0;&#x4E0A;&#x5F00;&#x53D1; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x628A;&#x4F60;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x6210;&#x5404;&#x79CD;&#x683C;&#x5F0F;&#x548C;&#x6A21;&#x578B;&#xFF0C;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x76F8;&#x5F53;&#x60CA;&#x4EBA;&#x7684;&#x3002;&#x5BF9;&#x4E8E; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;JSON &#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x9886;&#x57DF;&#x2014;&#x2014;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x548C;&#x6570;&#x636E;&#x5E93;&#x3002; <a href="https://www.mongodb.org/" target="_blank" rel="external">MongoDB</a> &#x548C; <a href="http://couchdb.apache.org/" target="_blank" rel="external">CouchDB</a> &#x662F;&#x6D41;&#x884C;&#x7684; NoSQL &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F7F;&#x7528; JSON &#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002; <a href="http://www.postgresql.org/" target="_blank" rel="external">PostgreSQL</a> &#xFF0C;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x5F00;&#x6E90;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x5B58;&#x50A8; JSON &#x5BF9;&#x8C61;&#x3002;&#x5FAE;&#x8F6F;&#x751A;&#x81F3; <a href="http://blogs.msdn.com/b/jocapc/archive/2015/05/16/json-support-in-sql-server-2016.aspx" target="_blank" rel="external">&#x5BA3;&#x5E03;</a> SQL Server 2016 &#x5C06;&#x652F;&#x6301; JSON&#x3002;&#x6709;&#x5982;&#x6B64;&#x4E30;&#x5BCC;&#x7684;&#x53EF;&#x9009;&#x9879;&#xFF0C;&#x5C31;&#x53EF;&#x8F7B;&#x677E;&#x5730;&#x7ED9;&#x4F60;&#x7684; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6311;&#x9009;&#x4E00;&#x79CD;&#x53EF;&#x9760;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4EE5;&#x6324;&#x51FA;&#x6BCF;&#x4E00;&#x70B9;&#x751F;&#x4EA7;&#x529B;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x7684;&#x8F6C;&#x6362;&#x3002; </p>
<h3 id="5-&#x6A21;&#x5757;&#x2014;&#x2014;&#x53D6;&#x4F60;&#x6240;&#x9700;">5.&#x6A21;&#x5757;&#x2014;&#x2014;&#x53D6;&#x4F60;&#x6240;&#x9700;</h3><p>&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x4E2A;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x5C31;&#x662F;&#x4FDD;&#x6301;&#x5C0F;&#x800C;&#x4E13;&#x6CE8;&#x3002;&#x8BE5;&#x6CD5;&#x5219;&#x6709;&#x52A9;&#x4E8E;&#x786E;&#x4FDD;&#x771F;&#x6B63;&#x5730;&#x5B8C;&#x6210;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x3002;&#x540C;&#x6837;&#x7684;&#x6982;&#x5FF5;&#x53EF;&#x5728; Node.js &#x9879;&#x76EE;&#x4E2D;&#x627E;&#x5230;&#x2014;&#x2014;&#x4F60;&#x53EA;&#x4F7F;&#x7528;&#x90A3;&#x4E9B;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8DB3;&#x591F;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;&#x548C;&#x5176;&#x5B83;&#x90A3;&#x4E9B;&#x4EE5;&#x4F01;&#x4E1A;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x5E73;&#x53F0;&#x4E0D;&#x540C;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x6709;&#x5927;&#x91CF;&#x6839;&#x672C;&#x7528;&#x4E0D;&#x5230;&#x7684;&#x989D;&#x5916;&#x4E1C;&#x4E1C;&#x3002;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x90E8;&#x7F72;&#x5C06;&#x66F4;&#x8FC5;&#x901F;&#xFF0C;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x5C06;&#x5360;&#x7528;&#x66F4;&#x5C11;&#x7A7A;&#x95F4;&#xFF0C;&#x9879;&#x76EE;&#x91CC;&#x7684;&#x6BCF;&#x6837;&#x4E1C;&#x897F;&#x6070;&#x6070;&#x90FD;&#x662F;&#x4F60;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x4F60;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#xFF0C;&#x5185;&#x5FC3;&#x611F;&#x5230;&#x5E73;&#x9759;&#x3002; <a href="https://www.npmjs.com/" target="_blank" rel="external">NPM</a> &#xFF08;Node Package Manager&#xFF09;&#x3010;&#x6CE8;2&#x3011;&#x662F; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x5927;&#x5356;&#x70B9;&#x3002;&#x5B83;&#x8BA9;&#x4F60;&#x7B80;&#x5355;&#x5FEB;&#x6377;&#x5730;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x516C;&#x5171; Node &#x6A21;&#x5757;&#xFF0C;&#x9009;&#x62E9;&#x8303;&#x56F4;&#x8D85;&#x8FC7;&#x4E86; 150,000 &#x4E2A;&#x5305;&#x3002;&#x51CF;&#x5C11;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x3001;&#x5229;&#x7528;&#x5DF2;&#x6709;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x5DE5;&#x5177;&#xFF0C;&#x4ECE;&#x672A;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x8FC7;&#x3002; </p>
<h3 id="6-&#x603B;&#x7ED3;">6.&#x603B;&#x7ED3;</h3><p>Node.js &#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E73;&#x53F0;&#xFF0C;&#x56E0;&#x5176;&#x9AD8; I/O &#x9700;&#x6C42;&#x800C;&#x771F;&#x6B63;&#x80DC;&#x51FA;&#x7684; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6253;&#x7B97;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x4F7F;&#x7528; Node.js&#xFF0C;&#x5C31;&#x5C3D;&#x91CF;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7684; web &#x670D;&#x52A1;&#x5668; API&#xFF0C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x771F;&#x6B63;&#x8D1F;&#x8F7D;&#x3002;Node.js &#x6781;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5B66;&#x4E60;&#x548C;&#x638C;&#x63E1;&#x8D77;&#x6765;&#xFF0C;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x4E9B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x5462;&#xFF1F;</p>
<h3 id="7-&#x6211;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x89C4;&#x5212;">7.&#x6211;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x89C4;&#x5212;</h3><p>&#x6211;&#x60F3;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x4F18;&#x79C0;&#x8D44;&#x6E90;&#x7684;&#x7B80;&#x5355;&#x6E05;&#x5355;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x638C;&#x63E1; Node.js&#x3002;</p>
<ul>
<li><a href="https://thinkster.io/mean-stack-tutorial/" target="_blank" rel="external">https://thinkster.io/mean-stack-tutorial/</a> &#xFF1A;&#x5B83;&#x662F;&#x5BF9;&#x6211;&#x5E2E;&#x52A9;&#x6700;&#x5927;&#x7684;&#x6559;&#x7A0B;&#x3002;&#x8BE5;&#x6559;&#x7A0B;&#x7ED3;&#x6784;&#x7CBE;&#x5999;&#xFF0C;&#x8986;&#x76D6;&#x4E86;&#x6781;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6D77;&#x91CF;&#x5185;&#x5BB9;&#x3002;&#x8BE5;&#x6559;&#x7A0B;&#x514D;&#x8D39;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x8FD8;&#x80FD;&#x4ED8;&#x8D39;&#xFF0C;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x89C6;&#x9891;&#xFF08;&#x5F53;&#x65F6;&#x6211;&#x4E3A;&#x6E90;&#x4EE3;&#x7801;&#x652F;&#x4ED8;&#x4E86; 25 &#x7F8E;&#x5143;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x4EEC;&#x597D;&#x50CF;&#x53D8;&#x6210;&#x4E86;&#x6BCF;&#x6708; 20 &#x7F8E;&#x5143;&#x7684;&#x8BA2;&#x9605;&#xFF0C;&#x5C31;&#x53EF;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x6240;&#x6709;&#x6559;&#x7A0B;&#xFF09;&#x3002;</li>
<li><p><a href="http://www.toptal.com/nodejs/why-the-hell-would-i-use-node-js" target="_blank" rel="external">http://www.toptal.com/nodejs/why-the-hell-would-i-use-node-js</a> &#xFF1A;&#x4E00;&#x7BC7;&#x5199;&#x5F97;&#x4E0D;&#x9519;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x7406;&#x89E3;&#x4E86; Node.js &#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x6CE8;1&#xFF1A;JSON&#xFF08;JavaScript Object Notation&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x9053;&#x683C;&#x62C9;&#x65AF;&#xB7;&#x514B;&#x7F57;&#x514B;&#x798F;&#x7279;&#x6784;&#x60F3;&#x8BBE;&#x8BA1;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x8BED;&#x8A00;&#xFF0C;&#x4EE5;&#x6587;&#x5B57;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x4E14;&#x6613;&#x4E8E;&#x8BA9;&#x4EBA;&#x9605;&#x8BFB;&#x3002;&#x5C3D;&#x7BA1;JSON&#x662F;Javascript&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x4F46;JSON&#x662F;&#x72EC;&#x7ACB;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x91C7;&#x7528;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E;C&#x8BED;&#x8A00;&#x5BB6;&#x65CF;&#x7684;&#x4E00;&#x4E9B;&#x4E60;&#x60EF;&#x3002; <a href="https://zh.wikipedia.org/wiki/JSON" target="_blank" rel="external">https://zh.wikipedia.org/wiki/JSON</a></p>
</li>
<li>&#x6CE8;2&#xFF1A;Node&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF08;Node Package Manager&#xFF09;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;javascript&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x9ED8;&#x8BA4;&#x73AF;&#x5883;&#x4E3A;Node.js&#xFF0C;&#x4ECE;Node.js0.6.3&#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;npm&#x88AB;&#x81EA;&#x52A8;&#x9644;&#x5E26;&#x5728;&#x5B89;&#x88C5;&#x5305;&#x4E2D;&#x3002; <a href="https://zh.wikipedia.org/wiki/Node%E5%8C%85%E7%AE%A1%E7%90%86%E5%99%A8" target="_blank" rel="external">https://zh.wikipedia.org/wiki/Node%E5%8C%85%E7%AE%A1%E7%90%86%E5%99%A8</a></li>
</ul>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Node-js/">Node.js</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/02/2da3fd4/" title="Dealing with long paths -">
  <strong>上一篇：</strong><br/>
  <span>
  Dealing with long paths -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/02/56aa566/"  title="源码推荐(7.02)：LazyTableView（一个可以最大程度简化uitableview操作的第三方框架） -">
 <strong>下一篇：</strong><br/> 
 <span>源码推荐(7.02)：LazyTableView（一个可以最大程度简化uitableview操作的第三方框架） -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#本文是翻译，版权归原作者所有"><span class="toc-number">1.</span> <span class="toc-text">本文是翻译，版权归原作者所有</span></a></li></ol></li><li class="toc-item toc-level-3"><a class="toc-link" href="#1-Node-js_究竟是什么？"><span class="toc-number"></span> <span class="toc-text">1.Node.js 究竟是什么？</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#2-你不应该使用_Node-js_的场景"><span class="toc-number"></span> <span class="toc-text">2.你不应该使用 Node.js 的场景</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#3-JavaScript_——前端和后端"><span class="toc-number"></span> <span class="toc-text">3.JavaScript ——前端和后端</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#4-JSON——数据丛林之王"><span class="toc-number"></span> <span class="toc-text">4.JSON——数据丛林之王</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#5-模块——取你所需"><span class="toc-number"></span> <span class="toc-text">5.模块——取你所需</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#6-总结"><span class="toc-number"></span> <span class="toc-text">6.总结</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#7-我的下一步规划"><span class="toc-number"></span> <span class="toc-text">7.我的下一步规划</span></a>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>587</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>32</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>23</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/MySQL/" title="MySQL">MySQL<sup>9</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
