
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>java.util.concurrent介绍 - super_marioli的专栏 | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="java.util.concurrent &amp;#x5305;&amp;#x542B;&amp;#x8BB8;&amp;#x591A;&amp;#x7EBF;&amp;#x7A0B;&amp;#x5B89;&amp;#x5168;&amp;#x3001;&amp;#x6D4B;&amp;#x8BD5;&amp;#x826F;&amp;#x597D;&amp;#x3001;&amp;#x9AD8;&amp;#x6027;&amp;#x80FD;&amp;#x7684;&amp;#x5E76;&amp;#x53D1;&amp;#x6784;&amp;#x5EFA;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="java.util.concurrent介绍 - super_marioli的专栏">
<meta property="og:url" content="http://taojinke.github.io/2015/07/01/2773f98/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="java.util.concurrent &amp;#x5305;&amp;#x542B;&amp;#x8BB8;&amp;#x591A;&amp;#x7EBF;&amp;#x7A0B;&amp;#x5B89;&amp;#x5168;&amp;#x3001;&amp;#x6D4B;&amp;#x8BD5;&amp;#x826F;&amp;#x597D;&amp;#x3001;&amp;#x9AD8;&amp;#x6027;&amp;#x80FD;&amp;#x7684;&amp;#x5E76;&amp;#x53D1;&amp;#x6784;&amp;#x5EFA;&amp;#x">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/2758d06.jpg">
<meta property="og:image" content="http://taojinke.github.io/img/20150701/2758d06.jpg">
<meta property="og:updated_time" content="2015-07-01T15:38:00.422Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="java.util.concurrent介绍 - super_marioli的专栏">
<meta name="twitter:description" content="java.util.concurrent &amp;#x5305;&amp;#x542B;&amp;#x8BB8;&amp;#x591A;&amp;#x7EBF;&amp;#x7A0B;&amp;#x5B89;&amp;#x5168;&amp;#x3001;&amp;#x6D4B;&amp;#x8BD5;&amp;#x826F;&amp;#x597D;&amp;#x3001;&amp;#x9AD8;&amp;#x6027;&amp;#x80FD;&amp;#x7684;&amp;#x5E76;&amp;#x53D1;&amp;#x6784;&amp;#x5EFA;&amp;#x">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/2773f98/" title="java.util.concurrent介绍 - super_marioli的专栏" itemprop="url">java.util.concurrent介绍 - super_marioli的专栏</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:38:00.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			
		
		</div>
		
		<p> java.util.concurrent &#x5305;&#x542B;&#x8BB8;&#x591A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3001;&#x6D4B;&#x8BD5;&#x826F;&#x597D;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5E76;&#x53D1;&#x6784;&#x5EFA;&#x5757;&#x3002;&#x4E0D;&#x5BA2;&#x6C14;&#x5730;&#x8BF4;&#xFF0C;&#x521B;&#x5EFA; java.util.concurrent &#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x8981;&#x5B9E;&#x73B0; Collection &#x6846;&#x67B6;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6240;&#x6267;&#x884C;&#x7684;&#x5E76;&#x53D1;&#x64CD;&#x4F5C;&#x3002;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x4E00;&#x7EC4;&#x53EF;&#x9760;&#x7684;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x53D1;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x5E76;&#x53D1;&#x7C7B;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3001;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3001;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x7C7B;&#x540D;&#x770B;&#x8D77;&#x6765;&#x76F8;&#x4F3C;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A; java.util.concurrent &#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x6982;&#x5FF5;&#x6E90;&#x81EA; Doug Lea &#x7684; util.concurrent &#x5E93;&#xFF08;&#x8BF7;&#x53C2;&#x9605; &#x53C2;&#x8003;&#x8D44;&#x6599;&#xFF09;&#x3002;</p>
<p>JDK 5.0 &#x4E2D;&#x7684;&#x5E76;&#x53D1;&#x6539;&#x8FDB;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x4E09;&#x7EC4;&#xFF1A;</p>
<p> &#xA0;&#xA0;&#xA0;&#xA0;&#x2022; JVM &#x7EA7;&#x522B;&#x66F4;&#x6539; &#x3002;&#x5927;&#x591A;&#x6570;&#x73B0;&#x4EE3;&#x5904;&#x7406;&#x5668;&#x5BF9;&#x5E76;&#x53D1;&#x5BF9;&#x67D0;&#x4E00;&#x786C;&#x4EF6;&#x7EA7;&#x522B;&#x63D0;&#x4F9B;&#x652F;&#x6301;&#xFF0C;&#x901A;&#x5E38;&#x4EE5; compare-and-swap &#xFF08;CAS&#xFF09;&#x6307;&#x4EE4;&#x5F62;&#x5F0F;&#x3002;CAS &#x662F;&#x4E00;&#x79CD;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x3001;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x66F4;&#x65B0;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#xFF0C;&#x540C;&#x65F6;&#x80FD;&#x591F;&#x68C0;&#x6D4B;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7684;&#x51B2;&#x7A81;&#x5E76;&#x8FDB;&#x884C;&#x6062;&#x590D;&#x3002;&#x5B83;&#x662F;&#x8BB8;&#x591A;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x53D1;&#x7B97;&#x6CD5;&#x7684;&#x57FA;&#x7840;&#x3002;&#x5728; JDK 5.0 &#x4E4B;&#x524D;&#xFF0C;Java &#x8BED;&#x8A00;&#x4E2D;&#x7528;&#x4E8E;&#x534F;&#x8C03;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x8BBF;&#x95EE;&#x7684;&#x60DF;&#x4E00;&#x539F;&#x8BED;&#x662F;&#x540C;&#x6B65;&#xFF0C;&#x540C;&#x6B65;&#x662F;&#x66F4;&#x91CD;&#x91CF;&#x7EA7;&#x548C;&#x7C97;&#x7C92;&#x5EA6;&#x7684;&#x3002;&#x516C;&#x5F00; CAS &#x53EF;&#x4EE5;&#x5F00;&#x53D1;&#x9AD8;&#x5EA6;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x5E76;&#x53D1; Java &#x7C7B;&#x3002;&#x8FD9;&#x4E9B;&#x66F4;&#x6539;&#x4E3B;&#x8981;&#x7531; JDK &#x5E93;&#x7C7B;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#x2022; &#x4F4E;&#x7EA7;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B; — &#x9501;&#x5B9A;&#x548C;&#x539F;&#x5B50;&#x7C7B;&#x3002; &#x4F7F;&#x7528; CAS &#x4F5C;&#x4E3A;&#x5E76;&#x53D1;&#x539F;&#x8BED;&#xFF0C;ReentrantLock &#x7C7B;&#x63D0;&#x4F9B;&#x4E0E; synchronized &#x539F;&#x8BED;&#x76F8;&#x540C;&#x7684;&#x9501;&#x5B9A;&#x548C;&#x5185;&#x5B58;&#x8BED;&#x4E49;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x5730;&#x63A7;&#x5236;&#x9501;&#x5B9A;&#xFF08;&#x5982;&#x8BA1;&#x65F6;&#x7684;&#x9501;&#x5B9A;&#x7B49;&#x5F85;&#x3001;&#x9501;&#x5B9A;&#x8F6E;&#x8BE2;&#x548C;&#x53EF;&#x4E2D;&#x65AD;&#x7684;&#x9501;&#x5B9A;&#x7B49;&#x5F85;&#xFF09;&#x548C;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF08;&#x7ADE;&#x4E89;&#x65F6;&#x7684;&#x9AD8;&#x6027;&#x80FD;&#xFF09;&#x3002;&#x5927;&#x591A;&#x6570;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x4E0D;&#x518D;&#x76F4;&#x63A5;&#x4F7F;&#x7528; ReentrantLock &#x7C7B;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x5728; ReentrantLock &#x7C7B;&#x4E0A;&#x6784;&#x5EFA;&#x7684;&#x9AD8;&#x7EA7;&#x7C7B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#x2022; &#x9AD8;&#x7EA7;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B; &#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x5B9E;&#x73B0;&#x5E76;&#x53D1;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x6BCF;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x6587;&#x672C;&#x4E2D;&#x90FD;&#x4F1A;&#x8BB2;&#x8FF0;&#x8FD9;&#x4E9B;&#x7C7B; — &#x4FE1;&#x53F7;&#x3001;&#x4E92;&#x65A5;&#x3001;&#x95E9;&#x9501;&#x3001;&#x5C4F;&#x969C;&#x3001;&#x4EA4;&#x6362;&#x7A0B;&#x5E8F;&#x3001;&#x7EBF;&#x7A0B;&#x6C60;&#x548C;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x96C6;&#x5408;&#x7C7B;&#x7B49;&#x3002;&#x5927;&#x90E8;&#x5206;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x90FD;&#x53EF;&#x4EE5;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7528;&#x8FD9;&#x4E9B;&#x7C7B;&#xFF0C;&#x6765;&#x66FF;&#x6362;&#x8BB8;&#x591A;&#xFF08;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#xFF09;&#x540C;&#x6B65;&#x3001;wait() &#x548C; notify() &#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x6B63;&#x786E;&#x6027;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x672C;&#x6559;&#x7A0B;&#x5C06;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD; java.util.concurrent &#x5305;&#x63D0;&#x4F9B;&#x7684;&#x9AD8;&#x7EA7;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B; — &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x96C6;&#x5408;&#x3001;&#x7EBF;&#x7A0B;&#x6C60;&#x548C;&#x540C;&#x6B65;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E9B;&#x662F;&#x521D;&#x5B66;&#x8005;&#x548C;&#x4E13;&#x5BB6;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7684;&quot;&#x73B0;&#x6210;&quot;&#x7C7B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5728;&#x7B2C;&#x4E00;&#x5C0F;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x56DE;&#x987E;&#x5E76;&#x53D1;&#x7684;&#x57FA;&#x672C;&#x77E5;&#x8BC6;&#xFF0C;&#x5C3D;&#x7BA1;&#x5B83;&#x4E0D;&#x5E94;&#x53D6;&#x4EE3;&#x5BF9;&#x7EBF;&#x7A0B;&#x548C;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x90A3;&#x4E9B;&#x4E00;&#x70B9;&#x90FD;&#x4E0D;&#x719F;&#x6089;&#x7EBF;&#x7A0B;&#x7684;&#x8BFB;&#x8005;&#x5E94;&#x8BE5;&#x5148;&#x53C2;&#x8003;&#x4E00;&#x4E9B;&#x5173;&#x4E8E;&#x7EBF;&#x7A0B;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5982;&quot;Introduction to Java Threads&quot;&#x6559;&#x7A0B;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x53C2;&#x8003;&#x8D44;&#x6599;&#xFF09;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x4E2A;&#x5C0F;&#x8282;&#x5C06;&#x7814;&#x7A76; java.util.concurrent &#x4E2D;&#x7684;&#x9AD8;&#x7EA7;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B; — &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x96C6;&#x5408;&#x3001;&#x7EBF;&#x7A0B;&#x6C60;&#x3001;&#x4FE1;&#x53F7;&#x548C;&#x540C;&#x6B65;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6700;&#x540E;&#x4E00;&#x5C0F;&#x8282;&#x5C06;&#x4ECB;&#x7ECD; java.util.concurrent &#x4E2D;&#x7684;&#x4F4E;&#x7EA7;&#x5E76;&#x53D1;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x6027;&#x80FD;&#x6D4B;&#x8BC4;&#x6765;&#x663E;&#x793A;&#x65B0; java.util.concurrent &#x7C7B;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7684;&#x6539;&#x8FDB;&#x3002;</p>
<p> &#x4EC0;&#x4E48;&#x662F;&#x7EBF;&#x7A0B;&#xFF1F;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6240;&#x6709;&#x91CD;&#x8981;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90FD;&#x652F;&#x6301;&#x8FDB;&#x7A0B;&#x7684;&#x6982;&#x5FF5; — &#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x5728;&#x67D0;&#x79CD;&#x7A0B;&#x5EA6;&#x4E0A;&#x76F8;&#x4E92;&#x9694;&#x79BB;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x7EBF;&#x7A0B;&#x6709;&#x65F6;&#x79F0;&#x4E3A; &#x8F7B;&#x91CF;&#x7EA7;&#x8FDB;&#x7A0B;&#x3002;&#x4E0E;&#x8FDB;&#x7A0B;&#x4E00;&#x6837;&#xFF0C;&#x5B83;&#x4EEC;&#x62E5;&#x6709;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x72EC;&#x7ACB;&#x7684;&#x5E76;&#x53D1;&#x8DEF;&#x5F84;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x79F0;&#x4E3A;&#x5806;&#x6808;&#x548C;&#x672C;&#x5730;&#x53D8;&#x91CF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x7EBF;&#x7A0B;&#x5B58;&#x5728;&#x4E8E;&#x8FDB;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;&#x540C;&#x4E00;&#x8FDB;&#x7A0B;&#x5185;&#x7684;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x3001;&#x6587;&#x4EF6;&#x53E5;&#x67C4;&#x4EE5;&#x53CA;&#x6BCF;&#x8FDB;&#x7A0B;&#x72B6;&#x6001;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4ECA;&#x5929;&#xFF0C;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x90FD;&#x652F;&#x6301;&#x7EBF;&#x7A0B;&#xFF0C;&#x5141;&#x8BB8;&#x6267;&#x884C;&#x591A;&#x4E2A;&#x53EF;&#x72EC;&#x7ACB;&#x8C03;&#x5EA6;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x4FBF;&#x5171;&#x5B58;&#x4E8E;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x7A7A;&#x95F4;&#x4E2D;&#x6267;&#x884C;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x76F8;&#x540C;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x4EEC;&#x4ECE;&#x540C;&#x4E00;&#x5806;&#x6808;&#x4E2D;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4F7F;&#x7EBF;&#x7A0B;&#x66F4;&#x6613;&#x4E8E;&#x4E0E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x4E5F;&#x610F;&#x5473;&#x7740;&#x60A8;&#x5FC5;&#x987B;&#x786E;&#x4FDD;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x4E0D;&#x76F8;&#x4E92;&#x5E72;&#x6D89;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6B63;&#x786E;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x7EBF;&#x7A0B;&#x80FD;&#x5E26;&#x6765;&#x8BF8;&#x591A;&#x597D;&#x5904;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x66F4;&#x597D;&#x7684;&#x8D44;&#x6E90;&#x5229;&#x7528;&#x3001;&#x7B80;&#x5316;&#x5F00;&#x53D1;&#x3001;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x3001;&#x66F4;&#x6613;&#x54CD;&#x5E94;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x4EE5;&#x53CA;&#x80FD;&#x6267;&#x884C;&#x5F02;&#x6B65;&#x5904;&#x7406;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Java &#x8BED;&#x8A00;&#x5305;&#x62EC;&#x7528;&#x4E8E;&#x534F;&#x8C03;&#x7EBF;&#x7A0B;&#x884C;&#x4E3A;&#x7684;&#x539F;&#x8BED;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x8FDD;&#x53CD;&#x8BBE;&#x8BA1;&#x539F;&#x578B;&#x6216;&#x8005;&#x4E0D;&#x7834;&#x574F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5B89;&#x5168;&#x5730;&#x8BBF;&#x95EE;&#x548C;&#x4FEE;&#x6539;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x3002;</p>
<p> &#x7EBF;&#x7A0B;&#x6709;&#x54EA;&#x4E9B;&#x529F;&#x80FD;&#xFF1F;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5728; Java &#x7A0B;&#x5E8F;&#x4E2D;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x7406;&#x7531;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x7BA1;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x77E5;&#x9053;&#x7EBF;&#x7A0B;&#x4E0E;&#x5426;&#xFF0C;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A; Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x3002;&#x8BB8;&#x591A; J2SE &#x548C; J2EE &#x5DE5;&#x5177;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#xFF0C;&#x5982; RMI&#x3001;Servlet&#x3001;Enterprise JavaBeans &#x7EC4;&#x4EF6;&#x548C; Swing GUI &#x5DE5;&#x5177;&#x5305;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x7684;&#x7406;&#x7531;&#x5305;&#x62EC;&#xFF1A;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#x2022; &#x66F4;&#x6613;&#x54CD;&#x5E94;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x3002;&#xA0; &#x4E8B;&#x4EF6;&#x9A71;&#x52A8;&#x7684; GUI &#x5DE5;&#x5177;&#x5305;&#xFF08;&#x5982; AWT &#x6216; Swing&#xFF09;&#x4F7F;&#x7528;&#x5355;&#x72EC;&#x7684;&#x4E8B;&#x4EF6;&#x7EBF;&#x7A0B;&#x6765;&#x5904;&#x7406; GUI &#x4E8B;&#x4EF6;&#x3002;&#x4ECE;&#x4E8B;&#x4EF6;&#x7EBF;&#x7A0B;&#x4E2D;&#x8C03;&#x7528;&#x901A;&#x8FC7; GUI &#x5BF9;&#x8C61;&#x6CE8;&#x518C;&#x7684;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x4E8B;&#x4EF6;&#x76D1;&#x542C;&#x5668;&#x5C06;&#x6267;&#x884C;&#x5197;&#x957F;&#x7684;&#x4EFB;&#x52A1;&#xFF08;&#x5982;&#x6587;&#x6863;&#x62FC;&#x5199;&#x68C0;&#x67E5;&#xFF09;&#xFF0C;&#x90A3;&#x4E48; UI &#x5C06;&#x51FA;&#x73B0;&#x51BB;&#x7ED3;&#xFF0C;&#x56E0;&#x4E3A;&#x4E8B;&#x4EF6;&#x7EBF;&#x7A0B;&#x76F4;&#x5230;&#x5197;&#x957F;&#x4EFB;&#x52A1;&#x5B8C;&#x6BD5;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x5904;&#x7406;&#x5176;&#x4ED6;&#x4E8B;&#x4EF6;&#x3002;&#x901A;&#x8FC7;&#x5728;&#x5355;&#x72EC;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x5197;&#x957F;&#x64CD;&#x4F5C;&#xFF0C;&#x5F53;&#x6267;&#x884C;&#x5197;&#x957F;&#x540E;&#x53F0;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;UI &#x80FD;&#x7EE7;&#x7EED;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#x2022; &#x4F7F;&#x7528;&#x591A;&#x5904;&#x7406;&#x5668;&#x3002; &#xA0;&#x591A;&#x5904;&#x7406;&#x5668;&#xFF08;MP&#xFF09;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x4FBF;&#x5B9C;&#xFF0C;&#x5E76;&#x4E14;&#x5206;&#x5E03;&#x8D8A;&#x6765;&#x8D8A;&#x5E7F;&#x6CDB;&#x3002;&#x56E0;&#x4E3A;&#x8C03;&#x5EA6;&#x7684;&#x57FA;&#x672C;&#x5355;&#x4F4D;&#x901A;&#x5E38;&#x662F;&#x7EBF;&#x7A0B;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x7BA1;&#x6709;&#x591A;&#x5C11;&#x5904;&#x7406;&#x5668;&#x53EF;&#x7528;&#xFF0C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x66F4;&#x597D;&#x5730;&#x5229;&#x7528;&#x53EF;&#x7528;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8D44;&#x6E90;&#xFF0C;&#x591A;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x548C;&#x6027;&#x80FD;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#x2022; &#x7B80;&#x5316;&#x5EFA;&#x6A21;&#x3002; &#xA0;&#x6709;&#x6548;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x80FD;&#x591F;&#x4F7F;&#x7A0B;&#x5E8F;&#x7F16;&#x5199;&#x53D8;&#x5F97;&#x66F4;&#x7B80;&#x5355;&#xFF0C;&#x5E76;&#x6613;&#x4E8E;&#x7EF4;&#x62A4;&#x3002;&#x901A;&#x8FC7;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E2A;&#x522B;&#x7C7B;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x4E00;&#x4E9B;&#x8C03;&#x5EA6;&#x7684;&#x8BE6;&#x7EC6;&#x3001;&#x4EA4;&#x53C9;&#x5B58;&#x53D6;&#x64CD;&#x4F5C;&#x3001;&#x5F02;&#x6B65; IO &#x548C;&#x8D44;&#x6E90;&#x7B49;&#x5F85;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x95EE;&#x9898;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x4EEC;&#x80FD;&#x4E13;&#x6CE8;&#x4E8E;&#x57DF;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x7B80;&#x5316;&#x5F00;&#x53D1;&#x5E76;&#x6539;&#x8FDB;&#x53EF;&#x9760;&#x6027;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#x2022; &#x5F02;&#x6B65;&#x6216;&#x540E;&#x53F0;&#x5904;&#x7406;&#x3002; &#xA0;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x540C;&#x65F6;&#x670D;&#x52A1;&#x4E8E;&#x8BB8;&#x591A;&#x8FDC;&#x7A0B;&#x5BA2;&#x6237;&#x673A;&#x3002;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4ECE; socket &#x4E2D;&#x8BFB;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x8BFB;&#x53D6;&#xFF0C;&#x90A3;&#x4E48;&#x5BF9; read() &#x7684;&#x8C03;&#x7528;&#x5C06;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x6570;&#x636E;&#x53EF;&#x8BFB;&#x3002;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F53;&#x67D0;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x4E0D;&#x4EC5;&#x5904;&#x7406;&#x76F8;&#x5E94;&#x8BF7;&#x6C42;&#x8981;&#x5EF6;&#x8FDF;&#xFF0C;&#x800C;&#x4E14;&#x5904;&#x7406;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x4E5F;&#x5C06;&#x5EF6;&#x8FDF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x6BCF;&#x4E2A; socket &#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684; IO &#x7EBF;&#x7A0B;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x88AB;&#x963B;&#x585E;&#x65F6;&#xFF0C;&#x5BF9;&#x5176;&#x4ED6;&#x5E76;&#x53D1;&#x8BF7;&#x6C42;&#x884C;&#x4E3A;&#x6CA1;&#x6709;&#x5F71;&#x54CD;&#x3002;</p>
<p> &#x7EBF;&#x7A0B;&#x5B89;&#x5168;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x5C06;&#x8FD9;&#x4E9B;&#x7C7B;&#x7528;&#x4E8E;&#x591A;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x867D;&#x7136;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x7C7B;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6BD4;&#x8F83;&#x56F0;&#x96BE;&#xFF0C;&#x4F46;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x5374;&#x662F;&#x5FC5;&#x9700;&#x7684;&#x3002;java.util.concurrent &#x89C4;&#x8303;&#x8FDB;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x4E00;&#x7EC4;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x5E76;&#x53D1;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x80FD;&#x591F;&#x51CF;&#x8F7B;&#x4E00;&#x4E9B;&#x7F16;&#x5199;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7C7B;&#x7684;&#x8D1F;&#x62C5;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7C7B;&#x975E;&#x5E38;&#x96BE;&#x4EE5;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x5B9A;&#x4E49;&#x4F3C;&#x4E4E;&#x90FD;&#x662F;&#x5B8C;&#x5168;&#x5FAA;&#x73AF;&#x7684;&#x3002;&#x5FEB;&#x901F; Google &#x641C;&#x7D22;&#x4F1A;&#x663E;&#x793A;&#x4E0B;&#x5217;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x4EE3;&#x7801;&#x5B9A;&#x4E49;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#xFF08;&#x6216;&#x8005;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#x662F;&#x63CF;&#x8FF0;&#xFF09;&#x901A;&#x5E38;&#x6CA1;&#x4EC0;&#x4E48;&#x5E2E;&#x52A9;&#xFF1A;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; . . . can be called from multiple programming threads without unwanted interaction between the threads.</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; . . . may be called by more than on thread at a time without requiring any other action on the caller&apos;s part.</p>
<p>&#xA0;&#xA0;&#xA0; &#x901A;&#x8FC7;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x7684;&#x5B9A;&#x4E49;&#xFF0C;&#x4E0D;&#x5947;&#x602A;&#x6211;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x5982;&#x6B64;&#x8FF7;&#x60D1;&#x3002;&#x8FD9;&#x4E9B;&#x5B9A;&#x4E49;&#x51E0;&#x4E4E;&#x5C31;&#x662F;&#x5728;&#x8BF4;&quot;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x4ECE;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x8C03;&#x7528;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x7C7B;&#x5C31;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&quot;&#x3002;&#x8FD9;&#x5F53;&#x7136;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x5BF9;&#x6211;&#x4EEC;&#x533A;&#x522B;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7C7B;&#x548C;&#x4E0D;&#x5B89;&#x5168;&#x7C7B;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x5E2E;&#x52A9;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&quot;&#x5B89;&#x5168;&quot;&#x662F;&#x4E3A;&#x4E86;&#x8BF4;&#x660E;&#x4EC0;&#x4E48;&#xFF1F;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8981;&#x6210;&#x4E3A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#xFF0C;&#x9996;&#x5148;&#x5B83;&#x5FC5;&#x987B;&#x5728;&#x5355;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x4E2D;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#x3002;&#x5982;&#x679C;&#x6B63;&#x786E;&#x5B9E;&#x73B0;&#x4E86;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x8BF4;&#x660E;&#x5B83;&#x7B26;&#x5408;&#x89C4;&#x8303;&#xFF0C;&#x5BF9;&#x8BE5;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x4EFB;&#x4F55;&#x987A;&#x5E8F;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x516C;&#x5171;&#x5B57;&#x6BB5;&#x7684;&#x8BFB;&#x5199;&#x3001;&#x516C;&#x5171;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#xFF09;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x5BF9;&#x8C61;&#x5904;&#x4E8E;&#x65E0;&#x6548;&#x72B6;&#x6001;&#xFF1B;&#x89C2;&#x5BDF;&#x5C06;&#x5904;&#x4E8E;&#x65E0;&#x6548;&#x72B6;&#x6001;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#x6216;&#x8FDD;&#x53CD;&#x7C7B;&#x7684;&#x4EFB;&#x4F55;&#x53D8;&#x91CF;&#x3001;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#x6216;&#x540E;&#x7F6E;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x800C;&#x4E14;&#xFF0C;&#x8981;&#x6210;&#x4E3A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#xFF0C;&#x5728;&#x4ECE;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x7EE7;&#x7EED;&#x6B63;&#x786E;&#x8FD0;&#x884C;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#x6267;&#x884C;&#x90A3;&#x4E9B;&#x7EBF;&#x7A0B;&#x7684;&#x8C03;&#x5EA6;&#x548C;&#x4EA4;&#x53C9;&#xFF0C;&#x4E14;&#x65E0;&#x9700;&#x5BF9;&#x90E8;&#x5206;&#x8C03;&#x7528;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x540C;&#x6B65;&#x3002;&#x7ED3;&#x679C;&#x662F;&#x5BF9;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x5BF9;&#x8C61;&#x7684;&#x64CD;&#x4F5C;&#x5C06;&#x7528;&#x4E8E;&#x6309;&#x56FA;&#x5B9A;&#x7684;&#x6574;&#x4F53;&#x4E00;&#x81F4;&#x987A;&#x5E8F;&#x51FA;&#x73B0;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x67D0;&#x79CD;&#x660E;&#x786E;&#x534F;&#x8C03;&#xFF0C;&#x6BD4;&#x5982;&#x9501;&#x5B9A;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x5728;&#x9700;&#x8981;&#x65F6;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x4EA4;&#x53C9;&#x64CD;&#x4F5C;&#x6267;&#x884C;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5728; JDK 5.0 &#x4E4B;&#x524D;&#xFF0C;&#x786E;&#x4FDD;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4E3B;&#x8981;&#x673A;&#x5236;&#x662F; synchronized &#x539F;&#x8BED;&#x3002;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#xFF08;&#x90A3;&#x4E9B;&#x53EF;&#x4EE5;&#x7531;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#x7684;&#x53D8;&#x91CF;&#xFF09;&#x7684;&#x7EBF;&#x7A0B;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x6765;&#x534F;&#x8C03;&#x5BF9;&#x5171;&#x4EAB;&#x53D8;&#x91CF;&#x7684;&#x8BFB;&#x5199;&#x8BBF;&#x95EE;&#x3002;java.util.concurrent &#x5305;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x5907;&#x7528;&#x5E76;&#x53D1;&#x539F;&#x8BED;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x7EC4;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x540C;&#x6B65;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x7C7B;&#x3002;</p>
<p> &#x4EE4;&#x4EBA;&#x538C;&#x70E6;&#x7684;&#x5E76;&#x53D1;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5373;&#x4F7F;&#x60A8;&#x7684;&#x7A0B;&#x5E8F;&#x4ECE;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x8BB8;&#x591A;&#x5DE5;&#x5177;&#x6216;&#x6846;&#x67B6;&#x4EE3;&#x8868;&#x60A8;&#x521B;&#x5EFA;&#x4E86;&#x7EBF;&#x7A0B;&#xFF0C;&#x8FD9;&#x65F6;&#x8981;&#x6C42;&#x4ECE;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;&#x7684;&#x7C7B;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;&#x8FD9;&#x6837;&#x4F1A;&#x5BF9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5E26;&#x6765;&#x8F83;&#x5927;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x73B0;&#x8D1F;&#x62C5;&#xFF0C;&#x56E0;&#x4E3A;&#x5F00;&#x53D1;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7C7B;&#x6BD4;&#x5F00;&#x53D1;&#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7C7B;&#x6709;&#x66F4;&#x591A;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x4E8B;&#x9879;&#xFF0C;&#x4E14;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x5206;&#x6790;&#x3002;</p>
<p> AWT&#xA0;&#x548C; Swing</p>
<p>&#xA0;&#xA0;&#xA0; &#x8FD9;&#x4E9B; GUI &#x5DE5;&#x5177;&#x5305;&#x521B;&#x5EFA;&#x4E86;&#x79F0;&#x4E3A;&#x65F6;&#x95F4;&#x7EBF;&#x7A0B;&#x7684;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5C06;&#x4ECE;&#x8BE5;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;&#x901A;&#x8FC7; GUI &#x7EC4;&#x4EF6;&#x6CE8;&#x518C;&#x7684;&#x76D1;&#x542C;&#x5668;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B9E;&#x73B0;&#x8FD9;&#x4E9B;&#x76D1;&#x542C;&#x5668;&#x7684;&#x7C7B;&#x5FC5;&#x987B;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p> TimerTask</p>
<p>&#xA0;&#xA0;&#xA0; JDK 1.3 &#x4E2D;&#x5F15;&#x5165;&#x7684; TimerTask &#x5DE5;&#x5177;&#x5141;&#x8BB8;&#x7A0D;&#x540E;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x6216;&#x8BA1;&#x5212;&#x5B9A;&#x671F;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;&#x5728; Timer &#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C; TimerTask &#x4E8B;&#x4EF6;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F5C;&#x4E3A; TimerTask &#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p> Servlet&#xA0;&#x548C; JavaServer Page &#x6280;&#x672F;</p>
<p>&#xA0;&#xA0;&#xA0; Servlet &#x5BB9;&#x5668;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5728;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x540C;&#x65F6;&#x8C03;&#x7528;&#x7ED9;&#x5B9A; servlet&#xFF0C;&#x4ECE;&#x800C;&#x8FDB;&#x884C;&#x591A;&#x4E2A;&#x8BF7;&#x6C42;&#x3002;&#x56E0;&#x6B64; servlet &#x7C7B;&#x5FC5;&#x987B;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p> RMI</p>
<p>&#xA0;&#xA0;&#xA0; &#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#xFF08;remote method invocation&#xFF0C;RMI&#xFF09;&#x5DE5;&#x5177;&#x5141;&#x8BB8;&#x8C03;&#x7528;&#x5176;&#x4ED6; JVM &#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5B9E;&#x73B0;&#x8FDC;&#x7A0B;&#x5BF9;&#x8C61;&#x6700;&#x666E;&#x904D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x6269;&#x5C55; UnicastRemoteObject&#x3002;&#x4F8B;&#x793A; UnicastRemoteObject &#x65F6;&#xFF0C;&#x5B83;&#x662F;&#x901A;&#x8FC7; RMI &#x8C03;&#x5EA6;&#x5668;&#x6CE8;&#x518C;&#x7684;&#xFF0C;&#x8BE5;&#x8C03;&#x5EA6;&#x5668;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5C06;&#x5728;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x8FDC;&#x7A0B;&#x65B9;&#x6CD5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FDC;&#x7A0B;&#x7C7B;&#x5FC5;&#x987B;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6B63;&#x5982;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x4F1A;&#x53D1;&#x751F;&#x8BB8;&#x591A;&#x53EF;&#x80FD;&#x4F1A;&#x4ECE;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8C03;&#x7528;&#x7C7B;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;java.util.concurrent &#x4E2D;&#x7684;&#x7C7B;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x7B80;&#x5316;&#x7F16;&#x5199;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7C7B;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p> &#x4F8B;&#x5B50; — &#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168; servlet</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0B;&#x5217; servlet &#x770B;&#x8D77;&#x6765;&#x50CF;&#x65E0;&#x5BB3;&#x7684;&#x7559;&#x8A00;&#x677F; servlet&#xFF0C;&#x5B83;&#x4FDD;&#x5B58;&#x6BCF;&#x4E2A;&#x6765;&#x8BBF;&#x8005;&#x7684;&#x59D3;&#x540D;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BE5; servlet &#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A; servlet &#x5E94;&#x8BE5;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#x5B83;&#x4F7F;&#x7528; HashSet &#x5B58;&#x50A8;&#x6765;&#x8BBF;&#x8005;&#x7684;&#x59D3;&#x540D;&#xFF0C;HashSet &#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5F53;&#x6211;&#x4EEC;&#x8BF4;&#x8FD9;&#x4E2A; servlet &#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x65F6;&#xFF0C;&#x662F;&#x8BF4;&#x5B83;&#x6240;&#x9020;&#x6210;&#x7684;&#x7834;&#x574F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E22;&#x5931;&#x7559;&#x8A00;&#x677F;&#x8F93;&#x5165;&#x3002;&#x5728;&#x6700;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7559;&#x8A00;&#x677F;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x90FD;&#x53EF;&#x80FD;&#x88AB;&#x7834;&#x574F;&#x5E76;&#x4E14;&#x65E0;&#x6CD5;&#x6062;&#x590D;&#x3002;</p>
<p>public class UnsafeGuestbookServlet extends HttpServlet {</p>
<p>&#xA0;&#xA0;&#xA0; private Set visitorSet = new HashSet();</p>
<p>&#xA0;&#xA0;&#xA0; protected void doGet(HttpServletRequest httpServletRequest,</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; HttpServletResponse httpServletResponse) throws ServletException, IOException {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; String visitorName = httpServletRequest.getParameter(&quot;NAME&quot;);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; if (visitorName != null)</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; visitorSet.add(visitorName);</p>
<p>&#xA0;&#xA0;&#xA0; }</p>
<p>}</p>
<p>&#xA0;&#xA0;&#xA0; &#x901A;&#x8FC7;&#x5C06; visitorSet &#x7684;&#x5B9A;&#x4E49;&#x66F4;&#x6539;&#x4E3A;&#x4E0B;&#x5217;&#x4EE3;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x8BE5;&#x7C7B;&#x53D8;&#x4E3A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF1A;</p>
<p>&#xA0;&#xA0;&#xA0; private Set visitorSet = Collections.synchronizedSet(new HashSet());</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x4E0A;&#x6240;&#x793A;&#x7684;&#x4F8B;&#x5B50;&#x663E;&#x793A;&#x7EBF;&#x7A0B;&#x7684;&#x5185;&#x7F6E;&#x652F;&#x6301;&#x662F;&#x4E00;&#x628A;&#x53CC;&#x5203;&#x5251; — &#x867D;&#x7136;&#x5B83;&#x4F7F;&#x6784;&#x5EFA;&#x591A;&#x7EBF;&#x7A0B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53D8;&#x5F97;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x5B83;&#x540C;&#x65F6;&#x8981;&#x6C42;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x66F4;&#x52A0;&#x6CE8;&#x610F;&#x5E76;&#x53D1;&#x95EE;&#x9898;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x4F7F;&#x7528;&#x7559;&#x8A00;&#x677F; servlet &#x8FD9;&#x6837;&#x666E;&#x901A;&#x7684;&#x4E1C;&#x897F;&#x65F6;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002;</p>
<p> &#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x96C6;&#x5408;</p>
<p>&#xA0;&#xA0;&#xA0; JDK 1.2 &#x4E2D;&#x5F15;&#x5165;&#x7684; Collection &#x6846;&#x67B6;&#x662F;&#x4E00;&#x79CD;&#x8868;&#x793A;&#x5BF9;&#x8C61;&#x96C6;&#x5408;&#x7684;&#x9AD8;&#x5EA6;&#x7075;&#x6D3B;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x63A5;&#x53E3; List&#x3001;Set &#x548C; Map&#x3002;&#x901A;&#x8FC7; JDK &#x63D0;&#x4F9B;&#x6BCF;&#x4E2A;&#x96C6;&#x5408;&#x7684;&#x591A;&#x6B21;&#x5B9E;&#x73B0;&#xFF08;HashMap&#x3001;Hashtable&#x3001;TreeMap&#x3001;WeakHashMap&#x3001;HashSet&#x3001;TreeSet&#x3001;Vector&#x3001;ArrayList&#x3001;LinkedList &#x7B49;&#x7B49;&#xFF09;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x96C6;&#x5408;&#x5DF2;&#x7ECF;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF08;Hashtable &#x548C; Vector&#xFF09;&#xFF0C;&#x901A;&#x8FC7;&#x540C;&#x6B65;&#x7684;&#x5C01;&#x88C5;&#x5DE5;&#x5382;&#xFF08;Collections.synchronizedMap()&#x3001;synchronizedList() &#x548C; synchronizedSet()&#xFF09;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x96C6;&#x5408;&#x5747;&#x53EF;&#x8868;&#x73B0;&#x4E3A;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x5305;&#x6DFB;&#x52A0;&#x4E86;&#x591A;&#x4E2A;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x96C6;&#x5408;&#x7C7B;&#xFF08;ConcurrentHashMap&#x3001;CopyOnWriteArrayList &#x548C; CopyOnWriteArraySet&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x7684;&#x76EE;&#x7684;&#x662F;&#x63D0;&#x4F9B;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x5EA6;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3001;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x57FA;&#x672C;&#x96C6;&#x5408;&#x7C7B;&#x578B;&#x7248;&#x672C;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; java.util &#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x96C6;&#x5408;&#x4ECD;&#x6709;&#x4E00;&#x4E9B;&#x7F3A;&#x70B9;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x8FED;&#x4EE3;&#x9501;&#x5B9A;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5C06;&#x8BE5;&#x9501;&#x5B9A;&#x4FDD;&#x7559;&#x5728;&#x96C6;&#x5408;&#x4E2D;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x4F1A;&#x6709;&#x629B;&#x51FA; ConcurrentModificationException &#x7684;&#x5371;&#x9669;&#x3002;&#xFF08;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x6709;&#x65F6;&#x79F0;&#x4E3A;&#x6761;&#x4EF6;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#xFF1B;&#x6709;&#x5173;&#x7684;&#x66F4;&#x591A;&#x8BF4;&#x660E;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x3002;&#xFF09;&#x6B64;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4ECE;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x9891;&#x7E41;&#x5730;&#x8BBF;&#x95EE;&#x96C6;&#x5408;&#xFF0C;&#x5219;&#x5E38;&#x5E38;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x6267;&#x884C;&#x8FD9;&#x4E9B;&#x7C7B;&#x3002;java.util.concurrent &#x4E2D;&#x7684;&#x65B0;&#x96C6;&#x5408;&#x7C7B;&#x5141;&#x8BB8;&#x901A;&#x8FC7;&#x5728;&#x8BED;&#x4E49;&#x4E2D;&#x7684;&#x5C11;&#x91CF;&#x66F4;&#x6539;&#x6765;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x5E76;&#x53D1;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; JDK 5.0 &#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;&#x65B0;&#x96C6;&#x5408;&#x63A5;&#x53E3; — Queue &#x548C; BlockingQueue&#x3002;Queue &#x63A5;&#x53E3;&#x4E0E; List &#x7C7B;&#x4F3C;&#xFF0C;&#x4F46;&#x5B83;&#x53EA;&#x5141;&#x8BB8;&#x4ECE;&#x540E;&#x9762;&#x63D2;&#x5165;&#xFF0C;&#x4ECE;&#x524D;&#x9762;&#x5220;&#x9664;&#x3002;&#x901A;&#x8FC7;&#x6D88;&#x9664; List &#x7684;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#x8981;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x6BD4;&#x73B0;&#x6709; ArrayList &#x548C; LinkedList &#x5B9E;&#x73B0;&#x6027;&#x80FD;&#x66F4;&#x597D;&#x7684; Queue &#x5B9E;&#x73B0;&#x3002;&#x56E0;&#x4E3A; List &#x7684;&#x8BB8;&#x591A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x9700;&#x8981;&#x968F;&#x673A;&#x8BBF;&#x95EE;&#xFF0C;&#x6240;&#x4EE5;Queue &#x901A;&#x5E38;&#x53EF;&#x4EE5;&#x66FF;&#x4EE3; List&#xFF0C;&#x6765;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p> &#x5F31;&#x4E00;&#x81F4;&#x7684;&#x8FED;&#x4EE3;&#x5668;</p>
<p>&#xA0;&#xA0;&#xA0; java.util &#x5305;&#x4E2D;&#x7684;&#x96C6;&#x5408;&#x7C7B;&#x90FD;&#x8FD4;&#x56DE; fail-fast &#x8FED;&#x4EE3;&#x5668;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x5047;&#x8BBE;&#x7EBF;&#x7A0B;&#x5728;&#x96C6;&#x5408;&#x5185;&#x5BB9;&#x4E2D;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x65F6;&#xFF0C;&#x96C6;&#x5408;&#x4E0D;&#x4F1A;&#x66F4;&#x6539;&#x5B83;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5982;&#x679C; fail-fast &#x8FED;&#x4EE3;&#x5668;&#x68C0;&#x6D4B;&#x5230;&#x5728;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x66F4;&#x6539;&#x64CD;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4F1A;&#x629B;&#x51FA; ConcurrentModificationException&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x63A7;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x5728;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x66F4;&#x6539;&#x96C6;&#x5408;&#x7684;&#x8981;&#x6C42;&#x901A;&#x5E38;&#x4F1A;&#x5BF9;&#x8BB8;&#x591A;&#x5E76;&#x53D1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9020;&#x6210;&#x4E0D;&#x4FBF;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6BD4;&#x8F83;&#x597D;&#x7684;&#x662F;&#x5B83;&#x5141;&#x8BB8;&#x5E76;&#x53D1;&#x4FEE;&#x6539;&#x5E76;&#x786E;&#x4FDD;&#x8FED;&#x4EE3;&#x5668;&#x53EA;&#x8981;&#x8FDB;&#x884C;&#x5408;&#x7406;&#x64CD;&#x4F5C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x96C6;&#x5408;&#x7684;&#x4E00;&#x81F4;&#x89C6;&#x56FE;&#xFF0C;&#x5982; java.util.concurrent &#x96C6;&#x5408;&#x7C7B;&#x4E2D;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x6240;&#x505A;&#x7684;&#x90A3;&#x6837;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x96C6;&#x5408;&#x8FD4;&#x56DE;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x79F0;&#x4E3A;&#x5F31;&#x4E00;&#x81F4;&#x7684;&#xFF08;weakly consistent&#xFF09;&#x8FED;&#x4EE3;&#x5668;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E9B;&#x7C7B;&#xFF0C;&#x5982;&#x679C;&#x5143;&#x7D20;&#x81EA;&#x4ECE;&#x8FED;&#x4EE3;&#x5F00;&#x59CB;&#x5DF2;&#x7ECF;&#x5220;&#x9664;&#xFF0C;&#x4E14;&#x5C1A;&#x672A;&#x7531; next() &#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x4E0D;&#x8FD4;&#x56DE;&#x5230;&#x8C03;&#x7528;&#x8005;&#x3002;&#x5982;&#x679C;&#x5143;&#x7D20;&#x81EA;&#x8FED;&#x4EE3;&#x5F00;&#x59CB;&#x5DF2;&#x7ECF;&#x6DFB;&#x52A0;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x53EF;&#x80FD;&#x8FD4;&#x56DE;&#x8C03;&#x7528;&#x8005;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4E0D;&#x8FD4;&#x56DE;&#x3002;&#x5728;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#x4E2D;&#xFF0C;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x66F4;&#x6539;&#x5E95;&#x5C42;&#x96C6;&#x5408;&#xFF0C;&#x5143;&#x7D20;&#x4E0D;&#x4F1A;&#x88AB;&#x8FD4;&#x56DE;&#x4E24;&#x6B21;&#x3002;</p>
<p> CopyOnWriteArrayList&#xA0;&#x548C; CopyOnWriteArraySet</p>
<p>&#xA0;&#xA0;&#xA0; &#x53EF;&#x4EE5;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x652F;&#x6301;&#x6570;&#x636E;&#x7684; List — Vector &#x6216;&#x5C01;&#x88C5; ArrayList &#x548C; Collections.synchronizedList()&#x3002;java.util.concurrent &#x5305;&#x6DFB;&#x52A0;&#x4E86;&#x540D;&#x79F0;&#x7E41;&#x7410;&#x7684; CopyOnWriteArrayList&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;List&#x7C7B;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;Vector&#x8FD8;&#x4E0D;&#x591F;&#xFF1F;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6700;&#x7B80;&#x5355;&#x7684;&#x7B54;&#x6848;&#x662F;&#x4E0E;&#x8FED;&#x4EE3;&#x548C;&#x5E76;&#x53D1;&#x4FEE;&#x6539;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x4E92;&#x6709;&#x5173;&#x3002;&#x4F7F;&#x7528; Vector &#x6216;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x7684; List &#x5C01;&#x88C5;&#x5668;&#xFF0C;&#x8FD4;&#x56DE;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x662F; fail-fast &#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x5728;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539; List&#xFF0C;&#x8FED;&#x4EE3;&#x53EF;&#x80FD;&#x5931;&#x8D25;&#x3002;</p>
<p>Vector &#x7684;&#x975E;&#x5E38;&#x666E;&#x904D;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5B58;&#x50A8;&#x901A;&#x8FC7;&#x7EC4;&#x4EF6;&#x6CE8;&#x518C;&#x7684;&#x76D1;&#x542C;&#x5668;&#x7684;&#x5217;&#x8868;&#x3002;&#x5F53;&#x53D1;&#x751F;&#x9002;&#x5408;&#x7684;&#x4E8B;&#x4EF6;&#x65F6;&#xFF0C;&#x8BE5;&#x7EC4;&#x4EF6;&#x5C06;&#x5728;&#x76D1;&#x542C;&#x5668;&#x7684;&#x5217;&#x8868;&#x4E2D;&#x8FED;&#x4EE3;&#xFF0C;&#x8C03;&#x7528;&#x6BCF;&#x4E2A;&#x76D1;&#x542C;&#x5668;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62; ConcurrentModificationException&#xFF0C;&#x8FED;&#x4EE3;&#x7EBF;&#x7A0B;&#x5FC5;&#x987B;&#x590D;&#x5236;&#x5217;&#x8868;&#x6216;&#x9501;&#x5B9A;&#x5217;&#x8868;&#xFF0C;&#x4EE5;&#x4FBF;&#x8FDB;&#x884C;&#x6574;&#x4F53;&#x8FED;&#x4EE3;&#xFF0C;&#x800C;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x90FD;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x6027;&#x80FD;&#x6210;&#x672C;&#x3002;</p>
<p>CopyOnWriteArrayList &#x7C7B;&#x901A;&#x8FC7;&#x6BCF;&#x6B21;&#x6DFB;&#x52A0;&#x6216;&#x5220;&#x9664;&#x5143;&#x7D20;&#x65F6;&#x521B;&#x5EFA;&#x652F;&#x6301;&#x6570;&#x7EC4;&#x7684;&#x65B0;&#x526F;&#x672C;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FDB;&#x884C;&#x4E2D;&#x7684;&#x8FED;&#x4EE3;&#x4FDD;&#x6301;&#x5BF9;&#x521B;&#x5EFA;&#x8FED;&#x4EE3;&#x5668;&#x65F6;&#x7684;&#x5F53;&#x524D;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x867D;&#x7136;&#x590D;&#x5236;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x6210;&#x672C;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8BB8;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FED;&#x4EE3;&#x8981;&#x6BD4;&#x4FEE;&#x6539;&#x591A;&#x5F97;&#x591A;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5199;&#x5165;&#x65F6;&#x590D;&#x5236;&#x8981;&#x6BD4;&#x5176;&#x4ED6;&#x5907;&#x7528;&#x65B9;&#x6CD5;&#x5177;&#x6709;&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x548C;&#x5E76;&#x53D1;&#x6027;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981; Set &#x8BED;&#x4E49;&#xFF0C;&#x800C;&#x4E0D;&#x662F; List&#xFF0C;&#x90A3;&#x4E48;&#x8FD8;&#x6709;&#x4E00;&#x4E2A; Set &#x7248;&#x672C; — CopyOnWriteArraySet&#x3002;</p>
<p> ConcurrentHashMap</p>
<p>&#xA0;&#xA0;&#xA0; &#x6B63;&#x5982;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684; List &#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x7528;&#x591A;&#x79CD;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3001;&#x57FA;&#x4E8E; hash &#x7684; Map — Hashtable&#xFF0C;&#x5E76;&#x4F7F;&#x7528; Collections.synchronizedMap() &#x5C01;&#x88C5; HashMap&#x3002;JDK 5.0 &#x6DFB;&#x52A0;&#x4E86; ConcurrentHashMap &#x5B9E;&#x73B0;&#xFF0C;&#x8BE5;&#x5B9E;&#x73B0;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x57FA;&#x672C;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684; Map &#x529F;&#x80FD;&#xFF0C;&#x4F46;&#x5B83;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x5E76;&#x53D1;&#x6027;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Hashtable &#x548C; synchronizedMap &#x6240;&#x91C7;&#x53D6;&#x7684;&#x83B7;&#x5F97;&#x540C;&#x6B65;&#x7684;&#x7B80;&#x5355;&#x65B9;&#x6CD5;&#xFF08;&#x540C;&#x6B65; Hashtable &#x4E2D;&#x6216;&#x8005;&#x540C;&#x6B65;&#x7684; Map &#x5C01;&#x88C5;&#x5668;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#xFF09;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x4E0D;&#x8DB3;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5BF9;&#x4E8E;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x662F;&#x4E00;&#x79CD;&#x969C;&#x788D;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE; hash &#x8868;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8FD9;&#x6837;&#x4ECD;&#x4E0D;&#x8DB3;&#x4EE5;&#x63D0;&#x4F9B;&#x771F;&#x6B63;&#x7684;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x8BB8;&#x591A;&#x516C;&#x7528;&#x7684;&#x6DF7;&#x5408;&#x64CD;&#x4F5C;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x989D;&#x5916;&#x7684;&#x540C;&#x6B65;&#x3002;&#x867D;&#x7136;&#x8BF8;&#x5982; get() &#x548C; put() &#x4E4B;&#x7C7B;&#x7684;&#x7B80;&#x5355;&#x64CD;&#x4F5C;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x989D;&#x5916;&#x540C;&#x6B65;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B89;&#x5168;&#x5730;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x6709;&#x4E00;&#x4E9B;&#x516C;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x5E8F;&#x5217;&#xFF0C;&#x4F8B;&#x5982;&#x8FED;&#x4EE3;&#x6216;&#x8005; put-if-absent&#xFF08;&#x7A7A;&#x5219;&#x653E;&#x5165;&#xFF09;&#xFF0C;&#x9700;&#x8981;&#x5916;&#x90E8;&#x7684;&#x540C;&#x6B65;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x6570;&#x636E;&#x4E89;&#x7528;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Hashtable &#x548C; Collections.synchronizedMap &#x901A;&#x8FC7;&#x540C;&#x6B65;&#x6BCF;&#x4E2A;&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4E00;&#x4E2A; Map &#x65B9;&#x6CD5;&#x65F6;&#xFF0C;&#x65E0;&#x8BBA;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x8981;&#x5BF9; Map &#x8FDB;&#x884C;&#x4EC0;&#x4E48;&#x6837;&#x64CD;&#x4F5C;&#xFF0C;&#x90FD;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x624D;&#x53EF;&#x4EE5;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5BF9;&#x6BD4;&#x6765;&#x8BF4;&#xFF0C;ConcurrentHashMap &#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x8BFB;&#x53D6;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x8BFB;&#x548C;&#x5199;&#x64CD;&#x4F5C;&#x901A;&#x5E38;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x591A;&#x4E2A;&#x540C;&#x65F6;&#x5199;&#x5165;&#x7ECF;&#x5E38;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;&#x7ED3;&#x679C;&#x662F;&#x5F53;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x540C;&#x4E00; Map &#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;ConcurrentHashMap &#x662F; Hashtable&#x6216; Collections.synchronizedMap(new HashMap()) &#x7684;&#x7B80;&#x5355;&#x66FF;&#x6362;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x4E0D;&#x540C;&#xFF0C;&#x5373; ConcurrentHashMap &#x5B9E;&#x4F8B;&#x4E2D;&#x7684;&#x540C;&#x6B65;&#x4E0D;&#x9501;&#x5B9A;&#x6620;&#x5C04;&#x8FDB;&#x884C;&#x72EC;&#x5360;&#x4F7F;&#x7528;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x9501;&#x5B9A; ConcurrentHashMap &#x8FDB;&#x884C;&#x72EC;&#x5360;&#x4F7F;&#x7528;&#xFF0C;&#x5B83;&#x88AB;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x96C6;&#x5408;&#x4E0D;&#x88AB;&#x9501;&#x5B9A;&#x8FDB;&#x884C;&#x72EC;&#x5360;&#x4F7F;&#x7528;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x516C;&#x7528;&#x7684;&#x6DF7;&#x5408;&#x64CD;&#x4F5C;&#x7684;&#x5176;&#x4ED6;&#xFF08;&#x539F;&#x5B50;&#xFF09;&#x65B9;&#x6CD5;&#xFF0C;&#x5982; put-if-absent&#x3002;ConcurrentHashMap &#x8FD4;&#x56DE;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x662F;&#x5F31;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x5C06;&#x4E0D;&#x629B;&#x51FA;ConcurrentModificationException &#xFF0C;&#x5C06;&#x8FDB;&#x884C;&quot;&#x5408;&#x7406;&#x64CD;&#x4F5C;&quot;&#x6765;&#x53CD;&#x6620;&#x8FED;&#x4EE3;&#x8FC7;&#x7A0B;&#x4E2D;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5BF9; Map &#x7684;&#x4FEE;&#x6539;&#x3002;</p>
<p> &#x961F;&#x5217;</p>
<p>&#xA0;&#xA0;&#xA0; &#x539F;&#x59CB;&#x96C6;&#x5408;&#x6846;&#x67B6;&#x5305;&#x542B;&#x4E09;&#x4E2A;&#x63A5;&#x53E3;&#xFF1A;List&#x3001;Map &#x548C; Set&#x3002;List &#x63CF;&#x8FF0;&#x4E86;&#x5143;&#x7D20;&#x7684;&#x6709;&#x5E8F;&#x96C6;&#x5408;&#xFF0C;&#x652F;&#x6301;&#x5B8C;&#x5168;&#x968F;&#x5373;&#x8BBF;&#x95EE; — &#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x4F4D;&#x7F6E;&#x6DFB;&#x52A0;&#x3001;&#x63D0;&#x53D6;&#x6216;&#x5220;&#x9664;&#x5143;&#x7D20;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; LinkedList &#x7C7B;&#x7ECF;&#x5E38;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5DE5;&#x4F5C;&#x5143;&#x7D20;&#xFF08;&#x7B49;&#x5F85;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#xFF09;&#x7684;&#x5217;&#x8868;&#x6216;&#x961F;&#x5217;&#x3002;&#x7136;&#x800C;&#xFF0C;List &#x63D0;&#x4F9B;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x6BD4;&#x8BE5;&#x516C;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x8981;&#x7684;&#x591A;&#x5F97;&#x591A;&#xFF0C;&#x8FD9;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x5728;&#x540E;&#x9762;&#x63D2;&#x5165;&#x5143;&#x7D20;&#xFF0C;&#x4ECE;&#x524D;&#x9762;&#x5220;&#x9664;&#x5143;&#x7D20;&#x3002;&#x4F46;&#x662F;&#x8981;&#x652F;&#x6301;&#x5B8C;&#x6574; List &#x63A5;&#x53E3;&#x5219;&#x610F;&#x5473;&#x7740; LinkedList &#x5BF9;&#x4E8E;&#x8FD9;&#x9879;&#x4EFB;&#x52A1;&#x4E0D;&#x50CF;&#x539F;&#x6765;&#x90A3;&#x6837;&#x6709;&#x6548;&#x3002;Queue &#x63A5;&#x53E3;&#x6BD4; List &#x7B80;&#x5355;&#x5F97;&#x591A;&#xFF0C;&#x4EC5;&#x5305;&#x542B; put() &#x548C; take() &#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5141;&#x8BB8;&#x6BD4; LinkedList &#x66F4;&#x6709;&#x6548;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Queue &#x63A5;&#x53E3;&#x8FD8;&#x5141;&#x8BB8;&#x5B9E;&#x73B0;&#x6765;&#x786E;&#x5B9A;&#x5B58;&#x50A8;&#x5143;&#x7D20;&#x7684;&#x987A;&#x5E8F;&#x3002;ConcurrentLinkedQueue &#x7C7B;&#x5B9E;&#x73B0;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF08;first-in-first-out&#xFF0C;FIFO&#xFF09;&#x961F;&#x5217;&#xFF0C;&#x800C; PriorityQueue &#x7C7B;&#x5B9E;&#x73B0;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x5806;&#xFF09;&#xFF0C;&#x5B83;&#x5BF9;&#x4E8E;&#x6784;&#x5EFA;&#x8C03;&#x5EA6;&#x5668;&#x975E;&#x5E38;&#x6709;&#x7528;&#xFF0C;&#x8C03;&#x5EA6;&#x5668;&#x5FC5;&#x987B;&#x6309;&#x4F18;&#x5148;&#x7EA7;&#x6216;&#x9884;&#x671F;&#x7684;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x3002;</p>
<p>interface Queue extends Collection {</p>
<p>&#xA0;&#xA0;&#xA0; boolean offer(E x);</p>
<p>&#xA0;&#xA0;&#xA0; E poll();</p>
<p>&#xA0;&#xA0;&#xA0; E remove() throws NoSuchElementException;</p>
<p>&#xA0;&#xA0;&#xA0; E peek();</p>
<p>&#xA0;&#xA0;&#xA0; E element() throws NoSuchElementException;</p>
<p>}</p>
<p>&#x5B9E;&#x73B0; Queue &#x7684;&#x7C7B;&#x662F;&#xFF1A;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; LinkedList &#x5DF2;&#x7ECF;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x8FDB;&#x6765;&#x5B9E;&#x73B0; Queue&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; PriorityQueue &#x975E;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x5BF9;&#x5217;&#xFF08;&#x5806;&#xFF09;&#x5B9E;&#x73B0;&#xFF0C;&#x6839;&#x636E;&#x81EA;&#x7136;&#x987A;&#x5E8F;&#x6216;&#x6BD4;&#x8F83;&#x5668;&#x8FD4;&#x56DE;&#x5143;&#x7D20;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; ConcurrentLinkedQueue &#x5FEB;&#x901F;&#x3001;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3001;&#x65E0;&#x963B;&#x585E; FIFO &#x961F;&#x5217;&#x3002;</p>
<p> &#x4EFB;&#x52A1;&#x7BA1;&#x7406;&#x4E4B;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;</p>
<p>&#x7EBF;&#x7A0B;&#x6700;&#x666E;&#x904D;&#x7684;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x4EE5;&#x6267;&#x884C;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x4EFB;&#x52A1;&#x3002;Timer &#x7C7B;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C; TimerTask &#x5BF9;&#x8C61;&#xFF0C;Swing &#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x6765;&#x5904;&#x7406; UI &#x4E8B;&#x4EF6;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x5728;&#x5355;&#x72EC;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x5047;&#x5B9A;&#x662F;&#x77ED;&#x671F;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x662F;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x5927;&#x91CF;&#x77ED;&#x671F;&#x4EFB;&#x52A1;&#x800C;&#x5B58;&#x5728;&#x7684;&#x3002;</p>
<p>&#x5728;&#x5176;&#x4E2D;&#x6BCF;&#x79CD;&#x60C5;&#x51B5;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x4E00;&#x822C;&#x90FD;&#x6709;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x7ED3;&#x6784;&#xFF1A;</p>
<p>while (true) {</p>
<p>&#xA0; if (no tasks)</p>
<p>&#xA0;&#xA0;&#xA0; wait for a task;</p>
<p>&#xA0; execute the task;</p>
<p>}</p>
<p>&#x901A;&#x8FC7;&#x4F8B;&#x793A;&#x4ECE; Thread &#x83B7;&#x5F97;&#x7684;&#x5BF9;&#x8C61;&#x5E76;&#x8C03;&#x7528; Thread.start() &#x65B9;&#x6CD5;&#x6765;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#xFF1A;&#x901A;&#x8FC7;&#x6269;&#x5C55; Thread &#x548C;&#x8986;&#x76D6; run() &#x65B9;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x5B9E;&#x73B0; Runnable &#x63A5;&#x53E3;&#x548C;&#x4F7F;&#x7528; Thread(Runnable) &#x6784;&#x9020;&#x51FD;&#x6570;&#xFF1A;</p>
<p>class WorkerThread extends Thread {</p>
<p>&#xA0; public void run() { /<em> do work </em>/ }</p>
<p>}</p>
<p>Thread t = new WorkerThread();</p>
<p>t.start();</p>
<p>&#x6216;&#x8005;&#xFF1A;</p>
<p>Thread t = new Thread(new Runnable() {</p>
<p>&#xA0; public void run() { /<em> do work </em>/ }</p>
<p>}</p>
<p>t.start();</p>
<p> &#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;</p>
<p>&#xA0;&#xA0;&#xA0; &#x56E0;&#x4E3A;&#x591A;&#x4E2A;&#x539F;&#x56E0;&#xFF0C;&#x7C7B;&#x4F3C; Swing GUI &#x7684;&#x6846;&#x67B6;&#x4E3A;&#x4E8B;&#x4EF6;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x5355;&#x4E00;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x9996;&#x5148;&#x662F;&#x56E0;&#x4E3A;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x4F1A;&#x6709;&#x95F4;&#x63A5;&#x6210;&#x672C;&#xFF0C;&#x6240;&#x4EE5;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x7B80;&#x5355;&#x4EFB;&#x52A1;&#x5C06;&#x662F;&#x4E00;&#x79CD;&#x8D44;&#x6E90;&#x6D6A;&#x8D39;&#x3002;&#x901A;&#x8FC7;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x4E8B;&#x4EF6;&#x7EBF;&#x7A0B;&#x6765;&#x5904;&#x7406;&#x591A;&#x4E2A;&#x4E8B;&#x4EF6;&#xFF0C;&#x542F;&#x52A8;&#x548C;&#x62C6;&#x5378;&#x6210;&#x672C;&#xFF08;&#x968F;&#x5E73;&#x53F0;&#x800C;&#x53D8;&#xFF09;&#x4F1A;&#x5206;&#x644A;&#x5728;&#x591A;&#x4E2A;&#x4E8B;&#x4EF6;&#x4E0A;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Swing &#x4E3A;&#x4E8B;&#x4EF6;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x662F;&#x786E;&#x4FDD;&#x4E8B;&#x4EF6;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x5E72;&#x6D89;&#xFF0C;&#x56E0;&#x4E3A;&#x76F4;&#x5230;&#x524D;&#x4E00;&#x4E8B;&#x4EF6;&#x7ED3;&#x675F;&#xFF0C;&#x4E0B;&#x4E00;&#x4E8B;&#x4EF6;&#x624D;&#x5F00;&#x59CB;&#x5904;&#x7406;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x7B80;&#x5316;&#x4E86;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x7684;&#x7F16;&#x5199;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5C06;&#x8981;&#x505A;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x6765;&#x786E;&#x4FDD;&#x4E00;&#x6B21;&#x4EC5;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5730;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x76F8;&#x5173;&#x7684;&#x4EE3;&#x7801;&#x3002;</p>
<p> &#x5982;&#x4F55;&#x4E0D;&#x5BF9;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x7BA1;&#x7406;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08;&#x5982; Web &#x670D;&#x52A1;&#x5668;&#x3001;POP &#x670D;&#x52A1;&#x5668;&#x3001;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668;&#x6216;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#x5668;&#xFF09;&#x4EE3;&#x8868;&#x8FDC;&#x7A0B;&#x5BA2;&#x6237;&#x673A;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BA2;&#x6237;&#x673A;&#x901A;&#x5E38;&#x4F7F;&#x7528; socket &#x8FDE;&#x63A5;&#x5230;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x8FDB;&#x884C;&#x5C11;&#x91CF;&#x5904;&#x7406;&#xFF08;&#x83B7;&#x5F97;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x4EE3;&#x7801;&#x5757;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x53D1;&#x9001;&#x56DE; socket&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5927;&#x91CF;&#xFF08;&#x4E14;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#xFF09;&#x7684;&#x5BA2;&#x6237;&#x673A;&#x8BF7;&#x6C42;&#x670D;&#x52A1;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7B80;&#x5355;&#x5316;&#x6A21;&#x578B;&#x4F1A;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x3002;&#x4E0B;&#x5217;&#x4EE3;&#x7801;&#x6BB5;&#x5B9E;&#x73B0;&#x7B80;&#x5355;&#x7684; Web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5B83;&#x63A5;&#x53D7;&#x7AEF;&#x53E3; 80 &#x7684; socket &#x8FDE;&#x63A5;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8BE5;&#x4EE3;&#x7801;&#x4E0D;&#x662F;&#x5B9E;&#x73B0; Web &#x670D;&#x52A1;&#x5668;&#x7684;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x91CD;&#x8D1F;&#x8F7D;&#x6761;&#x4EF6;&#x4E0B;&#x5B83;&#x5C06;&#x5931;&#x8D25;&#xFF0C;&#x505C;&#x6B62;&#x6574;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x3002;</p>
<p>class UnreliableWebServer {</p>
<p>&#xA0; public static void main(String[] args) {</p>
<p>&#xA0;&#xA0;&#xA0; ServerSocket socket = new ServerSocket(80);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; while (true) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; final Socket connection = socket.accept();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Runnable r = new Runnable() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; public void run() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; handleRequest(connection);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; };</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; // Don&apos;t do this!</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; new Thread(r).start();</p>
<p>&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0; }</p>
<p>}</p>
<p>&#xA0;&#xA0;&#xA0; &#x5F53;&#x670D;&#x52A1;&#x5668;&#x88AB;&#x8BF7;&#x6C42;&#x541E;&#x6CA1;&#x65F6;&#xFF0C;UnreliableWebServer &#x7C7B;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5904;&#x7406;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x3002;&#x6BCF;&#x6B21;&#x6709;&#x8BF7;&#x6C42;&#x65F6;&#xFF0C;&#x5C31;&#x4F1A;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7C7B;&#x3002;&#x6839;&#x636E;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x53EF;&#x7528;&#x5185;&#x5B58;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x662F;&#x6709;&#x9650;&#x7684;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x60A8;&#x901A;&#x5E38;&#x4E0D;&#x77E5;&#x9053;&#x9650;&#x5236;&#x662F;&#x591A;&#x5C11; — &#x53EA;&#x6709;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x56E0;&#x4E3A; OutOfMemoryError &#x800C;&#x5D29;&#x6E83;&#x65F6;&#x624D;&#x53D1;&#x73B0;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x8DB3;&#x591F;&#x5FEB;&#x5730;&#x5728;&#x8FD9;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x629B;&#x51FA;&#x8BF7;&#x6C42;&#x7684;&#x8BDD;&#xFF0C;&#x6700;&#x7EC8;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x5C06;&#x5931;&#x8D25;&#xFF0C;&#x751F;&#x6210;&#x7684; Error &#x4F1A;&#x5173;&#x95ED;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5F53;&#x4E00;&#x6B21;&#x4EC5;&#x80FD;&#x6709;&#x6548;&#x652F;&#x6301;&#x5F88;&#x5C11;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x521B;&#x5EFA;&#x4E0A;&#x5343;&#x4E2A;</p>
<p>&#xA0;&#xA0;&#xA0; &#x7EBF;&#x7A0B;&#xFF0C;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#xFF0C;&#x8FD9;&#x6837;&#x4F7F;&#x7528;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x4F1A;&#x635F;&#x5BB3;&#x6027;&#x80FD;&#x3002;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x4F1A;&#x4F7F;&#x7528;&#x76F8;&#x5F53;&#x4E00;&#x90E8;&#x5206;&#x5185;&#x5B58;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x6709;&#x4E24;&#x4E2A;&#x5806;&#x6808;&#xFF08;Java &#x548C; C&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x7EBF;&#x7A0B;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x8FC7;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;&#x5176;&#x4E2D;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x5C06;&#x5360;&#x7528;&#x4E00;&#x4E9B; CPU &#x65F6;&#x95F4;&#xFF0C;&#x7ED3;&#x679C;&#x5C06;&#x4F7F;&#x7528;&#x8BB8;&#x591A;&#x5185;&#x5B58;&#x6765;&#x652F;&#x6301;&#x5927;&#x91CF;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x8FD0;&#x884C;&#x5F97;&#x5F88;&#x6162;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x65E0;&#x6CD5;&#x5F88;&#x597D;&#x5730;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x3002;</p>
<p> &#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x6C60;&#x89E3;&#x51B3;&#x95EE;&#x9898;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E3A;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x4E0D;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x521B;&#x5EFA;&#x4EFB;&#x52A1;&#x7684;&#x9891;&#x7387;&#x9AD8;&#xFF0C;&#x800C;&#x5E73;&#x5747;&#x4EFB;&#x52A1;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x4F4E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x5C06;&#x4EA7;&#x751F;&#x6027;&#x80FD;&#xFF08;&#x5982;&#x679C;&#x8D1F;&#x8F7D;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#xFF0C;&#x8FD8;&#x6709;&#x7A33;&#x5B9A;&#x6027;&#xFF09;&#x95EE;&#x9898;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x4E0D;&#x662F;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x5219;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#x6765;&#x9650;&#x5236;&#x4E00;&#x6B21;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x7684;&#x8BF7;&#x6C42;&#x6570;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x6B21;&#x9700;&#x8981;&#x542F;&#x52A8;&#x65B0;&#x7684;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x5B83;&#x4E0D;&#x80FD;&#x4EC5;&#x8C03;&#x7528;&#x4E0B;&#x5217;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#xA0; new Thread(runnable).start()</p>
<p>&#xA0;&#xA0;&#xA0; &#x7BA1;&#x7406;&#x4E00;&#x5927;&#x7EC4;&#x5C0F;&#x4EFB;&#x52A1;&#x7684;&#x6807;&#x51C6;&#x673A;&#x5236;&#x662F;&#x7EC4;&#x5408;&#x5DE5;&#x4F5C;&#x961F;&#x5217;&#x548C;&#x7EBF;&#x7A0B;&#x6C60;&#x3002;&#x5DE5;&#x4F5C;&#x961F;&#x5217;&#x5C31;&#x662F;&#x8981;&#x5904;&#x7406;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x961F;&#x5217;&#xFF0C;&#x524D;&#x9762;&#x63CF;&#x8FF0;&#x7684; Queue &#x7C7B;&#x5B8C;&#x5168;&#x9002;&#x5408;&#x3002;&#x7EBF;&#x7A0B;&#x6C60;&#x662F;&#x7EBF;&#x7A0B;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x63D0;&#x53D6;&#x516C;&#x7528;&#x5DE5;&#x4F5C;&#x961F;&#x5217;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x5904;&#x7406;&#x540E;&#xFF0C;&#x5B83;&#x4F1A;&#x8FD4;&#x56DE;&#x961F;&#x5217;&#xFF0C;&#x67E5;&#x770B;&#x662F;&#x5426;&#x6709;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x5904;&#x7406;&#x3002;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x5B83;&#x4F1A;&#x8F6C;&#x79FB;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x5904;&#x7406;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x7EBF;&#x7A0B;&#x6C60;&#x4E3A;&#x7EBF;&#x7A0B;&#x751F;&#x547D;&#x5468;&#x671F;&#x95F4;&#x63A5;&#x6210;&#x672C;&#x95EE;&#x9898;&#x548C;&#x8D44;&#x6E90;&#x5D29;&#x6E83;&#x95EE;&#x9898;&#x63D0;&#x4F9B;&#x4E86;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#xFF0C;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x7684;&#x95F4;&#x63A5;&#x6210;&#x672C;&#x5C06;&#x5206;&#x5E03;&#x5230;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x4E2D;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x989D;&#x5916;&#x597D;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x8BF7;&#x6C42;&#x5230;&#x8FBE;&#x65F6;&#xFF0C;&#x7EBF;&#x7A0B;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x6D88;&#x9664;&#x7531;&#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x5F15;&#x8D77;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#xFF0C;&#x4F7F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x66F4;&#x6613;&#x54CD;&#x5E94;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x901A;&#x8FC7;&#x6B63;&#x786E;&#x8C03;&#x6574;&#x7EBF;&#x7A0B;&#x6C60;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#xFF0C;&#x53EF;&#x4EE5;&#x5F3A;&#x5236;&#x8D85;&#x51FA;&#x7279;&#x5B9A;&#x9650;&#x5236;&#x7684;&#x4EFB;&#x4F55;&#x8BF7;&#x6C42;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x5B83;&#x4EEC;&#x7B49;&#x5F85;&#x65F6;&#x6240;&#x6D88;&#x8017;&#x7684;&#x8D44;&#x6E90;&#x8981;&#x5C11;&#x4E8E;&#x4F7F;&#x7528;&#x989D;&#x5916;&#x7EBF;&#x7A0B;&#x6240;&#x6D88;&#x8017;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x8D44;&#x6E90;&#x5D29;&#x6E83;&#x3002;</p>
<p> Executor&#xA0;&#x6846;&#x67B6;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x5305;&#x4E2D;&#x5305;&#x542B;&#x7075;&#x6D3B;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5B9E;&#x73B0; Runnable &#x7684;&#x4EFB;&#x52A1;&#x7684;&#x6267;&#x884C;&#x7684;&#x6574;&#x4E2A;&#x6846;&#x67B6;&#x3002;&#x8BE5;&#x6846;&#x67B6;&#x79F0;&#x4E3A; Executor &#x6846;&#x67B6;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Executor &#x63A5;&#x53E3;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x3002;&#x5B83;&#x63CF;&#x8FF0;&#x5C06;&#x8FD0;&#x884C; Runnable &#x7684;&#x5BF9;&#x8C61;&#xFF1A;</p>
<p>public interface Executor {</p>
<p>&#xA0; void execute(Runnable command);</p>
<p>}</p>
<p>&#xA0;&#xA0;&#xA0; &#x4EFB;&#x52A1;&#x8FD0;&#x884C;&#x4E8E;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0D;&#x662F;&#x7531;&#x8BE5;&#x63A5;&#x53E3;&#x6307;&#x5B9A;&#x7684;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F7F;&#x7528;&#x7684; Executor &#x7684;&#x5B9E;&#x73B0;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E8E;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#xFF0C;&#x5982; Swing &#x4E8B;&#x4EF6;&#x7EBF;&#x7A0B;&#xFF0C;&#x6216;&#x8005;&#x8FD0;&#x884C;&#x4E8E;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x6216;&#x8005;&#x8C03;&#x7528;&#x7EBF;&#x7A0B;&#xFF0C;&#x6216;&#x8005;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#xFF0C;&#x5B83;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4E8E;&#x5176;&#x4ED6; JVM&#xFF01;&#x901A;&#x8FC7;&#x540C;&#x6B65;&#x7684; Executor &#x63A5;&#x53E3;&#x63D0;&#x4EA4;&#x4EFB;&#x52A1;&#xFF0C;&#x4ECE;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x7B56;&#x7565;&#x4E2D;&#x5220;&#x9664;&#x4EFB;&#x52A1;&#x63D0;&#x4EA4;&#x3002;Executor &#x63A5;&#x53E3;&#x72EC;&#x81EA;&#x5173;&#x6CE8;&#x4EFB;&#x52A1;&#x63D0;&#x4EA4; — &#x8FD9;&#x662F;Executor &#x5B9E;&#x73B0;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x786E;&#x5B9A;&#x6267;&#x884C;&#x7B56;&#x7565;&#x3002;&#x8FD9;&#x4F7F;&#x5728;&#x90E8;&#x7F72;&#x65F6;&#x8C03;&#x6574;&#x6267;&#x884C;&#x7B56;&#x7565;&#xFF08;&#x961F;&#x5217;&#x9650;&#x5236;&#x3001;&#x6C60;&#x5927;&#x5C0F;&#x3001;&#x4F18;&#x5148;&#x7EA7;&#x6392;&#x5217;&#x7B49;&#x7B49;&#xFF09;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#xFF0C;&#x66F4;&#x6539;&#x7684;&#x4EE3;&#x7801;&#x6700;&#x5C11;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x4E2D;&#x7684;&#x5927;&#x591A;&#x6570; Executor &#x5B9E;&#x73B0;&#x8FD8;&#x5B9E;&#x73B0; ExecutorService &#x63A5;&#x53E3;&#xFF0C;&#x8FD9;&#x662F;&#x5BF9; Executor &#x7684;&#x6269;&#x5C55;&#xFF0C;&#x5B83;&#x8FD8;&#x7BA1;&#x7406;&#x6267;&#x884C;&#x670D;&#x52A1;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x8FD9;&#x4F7F;&#x5B83;&#x4EEC;&#x66F4;&#x6613;&#x4E8E;&#x7BA1;&#x7406;&#xFF0C;&#x5E76;&#x5411;&#x751F;&#x547D;&#x53EF;&#x80FD;&#x6BD4;&#x5355;&#x72EC; Executor &#x7684;&#x751F;&#x547D;&#x66F4;&#x957F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;</p>
<p>public interface ExecutorService extends Executor {</p>
<p>&#xA0; void shutdown();</p>
<p>&#xA0; List shutdownNow();</p>
<p>&#xA0; boolean isShutdown();</p>
<p>&#xA0; boolean isTerminated();</p>
<p>&#xA0; boolean awaitTermination(long timeout,</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; TimeUnit unit);</p>
<p>&#xA0; // other convenience methods for submitting tasks</p>
<p>}</p>
<p> Executor</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x5305;&#x5305;&#x542B;&#x591A;&#x4E2A; Executor &#x5B9E;&#x73B0;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B9E;&#x73B0;&#x90FD;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x7684;&#x6267;&#x884C;&#x7B56;&#x7565;&#x3002;&#x4EC0;&#x4E48;&#x662F;&#x6267;&#x884C;&#x7B56;&#x7565;&#xFF1F;&#x6267;&#x884C;&#x7B56;&#x7565;&#x5B9A;&#x4E49;&#x4F55;&#x65F6;&#x5728;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FD0;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#x53EF;&#x80FD;&#x6D88;&#x8017;&#x7684;&#x8D44;&#x6E90;&#x7EA7;&#x522B;&#xFF08;&#x7EBF;&#x7A0B;&#x3001;&#x5185;&#x5B58;&#x7B49;&#x7B49;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x679C;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x8D85;&#x8F7D;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x901A;&#x8FC7;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x4F8B;&#x793A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x901A;&#x8FC7;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;Executors &#x7C7B;&#x5305;&#x542B;&#x7528;&#x4E8E;&#x6784;&#x9020;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684; Executor &#x5B9E;&#x73B0;&#x7684;&#x9759;&#x6001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; Executors.newCachedThreadPool() &#x521B;&#x5EFA;&#x4E0D;&#x9650;&#x5236;&#x5927;&#x5C0F;&#x7684;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x4EE5;&#x524D;&#x521B;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x65F6;&#x5C06;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x90A3;&#x4E9B;&#x7EBF;&#x7A0B;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x73B0;&#x6709;&#x7EBF;&#x7A0B;&#x53EF;&#x7528;&#xFF0C;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; &#x5C06;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x5E76;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x6C60;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x4E0D;&#x5230; 60 &#x79D2;&#x7684;&#x7EBF;&#x7A0B;&#x5C06;&#x7EC8;&#x6B62;&#x5E76;&#x4ECE;&#x7F13;&#x5B58;&#x4E2D;&#x5220;&#x9664;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; Executors.newFixedThreadPool(int n) &#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x6C60;&#xFF0C;&#x5176;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x5728;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#x7684;&#x961F;&#x5217;&#x4E4B;&#x5916;&#x8FD0;&#x884C;&#x7684;&#x56FA;&#x5B9A;&#x7EBF;&#x7A0B;&#x7EC4;&#x3002;&#x5728;&#x5173;&#x95ED;&#x524D;&#xFF0C;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x90FD;&#x4F1A;&#x56E0;&#x4E3A;&#x6267;&#x884C;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; &#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5931;&#x8D25;&#x800C;&#x7EC8;&#x6B62;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x6267;&#x884C;&#x540E;&#x7EED;&#x4EFB;&#x52A1;&#xFF0C;&#x5C06;&#x4F1A;&#x6709;&#x65B0;&#x7684;&#x7EBF;&#x7A0B;&#x6765;&#x4EE3;&#x66FF;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; Executors.newSingleThreadExecutor() &#x521B;&#x5EFA; Executor&#xFF0C;&#x5176;&#x4F7F;&#x7528;&#x5728;&#x4E0D;&#x53D7;&#x9650;&#x5236;&#x7684;&#x961F;&#x5217;&#x4E4B;&#x5916;&#x8FD0;&#x884C;&#x7684;&#x5355;&#x4E00;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E0E; Swing &#x4E8B;&#x4EF6;&#x7EBF;&#x7A0B;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x2022; &#x4FDD;&#x8BC1;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x5728;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#xFF0C;&#x4E0D;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x4EFB;&#x52A1;&#x5904;&#x4E8E;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x66F4;&#x53EF;&#x9760;&#x7684; Web &#x670D;&#x52A1;&#x5668; — &#x4F7F;&#x7528; Executor</p>
<p>&#xA0;&#xA0;&#xA0; &#x524D;&#x9762; &#x5982;&#x4F55;&#x4E0D;&#x5BF9;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x7BA1;&#x7406; &#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x663E;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x4E0D;&#x7528;&#x7F16;&#x5199;&#x53EF;&#x9760;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x4FEE;&#x590D;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x5C06; Thread.start() &#x8C03;&#x7528;&#x66FF;&#x6362;&#x4E3A;&#x5411; Executor &#x63D0;&#x4EA4;&#x4EFB;&#x52A1;&#x5373;&#x53EF;&#xFF1A;</p>
<p>class ReliableWebServer {</p>
<p>&#xA0; Executor pool =</p>
<p>&#xA0;&#xA0;&#xA0; Executors.newFixedThreadPool(7);</p>
<p>&#xA0;&#xA0;&#xA0; public static void main(String[] args) {</p>
<p>&#xA0;&#xA0;&#xA0; ServerSocket socket = new ServerSocket(80);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; while (true) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; final Socket connection = socket.accept();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Runnable r = new Runnable() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; public void run() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; handleRequest(connection);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; };</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; pool.execute(r);</p>
<p>&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0; }</p>
<p>}</p>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x672C;&#x4F8B;&#x4E0E;&#x524D;&#x4F8B;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x4EC5;&#x5728;&#x4E8E; Executor &#x7684;&#x521B;&#x5EFA;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x63D0;&#x4EA4;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x3002;</p>
<p> &#x5B9A;&#x5236; ThreadPoolExecutor</p>
<p>&#xA0;&#xA0;&#xA0; Executors &#x4E2D;&#x7684; newFixedThreadPool &#x548C; newCachedThreadPool &#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x7684; Executor &#x662F;&#x7C7B; ThreadPoolExecutor &#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x662F;&#x9AD8;&#x5EA6;&#x53EF;&#x5B9A;&#x5236;&#x7684;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5305;&#x542B; ThreadFactory &#x53D8;&#x91CF;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x6216;&#x6784;&#x9020;&#x51FD;&#x6570;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x6C60;&#x7EBF;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x3002;ThreadFactory &#x662F;&#x5DE5;&#x5382;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x6784;&#x9020;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x65B0;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4F7F;&#x7528;&#x5B9A;&#x5236;&#x7684;&#x7EBF;&#x7A0B;&#x5DE5;&#x5382;&#xFF0C;&#x521B;&#x5EFA;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x6709;&#x7528;&#x7684;&#x7EBF;&#x7A0B;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x662F;&#x5B88;&#x62A4;&#x7EBF;&#x7A0B;&#xFF0C;&#x5C5E;&#x4E8E;&#x7279;&#x5B9A;&#x7EBF;&#x7A0B;&#x7EC4;&#x6216;&#x5177;&#x6709;&#x7279;&#x5B9A;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0B;&#x9762;&#x662F;&#x7EBF;&#x7A0B;&#x5DE5;&#x5382;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x5B83;&#x521B;&#x5EFA;&#x5B88;&#x62A4;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x521B;&#x5EFA;&#x7528;&#x6237;&#x7EBF;&#x7A0B;&#xFF1A;</p>
<p>public class DaemonThreadFactory implements ThreadFactory {</p>
<p>&#xA0;&#xA0;&#xA0; public Thread newThread(Runnable r) {</p>
<p>&#xA0;&#xA0;&#xA0; &#xA0;&#xA0;&#xA0;&#xA0;Thread thread = new Thread(r);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; thread.setDaemon(true);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; return thread;</p>
<p>&#xA0;&#xA0;&#xA0; }</p>
<p>}</p>
<p>&#xA0;&#xA0;&#xA0; &#x6709;&#x65F6;&#xFF0C;Executor &#x4E0D;&#x80FD;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5DF2;&#x7ECF;&#x5173;&#x95ED;&#x6216;&#x8005;&#x56E0;&#x4E3A; Executor &#x4F7F;&#x7528;&#x53D7;&#x9650;&#x5236;&#x961F;&#x5217;&#x5B58;&#x50A8;&#x7B49;&#x5F85;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x8BE5;&#x961F;&#x5217;&#x5DF2;&#x6EE1;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x54A8;&#x8BE2;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684; RejectedExecutionHandler &#x6765;&#x786E;&#x5B9A;&#x5982;&#x4F55;&#x5904;&#x7406;&#x4EFB;&#x52A1; — &#x629B;&#x51FA;&#x5F02;&#x5E38;&#xFF08;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#xFF09;&#xFF0C;&#x653E;&#x5F03;&#x4EFB;&#x52A1;&#xFF0C;&#x5728;&#x8C03;&#x7528;&#x8005;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x6267;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x6216;&#x653E;&#x5F03;&#x961F;&#x5217;&#x4E2D;&#x6700;&#x65E9;&#x7684;&#x4EFB;&#x52A1;&#x4EE5;&#x4E3A;&#x65B0;&#x4EFB;&#x52A1;&#x817E;&#x51FA;&#x7A7A;&#x95F4;&#x3002;ThreadPoolExecutor.setRejectedExecutionHandler &#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x62D2;&#x7EDD;&#x7684;&#x6267;&#x884C;&#x5904;&#x7406;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8FD8;&#x53EF;&#x4EE5;&#x6269;&#x5C55; ThreadPoolExecutor&#xFF0C;&#x5E76;&#x8986;&#x76D6;&#x65B9;&#x6CD5; beforeExecute &#x548C; afterExecute&#xFF0C;&#x4EE5;&#x6DFB;&#x52A0;&#x88C5;&#x7F6E;&#xFF0C;&#x6DFB;&#x52A0;&#x8BB0;&#x5F55;&#xFF0C;&#x6DFB;&#x52A0;&#x8BA1;&#x65F6;&#xFF0C;&#x91CD;&#x65B0;&#x521D;&#x59CB;&#x5316;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x53D8;&#x91CF;&#xFF0C;&#x6216;&#x8FDB;&#x884C;&#x5176;&#x4ED6;&#x6267;&#x884C;&#x5B9A;&#x5236;&#x3002;</p>
<p> &#xA0;&#x9700;&#x8981;&#x7279;&#x522B;&#x8003;&#x8651;&#x7684;&#x95EE;&#x9898;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4F7F;&#x7528; Executor &#x6846;&#x67B6;&#x4F1A;&#x4ECE;&#x6267;&#x884C;&#x7B56;&#x7565;&#x4E2D;&#x5220;&#x9664;&#x4EFB;&#x52A1;&#x63D0;&#x4EA4;&#xFF0C;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EBA;&#x4EEC;&#x5E0C;&#x671B;&#x8FD9;&#x6837;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x7075;&#x6D3B;&#x5730;&#x8C03;&#x6574;&#x6267;&#x884C;&#x7B56;&#x7565;&#xFF0C;&#x4E0D;&#x5FC5;&#x66F4;&#x6539;&#x8BB8;&#x591A;&#x4F4D;&#x7F6E;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x6697;&#x542B;&#x5047;&#x8BBE;&#x7279;&#x5B9A;&#x6267;&#x884C;&#x7B56;&#x7565;&#x65F6;&#xFF0C;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5728;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x91CD;&#x8981;&#x7684;&#x662F;&#x9009;&#x62E9;&#x7684; Executor &#x5B9E;&#x73B0;&#x4E00;&#x81F4;&#x7684;&#x6267;&#x884C;&#x7B56;&#x7565;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8FD9;&#x7C7B;&#x60C5;&#x51B5;&#x4E2D;&#x7684;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x5C31;&#x662F;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x540C;&#x65F6;&#x7B49;&#x5F85;&#x5176;&#x4ED6;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x7EBF;&#x7A0B;&#x6C60;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x5F53;&#x524D;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x90FD;&#x5728;&#x7B49;&#x5F85;&#x53E6;&#x4E00;&#x9879;&#x4EFB;&#x52A1;&#xFF0C;&#x800C;&#x8BE5;&#x4EFB;&#x52A1;&#x56E0;&#x4E3A;&#x7EBF;&#x7A0B;&#x6C60;&#x5DF2;&#x6EE1;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#xFF0C;&#x90A3;&#x4E48;&#x7EBF;&#x7A0B;&#x6C60;&#x53EF;&#x80FD;&#x4F1A;&#x6B7B;&#x9501;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x53E6;&#x4E00;&#x79CD;&#x76F8;&#x4F3C;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x4E00;&#x7EC4;&#x7EBF;&#x7A0B;&#x5FC5;&#x987B;&#x4F5C;&#x4E3A;&#x5171;&#x540C;&#x64CD;&#x4F5C;&#x7EC4;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x7EBF;&#x7A0B;&#x6C60;&#x80FD;&#x591F;&#x5BB9;&#x7EB3;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5BF9;&#x7279;&#x5B9A;&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x4E86;&#x7279;&#x5B9A;&#x5047;&#x8BBE;&#xFF0C;&#x90A3;&#x4E48;&#x5E94;&#x8BE5;&#x5728; Executor &#x5B9A;&#x4E49;&#x548C;&#x521D;&#x59CB;&#x5316;&#x7684;&#x9644;&#x8FD1;&#x5BF9;&#x8FD9;&#x4E9B;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5584;&#x610F;&#x7684;&#x66F4;&#x6539;&#x4E0D;&#x4F1A;&#x7834;&#x574F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6B63;&#x786E;&#x529F;&#x80FD;&#x3002;</p>
<p> &#x8C03;&#x6574;&#x7EBF;&#x7A0B;&#x6C60;</p>
<p>&#xA0;&#xA0;&#xA0; &#x521B;&#x5EFA; Executor &#x65F6;&#xFF0C;&#x4EBA;&#x4EEC;&#x666E;&#x904D;&#x4F1A;&#x95EE;&#x7684;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&quot;&#x7EBF;&#x7A0B;&#x6C60;&#x5E94;&#x8BE5;&#x6709;&#x591A;&#x5927;&#xFF1F;&quot;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x7B54;&#x6848;&#x53D6;&#x51B3;&#x4E8E;&#x786C;&#x4EF6;&#x548C;&#x5C06;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x7C7B;&#x578B;&#xFF08;&#x5B83;&#x4EEC;&#x662F;&#x53D7;&#x8BA1;&#x7B97;&#x9650;&#x5236;&#x6216;&#x662F;&#x53D7; IO &#x7684;&#x9650;&#x5236;&#xFF1F;&#xFF09;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x6C60;&#x592A;&#x5C0F;&#xFF0C;&#x8D44;&#x6E90;&#x53EF;&#x80FD;&#x4E0D;&#x80FD;&#x88AB;&#x5145;&#x5206;&#x5229;&#x7528;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x8FD8;&#x5728;&#x5DE5;&#x4F5C;&#x961F;&#x5217;&#x4E2D;&#x7B49;&#x5F85;&#x6267;&#x884C;&#x65F6;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x5904;&#x7406;&#x5668;&#x5904;&#x4E8E;&#x95F2;&#x7F6E;&#x72B6;&#x6001;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x6C60;&#x592A;&#x5927;&#xFF0C;&#x5219;&#x5C06;&#x6709;&#x8BB8;&#x591A;&#x6709;&#x6548;&#x7EBF;&#x7A0B;&#xFF0C;&#x56E0;&#x4E3A;&#x5927;&#x91CF;&#x7EBF;&#x7A0B;&#x6216;&#x6709;&#x6548;&#x4EFB;&#x52A1;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#xFF0C;&#x6216;&#x8005;&#x56E0;&#x4E3A;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x8981;&#x6BD4;&#x4F7F;&#x7528;&#x5C11;&#x91CF;&#x7EBF;&#x7A0B;&#x6709;&#x66F4;&#x591A;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#xFF0C;&#x6027;&#x80FD;&#x53EF;&#x80FD;&#x4F1A;&#x53D7;&#x635F;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6240;&#x4EE5;&#x5047;&#x8BBE;&#x4E3A;&#x4E86;&#x4F7F;&#x5904;&#x7406;&#x5668;&#x5F97;&#x5230;&#x5145;&#x5206;&#x4F7F;&#x7528;&#xFF0C;&#x7EBF;&#x7A0B;&#x6C60;&#x5E94;&#x8BE5;&#x6709;&#x591A;&#x5927;&#xFF1F;&#x5982;&#x679C;&#x77E5;&#x9053;&#x7CFB;&#x7EDF;&#x6709;&#x591A;&#x5C11;&#x5904;&#x7406;&#x5668;&#x548C;&#x4EFB;&#x52A1;&#x7684;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#x548C;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x7684;&#x8FD1;&#x4F3C;&#x6BD4;&#x7387;&#xFF0C;Amdahl &#x6CD5;&#x5219;&#x63D0;&#x4F9B;&#x5F88;&#x597D;&#x7684;&#x8FD1;&#x4F3C;&#x516C;&#x5F0F;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x7528; WT &#x8868;&#x793A;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x7684;&#x5E73;&#x5747;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF0C;ST &#x8868;&#x793A;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x7684;&#x5E73;&#x5747;&#x670D;&#x52A1;&#x65F6;&#x95F4;&#xFF08;&#x8BA1;&#x7B97;&#x65F6;&#x95F4;&#xFF09;&#x3002;&#x5219; WT/ST &#x662F;&#x6BCF;&#x9879;&#x4EFB;&#x52A1;&#x7B49;&#x5F85;&#x6240;&#x7528;&#x65F6;&#x95F4;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x3002;&#x5BF9;&#x4E8E; N &#x5904;&#x7406;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;&#x6C60;&#x4E2D;&#x53EF;&#x4EE5;&#x8FD1;&#x4F3C;&#x6709; N*(1+WT/ST) &#x4E2A;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x597D;&#x7684;&#x6D88;&#x606F;&#x662F;&#x60A8;&#x4E0D;&#x5FC5;&#x7CBE;&#x786E;&#x4F30;&#x8BA1; WT/ST&#x3002;&quot;&#x5408;&#x9002;&#x7684;&quot;&#x6C60;&#x5927;&#x5C0F;&#x7684;&#x8303;&#x56F4;&#x76F8;&#x5F53;&#x5927;&#xFF1B;&#x53EA;&#x9700;&#x8981;&#x907F;&#x514D;&quot;&#x8FC7;&#x5927;&quot;&#x548C;&quot;&#x8FC7;&#x5C0F;&quot;&#x7684;&#x6781;&#x7AEF;&#x60C5;&#x51B5;&#x5373;&#x53EF;&#x3002;</p>
<p> Future&#xA0;&#x63A5;&#x53E3;</p>
<p>&#xA0;&#xA0;&#xA0; Future &#x63A5;&#x53E3;&#x5141;&#x8BB8;&#x8868;&#x793A;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x3001;&#x6B63;&#x5728;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4EFB;&#x52A1;&#x6216;&#x8005;&#x5C1A;&#x672A;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x901A;&#x8FC7; Future &#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x53D6;&#x6D88;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x67E5;&#x8BE2;&#x4EFB;&#x52A1;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x8FD8;&#x662F;&#x53D6;&#x6D88;&#x4E86;&#xFF0C;&#x4EE5;&#x53CA;&#x63D0;&#x53D6;&#xFF08;&#x6216;&#x7B49;&#x5F85;&#xFF09;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x679C;&#x503C;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; FutureTask &#x7C7B;&#x5B9E;&#x73B0;&#x4E86; Future&#xFF0C;&#x5E76;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x5141;&#x8BB8;&#x5C06; Runnable &#x6216; Callable&#xFF08;&#x4F1A;&#x4EA7;&#x751F;&#x7ED3;&#x679C;&#x7684; Runnable&#xFF09;&#x548C; Future &#x63A5;&#x53E3;&#x5C01;&#x88C5;&#x3002;&#x56E0;&#x4E3A; FutureTask &#x4E5F;&#x5B9E;&#x73B0; Runnable&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x53EA;&#x5C06; FutureTask &#x63D0;&#x4F9B;&#x7ED9; Executor&#x3002;&#x4E00;&#x4E9B;&#x63D0;&#x4EA4;&#x65B9;&#x6CD5;&#xFF08;&#x5982; ExecutorService.submit()&#xFF09;&#x9664;&#x4E86;&#x63D0;&#x4EA4;&#x4EFB;&#x52A1;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x5C06;&#x8FD4;&#x56DE; Future &#x63A5;&#x53E3;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Future.get() &#x65B9;&#x6CD5;&#x68C0;&#x7D22;&#x4EFB;&#x52A1;&#x8BA1;&#x7B97;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x6216;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#xFF0C;&#x4F46;&#x6709;&#x5F02;&#x5E38;&#xFF0C;&#x5219;&#x629B;&#x51FA; ExecutionException&#xFF09;&#x3002;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x5C1A;&#x672A;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48; Future.get() &#x5C06;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#xFF1B;&#x5982;&#x679C;&#x4EFB;&#x52A1;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;</p>
<p> &#x4F7F;&#x7528; Future &#x6784;&#x5EFA;&#x7F13;&#x5B58;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8BE5;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x4E0E; java.util.concurrent &#x4E2D;&#x7684;&#x591A;&#x4E2A;&#x7C7B;&#x5173;&#x8054;&#xFF0C;&#x7A81;&#x51FA;&#x663E;&#x793A;&#x4E86; Future &#x7684;&#x529F;&#x80FD;&#x3002;&#x5B83;&#x5B9E;&#x73B0;&#x7F13;&#x5B58;&#xFF0C;&#x4F7F;&#x7528; Future &#x63CF;&#x8FF0;&#x7F13;&#x5B58;&#x503C;&#xFF0C;&#x8BE5;&#x503C;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x8BA1;&#x7B97;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x80FD;&#x5728;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E2D;&quot;&#x6B63;&#x5728;&#x6784;&#x9020;&quot;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5B83;&#x5229;&#x7528; ConcurrentHashMap &#x4E2D;&#x7684;&#x539F;&#x5B50; putIfAbsent() &#x65B9;&#x6CD5;&#xFF0C;&#x786E;&#x4FDD;&#x4EC5;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BD5;&#x56FE;&#x8BA1;&#x7B97;&#x7ED9;&#x5B9A;&#x5173;&#x952E;&#x5B57;&#x7684;&#x503C;&#x3002;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x968F;&#x540E;&#x8BF7;&#x6C42;&#x540C;&#x4E00;&#x5173;&#x952E;&#x5B57;&#x7684;&#x503C;&#xFF0C;&#x5B83;&#x4EC5;&#x80FD;&#x7B49;&#x5F85;&#xFF08;&#x901A;&#x8FC7; Future.get() &#x7684;&#x5E2E;&#x52A9;&#xFF09;&#x7B2C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5B8C;&#x6210;&#x3002;&#x56E0;&#x6B64;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E0D;&#x4F1A;&#x8BA1;&#x7B97;&#x76F8;&#x540C;&#x7684;&#x503C;&#x3002;</p>
<p>public class Cache {</p>
<p>&#xA0;&#xA0;&#xA0; ConcurrentMap&gt; map = new ConcurrentHashMap();</p>
<p>&#xA0;&#xA0;&#xA0; Executor executor = Executors.newFixedThreadPool(8);</p>
<p>&#xA0;&#xA0;&#xA0; public V get(final K key) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; FutureTask f = map.get(key);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; if (f == null) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Callable c = new Callable() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; public V call() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; // return value associated with key</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; };</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; f = new FutureTask(c);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; FutureTask old = map.putIfAbsent(key, f);</p>
<p>&#xA0; &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;if (old == null)</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; executor.execute(f);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; else</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; f = old;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; return f.get();</p>
<p>&#xA0;&#xA0;&#xA0; }</p>
<p>}</p>
<p> CompletionService</p>
<p>&#xA0;&#xA0;&#xA0; CompletionService &#x5C06;&#x6267;&#x884C;&#x670D;&#x52A1;&#x4E0E;&#x7C7B;&#x4F3C; Queue &#x7684;&#x63A5;&#x53E3;&#x7EC4;&#x5408;&#xFF0C;&#x4ECE;&#x4EFB;&#x52A1;&#x6267;&#x884C;&#x4E2D;&#x5220;&#x9664;&#x4EFB;&#x52A1;&#x7ED3;&#x679C;&#x7684;&#x5904;&#x7406;&#x3002;CompletionService &#x63A5;&#x53E3;&#x5305;&#x542B;&#x7528;&#x6765;&#x63D0;&#x4EA4;&#x5C06;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x7684; submit() &#x65B9;&#x6CD5;&#x548C;&#x7528;&#x6765;&#x8BE2;&#x95EE;&#x4E0B;&#x4E00;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684; take()/poll() &#x65B9;&#x6CD5;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; CompletionService &#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7ED3;&#x6784;&#x5316;&#xFF0C;&#x4F7F;&#x7528; Producer/Consumer &#x6A21;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x751F;&#x4EA7;&#x8005;&#x521B;&#x5EFA;&#x4EFB;&#x52A1;&#x5E76;&#x63D0;&#x4EA4;&#xFF0C;&#x6D88;&#x8D39;&#x8005;&#x8BF7;&#x6C42;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x679C;&#x5E76;&#x5904;&#x7406;&#x8FD9;&#x4E9B;&#x7ED3;&#x679C;&#x3002;CompletionService &#x63A5;&#x53E3;&#x7531; ExecutorCompletionService &#x7C7B;&#x5B9E;&#x73B0;&#xFF0C;&#x8BE5;&#x7C7B;&#x4F7F;&#x7528; Executor &#x5904;&#x7406;&#x4EFB;&#x52A1;&#x5E76;&#x4ECE; CompletionService &#x5BFC;&#x51FA; submit/poll/take &#x65B9;&#x6CD5;&#x3002;</p>
<p>&#xA0;&#xA0; &#xA0;&#x4E0B;&#x5217;&#x4EE3;&#x7801;&#x4F7F;&#x7528; Executor &#x548C; CompletionService &#x6765;&#x542F;&#x52A8;&#x8BB8;&#x591A;&quot;solver&quot;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x751F;&#x6210;&#x975E;&#x7A7A;&#x7ED3;&#x679C;&#x7684;&#x4EFB;&#x52A1;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x7136;&#x540E;&#x53D6;&#x6D88;&#x5176;&#x4F59;&#x4EFB;&#x52A1;&#xFF1A;</p>
<p>void solve(Executor e, Collection&gt; solvers)</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; throws InterruptedException {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; CompletionService ecs = new ExecutorCompletionService(e);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; int n = solvers.size();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; List&gt; futures = new ArrayList&gt;(n);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Result result = null;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; try {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; for (Callable s : solvers)</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; futures.add(ecs.submit(s));</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; for (int i = 0; i &lt; n; ++i) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; try {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Result r = ecs.take().get();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; if (r != null) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; result = r;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; break;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; } catch(ExecutionException ignore) {}</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0; &#xA0;&#xA0;&#xA0;&#xA0;&#xA0;finally {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; for (Future f : futures)</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; f.cancel(true);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; if (result != null)</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; use(result);</p>
<p>&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x4E2D;&#x5176;&#x4ED6;&#x7C7B;&#x522B;&#x7684;&#x6709;&#x7528;&#x7684;&#x7C7B;&#x4E5F;&#x662F;&#x540C;&#x6B65;&#x5DE5;&#x5177;&#x3002;&#x8FD9;&#x7EC4;&#x7C7B;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#xFF0C;&#x63A7;&#x5236;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x6267;&#x884C;&#x6D41;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; Semaphore&#x3001;CyclicBarrier&#x3001;CountdownLatch &#x548C; Exchanger &#x7C7B;&#x90FD;&#x662F;&#x540C;&#x6B65;&#x5DE5;&#x5177;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x6709;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x65B9;&#x6CD5;&#x662F;&#x5426;&#x88AB;&#x963B;&#x585E;&#x53D6;&#x51B3;&#x4E8E;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x7279;&#x5B9A;&#x540C;&#x6B65;&#x5DE5;&#x5177;&#x7684;&#x72B6;&#x6001;&#x548C;&#x89C4;&#x5219;&#x3002;</p>
<p> Semaphore</p>
<p>&#xA0;&#xA0;&#xA0; Semaphore &#x7C7B;&#x5B9E;&#x73B0;&#x6807;&#x51C6; Dijkstra &#x8BA1;&#x6570;&#x4FE1;&#x53F7;&#x3002;&#x8BA1;&#x6570;&#x4FE1;&#x53F7;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8BB8;&#x53EF;&#x6743;&#xFF0C;&#x8BE5;&#x8BB8;&#x53EF;&#x6743;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x6216;&#x91CA;&#x653E;&#x3002;&#x5982;&#x679C;&#x6709;&#x5269;&#x4F59;&#x7684;&#x8BB8;&#x53EF;&#x6743;&#xFF0C;acquire() &#x65B9;&#x6CD5;&#x5C06;&#x6210;&#x529F;&#xFF0C;&#x5426;&#x5219;&#x8BE5;&#x65B9;&#x6CD5;&#x5C06;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x53EF;&#x7528;&#x7684;&#x8BB8;&#x53EF;&#x6743;&#xFF08;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x91CA;&#x653E;&#x8BB8;&#x53EF;&#x6743;&#xFF09;&#x3002;&#x7EBF;&#x7A0B;&#x4E00;&#x6B21;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x591A;&#x4E2A;&#x8BB8;&#x53EF;&#x6743;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8BA1;&#x6570;&#x4FE1;&#x53F7;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x9650;&#x5236;&#x6709;&#x6743;&#x5BF9;&#x8D44;&#x6E90;&#x8FDB;&#x884C;&#x5E76;&#x53D1;&#x8BBF;&#x95EE;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5BF9;&#x4E8E;&#x5B9E;&#x73B0;&#x8D44;&#x6E90;&#x6C60;&#x6216;&#x9650;&#x5236; Web &#x722C;&#x866B;&#xFF08;Web crawler&#xFF09;&#x4E2D;&#x7684;&#x8F93;&#x51FA; socket &#x8FDE;&#x63A5;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6CE8;&#x610F;&#x4FE1;&#x53F7;&#x4E0D;&#x8DDF;&#x8E2A;&#x54EA;&#x4E2A;&#x7EBF;&#x7A0B;&#x62E5;&#x6709;&#x591A;&#x5C11;&#x8BB8;&#x53EF;&#x6743;&#xFF1B;&#x8FD9;&#x7531;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x51B3;&#x5B9A;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4F55;&#x65F6;&#x7EBF;&#x7A0B;&#x91CA;&#x653E;&#x8BB8;&#x53EF;&#x6743;&#xFF0C;&#x8BE5;&#x4FE1;&#x53F7;&#x8868;&#x793A;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x62E5;&#x6709;&#x8BB8;&#x53EF;&#x6743;&#x6216;&#x8005;&#x6B63;&#x5728;&#x91CA;&#x653E;&#x8BB8;&#x53EF;&#x6743;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x77E5;&#x9053;&#x5B83;&#x7684;&#x8BB8;&#x53EF;&#x6743;&#x5DF2;&#x91CA;&#x653E;&#x3002;</p>
<p> &#x4E92;&#x65A5;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8BA1;&#x6570;&#x4FE1;&#x53F7;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x662F;&#x4E92;&#x65A5;&#xFF0C;&#x6216;&#x8005;&#x4E92;&#x65A5;&#x4FE1;&#x53F7;&#x3002;&#x4E92;&#x65A5;&#x5C31;&#x662F;&#x5177;&#x6709;&#x5355;&#x4E00;&#x8BB8;&#x53EF;&#x6743;&#x7684;&#x8BA1;&#x6570;&#x4FE1;&#x53F7;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x5728;&#x7ED9;&#x5B9A;&#x65F6;&#x95F4;&#x4EC5;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5177;&#x6709;&#x8BB8;&#x53EF;&#x6743;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;&#x4E8C;&#x8FDB;&#x5236;&#x4FE1;&#x53F7;&#xFF09;&#x3002;&#x4E92;&#x65A5;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x7BA1;&#x7406;&#x5BF9;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x7684;&#x72EC;&#x5360;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x867D;&#x7136;&#x4E92;&#x65A5;&#x8BB8;&#x591A;&#x5730;&#x65B9;&#x4E0E;&#x9501;&#x5B9A;&#x4E00;&#x6837;&#xFF0C;&#x4F46;&#x4E92;&#x65A5;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x9501;&#x5B9A;&#x901A;&#x5E38;&#x6CA1;&#x6709;&#x7684;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#xFF0C;&#x5C31;&#x662F;&#x4E92;&#x65A5;&#x53EF;&#x4EE5;&#x7531;&#x5177;&#x6709;&#x8BB8;&#x53EF;&#x6743;&#x7684;&#x7EBF;&#x7A0B;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x6765;&#x91CA;&#x653E;&#x3002;&#x8FD9;&#x5728;&#x6B7B;&#x9501;&#x6062;&#x590D;&#x65F6;&#x4F1A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; CyclicBarrier &#x7C7B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x540C;&#x6B65;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x4E00;&#x7EC4;&#x7EBF;&#x7A0B;&#x7B49;&#x5F85;&#x6574;&#x4E2A;&#x7EBF;&#x7A0B;&#x7EC4;&#x5230;&#x8FBE;&#x516C;&#x5171;&#x5C4F;&#x969C;&#x70B9;&#x3002;CyclicBarrier &#x662F;&#x4F7F;&#x7528;&#x6574;&#x578B;&#x53D8;&#x91CF;&#x6784;&#x9020;&#x7684;&#xFF0C;&#x5176;&#x786E;&#x5B9A;&#x7EC4;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#x65F6;&#xFF08;&#x901A;&#x8FC7;&#x8C03;&#x7528; CyclicBarrier.await()&#xFF09;&#xFF0C;&#x5B83;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x90FD;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x8BE5;&#x70B9;&#x5141;&#x8BB8;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x3002;&#x8BE5;&#x64CD;&#x4F5C;&#x4E0E;&#x8BB8;&#x591A;&#x5BB6;&#x5EAD;&#x901B;&#x5546;&#x4E1A;&#x8857;&#x76F8;&#x4F3C; — &#x6BCF;&#x4E2A;&#x5BB6;&#x5EAD;&#x6210;&#x5458;&#x90FD;&#x81EA;&#x5DF1;&#x8D70;&#xFF0C;&#x5E76;&#x5546;&#x5B9A; 1:00 &#x5728;&#x7535;&#x5F71;&#x9662;&#x96C6;&#x5408;&#x3002;&#x5F53;&#x60A8;&#x5230;&#x7535;&#x5F71;&#x9662;&#x4F46;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x5230;&#x4E86;&#x65F6;&#xFF0C;&#x60A8;&#x4F1A;&#x5750;&#x4E0B;&#x6765;&#x7B49;&#x5176;&#x4ED6;&#x4EBA;&#x5230;&#x8FBE;&#x3002;&#x7136;&#x540E;&#x6240;&#x6709;&#x4EBA;&#x4E00;&#x8D77;&#x79BB;&#x5F00;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8BA4;&#x4E3A;&#x5C4F;&#x969C;&#x662F;&#x5FAA;&#x73AF;&#x7684;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#xFF1B;&#x4E00;&#x65E6;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x90FD;&#x5DF2;&#x7ECF;&#x5728;&#x5C4F;&#x969C;&#x5904;&#x96C6;&#x5408;&#x5E76;&#x91CA;&#x653E;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5C06;&#x8BE5;&#x5C4F;&#x969C;&#x91CD;&#x65B0;&#x521D;&#x59CB;&#x5316;&#x5230;&#x5B83;&#x7684;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x3002; &#x8FD8;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x5728;&#x5C4F;&#x969C;&#x5904;&#x7B49;&#x5F85;&#x65F6;&#x7684;&#x8D85;&#x65F6;&#xFF1B;&#x5982;&#x679C;&#x5728;&#x8BE5;&#x65F6;&#x95F4;&#x5185;&#x5176;&#x4F59;&#x7EBF;&#x7A0B;&#x8FD8;&#x6CA1;&#x6709;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x5C4F;&#x969C;&#x88AB;&#x6253;&#x7834;&#xFF0C;&#x6240;&#x6709;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x7684;&#x7EBF;&#x7A0B;&#x4F1A;&#x6536;&#x5230; BrokenBarrierException&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0B;&#x5217;&#x4EE3;&#x7801;&#x5C06;&#x521B;&#x5EFA; CyclicBarrier &#x5E76;&#x542F;&#x52A8;&#x4E00;&#x7EC4;&#x7EBF;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5C06;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x7B49;&#x5F85;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x4E4B;&#x540E;&#xFF0C;&#x518D;&#x68C0;&#x67E5;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x5426;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E2A;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x5C06;&#x5F00;&#x59CB;&#x53E6;&#x4E00;&#x4E2A;&#x8FED;&#x4EE3;&#x3002;&#x8BE5;&#x4F8B;&#x5C06;&#x4F7F;&#x7528; CyclicBarrier &#x53D8;&#x91CF;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x6CE8;&#x518C; Runnable&#xFF0C;&#x5728;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#x4F46;&#x8FD8;&#x6CA1;&#x6709;&#x91CA;&#x653E;&#x4EFB;&#x4F55;&#x7EBF;&#x7A0B;&#x65F6;&#x6267;&#x884C; Runnable&#x3002;</p>
<p>class Solver { // Code sketch</p>
<p>&#xA0; void solve(final Problem p, int nThreads) {</p>
<p>&#xA0; final CyclicBarrier barrier =</p>
<p>&#xA0;&#xA0;&#xA0; new CyclicBarrier(nThreads,</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; new Runnable() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; public void run() { p.checkConvergence(); }}</p>
<p>&#xA0;&#xA0;&#xA0; );</p>
<p>&#xA0;&#xA0;&#xA0; for (int i = 0; i &lt; nThreads; ++i) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; final int id = i;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Runnable worker = new Runnable() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; final Segment segment = p.createSegment(id);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; &#xA0;&#xA0;&#xA0;public void run() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; try {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; while (!p.converged()) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; segment.update();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; barrier.await();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; catch(Exception e) { return; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; };</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; new Thread(worker).start();</p>
<p>&#xA0;&#xA0; }</p>
<p>}</p>
<p> CountdownLatch</p>
<p>&#xA0;&#xA0;&#xA0; CountdownLatch &#x7C7B;&#x4E0E; CyclicBarrier &#x76F8;&#x4F3C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x89D2;&#x8272;&#x662F;&#x5BF9;&#x5DF2;&#x7ECF;&#x5728;&#x5B83;&#x4EEC;&#x4E2D;&#x95F4;&#x5206;&#x644A;&#x4E86;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x7EC4;&#x7EBF;&#x7A0B;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#x3002;&#x5B83;&#x4E5F;&#x662F;&#x4F7F;&#x7528;&#x6574;&#x578B;&#x53D8;&#x91CF;&#x6784;&#x9020;&#x7684;&#xFF0C;&#x6307;&#x660E;&#x8BA1;&#x6570;&#x7684;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x4E0E; CyclicBarrier &#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;CountdownLatch &#x4E0D;&#x80FD;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5176;&#x4E2D;&#xFF0C;CyclicBarrier &#x662F;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x7684;&#x5927;&#x95E8;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x90FD;&#x5DF2;&#x7ECF;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#x6216;&#x5C4F;&#x969C;&#x88AB;&#x6253;&#x7834;&#x65F6;&#xFF0C;&#x624D;&#x5141;&#x8BB8;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x901A;&#x8FC7;&#xFF0C;CountdownLatch &#x5C06;&#x5230;&#x8FBE;&#x548C;&#x7B49;&#x5F85;&#x529F;&#x80FD;&#x5206;&#x79BB;&#x3002;&#x4EFB;&#x4F55;&#x7EBF;&#x7A0B;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528; countDown() &#x51CF;&#x5C11;&#x5F53;&#x524D;&#x8BA1;&#x6570;&#xFF0C;&#x8FD9;&#x79CD;&#x4E0D;&#x4F1A;&#x963B;&#x585E;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x51CF;&#x5C11;&#x8BA1;&#x6570;&#x3002;await() &#x65B9;&#x6CD5;&#x7684;&#x884C;&#x4E3A;&#x4E0E; CyclicBarrier.await() &#x7A0D;&#x5FAE;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF0C;&#x8C03;&#x7528; await() &#x4EFB;&#x4F55;&#x7EBF;&#x7A0B;&#x90FD;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x95E9;&#x9501;&#x8BA1;&#x6570;&#x51CF;&#x5C11;&#x4E3A;&#x96F6;&#xFF0C;&#x5728;&#x8BE5;&#x70B9;&#x7B49;&#x5F85;&#x7684;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x624D;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x5BF9; await() &#x7684;&#x540E;&#x7EED;&#x8C03;&#x7528;&#x5C06;&#x7ACB;&#x5373;&#x8FD4;&#x56DE;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5F53;&#x95EE;&#x9898;&#x5DF2;&#x7ECF;&#x5206;&#x89E3;&#x4E3A;&#x8BB8;&#x591A;&#x90E8;&#x5206;&#xFF0C;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x88AB;&#x5206;&#x914D;&#x4E00;&#x90E8;&#x5206;&#x8BA1;&#x7B97;&#x65F6;&#xFF0C;CountdownLatch &#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x5728;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x51CF;&#x5C11;&#x8BA1;&#x6570;&#xFF0C;&#x534F;&#x8C03;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x95E9;&#x9501;&#x5904;&#x7B49;&#x5F85;&#x5F53;&#x524D;&#x8FD9;&#x4E00;&#x6279;&#x8BA1;&#x7B97;&#x7ED3;&#x675F;&#xFF0C;&#x7136;&#x540E;&#x7EE7;&#x7EED;&#x79FB;&#x81F3;&#x4E0B;&#x4E00;&#x6279;&#x8BA1;&#x7B97;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x76F8;&#x53CD;&#x5730;&#xFF0C;&#x5177;&#x6709;&#x8BA1;&#x6570; 1 &#x7684; CountdownLatch &#x7C7B;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&quot;&#x542F;&#x52A8;&#x5927;&#x95E8;&quot;&#xFF0C;&#x6765;&#x7ACB;&#x5373;&#x542F;&#x52A8;&#x4E00;&#x7EC4;&#x7EBF;&#x7A0B;&#xFF1B;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x5728;&#x95E9;&#x9501;&#x5904;&#x7B49;&#x5F85;&#xFF0C;&#x534F;&#x8C03;&#x7EBF;&#x7A0B;&#x51CF;&#x5C11;&#x8BA1;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x7ACB;&#x5373;&#x91CA;&#x653E;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x3002;&#x4E0B;&#x4F8B;&#x4F7F;&#x7528;&#x4E24;&#x4E2A; CountdownLatche&#x3002;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x542F;&#x52A8;&#x5927;&#x95E8;&#xFF0C;&#x4E00;&#x4E2A;&#x5728;&#x6240;&#x6709;&#x5DE5;&#x4F5C;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x65F6;&#x91CA;&#x653E;&#x7EBF;&#x7A0B;&#xFF1A;</p>
<p>class Driver { // …</p>
<p>&#xA0;&#xA0; void main() throws InterruptedException {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; CountDownLatch startSignal = new CountDownLatch(1);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; CountDownLatch doneSignal = new CountDownLatch(N);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; for (int i = 0; i &lt; N; ++i) // create and start threads</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; new Thread(new Worker(startSignal, doneSignal)).start();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; doSomethingElse();&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; // don&apos;t let them run yet</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; startSignal.countDown();&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; // let all threads proceed</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; doSomethingElse();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; doneSignal.await();&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; // wait for all to finish</p>
<p>&#xA0;&#xA0; }</p>
<p>&#xA0;}</p>
<p>&#xA0;class Worker implements Runnable {</p>
<p>&#xA0;&#xA0; private final CountDownLatch startSignal;</p>
<p>&#xA0;&#xA0; private final CountDownLatch doneSignal;</p>
<p>&#xA0;&#xA0; Worker(CountDownLatch startSignal, CountDownLatch doneSignal) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; this.startSignal = startSignal;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; this.doneSignal = doneSignal;</p>
<p>&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0; public void run() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; try {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; startSignal.await();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; doWork();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; doneSignal.countDown();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; } catch (InterruptedException ex) {} // return;</p>
<p>&#xA0;&#xA0; }</p>
<p>&#xA0;}</p>
<p>&#xA0;&#xA0;&#xA0; Exchanger &#x7C7B;&#x65B9;&#x4FBF;&#x4E86;&#x4E24;&#x4E2A;&#x5171;&#x540C;&#x64CD;&#x4F5C;&#x7EBF;&#x7A0B;&#x4E4B;&#x95F4;&#x7684;&#x53CC;&#x5411;&#x4EA4;&#x6362;&#xFF1B;&#x8FD9;&#x6837;&#xFF0C;&#x5C31;&#x50CF;&#x5177;&#x6709;&#x8BA1;&#x6570;&#x4E3A; 2 &#x7684; CyclicBarrier&#xFF0C;&#x5E76;&#x4E14;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x90FD;&#x5230;&#x8FBE;&#x5C4F;&#x969C;&#x65F6;&#x53EF;&#x4EE5;&quot;&#x4EA4;&#x6362;&quot;&#x4E00;&#x4E9B;&#x72B6;&#x6001;&#x3002;&#xFF08;Exchanger &#x6A21;&#x5F0F;&#x6709;&#x65F6;&#x4E5F;&#x79F0;&#x4E3A;&#x805A;&#x96C6;&#x3002;&#xFF09;</p>
<p>&#xA0;&#xA0;&#xA0; Exchanger &#x901A;&#x5E38;&#x7528;&#x4E8E;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x586B;&#x5145;&#x7F13;&#x51B2;&#xFF08;&#x901A;&#x8FC7;&#x8BFB;&#x53D6; socket&#xFF09;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6E05;&#x7A7A;&#x7F13;&#x51B2;&#xFF08;&#x901A;&#x8FC7;&#x5904;&#x7406;&#x4ECE; socket &#x6536;&#x5230;&#x7684;&#x547D;&#x4EE4;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5F53;&#x4E24;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x5C4F;&#x969C;&#x5904;&#x96C6;&#x5408;&#x65F6;&#xFF0C;&#x5B83;&#x4EEC;&#x4EA4;&#x6362;&#x7F13;&#x51B2;&#x3002;&#x4E0B;&#x5217;&#x4EE3;&#x7801;&#x8BF4;&#x660E;&#x4E86;&#x8FD9;&#x9879;&#x6280;&#x672F;&#xFF1A;</p>
<p>class FillAndEmpty {</p>
<p>&#xA0;&#xA0; Exchanger exchanger = new Exchanger();</p>
<p>&#xA0;&#xA0; DataBuffer initialEmptyBuffer = new DataBuffer();</p>
<p>&#xA0;&#xA0; DataBuffer initialFullBuffer = new DataBuffer();</p>
<p>&#xA0;&#xA0; class FillingLoop implements Runnable {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; public void run() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; DataBuffer currentBuffer = initialEmptyBuffer;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; try {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; while (currentBuffer != null) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; addToBuffer(currentBuffer);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; if (currentBuffer.full())</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; currentBuffer = exchanger.exchange(currentBuffer);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; } catch (InterruptedException ex) { … handle … }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0; class EmptyingLoop implements Runnable {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; public void run() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; DataBuffer currentBuffer = initialFullBuffer;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; try {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; while (currentBuffer != null) {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; takeFromBuffer(currentBuffer);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; if (currentBuffer.empty())</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; currentBuffer = exchanger.exchange(currentBuffer);</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; } catch (InterruptedException ex) { … handle …}</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0; }</p>
<p>&#xA0;&#xA0; void start() {</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; new Thread(new FillingLoop()).start();</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0; new Thread(new EmptyingLoop()).start();</p>
<p>&#xA0; &#xA0;}</p>
<p>&#xA0;}</p>
<p> &#x9501;&#x5B9A;&#x548C;&#x539F;&#x5B50;&#x4E4B;Lock</p>
<p>&#xA0;&#xA0;&#xA0; Java &#x8BED;&#x8A00;&#x5185;&#x7F6E;&#x4E86;&#x9501;&#x5B9A;&#x5DE5;&#x5177; — synchronized &#x5173;&#x952E;&#x5B57;&#x3002;&#x5F53;&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#x76D1;&#x89C6;&#x5668;&#x65F6;&#xFF08;&#x5185;&#x7F6E;&#x9501;&#x5B9A;&#xFF09;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5982;&#x679C;&#x8BD5;&#x56FE;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x9501;&#x5B9A;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x4EEC;&#x5C06;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x91CA;&#x653E;&#x8BE5;&#x9501;&#x5B9A;&#x3002;&#x540C;&#x6B65;&#x8FD8;&#x786E;&#x4FDD;&#x968F;&#x540E;&#x83B7;&#x5F97;&#x76F8;&#x540C;&#x9501;&#x5B9A;&#x7684;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x7EBF;&#x7A0B;&#x5728;&#x5177;&#x6709;&#x8BE5;&#x9501;&#x5B9A;&#x65F6;&#x6240;&#x4FEE;&#x6539;&#x7684;&#x53D8;&#x91CF;&#x7684;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x786E;&#x4FDD;&#x5982;&#x679C;&#x7C7B;&#x6B63;&#x786E;&#x5730;&#x540C;&#x6B65;&#x4E86;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x7684;&#x8BBF;&#x95EE;&#x6743;&#xFF0C;&#x90A3;&#x4E48;&#x7EBF;&#x7A0B;&#x5C06;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x53D8;&#x91CF;&#x7684;&quot;&#x5931;&#x6548;&quot;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x7F13;&#x5B58;&#x6216;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x867D;&#x7136;&#x540C;&#x6B65;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x5B83;&#x6709;&#x4E00;&#x4E9B;&#x9650;&#x5236;&#xFF0C;&#x5728;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F1A;&#x9020;&#x6210;&#x4E0D;&#x4FBF;&#x3002;Lock &#x63A5;&#x53E3;&#x5C06;&#x5185;&#x7F6E;&#x76D1;&#x89C6;&#x5668;&#x9501;&#x5B9A;&#x7684;&#x9501;&#x5B9A;&#x884C;&#x4E3A;&#x666E;&#x904D;&#x5316;&#xFF0C;&#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x9501;&#x5B9A;&#x5B9E;&#x73B0;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x5185;&#x7F6E;&#x9501;&#x5B9A;&#x7F3A;&#x5C11;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#x8BA1;&#x65F6;&#x7684;&#x7B49;&#x5F85;&#x3001;&#x53EF;&#x4E2D;&#x65AD;&#x7684;&#x7B49;&#x5F85;&#x3001;&#x9501;&#x5B9A;&#x8F6E;&#x8BE2;&#x3001;&#x6BCF;&#x4E2A;&#x9501;&#x5B9A;&#x6709;&#x591A;&#x4E2A;&#x6761;&#x4EF6;&#x7B49;&#x5F85;&#x96C6;&#x5408;&#x4EE5;&#x53CA;&#x65E0;&#x963B;&#x585E;&#x7ED3;&#x6784;&#x7684;&#x9501;&#x5B9A;&#x3002;</p>
<p>interface Lock {</p>
<p>&#xA0;&#xA0;&#xA0; void lock();</p>
<p>&#xA0;&#xA0;&#xA0; void lockInterruptibly() throws IE;</p>
<p>&#xA0;&#xA0;&#xA0; boolean tryLock();</p>
<p>&#xA0;&#xA0;&#xA0; boolean tryLock(long time,</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; TimeUnit unit) throws IE;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;</p>
<p>&#xA0;&#xA0;&#xA0; void unlock();</p>
<p>&#xA0;&#xA0;&#xA0; Condition newCondition() throws</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; UnsupportedOperationException;</p>
<p>&#xA0; }</p>
<p> ReentrantLock</p>
<p>&#xA0;&#xA0;&#xA0; ReentrantLock &#x662F;&#x5177;&#x6709;&#x4E0E;&#x9690;&#x5F0F;&#x76D1;&#x89C6;&#x5668;&#x9501;&#x5B9A;&#xFF08;&#x4F7F;&#x7528; synchronized &#x65B9;&#x6CD5;&#x548C;&#x8BED;&#x53E5;&#x8BBF;&#x95EE;&#xFF09;&#x76F8;&#x540C;&#x7684;&#x57FA;&#x672C;&#x884C;&#x4E3A;&#x548C;&#x8BED;&#x4E49;&#x7684; Lock &#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x4F46;&#x5B83;&#x5177;&#x6709;&#x6269;&#x5C55;&#x7684;&#x80FD;&#x529B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4F5C;&#x4E3A;&#x989D;&#x5916;&#x6536;&#x83B7;&#xFF0C;&#x5728;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;ReentrantLock &#x7684;&#x5B9E;&#x73B0;&#x8981;&#x6BD4;&#x73B0;&#x5728;&#x7684; synchronized &#x5B9E;&#x73B0;&#x66F4;&#x5177;&#x6709;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3002;&#xFF08;&#x6709;&#x53EF;&#x80FD;&#x5728; JVM &#x7684;&#x5C06;&#x6765;&#x7248;&#x672C;&#x4E2D;&#x6539;&#x8FDB; synchronized &#x7684;&#x7ADE;&#x4E89;&#x6027;&#x80FD;&#x3002;&#xFF09;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x5F53;&#x8BB8;&#x591A;&#x7EBF;&#x7A0B;&#x90FD;&#x7ADE;&#x4E89;&#x76F8;&#x540C;&#x9501;&#x5B9A;&#x65F6;&#xFF0C;&#x4F7F;&#x7528; ReentrantLock &#x7684;&#x541E;&#x5410;&#x91CF;&#x901A;&#x5E38;&#x8981;&#x6BD4; synchronized &#x597D;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5F53;&#x8BB8;&#x591A;&#x7EBF;&#x7A0B;&#x8BD5;&#x56FE;&#x8BBF;&#x95EE; ReentrantLock &#x4FDD;&#x62A4;&#x7684;&#x5171;&#x4EAB;&#x8D44;&#x6E90;&#x65F6;&#xFF0C;JVM &#x5C06;&#x82B1;&#x8D39;&#x8F83;&#x5C11;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x8C03;&#x5EA6;&#x7EBF;&#x7A0B;&#xFF0C;&#x800C;&#x7528;&#x66F4;&#x591A;&#x4E2A;&#x65F6;&#x95F4;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x867D;&#x7136; ReentrantLock &#x7C7B;&#x6709;&#x8BB8;&#x591A;&#x4F18;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x4E0E;&#x540C;&#x6B65;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x7F3A;&#x70B9; — &#x5B83;&#x53EF;&#x80FD;&#x5FD8;&#x8BB0;&#x91CA;&#x653E;&#x9501;&#x5B9A;&#x3002;&#x5EFA;&#x8BAE;&#x5F53;&#x83B7;&#x5F97;&#x548C;&#x91CA;&#x653E; ReentrantLock &#x65F6;&#x4F7F;&#x7528;&#x4E0B;&#x5217;&#x7ED3;&#x6784;&#xFF1A;</p>
<p>Lock lock = new ReentrantLock();</p>
<p>…</p>
<p>lock.lock();</p>
<p>try {</p>
<p>&#xA0; // perform operations protected by lock</p>
<p>}</p>
<p>catch(Exception ex) {</p>
<p>&#xA0;// restore invariants</p>
<p>}</p>
<p>finally {</p>
<p>&#xA0; lock.unlock();</p>
<p>}</p>
<p>&#xA0;&#xA0;&#xA0; &#x56E0;&#x4E3A;&#x9501;&#x5B9A;&#x5931;&#x8BEF;&#xFF08;&#x5FD8;&#x8BB0;&#x91CA;&#x653E;&#x9501;&#x5B9A;&#xFF09;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x57FA;&#x672C;&#x9501;&#x5B9A;&#xFF0C;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x60A8;&#x7EE7;&#x7EED;&#x4F7F;&#x7528; synchronized&#xFF0C;&#x9664;&#x975E;&#x771F;&#x7684;&#x9700;&#x8981; ReentrantLock &#x989D;&#x5916;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; ReentrantLock &#x662F;&#x7528;&#x4E8E;&#x9AD8;&#x7EA7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9AD8;&#x7EA7;&#x5DE5;&#x5177; — &#x6709;&#x65F6;&#x9700;&#x8981;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x7528;&#x539F;&#x6765;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x5F88;&#x597D;&#x3002;</p>
<p> Condition</p>
<p>&#xA0;&#xA0;&#xA0; &#x5C31;&#x50CF; Lock &#x63A5;&#x53E3;&#x662F;&#x540C;&#x6B65;&#x7684;&#x5177;&#x4F53;&#x5316;&#xFF0C;Condition &#x63A5;&#x53E3;&#x662F; Object &#x4E2D; wait() &#x548C; notify() &#x65B9;&#x6CD5;&#x7684;&#x5177;&#x4F53;&#x5316;&#x3002;Lock &#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x662F; newCondition()&#xFF0C;&#x5B83;&#x8981;&#x6C42;&#x9501;&#x5B9A;&#x5411;&#x8BE5;&#x9501;&#x5B9A;&#x8FD4;&#x56DE;&#x65B0;&#x7684; Condition &#x5BF9;&#x8C61;&#x9650;&#x5236;&#x3002;await()&#x3001;signal() &#x548C; signalAll() &#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E8E; wait()&#x3001;notify() &#x548C; notifyAll()&#xFF0C;&#x4F46;&#x589E;&#x52A0;&#x4E86;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x6BCF;&#x4E2A; Lock &#x90FD;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x6761;&#x4EF6;&#x53D8;&#x91CF;&#x3002;&#x8FD9;&#x7B80;&#x5316;&#x4E86;&#x4E00;&#x4E9B;&#x5E76;&#x53D1;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p> ReadWriteLock</p>
<p>&#xA0;&#xA0; &#xA0;ReentrantLock &#x5B9E;&#x73B0;&#x7684;&#x9501;&#x5B9A;&#x89C4;&#x5219;&#x975E;&#x5E38;&#x7B80;&#x5355; — &#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5177;&#x6709;&#x9501;&#x5B9A;&#x65F6;&#xFF0C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#xFF0C;&#x76F4;&#x5230;&#x8BE5;&#x9501;&#x5B9A;&#x53EF;&#x7528;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x5F53;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x8BFB;&#x53D6;&#x901A;&#x5E38;&#x591A;&#x4E8E;&#x4FEE;&#x6539;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x66F4;&#x590D;&#x6742;&#x7684;&#x79F0;&#x4E3A;&#x8BFB;&#x5199;&#x9501;&#x5B9A;&#x7684;&#x9501;&#x5B9A;&#x7ED3;&#x6784;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x6709;&#x591A;&#x4E2A;&#x5E76;&#x53D1;&#x8BFB;&#x8005;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x5199;&#x5165;&#x8005;&#x72EC;&#x5360;&#x9501;&#x5B9A;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x53EA;&#x8BFB;&#xFF09;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x5927;&#x7684;&#x5E76;&#x53D1;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x5728;&#x5FC5;&#x8981;&#x65F6;&#x4ECD;&#x63D0;&#x4F9B;&#x72EC;&#x5360;&#x8BBF;&#x95EE;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;ReadWriteLock &#x63A5;&#x53E3;&#x548C; ReentrantReadWriteLock &#x7C7B;&#x63D0;&#x4F9B;&#x8FD9;&#x79CD;&#x529F;&#x80FD; — &#x591A;&#x8BFB;&#x8005;&#x3001;&#x5355;&#x5199;&#x5165;&#x8005;&#x9501;&#x5B9A;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x8FD9;&#x79CD;&#x529F;&#x80FD;&#x6765;&#x4FDD;&#x62A4;&#x5171;&#x4EAB;&#x7684;&#x6613;&#x53D8;&#x8D44;&#x6E90;&#x3002;</p>
<p> &#x539F;&#x5B50;&#x53D8;&#x91CF;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5373;&#x4F7F;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x5C06;&#x5F88;&#x5C11;&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7C7B;&#xFF08;AtomicInteger&#x3001;AtomicLong&#x3001;AtomicReference &#x7B49;&#x7B49;&#xFF09;&#x4E5F;&#x6709;&#x5145;&#x5206;&#x7406;&#x7531;&#x662F;&#x6700;&#x663E;&#x8457;&#x7684;&#x65B0;&#x5E76;&#x53D1;&#x7C7B;&#x3002;&#x8FD9;&#x4E9B;&#x7C7B;&#x516C;&#x5F00;&#x5BF9; JVM &#x7684;&#x4F4E;&#x7EA7;&#x522B;&#x6539;&#x8FDB;&#xFF0C;&#x5141;&#x8BB8;&#x8FDB;&#x884C;&#x5177;&#x6709;&#x9AD8;&#x5EA6;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7684;&#x539F;&#x5B50;&#x8BFB;-&#x4FEE;&#x6539;-&#x5199;&#x64CD;&#x4F5C;&#x3002;&#x5927;&#x591A;&#x6570;&#x73B0;&#x4EE3; CPU &#x90FD;&#x6709;&#x539F;&#x5B50;&#x8BFB;-&#x4FEE;&#x6539;-&#x5199;&#x7684;&#x539F;&#x8BED;&#xFF0C;&#x6BD4;&#x5982;&#x6BD4;&#x8F83;&#x5E76;&#x4EA4;&#x6362;&#xFF08;CAS&#xFF09;&#x6216;&#x52A0;&#x8F7D;&#x94FE;&#x63A5;/&#x6761;&#x4EF6;&#x5B58;&#x50A8;&#xFF08;LL/SC&#xFF09;&#x3002;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7C7B;&#x4F7F;&#x7528;&#x786C;&#x4EF6;&#x63D0;&#x4F9B;&#x7684;&#x6700;&#x5FEB;&#x7684;&#x5E76;&#x53D1;&#x7ED3;&#x6784;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x8BB8;&#x591A;&#x5E76;&#x53D1;&#x7B97;&#x6CD5;&#x90FD;&#x662F;&#x6839;&#x636E;&#x5BF9;&#x8BA1;&#x6570;&#x5668;&#x6216;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x6BD4;&#x8F83;&#x5E76;&#x4EA4;&#x6362;&#x64CD;&#x4F5C;&#x6765;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x901A;&#x8FC7;&#x66B4;&#x9732;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x3001;&#x9AD8;&#x5EA6;&#x53EF;&#x4F38;&#x7F29;&#x7684; CAS &#x64CD;&#x4F5C;&#xFF08;&#x4EE5;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7684;&#x5F62;&#x5F0F;&#xFF09;&#xFF0C;&#x7528; Java &#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x65E0;&#x7B49;&#x5F85;&#x3001;&#x65E0;&#x9501;&#x5B9A;&#x7684;&#x5E76;&#x53D1;&#x7B97;&#x6CD5;&#x5DF2;&#x7ECF;&#x53D8;&#x5F97;&#x53EF;&#x884C;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x51E0;&#x4E4E; java.util.concurrent &#x4E2D;&#x7684;&#x6240;&#x6709;&#x7C7B;&#x90FD;&#x662F;&#x5728; ReentrantLock &#x4E4B;&#x4E0A;&#x6784;&#x5EFA;&#x7684;&#xFF0C;ReentrantLock &#x5219;&#x662F;&#x5728;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7C7B;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6784;&#x5EFA;&#x7684;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x867D;&#x7136;&#x4EC5;&#x5C11;&#x6570;&#x5E76;&#x53D1;&#x4E13;&#x5BB6;&#x4F7F;&#x7528;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7C7B;&#xFF0C;&#x4F46; java.util.concurrent &#x7C7B;&#x7684;&#x5F88;&#x591A;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x6539;&#x8FDB;&#x90FD;&#x662F;&#x7531;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x7684;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x539F;&#x5B50;&#x53D8;&#x91CF;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x4E3A;&#x539F;&#x5B50;&#x5730;&#x66F4;&#x65B0;&quot;&#x70ED;&quot;&#x5B57;&#x6BB5;&#x63D0;&#x4F9B;&#x6709;&#x6548;&#x7684;&#x3001;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&quot;&#x70ED;&quot;&#x5B57;&#x6BB5;&#x662F;&#x6307;&#x7531;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x9891;&#x7E41;&#x8BBF;&#x95EE;&#x548C;&#x66F4;&#x65B0;&#x7684;&#x5B57;&#x6BB5;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x8FD8;&#x662F;&#x8BA1;&#x6570;&#x5668;&#x6216;&#x751F;&#x6210;&#x5E8F;&#x53F7;&#x7684;&#x81EA;&#x7136;&#x673A;&#x5236;&#x3002;</p>
<p> &#x6027;&#x80FD;&#x4E0E;&#x53EF;&#x4F38;&#x7F29;&#x6027;</p>
<p>&#xA0;&#xA0;&#xA0; &#x867D;&#x7136; java.util.concurrent &#x52AA;&#x529B;&#x7684;&#x9996;&#x8981;&#x76EE;&#x6807;&#x662F;&#x4F7F;&#x7F16;&#x5199;&#x6B63;&#x786E;&#x3001;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x7C7B;&#x66F4;&#x52A0;&#x5BB9;&#x6613;&#xFF0C;&#x4F46;&#x5B83;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6B21;&#x8981;&#x76EE;&#x6807;&#xFF0C;&#x5C31;&#x662F;&#x63D0;&#x4F9B;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3002;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x4E0E;&#x6027;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x6709;&#x65F6;&#x8981;&#x4EE5;&#x6027;&#x80FD;&#x4E3A;&#x4EE3;&#x4EF7;&#x6765;&#x83B7;&#x5F97;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x6027;&#x80FD;&#x662F;&quot;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x6267;&#x884C;&#x6B64;&#x4EFB;&#x52A1;&#x7684;&#x7A0B;&#x5EA6;&quot;&#x7684;&#x8BC4;&#x6D4B;&#x3002;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x63CF;&#x8FF0;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x541E;&#x5410;&#x91CF;&#x5982;&#x4F55;&#x8868;&#x73B0;&#x4E3A;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x548C;&#x53EF;&#x7528;&#x8BA1;&#x7B97;&#x8D44;&#x6E90;&#x589E;&#x52A0;&#x3002;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x6309;&#x6BD4;&#x4F8B;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x5904;&#x7406;&#x5668;&#x3001;&#x5185;&#x5B58;&#x6216; I/O &#x5E26;&#x5BBD;&#x6765;&#x5904;&#x7406;&#x66F4;&#x591A;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x5E76;&#x53D1;&#x73AF;&#x5883;&#x4E2D;&#x8C08;&#x8BBA;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x5728;&#x95EE;&#x5F53;&#x8BB8;&#x591A;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x8BBF;&#x95EE;&#x7ED9;&#x5B9A;&#x7C7B;&#x65F6;&#xFF0C;&#x8FD9;&#x4E2A;&#x7C7B;&#x7684;&#x6267;&#x884C;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x4E2D;&#x7684;&#x4F4E;&#x7EA7;&#x522B;&#x7C7B; ReentrantLock &#x548C;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7C7B;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x8981;&#x6BD4;&#x5185;&#x7F6E;&#x76D1;&#x89C6;&#x5668;&#xFF08;&#x540C;&#x6B65;&#xFF09;&#x9501;&#x5B9A;&#x9AD8;&#x5F97;&#x591A;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4F7F;&#x7528; ReentrantLock &#x6216;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x7C7B;&#x6765;&#x534F;&#x8C03;&#x5171;&#x4EAB;&#x8BBF;&#x95EE;&#x7684;&#x7C7B;&#x4E5F;&#x53EF;&#x80FD;&#x66F4;&#x5177;&#x6709;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3002;</p>
<p> Hashtable&#xA0;&#x4E0E; ConcurrentHashMap</p>
<p>&#xA0;&#xA0;&#xA0; &#x4F5C;&#x4E3A;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;ConcurrentHashMap &#x5B9E;&#x73B0;&#x8BBE;&#x8BA1;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x8981;&#x6BD4;&#x5176;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x4E0A;&#x4E00;&#x4EE3; Hashtable &#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x5F3A;&#x5F97;&#x591A;&#x3002;Hashtable &#x4E00;&#x6B21;&#x53EA;&#x5141;&#x8BB8;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE; Map&#xFF1B;ConcurrentHashMap &#x5141;&#x8BB8;&#x591A;&#x4E2A;&#x8BFB;&#x8005;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x8BFB;&#x8005;&#x4E0E;&#x5199;&#x5165;&#x8005;&#x5E76;&#x53D1;&#x6267;&#x884C;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x5199;&#x5165;&#x8005;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x8BB8;&#x591A;&#x7EBF;&#x7A0B;&#x9891;&#x7E41;&#x8BBF;&#x95EE;&#x5171;&#x4EAB;&#x6620;&#x5C04;&#xFF0C;&#x4F7F;&#x7528; ConcurrentHashMap &#x7684;&#x603B;&#x7684;&#x541E;&#x5410;&#x91CF;&#x8981;&#x6BD4;&#x4F7F;&#x7528; Hashtable &#x7684;&#x597D;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0B;&#x8868;&#x5927;&#x81F4;&#x8BF4;&#x660E;&#x4E86; Hashtable &#x548C; ConcurrentHashMap &#x4E4B;&#x95F4;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x5DEE;&#x522B;&#x3002;&#x5728;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;N &#x4E2A;&#x7EBF;&#x7A0B;&#x5E76;&#x53D1;&#x6267;&#x884C;&#x7D27;&#x5BC6;&#x5FAA;&#x73AF;&#xFF0C;&#x5B83;&#x4EEC;&#x4ECE; Hashtable &#x6216; ConcurrentHashMap &#x4E2D;&#x68C0;&#x7D22;&#x968F;&#x5373;&#x5173;&#x952E;&#x5B57;&#xFF0C;60% &#x7684;&#x5931;&#x8D25;&#x68C0;&#x7D22;&#x5C06;&#x6267;&#x884C; put() &#x64CD;&#x4F5C;&#xFF0C;2% &#x7684;&#x6210;&#x529F;&#x68C0;&#x7D22;&#x6267;&#x884C; remove() &#x64CD;&#x4F5C;&#x3002;&#x6D4B;&#x8BD5;&#x5728;&#x8FD0;&#x884C; Linux &#x7684;&#x53CC;&#x5904;&#x7406;&#x5668; Xeon &#x7CFB;&#x7EDF;&#x4E2D;&#x6267;&#x884C;&#x3002;&#x6570;&#x636E;&#x663E;&#x793A; 10,000,000 &#x4E2A;&#x8FED;&#x4EE3;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#xFF0C;&#x5BF9;&#x4E8E; ConcurrentHashMap&#xFF0C;&#x6807;&#x51C6;&#x5316;&#x4E3A;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x76F4;&#x5230;&#x8BB8;&#x591A;&#x7EBF;&#x7A0B;&#xFF0C;ConcurrentHashMap &#x7684;&#x6027;&#x80FD;&#x4ECD;&#x4FDD;&#x6301;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#xFF0C;&#x800C; Hashtable &#x7684;&#x6027;&#x80FD;&#x5728;&#x51FA;&#x73B0;&#x9501;&#x5B9A;&#x7ADE;&#x4E89;&#x65F6;&#x51E0;&#x4E4E;&#x7ACB;&#x5373;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0E;&#x901A;&#x5E38;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x76F8;&#x6BD4;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x4E2D;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x5C11;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x672A;&#x8FDB;&#x884C;&#x5176;&#x4ED6;&#x64CD;&#x4F5C;&#xFF0C;&#x4EC5;&#x662F;&#x91CD;&#x590D;&#x5730;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x8BE5;&#x8868;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x5728;&#x6267;&#x884C;&#x4E00;&#x4E9B;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x8BE5;&#x8868;&#x7684;&#x5927;&#x91CF;&#x7EBF;&#x7A0B;&#x7684;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x7EBF;&#x7A0B; ConcurrentHashMap&#xA0; Hashtable</p>
<p><table><tbody><tr><td> &#x7EBF;&#x7A0B;</td></tr></tbody></table></p>
<p><td> ConcurrentHashMap</td></p>
<p><td> Hashtable</td></p>
<p><tr><td>1</td></tr></p>
<p><td>1.0</td></p>
<p><td>1.51</td></p>
<p><tr><td>2</td></tr></p>
<p><td>1.44</td></p>
<p><td>17.09</td></p>
<p><tr><td>4</td></tr></p>
<p><td>1.83</td></p>
<p><td>29.9</td></p>
<p><tr><td>8</td></tr></p>
<p><td>4.06</td></p>
<p><td>54.06</td></p>
<p><tr><td>16</td></tr></p>
<p><td>7.5</td></p>
<p><td>119.44</td></p>
<p><tr><td>32</td></tr></p>
<p><td>15.32</td></p>
<p><td>237.2</td></p>
<p> &#xA0;</p>
<p> Lock&#xA0;&#x4E0E; synchronized &#x4E0E;&#x539F;&#x5B50;</p>
<p>&#xA0;&#xA0;&#xA0; &#x4E0B;&#x5217;&#x57FA;&#x51C6;&#x8BF4;&#x660E;&#x4E86;&#x4F7F;&#x7528; java.util.concurrent &#x53EF;&#x80FD;&#x6539;&#x8FDB;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x8BE5;&#x57FA;&#x51C6;&#x5C06;&#x6A21;&#x62DF;&#x65CB;&#x8F6C;&#x9AB0;&#x5B50;&#xFF0C;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x540C;&#x4F59;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x3002;&#x6709;&#x4E09;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#xFF1A;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x6765;&#x7BA1;&#x7406;&#x751F;&#x6210;&#x5668;&#x7684;&#x72B6;&#x6001;&#xFF08;&#x5355;&#x4E00;&#x53D8;&#x91CF;&#xFF09;&#xFF0C;&#x4E00;&#x4E2A;&#x4F7F;&#x7528; ReentrantLock&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5219;&#x4F7F;&#x7528; AtomicLong&#x3002;&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x5728; 8-way Ultrasparc3 &#x7CFB;&#x7EDF;&#x4E0A;&#xFF0C;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x7EBF;&#x7A0B;&#x6570;&#x91CF;&#x65F6;&#x8FD9;&#x4E09;&#x4E2A;&#x7248;&#x672C;&#x7684;&#x76F8;&#x5BF9;&#x541E;&#x5410;&#x91CF;&#x3002;&#xFF08;&#x8BE5;&#x56FE;&#x5BF9;&#x539F;&#x5B50;&#x53D8;&#x91CF;&#x65B9;&#x6CD5;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x63CF;&#x8FF0;&#x6BD4;&#x8F83;&#x4FDD;&#x5B88;&#x3002;&#xFF09;</p>
<p>&#x56FE; 1. &#x4F7F;&#x7528;&#x540C;&#x6B65;&#x3001;Lock &#x548C; AtomicLong &#x7684;&#x76F8;&#x5BF9;&#x541E;&#x5410;&#x91CF;</p>
<p>&#xA0;&#xA0;</p>
<p><img src="http://taojinke.github.io/img/20150701/2758d06.jpg" alt=""></p>
<p> &#x516C;&#x5E73;&#x4E0E;&#x4E0D;&#x516C;&#x5E73;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x4E2D;&#x8BB8;&#x591A;&#x7C7B;&#x4E2D;&#x7684;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5B9A;&#x5236;&#x5143;&#x7D20;&#x662F;&quot;&#x516C;&#x5E73;&quot;&#x7684;&#x95EE;&#x9898;&#x3002;&#x516C;&#x5E73;&#x9501;&#x5B9A;&#x6216;&#x516C;&#x5E73;&#x4FE1;&#x53F7;&#x662F;&#x6307;&#x5728;&#x5176;&#x4E2D;&#x6839;&#x636E;&#x5148;&#x8FDB;&#x5148;&#x51FA;&#xFF08;FIFO&#xFF09;&#x7684;&#x539F;&#x5219;&#x7ED9;&#x4E0E;&#x7EBF;&#x7A0B;&#x9501;&#x5B9A;&#x6216;&#x4FE1;&#x53F7;&#x3002;ReentrantLock&#x3001;Semaphore &#x548C; ReentrantReadWriteLock &#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53D8;&#x91CF;&#x786E;&#x5B9A;&#x9501;&#x5B9A;&#x662F;&#x5426;&#x516C;&#x5E73;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x5426;&#x5141;&#x8BB8;&#x95EF;&#x5165;&#xFF08;&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#x9501;&#x5B9A;&#xFF0C;&#x5373;&#x4F7F;&#x5B83;&#x4EEC;&#x7B49;&#x5F85;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x662F;&#x6700;&#x957F;&#xFF09;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x867D;&#x7136;&#x95EF;&#x5165;&#x9501;&#x5B9A;&#x7684;&#x60F3;&#x6CD5;&#x53EF;&#x80FD;&#x6709;&#x4E9B;&#x53EF;&#x7B11;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x516C;&#x5E73;&#x3001;&#x95EF;&#x5165;&#x7684;&#x9501;&#x5B9A;&#x975E;&#x5E38;&#x666E;&#x904D;&#xFF0C;&#x4E14;&#x901A;&#x5E38;&#x5F88;&#x53D7;&#x6B22;&#x8FCE;&#x3002;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x7F6E;&#x9501;&#x5B9A;&#x4E0D;&#x662F;&#x516C;&#x5E73;&#x9501;&#x5B9A;&#xFF08;&#x4E14;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x4F7F;&#x5B83;&#x4EEC;&#x516C;&#x5E73;&#xFF09;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5B83;&#x4EEC;&#x63D0;&#x4F9B;&#x8F83;&#x5F31;&#x7684;&#x751F;&#x75C5;&#x4FDD;&#x8BC1;&#xFF0C;&#x8981;&#x6C42;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x6700;&#x7EC8;&#x90FD;&#x5C06;&#x83B7;&#x5F97;&#x9501;&#x5B9A;&#x3002;</p>
<p>&#xA0;&#xA0;&#xA0; &#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9009;&#x62E9;&#xFF08;&#x4E14;&#x5E94;&#x8BE5;&#x9009;&#x62E9;&#xFF09;&#x95EF;&#x5165;&#x9501;&#x5B9A;&#x800C;&#x4E0D;&#x662F;&#x516C;&#x5E73;&#x9501;&#x5B9A;&#x7684;&#x539F;&#x56E0;&#x662F;&#x6027;&#x80FD;&#x3002;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B8C;&#x5168;&#x7684;&#x516C;&#x5E73;&#x4E0D;&#x662F;&#x7A0B;&#x5E8F;&#x6B63;&#x786E;&#x6027;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x771F;&#x6B63;&#x516C;&#x5E73;&#x7684;&#x6210;&#x672C;&#x76F8;&#x5F53;&#x9AD8;&#x3002;&#x4E0B;&#x8868;&#x5411;&#x524D;&#x9762;&#x7684;&#x9762;&#x677F;&#x4E2D;&#x7684;&#x8868;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x7B2C;&#x56DB;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5E76;&#x7531;&#x4E00;&#x4E2A;&#x516C;&#x5E73;&#x9501;&#x5B9A;&#x7BA1;&#x7406;&#x5BF9; PRNG &#x72B6;&#x6001;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x6CE8;&#x610F;&#x95EF;&#x5165;&#x9501;&#x5B9A;&#x4E0E;&#x516C;&#x5E73;&#x9501;&#x5B9A;&#x4E4B;&#x95F4;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5DE8;&#x5927;&#x5DEE;&#x522B;&#x3002;</p>
<p>&#x56FE; 2. &#x4F7F;&#x7528;&#x540C;&#x6B65;&#x3001;Lock&#x3001;&#x516C;&#x5E73;&#x9501;&#x5B9A;&#x548C; AtomicLong &#x7684;&#x76F8;&#x5BF9;&#x541E;&#x5410;&#x91CF;</p>
<p>&#xA0;&#xA0;</p>
<p><img src="http://taojinke.github.io/img/20150701/2758d06.jpg" alt=""></p>
<p> &#x7ED3;&#x675F;&#x8BED;</p>
<p>&#xA0;&#xA0;&#xA0; java.util.concurrent &#x5305;&#x4E2D;&#x5305;&#x542B;&#x5927;&#x91CF;&#x6709;&#x7528;&#x7684;&#x6784;&#x5EFA;&#x5FEB;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x6539;&#x8FDB;&#x5E76;&#x53D1;&#x7C7B;&#x7684;&#x6027;&#x80FD;&#x3001;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x3001;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x548C;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6784;&#x5EFA;&#x5FEB;&#xFF0C;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5728;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x4E2D;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x3001;wait/notify &#x548C; Thread.start()&#xFF0C;&#x800C;&#x7528;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x3001;&#x6807;&#x51C6;&#x5316;&#x7684;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x5E76;&#x53D1;&#x5B9E;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x66FF;&#x6362;&#x5B83;&#x4EEC;&#x3002;</p>
<p> Exchanger</p>
<p> CyclicBarrier</p>
<p> Synchronizer</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/分类：-java/">分类： java</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/01/37cc8b8/" title="spring mvc rest 优雅风格 - tang7837010的专栏">
  <strong>上一篇：</strong><br/>
  <span>
  spring mvc rest 优雅风格 - tang7837010的专栏</span>
</a>
</div>


<div class="next">
<a href="/2015/07/01/2701d6c/"  title="java.util.concurrent 多线程框架 - yiihsia的学习阵地">
 <strong>下一篇：</strong><br/> 
 <span>java.util.concurrent 多线程框架 - yiihsia的学习阵地
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>294</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
