
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="edwin jin dianzi blog">
<meta property="og:type" content="website">
<meta property="og:title" content="dianzi blog">
<meta property="og:url" content="http://taojinke.github.io/page/6/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="edwin jin dianzi blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="dianzi blog">
<meta name="twitter:description" content="edwin jin dianzi blog">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f436181/" title="不同的垃圾回收器的比较 -" itemprop="url">不同的垃圾回收器的比较 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> (&#x70B9;&#x51FB;&#x4E0A;&#x65B9;  &#x516C;&#x4F17;&#x53F7;  &#xFF0C;&#x53EF;&#x5FEB;&#x901F;&#x5173;&#x6CE8;)</p>
<h4 id="4&#x6B3E;Java&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x2014;&#x2014;&#x9519;&#x8BEF;&#x7684;&#x9009;&#x62E9;&#x5BFC;&#x81F4;&#x7CDF;&#x7CD5;&#x7684;&#x6027;&#x80FD;">4&#x6B3E;Java&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x2014;&#x2014;&#x9519;&#x8BEF;&#x7684;&#x9009;&#x62E9;&#x5BFC;&#x81F4;&#x7CDF;&#x7CD5;&#x7684;&#x6027;&#x80FD;</h4><p>&#x8BF4;&#x8D77;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x5728;&#x65E5;&#x5E38;&#x7684;&#x7F16;&#x7A0B;&#x4E2D;&#x6709;&#x6240;&#x5E94;&#x7528;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4ECD;&#x6709;&#x8BB8;&#x591A;&#x6211;&#x4EEC;&#x4E0D;&#x592A;&#x4E86;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x8FD9;&#x6B63;&#x662F;&#x75DB;&#x82E6;&#x7684;&#x6839;&#x6E90;&#x3002;&#x5173;&#x4E8E;JVM&#x6700;&#x5927;&#x7684;&#x8BEF;&#x89E3;&#x5C31;&#x662F;&#x8BA4;&#x4E3A;&#x5B83;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B83;&#x6709;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x5404;&#x6709;&#x5176;&#x957F;&#x77ED;&#x3002;JVM&#x5E76;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x5730;&#x9009;&#x62E9;&#x67D0;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E8B;&#x8FD8;&#x5F97;&#x843D;&#x5728;&#x4F60;&#x6211;&#x7684;&#x80A9;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x5E26;&#x6765;&#x541E;&#x5410;&#x91CF;&#x53CA;&#x5E94;&#x7528;&#x7684;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x7684;&#x663E;&#x8457;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x8FD9;&#x56DB;&#x79CD;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x7684;&#x5171;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x5206;&#x4EE3;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4EEC;&#x5C06;&#x6258;&#x7BA1;&#x7684;&#x5806;&#x5206;&#x6210;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x5047;&#x8BBE;&#x5806;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x90FD;&#x5F88;&#x77ED;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x88AB;&#x56DE;&#x6536;&#x6389;&#x3002;&#x4ECB;&#x7ECD;&#x8FD9;&#x5757;&#x5185;&#x5BB9;&#x7684;&#x5DF2;&#x7ECF;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x91CC;&#x6211;&#x6253;&#x7B97;&#x76F4;&#x63A5;&#x8BB2;&#x4E00;&#x4E0B;&#x8FD9;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x957F;&#x5904;&#x53CA;&#x77ED;&#x5904;&#x3002;</p>
<h4 id="1-&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;">1.&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;</h4><p>&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x4F60;&#x90FD;&#x4E0D;&#x4F1A;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3B;&#x8981;&#x662F;&#x9762;&#x5411;&#x5355;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x7684;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;32&#x4F4D;&#x7684;&#x6216;&#x8005;Windows&#xFF09;&#x4EE5;&#x53CA;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x5806;&#x3002;&#x8FD9;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x5168;&#x90E8;&#x51BB;&#x7ED3;&#xFF0C;&#x5C31;&#x8FD9;&#x4E00;&#x70B9;&#x800C;&#x8A00;&#x5C31;&#x4F7F;&#x5F97;&#x5B83;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x670D;&#x52A1;&#x7AEF;&#x5E94;&#x7528;&#x6240;&#x91C7;&#x7528;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x6253;&#x5F00;-XX:+UseSerialGC&#x8FD9;&#x4E2A;JVM&#x53C2;&#x6570;&#x6765;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<h4 id="2-&#x5E76;&#x884C;/&#x541E;&#x5410;&#x91CF;&#x56DE;&#x6536;&#x5668;">2.&#x5E76;&#x884C;/&#x541E;&#x5410;&#x91CF;&#x56DE;&#x6536;&#x5668;</h4><p>&#x4E0B;&#x4E00;&#x4E2A;&#x662F;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#xFF08; Parallel collector&#xFF09;&#x3002;&#x8FD9;&#x662F;JVM&#x7684;&#x9ED8;&#x8BA4;&#x56DE;&#x6536;&#x5668;&#x3002;&#x6B63;&#x5982;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x7684;&#x6700;&#x5927;&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x662F;&#x5B83;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6765;&#x626B;&#x63CF;&#x53CA;&#x538B;&#x7F29;&#x5806;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x4E0D;&#x7BA1;&#x6267;&#x884C;&#x7684;&#x662F;minor GC&#x8FD8;&#x662F;full GC&#x5B83;&#x90FD;&#x4F1A;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x3002;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x6700;&#x9002;&#x5408;&#x90A3;&#x4E9B;&#x53EF;&#x4EE5;&#x5BB9;&#x8BB8;&#x6682;&#x505C;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5B83;&#x8BD5;&#x56FE;&#x51CF;&#x5C11;&#x7531;&#x56DE;&#x6536;&#x5668;&#x6240;&#x5F15;&#x8D77;&#x7684;CPU&#x5F00;&#x9500;&#x3002;</p>
<h4 id="3-CMS&#x56DE;&#x6536;&#x5668;">3.CMS&#x56DE;&#x6536;&#x5668;</h4><p>&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x4E4B;&#x540E;&#x5C31;&#x662F;CMS&#x56DE;&#x6536;&#x5668;&#x4E86;&#xFF08;concurrent-mark-sweep&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF08;concurrent&#xFF09;&#x6765;&#x626B;&#x63CF;&#x5806;&#x5E76;&#x6807;&#x8BB0;&#xFF08;mark&#xFF09;&#x90A3;&#x4E9B;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x53EF;&#x4EE5;&#x56DE;&#x6536;(sweep)&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x201D;stop the world&#x201D;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;&#x5F53;&#x8FDB;&#x884C;&#x6839;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x7684;&#x65F6;&#x5019; &#xFF08;&#x8001;&#x751F;&#x4EE3;&#x4E2D;&#x7EBF;&#x7A0B;&#x5165;&#x53E3;&#x70B9;&#x6216;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x53EF;&#x8FBE;&#x7684;&#x90A3;&#x4E9B;&#x5BF9;&#x8C61;&#xFF09;&#x4EE5;&#x53CA;&#x5F53;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6539;&#x53D8;&#x4E86;&#x5806;&#x7684;&#x72B6;&#x6001;&#x4F7F;&#x5F97;&#x5B83;&#x4E0D;&#x5F97;&#x4E0D;&#x56DE;&#x53BB;&#x518D;&#x6B21;&#x786E;&#x8BA4;&#x81EA;&#x5DF1;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4F1A;&#x78B0;&#x5230;promotion failure&#xFF0C;&#x8FD9;&#x662F;&#x6307;&#x5728;&#x56DE;&#x6536;&#x65B0;&#x751F;&#x4EE3;&#x53CA;&#x5E74;&#x8001;&#x4EE3;&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;&#x56DE;&#x6536;&#x5668;&#x9700;&#x8981;&#x5C06;&#x5E74;&#x8F7B;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x5E74;&#x8001;&#x4EE3;&#x4E2D;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5E74;&#x8001;&#x4EE3;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x7684;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x53EA;&#x80FD;&#x5148;&#x8FDB;&#x884C;&#x4E00;&#x6B21;STW(Stop The World)&#x7684;full GC&#x4E86;&#x2014;&#x2014;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6B63;&#x662F;CMS&#x6240;&#x5E0C;&#x671B;&#x907F;&#x514D;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x4F60;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x6216;&#x8005;&#x589E;&#x52A0;&#x6574;&#x4E2A;&#x5806;&#x7684;&#x5927;&#x5C0F;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x7ED9;&#x56DE;&#x6536;&#x5668;&#x5206;&#x914D;&#x4E00;&#x4E9B;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x4EE5;&#x4FBF;&#x4E0E;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7684;&#x901F;&#x5EA6;&#x8FDB;&#x884C;&#x8D5B;&#x8DD1;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x548C;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x7684;CPU&#x8D44;&#x6E90;&#x4F1A;&#x66F4;&#x591A;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x626B;&#x63CF;&#x548C;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x8BA9;&#x5E94;&#x7528;&#x6301;&#x7EED;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x6682;&#x505C;&#x5BF9;&#x5B83;&#x4EEC;&#x662F;&#x5F88;&#x4E0D;&#x5229;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;CMS&#x56DE;&#x6536;&#x5668;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x4E5F;&#x4E0D;&#x662F;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#x7684;&#x3002;&#x4F60;&#x5F97;&#x6307;&#x5B9A;XX:+UseConcMarkSweepGC&#x6765;&#x542F;&#x7528;&#x5B83;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x5806;&#x5C0F;&#x4E8E;4G&#xFF0C;&#x800C;&#x4F60;&#x53C8;&#x5E0C;&#x671B;&#x5206;&#x914D;&#x66F4;&#x591A;&#x7684;CPU&#x8D44;&#x6E90;&#x4EE5;&#x907F;&#x514D;&#x5E94;&#x7528;&#x6682;&#x505C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C31;&#x662F;&#x4F60;&#x8981;&#x9009;&#x62E9;&#x7684;&#x56DE;&#x6536;&#x5668;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x5806;&#x5927;&#x4E8E;4G&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x66F4;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x6700;&#x540E;&#x7684;&#x8FD9;&#x4E2A;&#x2014;&#x2014;G1&#x56DE;&#x6536;&#x5668;&#x3002;</p>
<h4 id="4-G1&#x56DE;&#x6536;&#x5668;">4.G1&#x56DE;&#x6536;&#x5668;</h4><p>G1&#xFF08; Garbage first&#xFF09;&#x56DE;&#x6536;&#x5668;&#x5728;JDK 7update 4&#x4E2D;&#x9996;&#x6B21;&#x5F15;&#x5165;&#xFF0C;&#x5B83;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x662F;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x5927;&#x4E8E;4GB&#x7684;&#x5806;&#x3002;G1&#x56DE;&#x6536;&#x5668;&#x5C06;&#x5806;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x5927;&#x5C0F;&#x4ECE;1MB&#x5230;32MB&#x4E0D;&#x7B49;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x6765;&#x626B;&#x63CF;&#x5B83;&#x4EEC;&#x3002;G1&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x4F18;&#x5148;&#x626B;&#x63CF;&#x90A3;&#x4E9B;&#x5305;&#x542B;&#x5783;&#x573E;&#x6700;&#x591A;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x7684;&#x7531;&#x6765;&#xFF08;Garbage first&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;-XX:UseG1GC&#x6807;&#x8BB0;&#x6765;&#x542F;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x7B56;&#x7565;&#x51CF;&#x5C11;&#x4E86;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x8FD8;&#x672A;&#x626B;&#x63CF;&#x5B8C;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#x524D;&#x5806;&#x5C31;&#x5DF2;&#x7ECF;&#x7528;&#x5149;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x800C;&#x90A3;&#x79CD;&#x60C5;&#x51B5;&#x56DE;&#x6536;&#x5668;&#x5C31;&#x5FC5;&#x987B;&#x5F97;&#x6682;&#x505C;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;STW&#x56DE;&#x6536;&#x3002;G1&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5B83;&#x603B;&#x662F;&#x4F1A;&#x8FDB;&#x884C;&#x5806;&#x7684;&#x538B;&#x7F29;&#xFF0C;&#x800C;CMS&#x56DE;&#x6536;&#x5668;&#x53EA;&#x6709;&#x5728;full GC&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x5E72;&#x8FD9;&#x4E8B;&#x3002;</p>
<p>&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x5927;&#x5806;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x4E89;&#x8BAE;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4ECE;&#x5355;&#x673A;&#x5668;&#x5355;JVM&#x6A21;&#x578B;&#x8F6C;&#x5411;&#x4E86;&#x5355;&#x673A;&#x5668;&#x591A;JVM&#x7684;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x7EC4;&#x4EF6;&#x5316;&#x7684;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x662F;&#x8BB8;&#x591A;&#x56E0;&#x7D20;&#x6240;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x9694;&#x79BB;&#x7A0B;&#x5E8F;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x7B80;&#x5316;&#x90E8;&#x7F72;&#xFF0C;&#x907F;&#x514D;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x5E94;&#x7528;&#x7C7B;&#x5230;&#x5185;&#x5B58;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5F00;&#x9500;&#xFF08;Java 8&#x4E2D;&#x8FD9;&#x70B9;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x4E86;&#x6539;&#x5584;&#xFF09;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x6700;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x907F;&#x514D;&#x5927;&#x5806;&#x7684;GC&#x4E2D;&#x957F;&#x65F6;&#x671F;&#x7684;&#x201D;stop the world&#x201D;&#x7684;&#x6682;&#x505C;&#xFF08;&#x5728;&#x4E00;&#x6B21;&#x5927;&#x7684;&#x56DE;&#x6536;&#x4E2D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x6570;&#x79D2;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#xFF09;&#x3002;&#x50CF;Docker&#x8FD9;&#x6837;&#x7684;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x4E5F;&#x52A0;&#x901F;&#x4E86;&#x8FD9;&#x4E00;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x5F97;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x8F7B;&#x677E;&#x5730;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x7269;&#x7406;&#x673A;&#x4E0A;&#x90E8;&#x7F72;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x3002;</p>
<h4 id="Java_8&#x53CA;G1&#x56DE;&#x6536;&#x5668;">Java 8&#x53CA;G1&#x56DE;&#x6536;&#x5668;</h4><p>Java 8 update 20&#x6240;&#x5F15;&#x5165;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x68D2;&#x7684;&#x4F18;&#x5316;&#x5C31;&#x662F;G1&#x56DE;&#x6536;&#x5668;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53BB;&#x91CD;&#xFF08;String deduplication&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;(&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x5185;&#x90E8;&#x7684;char[]&#x6570;&#x7EC4;&#xFF09;&#x5360;&#x7528;&#x4E86;&#x5927;&#x591A;&#x6570;&#x7684;&#x5806;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x9879;&#x65B0;&#x7684;&#x4F18;&#x5316;&#x65E8;&#x5728;&#x4F7F;&#x5F97;G1&#x56DE;&#x6536;&#x5668;&#x80FD;&#x8BC6;&#x522B;&#x51FA;&#x5806;&#x4E2D;&#x90A3;&#x4E9B;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x7684;char[]&#x6570;&#x7EC4;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x540C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x591A;&#x4EFD;&#x62F7;&#x8D1D;&#xFF0C;&#x90A3;&#x6837;&#x5806;&#x7684;&#x4F7F;&#x7528;&#x6548;&#x7387;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x4F4E;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;-XX:+UseStringDeduplication&#x8FD9;&#x4E2A;JVM&#x53C2;&#x6570;&#x6765;&#x8BD5;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x3002;</p>
<h4 id="Java_8&#x53CA;&#x6301;&#x4E45;&#x4EE3;">Java 8&#x53CA;&#x6301;&#x4E45;&#x4EE3;</h4><p>Java 8&#x4E2D;&#x6700;&#x5927;&#x7684;&#x6539;&#x53D8;&#x5C31;&#x662F;&#x6301;&#x4E45;&#x4EE3;&#x7684;&#x79FB;&#x9664;&#xFF0C;&#x5B83;&#x539F;&#x672C;&#x662F;&#x7528;&#x6765;&#x7ED9;&#x7C7B;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x9A7B;&#x7559;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x6765;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x7684;&#x3002;&#x8FD9;&#x5728;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x9488;&#x5BF9;&#x90A3;&#x4E9B;&#x4F1A;&#x52A0;&#x8F7D;&#x5927;&#x91CF;&#x7C7B;&#x7684;&#x5E94;&#x7528;&#x6765;&#x4E13;&#x95E8;&#x8FDB;&#x884C;&#x5806;&#x6BD4;&#x4F8B;&#x7684;&#x4F18;&#x5316;&#x53CA;&#x8C03;&#x6574;&#x3002;&#x8BB8;&#x591A;&#x5E74;&#x6765;&#x90FD;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E5F;&#x6B63;&#x662F;&#x8BB8;&#x591A;OutOfMemory&#x5F02;&#x5E38;&#x7684;&#x6839;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x7531;JVM&#x6765;&#x63A5;&#x7BA1;&#x5B83;&#x771F;&#x662F;&#x518D;&#x597D;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x4F1A;&#x51CF;&#x5C11;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x5E94;&#x7528;&#x89E3;&#x8026;&#x5230;&#x4E0D;&#x540C;&#x7684;JVM&#x4E2D;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x90FD;&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x5173;&#x548C;&#x9009;&#x9879;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x4F18;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x589E;&#x52A0;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x51CF;&#x5C11;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7684;&#x5177;&#x4F53;&#x7684;&#x884C;&#x4E3A;&#x4E86;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x6DF1;&#x5165;&#x8BB2;&#x89E3;&#x914D;&#x7F6E;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x5173;&#x952E;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x51FA;&#x5904;&#xFF1A;&#x82B1;&#x540D;&#x6709;&#x5B5A;</p>
<p>&#x94FE;&#x63A5;&#xFF1A;<a href="http://it.deepinmind.com/gc/2014/09/12/garbage-collectors-serial-vs-parallel-vs-cms-vs-the-g1-and-whats-new-in-java-8.html" target="_blank" rel="external">http://it.deepinmind.com/gc/2014/09/12/garbage-collectors-serial-vs-parallel-vs-cms-vs-the-g1-and-whats-new-in-java-8.html</a></p>
<p> <strong>ImportNew &#x4E13;&#x6CE8; Java &#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x3002;</strong></p>
<p>&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; ImportNew</p>
<p> <img src="http://taojinke.github.io/img/20150702/f43506a.png" alt=""></p>
<p>&#xFF08;&#x957F;&#x6309;&#x4E0A;&#x56FE; &#x2191;&#x2191;&#x2191; &#x53EF;&#x81EA;&#x52A8;&#x8BC6;&#x522B;&#x4E8C;&#x7EF4;&#x7801;&#xFF09;</p>
<p>&#x70B9;&#x51FB;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#xFF0C;&#x67E5;&#x770B;&#x66F4;&#x591A; Java &#x6587;&#x7AE0;&#x3002;</p>
<p>&#x2193;&#x2193;&#x2193;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a><a href="/tags/Java8/">Java8</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f42cc94/" title="【Java】实战Java虚拟机之五“开启JIT编译” -" itemprop="url">【Java】实战Java虚拟机之五“开启JIT编译” -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4ECA;&#x5929;&#x5F00;&#x59CB;&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E94;&#x201C;&#x5F00;&#x542F;JIT&#x7F16;&#x8BD1;&#x201D;</p>
<p>&#x603B;&#x8BA1;&#x6709;5&#x4E2A;&#x7CFB;&#x5217;</p>
<ul>
<li><a href="http://www.uucode.net/201504/jvm1" target="_blank" rel="external">&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E00;&#x201C;&#x5806;&#x6EA2;&#x51FA;&#x5904;&#x7406;&#x201D;</a></li>
<li><a href="http://www.uucode.net/201504/jvm2" target="_blank" rel="external">&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E8C;&#x201C;&#x865A;&#x62DF;&#x673A;&#x7684;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#x201D;</a></li>
<li><a href="http://www.uucode.net/201504/jvm3" target="_blank" rel="external">&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E09;&#x201C;G1&#x7684;&#x65B0;&#x751F;&#x4EE3;GC&#x201D;</a></li>
<li><a href="http://www.uucode.net/201504/jvm4" target="_blank" rel="external">&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x56DB;&#x201C;&#x7981;&#x7528;System.gc()&#x201D;</a></li>
<li><a href="http://www.uucode.net/201504/jvm5" target="_blank" rel="external">&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x4E4B;&#x4E94;&#x201C;&#x5F00;&#x542F;JIT&#x7F16;&#x8BD1;&#x201D;</a></li>
</ul>
<p>Java&#x865A;&#x62DF;&#x673A;&#x6709;3&#x79CD;&#x6267;&#x884C;&#x65B9;&#x5F0F;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x3001;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x548C;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#xFF0C;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x5904;&#x4E8E;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x4E2D;&#x3002;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;java &#x2013;version&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x865A;&#x62DF;&#x673A;&#x7684;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#xFF1A;</p>
<pre><code><span class="rule"><span class="attribute">C</span>:<span class="value">\Users\Administrator&amp;gt</span></span>;<span class="tag">java</span> <span class="tag">-version</span>
<span class="tag">java</span> <span class="tag">version</span> &amp;<span class="tag">quot</span>;1<span class="class">.7</span><span class="class">.0_13</span>&amp;<span class="tag">quot</span>;
<span class="tag">Java</span>(<span class="tag">TM</span>) <span class="tag">SE</span> <span class="tag">Runtime</span> <span class="tag">Environment</span> (<span class="tag">build1</span><span class="class">.7</span><span class="class">.0_13-b20</span>)
<span class="tag">Java</span> <span class="tag">HotSpot</span>(<span class="tag">TM</span>) 64<span class="tag">-Bit</span> <span class="tag">Server</span> <span class="tag">VM</span> (<span class="tag">build</span> 23<span class="class">.7-b01</span>,<span class="tag">mixed</span> <span class="tag">mode</span>)
</code></pre><p>&#x4E0A;&#x9762;&#x8F93;&#x51FA;&#x7684;&#x201C;mixed mode&#x201D;&#x5C31;&#x8868;&#x793A;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x3002;&#x5728;&#x6DF7;&#x5408;&#x6A21;&#x5F0F;&#x4E2D;&#xFF0C;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x4F1A;&#x88AB;&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x90E8;&#x5206;&#x53EF;&#x80FD;&#x88AB;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x3002;&#x865A;&#x62DF;&#x673A;&#x51B3;&#x5B9A;&#x51FD;&#x6570;&#x662F;&#x5426;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x7684;&#x4F9D;&#x636E;&#x662F;&#x5224;&#x65AD;&#x8BE5;&#x51FD;&#x6570;&#xFF0C;&#x662F;&#x5426;&#x4E3A;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#x3002;&#x5982;&#x679C;&#x51FD;&#x6570;&#x7684;&#x8C03;&#x7528;&#x9891;&#x7387;&#x5F88;&#x9AD8;&#xFF0C;&#x88AB;&#x53CD;&#x590D;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x70ED;&#x70B9;&#xFF0C;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#x5C31;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x3002;</p>
<p>&#x89E3;&#x91CA;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#x8868;&#x793A;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x5747;&#x89E3;&#x91CA;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x505A;&#x4EFB;&#x4F55;JIT&#x7F16;&#x8BD1;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53C2;&#x6570;-Xint&#x6765;&#x5F00;&#x542F;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#xFF1A;</p>
<pre><code><span class="rule"><span class="attribute">C</span>:<span class="value">\Users\Administrator&amp;gt</span></span>;<span class="tag">java</span> <span class="tag">-Xint</span> <span class="tag">-version</span>
<span class="tag">java</span> <span class="tag">version</span> &amp;<span class="tag">quot</span>;1<span class="class">.7</span><span class="class">.0_13</span>&amp;<span class="tag">quot</span>;
<span class="tag">Java</span>(<span class="tag">TM</span>) <span class="tag">SE</span> <span class="tag">Runtime</span> <span class="tag">Environment</span> (<span class="tag">build1</span><span class="class">.7</span><span class="class">.0_13-b20</span>)
<span class="tag">Java</span> <span class="tag">HotSpot</span>(<span class="tag">TM</span>) 64<span class="tag">-Bit</span> <span class="tag">Server</span> <span class="tag">VM</span> (<span class="tag">build</span> 23<span class="class">.7-b01</span>,<span class="tag">interpreted</span> <span class="tag">mode</span>)
</code></pre><p>&#x7F16;&#x8BD1;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#x548C;&#x89E3;&#x91CA;&#x6267;&#x884C;&#x6A21;&#x5F0F;&#x76F8;&#x53CD;&#xFF0C;&#x5BF9;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x662F;&#x70ED;&#x70B9;&#x4EE3;&#x7801;&#xFF0C;&#x90FD;&#x4F1A;&#x88AB;&#x7F16;&#x8BD1;&#x6267;&#x884C;&#xFF0C;&#x4F7F;&#x7528;&#x53C2;&#x6570;-Xcomp&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E3A;&#x7F16;&#x8BD1;&#x6A21;&#x5F0F;&#xFF1A;</p>
<pre><code><span class="rule"><span class="attribute">C</span>:<span class="value">\Users\Administrator&amp;gt</span></span>;<span class="tag">java</span> <span class="tag">-Xcomp</span> <span class="tag">-version</span>
<span class="tag">java</span> <span class="tag">version</span> &amp;<span class="tag">quot</span>;1<span class="class">.7</span><span class="class">.0_13</span>&amp;<span class="tag">quot</span>;
<span class="tag">Java</span>(<span class="tag">TM</span>) <span class="tag">SE</span> <span class="tag">Runtime</span> <span class="tag">Environment</span> (<span class="tag">build1</span><span class="class">.7</span><span class="class">.0_13-b20</span>)
<span class="tag">Java</span> <span class="tag">HotSpot</span>(<span class="tag">TM</span>) 64<span class="tag">-Bit</span> <span class="tag">Server</span> <span class="tag">VM</span> (<span class="tag">build</span> 23<span class="class">.7-b01</span>,<span class="tag">compiled</span> <span class="tag">mode</span>)
</code></pre><p>&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x7F16;&#x8BD1;&#x6A21;&#x5F0F;&#x7684;&#x6267;&#x884C;&#x6548;&#x7387;&#x4F1A;&#x8FDC;&#x8FDC;&#x9AD8;&#x4E8E;&#x89E3;&#x91CA;&#x6A21;&#x5F0F;&#x3002;&#x66F4;&#x591A;&#x7684;&#x793A;&#x4F8B;&#x53C2;&#x8003;&#x300A;&#x5B9E;&#x6218;Java&#x865A;&#x62DF;&#x673A;&#x300B;&#x4E00;&#x4E66;&#x3002;</p>
<p>&#x3010;&#x793A;&#x4F8B;11-36&#x3011;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x4E0D;&#x505C;&#x8BA1;&#x7B97;&#x5706;&#x5468;&#x7387;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x5E76;&#x7ED9;&#x51FA;&#x4E86;&#x8FD0;&#x884C;&#x7684;&#x8017;&#x65F6;&#xFF1A;</p>
<pre><code>public static double calcPi<span class="params">()</span>{
         doublere=<span class="number">0</span>;
         <span class="keyword">for</span><span class="params">(inti=<span class="number">1</span>;i&amp;lt;<span class="number">10000</span>;i++)</span>{
             re+=<span class="params">(<span class="params">(i&amp;amp;<span class="number">1</span>)</span>==<span class="number">0</span>?-<span class="number">1</span>:<span class="number">1</span>)</span><span class="built_in">*</span><span class="number">1.0</span>/<span class="params">(<span class="number">2</span>*i-<span class="number">1</span>)</span>;
         }
         returnre<span class="built_in">*</span><span class="number">4</span>;
}
public static void main<span class="params">(String[] args)</span> {
         longb=System.currentTimeMillis<span class="params">()</span>;
         <span class="keyword">for</span><span class="params">(inti=<span class="number">0</span>;i&amp;lt;<span class="number">10000</span>;i++)</span>
             calcPi<span class="params">()</span>;      
         longe=System.currentTimeMillis<span class="params">()</span>;
         System.out.println<span class="params">(&amp;quot;spend:&amp;quot;+<span class="params">(e-b)</span>+&amp;quot;ms&amp;quot;)</span>;
}
</code></pre><p>&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x673A;&#x53C2;&#x6570;-Xint&#x8FD0;&#x884C;&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#xFF0C;&#x8F93;&#x51FA;&#xFF1A;</p>
<p>spend:2794ms</p>
<p>&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x673A;&#x53C2;&#x6570;-Xcomp&#x8FD0;&#x884C;&#x4EE5;&#x4E0A;&#x4EE3;&#x7801;&#xFF0C;&#x8F93;&#x51FA;&#xFF1A;</p>
<p>spend:1082ms</p>
<p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#x4F7F;&#x7528;&#x7F16;&#x8BD1;&#x8FD0;&#x884C;&#x8981;&#x6BD4;&#x89E3;&#x91CA;&#x8FD0;&#x884C;&#x5FEB;&#x5927;&#x7EA6;3&#x500D;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/f42bb7d.jpg" alt=""></p>
<h4 id="&#x300A;&#x5B9E;&#x6218;java&#x865A;&#x62DF;&#x673A;&#x300B;&#x4E00;&#x4E66;Q&#x4EA4;&#x6D41;&#x7FA4;&#xFF1A;397196583">&#x300A;&#x5B9E;&#x6218;java&#x865A;&#x62DF;&#x673A;&#x300B;&#x4E00;&#x4E66;Q&#x4EA4;&#x6D41;&#x7FA4;&#xFF1A;397196583</h4>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f4575bb/" title="Tomcat的JVM内存溢出解决方法 -" itemprop="url">Tomcat的JVM内存溢出解决方法 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> &#x4E00;&#x3001;  &#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;tomcat&#x5185;&#x5B58;&#x8BBE;&#x7F6E;&#x4E0D;&#x597D;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x73B0;JVM&#x5185;&#x5B58;&#x6EA2;&#xFF0C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4FEE;&#x6539;Tomcat&#x4E2D;&#x7684;catalina.sh&#x6587;&#x4EF6;&#x3002;</p>
<h1 id="vim_TOMCAT_HOME/bin/catalina-sh">vim TOMCAT_HOME/bin/catalina.sh</h1><p>&#x5728;catalina.sh&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x627E;&#x5230;cygwin=false&#xFF0C;&#x5728;&#x8FD9;&#x4E00;&#x884C;&#x7684;&#x524D;&#x9762;&#x52A0;&#x5165;&#x53C2;&#x6570;&#xFF0C;&#x5177;&#x4F53;&#x5982;&#x4E0B;</p>
<p>JAVA_OPTS=&quot;-server -Xms1024m -Xmx2048m -XX:PermSize=512m -XX:MaxPermSize=1024m -XX:MaxNewSize=512m&quot;</p>
<p>&#x5176;&#x4ED6;&#x8BF4;&#x660E;&#xFF1A;</p>
<p>1.&#x201C;m&#x201D;&#x8BF4;&#x660E;&#x5355;&#x4F4D;&#x662F;MB&#xFF0C;&#x5426;&#x5219;&#x9ED8;&#x8BA4;&#x662F;KB</p>
<p>2.&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;80%&#x4F5C;&#x4E3A;&#x5806;&#x5927;&#x5C0F;</p>
<p>3.&#x4E00;&#x822C;&#x628A;-Xms&#x548C;-Xmx&#x8BBE;&#x4E3A;&#x4E00;&#x6837;&#x5927;</p>
<p>4.&#x4E00;&#x822C;&#x628A;-Xmn&#x8BBE;&#x7F6E;&#x4E3A;-Xmx&#x503C;&#x7684;1/4</p>
<p>5.&#x4E00;&#x822C;&#x5C06;&#x5806;&#x7684;&#x603B;&#x5927;&#x5C0F;&#x7684;50%&#x5230;60%&#x5206;&#x914D;&#x7ED9;&#x65B0;&#x751F;&#x6210;&#x7684;&#x6C60;</p>
<p>&#x4E8C;&#x3001;jvm&#x53C2;&#x6570;&#x8BF4;&#x660E;&#xFF1A;</p>
<pre><code><span class="attribute">-server</span>                 <span class="subst">&amp;</span><span class="variable">#x4E00</span>;<span class="subst">&amp;</span><span class="variable">#x5B9A</span>;<span class="subst">&amp;</span><span class="variable">#x8981</span>;<span class="subst">&amp;</span><span class="variable">#x4F5C</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;<span class="subst">&amp;</span><span class="variable">#x7B2C</span>;<span class="subst">&amp;</span><span class="variable">#x4E00</span>;<span class="subst">&amp;</span><span class="variable">#x4E2A</span>;<span class="subst">&amp;</span><span class="variable">#x53C2</span>;<span class="subst">&amp;</span><span class="variable">#x6570</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x542F</span>;<span class="subst">&amp;</span><span class="variable">#x7528</span>;JDK<span class="subst">&amp;</span><span class="variable">#x7684</span>;server<span class="subst">&amp;</span><span class="variable">#x7248</span>;<span class="subst">&amp;</span><span class="variable">#x672C</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x5728</span>;<span class="subst">&amp;</span><span class="variable">#x591A</span>;<span class="subst">&amp;</span><span class="variable">#x4E2A</span>;CPU<span class="subst">&amp;</span><span class="variable">#x65F6</span>;<span class="subst">&amp;</span><span class="variable">#x6027</span>;<span class="subst">&amp;</span><span class="variable">#x80FD</span>;<span class="subst">&amp;</span><span class="variable">#x4F73</span>; 
<span class="attribute">-Xms</span>                    java Heap<span class="subst">&amp;</span><span class="variable">#x521D</span>;<span class="subst">&amp;</span><span class="variable">#x59CB</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#x3002</span>; <span class="subst">&amp;</span><span class="variable">#x9ED8</span>;<span class="subst">&amp;</span><span class="variable">#x8BA4</span>;<span class="subst">&amp;</span><span class="variable">#x662F</span>;<span class="subst">&amp;</span><span class="variable">#x7269</span>;<span class="subst">&amp;</span><span class="variable">#x7406</span>;<span class="subst">&amp;</span><span class="variable">#x5185</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="number">1</span>/<span class="number">64</span><span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="attribute">-Xmx</span>                    java heap<span class="subst">&amp;</span><span class="variable">#x6700</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x503C</span>;<span class="subst">&amp;</span><span class="variable">#x3002</span>;<span class="subst">&amp;</span><span class="variable">#x5EFA</span>;<span class="subst">&amp;</span><span class="variable">#x8BAE</span>;<span class="subst">&amp;</span><span class="variable">#x5747</span>;<span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;<span class="subst">&amp;</span><span class="variable">#x7269</span>;<span class="subst">&amp;</span><span class="variable">#x7406</span>;<span class="subst">&amp;</span><span class="variable">#x5185</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="number">80</span><span class="subst">%&amp;</span><span class="variable">#x3002</span>;<span class="subst">&amp;</span><span class="variable">#x4E0D</span>;<span class="subst">&amp;</span><span class="variable">#x53EF</span>;<span class="subst">&amp;</span><span class="variable">#x8D85</span>;<span class="subst">&amp;</span><span class="variable">#x8FC7</span>;<span class="subst">&amp;</span><span class="variable">#x7269</span>;<span class="subst">&amp;</span><span class="variable">#x7406</span>;<span class="subst">&amp;</span><span class="variable">#x5185</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="attribute">-Xmn</span>                    java heap<span class="subst">&amp;</span><span class="variable">#x6700</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#x503C</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x4E00</span>;<span class="subst">&amp;</span><span class="variable">#x822C</span>;<span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x7F6E</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;Xmx<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="number">3</span><span class="subst">&amp;</span><span class="variable">#x3001</span>;<span class="number">4</span><span class="subst">&amp;</span><span class="variable">#x5206</span>;<span class="subst">&amp;</span><span class="variable">#x4E4B</span>;<span class="subst">&amp;</span><span class="variable">#x4E00</span>;<span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="attribute">-XX</span>:PermSize            <span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x5B9A</span>;<span class="subst">&amp;</span><span class="variable">#x5185</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x6C38</span>;<span class="subst">&amp;</span><span class="variable">#x4E45</span>;<span class="subst">&amp;</span><span class="variable">#x4FDD</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x533A</span>;<span class="subst">&amp;</span><span class="variable">#x521D</span>;<span class="subst">&amp;</span><span class="variable">#x59CB</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x7F3A</span>;<span class="subst">&amp;</span><span class="variable">#x7701</span>;<span class="subst">&amp;</span><span class="variable">#x503C</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;<span class="number">64</span>M<span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="attribute">-XX</span>:MaxPermSize         <span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x5B9A</span>;<span class="subst">&amp;</span><span class="variable">#x5185</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x6C38</span>;<span class="subst">&amp;</span><span class="variable">#x4E45</span>;<span class="subst">&amp;</span><span class="variable">#x4FDD</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#x533A</span>;<span class="subst">&amp;</span><span class="variable">#x6700</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x7F3A</span>;<span class="subst">&amp;</span><span class="variable">#x7701</span>;<span class="subst">&amp;</span><span class="variable">#x503C</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;<span class="number">64</span>M<span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="attribute">-XX</span>:SurvivorRatio<span class="subst">=</span><span class="number">2</span>     <span class="subst">&amp;</span><span class="variable">#x751F</span>;<span class="subst">&amp;</span><span class="variable">#x8FD8</span>;<span class="subst">&amp;</span><span class="variable">#x8005</span>;<span class="subst">&amp;</span><span class="variable">#x6C60</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x9ED8</span>;<span class="subst">&amp;</span><span class="variable">#x8BA4</span>;<span class="subst">&amp;</span><span class="variable">#x662F</span>;<span class="number">2</span><span class="subst">&amp;</span><span class="variable">#x3002</span>;<span class="subst">&amp;</span><span class="variable">#x5982</span>;<span class="subst">&amp;</span><span class="variable">#x679C</span>;<span class="subst">&amp;</span><span class="variable">#x5783</span>;<span class="subst">&amp;</span><span class="variable">#x573E</span>;<span class="subst">&amp;</span><span class="variable">#x56DE</span>;<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x53D8</span>;<span class="subst">&amp;</span><span class="variable">#x6210</span>;<span class="subst">&amp;</span><span class="variable">#x4E86</span>;<span class="subst">&amp;</span><span class="variable">#x74F6</span>;<span class="subst">&amp;</span><span class="variable">#x9888</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x60A8</span>;<span class="subst">&amp;</span><span class="variable">#x53EF</span>;<span class="subst">&amp;</span><span class="variable">#x4EE5</span>;<span class="subst">&amp;</span><span class="variable">#x5C1D</span>;<span class="subst">&amp;</span><span class="variable">#x8BD5</span>;<span class="subst">&amp;</span><span class="variable">#x5B9A</span>;<span class="subst">&amp;</span><span class="variable">#x5236</span>;<span class="subst">&amp;</span><span class="variable">#x751F</span>;<span class="subst">&amp;</span><span class="variable">#x6210</span>;<span class="subst">&amp;</span><span class="variable">#x6C60</span>;<span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x7F6E</span>;
<span class="attribute">-XX</span>:NewSize             <span class="subst">&amp;</span><span class="variable">#x65B0</span>;<span class="subst">&amp;</span><span class="variable">#x751F</span>;<span class="subst">&amp;</span><span class="variable">#x6210</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x6C60</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x521D</span>;<span class="subst">&amp;</span><span class="variable">#x59CB</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#x3002</span>; <span class="subst">&amp;</span><span class="variable">#x7F3A</span>;<span class="subst">&amp;</span><span class="variable">#x7701</span>;<span class="subst">&amp;</span><span class="variable">#x503C</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;<span class="number">2</span>M<span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="attribute">-XX</span>:MaxNewSize          <span class="subst">&amp;</span><span class="variable">#x65B0</span>;<span class="subst">&amp;</span><span class="variable">#x751F</span>;<span class="subst">&amp;</span><span class="variable">#x6210</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x6C60</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x6700</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;<span class="subst">&amp;</span><span class="variable">#x3002</span>; <span class="subst">&amp;</span><span class="variable">#x7F3A</span>;<span class="subst">&amp;</span><span class="variable">#x7701</span>;<span class="subst">&amp;</span><span class="variable">#x503C</span>;<span class="subst">&amp;</span><span class="variable">#x4E3A</span>;<span class="number">32</span>M<span class="subst">&amp;</span><span class="variable">#x3002</span>;
<span class="subst">+</span>XX:AggressiveHeap      <span class="subst">&amp;</span><span class="variable">#x8BA9</span>;jvm<span class="subst">&amp;</span><span class="variable">#x5FFD</span>;<span class="subst">&amp;</span><span class="variable">#x7565</span>;Xmx<span class="subst">&amp;</span><span class="variable">#x53C2</span>;<span class="subst">&amp;</span><span class="variable">#x6570</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x75AF</span>;<span class="subst">&amp;</span><span class="variable">#x72C2</span>;<span class="subst">&amp;</span><span class="variable">#x5730</span>;<span class="subst">&amp;</span><span class="variable">#x5403</span>;<span class="subst">&amp;</span><span class="variable">#x5B8C</span>;<span class="subst">&amp;</span><span class="variable">#x4E00</span>;<span class="subst">&amp;</span><span class="variable">#x4E2A</span>;G<span class="subst">&amp;</span><span class="variable">#x7269</span>;<span class="subst">&amp;</span><span class="variable">#x7406</span>;<span class="subst">&amp;</span><span class="variable">#x5185</span>;<span class="subst">&amp;</span><span class="variable">#x5B58</span>;<span class="subst">&amp;</span><span class="variable">#xFF0C</span>;<span class="subst">&amp;</span><span class="variable">#x518D</span>;<span class="subst">&amp;</span><span class="variable">#x5403</span>;<span class="subst">&amp;</span><span class="variable">#x5C3D</span>;<span class="subst">&amp;</span><span class="variable">#x4E00</span>;<span class="subst">&amp;</span><span class="variable">#x4E2A</span>;G<span class="subst">&amp;</span><span class="variable">#x7684</span>;swap<span class="subst">&amp;</span><span class="variable">#x3002</span>; 
<span class="attribute">-Xss</span>                    <span class="subst">&amp;</span><span class="variable">#x6BCF</span>;<span class="subst">&amp;</span><span class="variable">#x4E2A</span>;<span class="subst">&amp;</span><span class="variable">#x7EBF</span>;<span class="subst">&amp;</span><span class="variable">#x7A0B</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="built_in">Stack</span><span class="subst">&amp;</span><span class="variable">#x5927</span>;<span class="subst">&amp;</span><span class="variable">#x5C0F</span>;
<span class="attribute">-verbose</span>:gc             <span class="subst">&amp;</span><span class="variable">#x73B0</span>;<span class="subst">&amp;</span><span class="variable">#x5B9E</span>;<span class="subst">&amp;</span><span class="variable">#x5783</span>;<span class="subst">&amp;</span><span class="variable">#x573E</span>;<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x96C6</span>;<span class="subst">&amp;</span><span class="variable">#x4FE1</span>;<span class="subst">&amp;</span><span class="variable">#x606F</span>;
<span class="attribute">-Xloggc</span>:gc<span class="built_in">.</span><span class="keyword">log</span>          <span class="subst">&amp;</span><span class="variable">#x6307</span>;<span class="subst">&amp;</span><span class="variable">#x5B9A</span>;<span class="subst">&amp;</span><span class="variable">#x5783</span>;<span class="subst">&amp;</span><span class="variable">#x573E</span>;<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x96C6</span>;<span class="subst">&amp;</span><span class="variable">#x65E5</span>;<span class="subst">&amp;</span><span class="variable">#x5FD7</span>;<span class="subst">&amp;</span><span class="variable">#x6587</span>;<span class="subst">&amp;</span><span class="variable">#x4EF6</span>;
<span class="attribute">-XX</span>:<span class="subst">+</span>UseParNewGC        <span class="subst">&amp;</span><span class="variable">#x7F29</span>;<span class="subst">&amp;</span><span class="variable">#x77ED</span>;minor<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x96C6</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x65F6</span>;<span class="subst">&amp;</span><span class="variable">#x95F4</span>;
<span class="attribute">-XX</span>:<span class="subst">+</span>UseConcMarkSweepGC <span class="subst">&amp;</span><span class="variable">#x7F29</span>;<span class="subst">&amp;</span><span class="variable">#x77ED</span>;major<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x96C6</span>;<span class="subst">&amp;</span><span class="variable">#x7684</span>;<span class="subst">&amp;</span><span class="variable">#x65F6</span>;<span class="subst">&amp;</span><span class="variable">#x95F4</span>;
<span class="attribute">-XX</span>:userParNewGC        <span class="subst">&amp;</span><span class="variable">#x53EF</span>;<span class="subst">&amp;</span><span class="variable">#x7528</span>;<span class="subst">&amp;</span><span class="variable">#x6765</span>;<span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x7F6E</span>;<span class="subst">&amp;</span><span class="variable">#x5E76</span>;<span class="subst">&amp;</span><span class="variable">#x884C</span>;<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x96C6</span>;(<span class="subst">&amp;</span><span class="variable">#x591A</span>;CPU)
<span class="attribute">-XX</span>:ParallelGCThreads   <span class="subst">&amp;</span><span class="variable">#x53EF</span>;<span class="subst">&amp;</span><span class="variable">#x7528</span>;<span class="subst">&amp;</span><span class="variable">#x6765</span>;<span class="subst">&amp;</span><span class="variable">#x589E</span>;<span class="subst">&amp;</span><span class="variable">#x52A0</span>;<span class="subst">&amp;</span><span class="variable">#x5E76</span>;<span class="subst">&amp;</span><span class="variable">#x884C</span>;<span class="subst">&amp;</span><span class="variable">#x5EA6</span>;(<span class="subst">&amp;</span><span class="variable">#x591A</span>;CPU)
<span class="attribute">-XX</span>:UseParallelGC       <span class="subst">&amp;</span><span class="variable">#x8BBE</span>;<span class="subst">&amp;</span><span class="variable">#x7F6E</span>;<span class="subst">&amp;</span><span class="variable">#x540E</span>;<span class="subst">&amp;</span><span class="variable">#x53EF</span>;<span class="subst">&amp;</span><span class="variable">#x4EE5</span>;<span class="subst">&amp;</span><span class="variable">#x4F7F</span>;<span class="subst">&amp;</span><span class="variable">#x7528</span>;<span class="subst">&amp;</span><span class="variable">#x5E76</span>;<span class="subst">&amp;</span><span class="variable">#x884C</span>;<span class="subst">&amp;</span><span class="variable">#x6E05</span>;<span class="subst">&amp;</span><span class="variable">#x9664</span>;<span class="subst">&amp;</span><span class="variable">#x6536</span>;<span class="subst">&amp;</span><span class="variable">#x96C6</span>;<span class="subst">&amp;</span><span class="variable">#x5668</span>;(<span class="subst">&amp;</span><span class="variable">#x591A</span>;CPU)
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a><a href="/tags/Tomcat/">Tomcat</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f414d47/" title="在运行时开启GC日志 -" itemprop="url">在运行时开启GC日志 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> &#x6211;&#x4EEC;&#x7ECF;&#x5E38;&#x4F1A;&#x9047;&#x5230;JVM&#x8FD0;&#x884C;&#x65F6;&#x51FA;&#x9519;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x82E5;&#x80FD;&#x5728;&#x542F;&#x52A8;&#x65F6;&#x52A0;&#x5165;&#x4E00;&#x4E9B;&#x542F;&#x52A8;&#x9009;&#x9879;&#xFF08;startup option&#xFF09;&#xFF0C;&#x4FBF;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x4E0E;bug&#x76F8;&#x5173;&#x7684;&#x91CD;&#x8981;&#x7EBF;&#x7D22;&#xFF0C;&#x4ECE;&#x800C;&#x6709;&#x5E0C;&#x671B;&#x6839;&#x6CBB;&#x5B83;&#x4EEC;&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x662F;&#x5FD8;&#x8BB0;&#x6DFB;&#x52A0; -XX:+HeapDumpOnOutOfMemoryError &#x6216; -XX:+PrintGCDetails &#x8FD9;&#x6837;&#x5FC5;&#x8981;&#x7684;flag&#x3002; </p>
<p>&#x6BCF;&#x5F53;&#x9762;&#x5BF9;&#x5982;&#x6B64;&#x7A98;&#x5883;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x5173;&#x95ED;JVM&#xFF0C;&#x4FEE;&#x6539;&#x542F;&#x52A8;&#x53C2;&#x6570;&#xFF08;startup parameter&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x9ED8;&#x9ED8;&#x7948;&#x7977;&#xFF0C;&#x5E0C;&#x671B;&#x95EE;&#x9898;&#x573A;&#x666F;&#xFF08;problematic situation&#xFF09;&#x80FD;&#x5728;&#x91CD;&#x542F;&#x4E4B;&#x540E;&#x5F97;&#x4EE5;&#x91CD;&#x73B0;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5076;&#x5C14;&#x594F;&#x6548;&#xFF0C;&#x5728;&#x573A;&#x666F;&#x91CD;&#x73B0;&#x540E;&#x4F60;&#x6216;&#x8BB8;&#x8FD8;&#x80FD;&#x6536;&#x96C6;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x8BC1;&#x636E;&#xFF0C;&#x4EE5;&#x4FBF;&#x52A8;&#x624B;&#x6839;&#x6CBB;&#x6F5C;&#x5728;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x4E0D;&#x96BE;&#x770B;&#x51FA;&#xFF0C;&#x524D;&#x6587;&#x6240;&#x8FF0;&#x7684;&#x65B9;&#x6CD5;&#x95EE;&#x9898;&#x663E;&#x8457;&#x2014;&#x2014;&#x4F60;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x989D;&#x5916;&#x7684;&#x91CD;&#x542F;&#x624D;&#x80FD;&#x52A0;&#x5165;&#x90A3;&#x70E6;&#x4EBA;&#x7684;debug&#x9009;&#x9879;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x501F;&#x52A9;&#x4E2D;&#x65AD;&#xFF08;outage&#xFF09;&#x5B9E;&#x73B0;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;JDK bundle&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x53EF;&#x884C;&#x7684;&#x53D8;&#x901A;&#x65B9;&#x6848;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x4E4B;&#x6536;&#x5165;&#x9EBE;&#x4E0B;&#xFF0C;&#x5076;&#x5C14;&#x8FD8;&#x80FD;&#x4ECE;&#x4E2D;&#x83B7;&#x76CA;&#x3002;</p>
<h3 id="jinfo">jinfo</h3><p>&#x5728;JDK bundle&#x4E2D;&#x9690;&#x85CF;&#x7740;&#x4E00;&#x4E2A;&#x7CBE;&#x608D;&#x7684;&#x5C0F;&#x5DE5;&#x5177;&#x2014;&#x2014; <a href="http://www.oracle.com/technetwork/java/javase/tooldescr-136044.html#gbdio" target="_blank" rel="external">jinfo</a> &#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;jinfo&#x7528;&#x4E8E;&#x6536;&#x96C6;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;Java&#x8FDB;&#x7A0B;&#x7684;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x3002;jinfo&#x5438;&#x5F15;&#x773C;&#x7403;&#x7684;&#x5730;&#x65B9;&#x5728;&#x4E8E;&#xFF0C;&#x5B83;&#x80FD;&#x901A;&#x8FC7; -flag &#x9009;&#x9879;&#x52A8;&#x6001;&#x4FEE;&#x6539;&#x6307;&#x5B9A;&#x7684;Java&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;JVM flag&#x7684;&#x503C;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x6837;&#x7684;flag&#x6570;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x5076;&#x5C14;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x5230;&#x4F60;&#x3002;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x7684;&#x547D;&#x4EE4;&#x4F60;&#x4FBF;&#x80FD;&#x770B;&#x5230;JVM&#x4E2D;&#x54EA;&#x4E9B;flag&#x53EF;&#x4EE5;&#x88AB;jinfo&#x52A8;&#x6001;&#x4FEE;&#x6539;&#xFF1A; </p>
<pre><code>my-precious me$ java -XX:+PrintFlagsFinal -<span class="keyword">version</span>|grep manageable
     intx CMSAbortablePrecleanWaitMillis            = <span class="number">100</span>                                 {manageable}
     intx CMSWaitDuration                           = <span class="number">2000</span>                                {manageable}
     <span class="built_in">bool</span> HeapDumpAfterFullGC                       = <span class="literal">false</span>                               {manageable}
     <span class="built_in">bool</span> HeapDumpBeforeFullGC                      = <span class="literal">false</span>                               {manageable}
     <span class="built_in">bool</span> HeapDumpOnOutOfMemoryError                = <span class="literal">false</span>                               {manageable}
     ... cut <span class="keyword">for</span> brevity ...
     <span class="built_in">bool</span> PrintGC                                   = <span class="literal">false</span>                               {manageable}
     <span class="built_in">bool</span> PrintGCDateStamps                         = <span class="literal">false</span>                               {manageable}
     <span class="built_in">bool</span> PrintGCDetails                            = <span class="literal">false</span>                               {manageable}
     <span class="built_in">bool</span> PrintGCTimeStamps                         = <span class="literal">false</span>                               {manageable}
</code></pre><p>&#x901A;&#x8FC7;&#x9009;&#x9879; -XX:+PrintFlagsFinal &#x53EF;&#x4EE5;&#x5217;&#x51FA;&#x6240;&#x6709;&#x7684;JVM flag&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x7684;&#x6807;&#x6CE8;&#x4E3A; manageable &#x7684;flag&#x5219;&#x662F;&#x503C;&#x5F97;&#x6211;&#x4EEC;&#x5173;&#x6CE8;&#x7684;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4E9B;flag&#x53EF;&#x901A;&#x8FC7;JDK management interface&#xFF08;-XX:+PrintFlagsFinal&#xFF09;&#x52A8;&#x6001;&#x4FEE;&#x6539;&#x3002;&#x867D;&#x7136;&#x5728;JConsole&#x4E2D;&#x4E5F;&#x80FD;&#x67E5;&#x5230;&#x4E0E;&#x5176;&#x5341;&#x5206;&#x76F8;&#x4F3C;&#x7684;MBean&#x3002;&#x4F46;&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x4EE5;&#x547D;&#x4EE4;&#x884C;&#x7684;&#x65B9;&#x5F0F;&#x67E5;&#x770B;&#x5B83;&#x4EEC;&#x66F4;&#x52A0;&#x7684;&#x4FBF;&#x6377;&#x3002; </p>
<h3 id="&#x5982;&#x4F55;&#x4F7F;&#x7528;jinfo">&#x5982;&#x4F55;&#x4F7F;&#x7528;jinfo</h3><p>&#x8BA9;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x5B9E;&#x6218;&#x6765;&#x5B66;&#x4E60;&#x5982;&#x4F55;&#x4F7F;&#x7528;jinfo&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E00;&#x4E2A;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;JVM&#x4E2D;&#x52A8;&#x6001;&#x5F00;&#x542F;GC&#x65E5;&#x5FD7;&#x529F;&#x80FD;&#xFF1A;</p>
<pre><code><span class="keyword">my</span>-precious <span class="keyword">me</span>$ jps
<span class="number">12278</span> HighAllocationRate
<span class="number">12279</span> Jps
<span class="number">12269</span> JConsole
<span class="keyword">my</span>-precious <span class="keyword">me</span>$ jinfo -flag +PrintGCDetails <span class="number">12278</span>
<span class="keyword">my</span>-precious <span class="keyword">me</span>$ jinfo -flag +PrintGC <span class="number">12278</span>
<span class="keyword">my</span>-precious <span class="keyword">me</span>$
</code></pre><p>&#x5728;jinfo&#x4E2D;&#x9700;&#x8981;&#x6253;&#x5F00; -XX:+PrintGC &#x548C; -XX:+PrintGCDetails &#x4E24;&#x4E2A;&#x9009;&#x9879;&#x624D;&#x80FD;&#x5F00;&#x542F;GC&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x4E0E;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x6709;&#x7740;&#x7EC6;&#x5FAE;&#x7684;&#x5DEE;&#x522B;&#x2014;&#x2014;&#x5982;&#x679C;&#x4F60;&#x901A;&#x8FC7;&#x542F;&#x52A8;&#x811A;&#x672C;&#xFF08;startup script&#xFF09;&#x6765;&#x8BBE;&#x7F6E;&#x53C2;&#x6570;&#xFF0C;&#x4EC5;&#x9700; -XX:+PrintGCDetails &#x5373;&#x53EF;&#xFF0C;&#x56E0;&#x4E3A; -XX:+PrintGC &#x4F1A;&#x88AB;&#x81EA;&#x52A8;&#x6253;&#x5F00;&#x3002; </p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x4ECE;standard output&#x7684;&#x7ED3;&#x679C;&#x6765;&#x770B;&#xFF0C;PID&#x4E3A;12278&#x7684;&#x8FDB;&#x7A0B;&#x7684;GC&#x65E5;&#x5FD7;&#x7684;&#x786E;&#x80FD;&#x591F;&#x6EDA;&#x52A8;&#x5730;&#x663E;&#x793A;&#x51FA;&#x6765;&#xFF1A;</p>
<pre><code>...
[GC (Allocation Failure) [PSYoungGen: <span class="number">876416</span><span class="keyword">K</span>-&amp;gt;<span class="number">102624</span><span class="keyword">K</span>(<span class="number">909312</span><span class="keyword">K</span>)] <span class="number">1094420</span><span class="keyword">K</span>-&amp;gt;<span class="number">320820</span><span class="keyword">K</span>(<span class="number">1161216</span><span class="keyword">K</span>), <span class="number">0.2173131</span> secs] [<span class="keyword">Times</span>: user=<span class="number">0.74</span> sys=<span class="number">0.00</span>, real=<span class="number">0.22</span> secs] 
...
[GC (Allocation Failure) [PSYoungGen: <span class="number">890304</span><span class="keyword">K</span>-&amp;gt;<span class="number">102240</span><span class="keyword">K</span>(<span class="number">917504</span><span class="keyword">K</span>)] <span class="number">1108924</span><span class="keyword">K</span>-&amp;gt;<span class="number">320956</span><span class="keyword">K</span>(<span class="number">1169408</span><span class="keyword">K</span>), <span class="number">0.2446639</span> secs] [<span class="keyword">Times</span>: user=<span class="number">0.82</span> sys=<span class="number">0.01</span>, real=<span class="number">0.25</span> secs] 
...
</code></pre><p>&#x540C;&#x7406;&#xFF0C;&#x82E5;&#x60F3;&#x5173;&#x95ED;GC&#x65E5;&#x5FD7;&#x529F;&#x80FD;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x6267;&#x884C; jinfo -flag -PrintGCDetails 12278 &#x548C; jinfo -flag -PrintGC 12278 &#x547D;&#x4EE4;&#x5373;&#x53EF;&#x3002; </p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x5B66;&#x4F1A;&#x4F7F;&#x7528;jinfo&#xFF0C;&#x53EA;&#x80FD;&#x8BA9;&#x4F60;&#x5728;&#x6545;&#x969C;&#x6392;&#x9664;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x5C11;&#x82B1;&#x4E00;&#x5230;&#x4E24;&#x5929;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x82E5;&#x6253;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x4F7F;&#x7528; <a href="https://plumbr.eu/" target="_blank" rel="external">Plumbr</a> &#x8FD9;&#x7C7B;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4ECE;&#x672A;&#x6709;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x70E6;&#x607C;&#x3002; </p>
<p>&#x539F;&#x6587;&#x94FE;&#x63A5;&#xFF1A; <a href="http://www.javacodegeeks.com/2015/03/turning-on-gc-logging-at-runtime.html" target="_blank" rel="external">JavaCodeGeeks</a> &#x7FFB;&#x8BD1;&#xFF1A;ImportNew.com -elviskang </p>
<p>&#x8BD1;&#x6587;&#x94FE;&#x63A5;&#xFF1A;[]</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a><a href="/tags/Linux/">Linux</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f40a743/" title="Java 性能优化手册 — 提高 Java 代码性能的各种技巧 -" itemprop="url">Java 性能优化手册 — 提高 Java 代码性能的各种技巧 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> (&#x70B9;&#x51FB;&#x4E0A;&#x65B9;  &#x516C;&#x4F17;&#x53F7;  &#xFF0C;&#xFFFD;&#xFFFD;&#xFFFD;&#x5FEB;&#x901F;&#x5173;&#x6CE8;)</p>
<h4 id="Java_6,7,8_&#x4E2D;&#x7684;_String-intern_&#x2013;_&#x5B57;&#x7B26;&#x4E32;&#x6C60;">Java 6,7,8 &#x4E2D;&#x7684; String.intern &#x2013; &#x5B57;&#x7B26;&#x4E32;&#x6C60;</h4><p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5C06;&#x8981;&#x8BA8;&#x8BBA; Java 6 &#x4E2D;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0; String.intern &#x65B9;&#x6CD5;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728; Java 7 &#x4EE5;&#x53CA; Java 8 &#x4E2D;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x8C03;&#x6574;&#x3002;</p>
<h4 id="&#x5B57;&#x7B26;&#x4E32;&#x6C60;">&#x5B57;&#x7B26;&#x4E32;&#x6C60;</h4><p>&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#xFF08;&#x6709;&#x540D;&#x5B57;&#x7B26;&#x4E32;&#x6807;&#x51C6;&#x5316;&#xFF09;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684;&#x5171;&#x4EAB; String &#x5BF9;&#x8C61;&#x6765;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x5740;&#x8868;&#x793A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684; Map&lt;String, String&gt; &#xFF08;&#x6839;&#x636E;&#x9700;&#x8981;&#x4F7F;&#x7528; weak &#x5F15;&#x7528;&#x6216;&#x8005; soft &#x5F15;&#x7528;&#xFF09;&#x5E76;&#x4F7F;&#x7528; map &#x4E2D;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x6807;&#x51C6;&#x503C;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; JDK &#x63D0;&#x4F9B;&#x7684; String.intern()&#x3002;</p>
<p>&#x5F88;&#x591A;&#x6807;&#x51C6;&#x7981;&#x6B62;&#x5728; Java 6 &#x4E2D;&#x4F7F;&#x7528; String.intern() &#x56E0;&#x4E3A;&#x5982;&#x679C;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#x6C60;&#x4F1A;&#x5E02;&#x533A;&#x63A7;&#x5236;&#xFF0C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x51E0;&#x7387;&#x89E6;&#x53D1; OutOfMemoryException&#x3002;Oracle Java 7 &#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x6539;&#x8FDB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x4E86;&#x89E3; <a href="http://bugs.sun.com/view_bug.do?bug_id=6962931&#x4EE5;&amp;#x53CA" target="_blank" rel="external">http://bugs.sun.com/view_bug.do?bug_id=6962931&#x4EE5;&amp;#x53CA</a>; <a href="http://bugs.sun.com/view_bug.do?bug_id=6962930" target="_blank" rel="external">http://bugs.sun.com/view_bug.do?bug_id=6962930</a></p>
<h4 id="Java_6_&#x4E2D;&#x7684;_String-intern()">Java 6 &#x4E2D;&#x7684; String.intern()</h4><p>&#x5728;&#x7F8E;&#x597D;&#x7684;&#x8FC7;&#x53BB;&#x6240;&#x6709;&#x5171;&#x4EAB;&#x7684; String &#x5BF9;&#x8C61;&#x90FD;&#x5B58;&#x50A8;&#x5728; PermGen &#x4E2D; &#x2014; &#x5806;&#x4E2D;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x5BF9;&#x8C61;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;&#x9664;&#x4E86;&#x660E;&#x786E;&#x7684;&#x5171;&#x4EAB;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;PermGen &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x8FD8;&#x5305;&#x542B;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x662F;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x4ECE;&#x672A;&#x52A0;&#x8F7D;&#x6216;&#x8005;&#x88AB;&#x6761;&#x7528;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4EFB;&#x4F55;&#x5E38;&#x91CF;&#x90FD;&#x4E0D;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#xFF09;</p>
<p>Java 6 &#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x6700;&#x5927;&#x95EE;&#x9898;&#x662F;&#x5B83;&#x7684;&#x4F4D;&#x7F6E; &#x2014; PermGen&#x3002;PermGen &#x7684;&#x5927;&#x5C0F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x5E76;&#x4E14;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x662F;&#x65E0;&#x6CD5;&#x6269;&#x5C55;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:MaxPermSize=N &#x914D;&#x7F6E;&#x6765;&#x8C03;&#x6574;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x636E;&#x6211;&#x4E86;&#x89E3;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x9ED8;&#x8BA4;&#x7684; PermGen &#x5927;&#x5C0F;&#x5728; 32M &#x5230; 96M &#x4E4B;&#x95F4;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E0D;&#x8FC7;&#x5927;&#x5C0F;&#x4F7F;&#x7528;&#x90FD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#x9700;&#x8981;&#x4F60;&#x5728;&#x4F7F;&#x7528; String.intern &#x65F6;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5C0F;&#x5FC3; &#x2014; &#x4F60;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5; intern &#x4EFB;&#x4F55;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x7528;&#x6237;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728; JAVA6 &#x4E2D;&#x5927;&#x90E8;&#x5206;&#x4F7F;&#x7528;&#x624B;&#x52A8;&#x7BA1;&#x7406; Map &#x6765;&#x5B9E;&#x73B0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;</p>
<h4 id="Java_7_&#x4E2D;&#x7684;_String-intern()">Java 7 &#x4E2D;&#x7684; String.intern()</h4><p>Java 7 &#x4E2D; Oracle &#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x903B;&#x8F91;&#x505A;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x6539;&#x53D8; &#x2014; &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x4F4D;&#x7F6E;&#x88AB;&#x8C03;&#x6574;&#x5230; heap &#x4E2D;&#x4E86;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x9650;&#x5236;&#x4E86;&#x3002;&#x6240;&#x6709;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x4FDD;&#x5B58;&#x5728;&#x5806;&#xFF08;heap&#xFF09;&#x4E2D;&#x540C;&#x5176;&#x4ED6;&#x666E;&#x901A;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4F60;&#x5728;&#x8C03;&#x4F18;&#x5E94;&#x7528;&#x65F6;&#x4EC5;&#x9700;&#x8981;&#x8C03;&#x6574;&#x5806;&#x5927;&#x5C0F;&#x3002;&#x8FD9; &#x4E2A;&#x6539;&#x52A8;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7406;&#x7531;&#x8BA9;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x8003;&#x8651;&#x5728; Java 7 &#x4E2D;&#x4F7F;&#x7528; String.intern()&#x3002;</p>
<h4 id="&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;">&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;</h4><p>&#x6CA1;&#x9519;&#xFF0C;&#x5728; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x503C;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x662F;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x7248;&#x672C;&#x7684; Java&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C; interned &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x5916;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F15;&#x7528; &#x2014; &#x5B83;&#x5C06;&#x4F1A;&#x4ECE; JVM &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6389;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x88AB;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#x5230;&#x5806;&#x4E2D;&#x4EE5;&#x53CA;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;JVM &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x5B58;&#x653E;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5408;&#x9002;&#x4F4D;&#x7F6E;&#xFF0C;&#x662F;&#x5417;&#xFF1F;&#x7406;&#x8BBA;&#x4E0A;&#x662F; &#x2014; &#x8FDD;&#x80CC;&#x4F7F;&#x7528;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4F1A;&#x4ECE;&#x6C60;&#x4E2D;&#x6536;&#x96C6;&#x6389;&#xFF0C;&#x5F53;&#x5916;&#x90E8;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4F20;&#x4E14;&#x6C60;&#x4E2D;&#x5B58;&#x5728;&#x65F6;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5185;&#x5B58;&#x3002;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x8282;&#x7701;&#x5185;&#x5B58;&#x7684;&#x7B56;&#x7565;&#xFF1F;&#x5728;&#x4F60;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x4E4B;&#x524D;&#xFF0C;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x7684;&#x662F;&#x4F60; &#x9700;&#x8981;&#x77E5;&#x9053;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<h4 id="&#x5728;_Java_6&#xFF0C;7&#xFF0C;8_&#x4E2D;_JVM_&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5B9E;&#x73B0;">&#x5728; Java 6&#xFF0C;7&#xFF0C;8 &#x4E2D; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5B9E;&#x73B0;</h4><p>&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x56FA;&#x5B9A;&#x5BB9;&#x91CF;&#x7684; HashMap &#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5305;&#x542B;&#x5177;&#x6709;&#x76F8;&#x540C; hash &#x503C;&#x7684;&#xFFFD;&#xFFFD;&#xFFFD;&#x7B26;&#x4E32;&#x5217;&#x8868;&#x3002;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x4ECE; Java bug &#x62A5;&#x544A;&#x4E2D;&#x83B7;&#x5F97; <a href="http://bugs.sun.com/view_bug.do?bug_id=6962930" target="_blank" rel="external">http://bugs.sun.com/view_bug.do?bug_id=6962930</a></p>
<p>&#x9ED8;&#x8BA4;&#x7684;&#x6C60;&#x5927;&#x5C0F;&#x662F; 1009 (&#x51FA;&#x73B0;&#x5728;&#x4E0A;&#x9762;&#x63D0;&#x53CA;&#x7684; bug &#x62A5;&#x544A;&#x7684;&#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x5728; Java7u40 &#x4E2D;&#x589E;&#x52A0;&#x4E86;)&#x3002;&#x5728; JAVA 6 &#x65E9;&#x671F;&#x7248;&#x672C;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF0C;&#x5728;&#x968F;&#x540E;&#x7684; java6u30 &#x81F3; java6u41 &#x4E2D;&#x8C03;&#x6574;&#x4E3A;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x3002;&#x800C;&#x5728;java 7&#x4E2D;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x7684;&#xFF08;&#x81F3;&#x5C11;&#x5728;java7u02&#x4E2D;&#x662F;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x7684;&#xFF09;&#x3002;&#x4F60;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x53C2;&#x6570; -XX:StringTableSize=N, N &#x662F;&#x5B57;&#x7B26;&#x4E32;&#x6C60; Map &#x7684;&#x5927;&#x5C0F;&#x3002;&#x786E;&#x4FDD;&#x5B83;&#x662F;&#x4E3A;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x800C;&#x9884;&#x5148;&#x51C6;&#x5907;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5728; Java 6 &#x4E2D;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x5E2E;&#x52A9;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4ECD;&#x4EFB;&#x88AB;&#x9650;&#x5236;&#x5728;&#x56FA;&#x5B9A;&#x7684; PermGen &#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4E2D;&#x3002;&#x540E;&#x7EED;&#x7684;&#x8BA8;&#x8BBA;&#x5C06;&#x76F4;&#x63A5;&#x5FFD;&#x7565; Java 6</p>
<h4 id="Java_7_&#xFF08;&#x76F4;&#x81F3;_Java7u40&#xFF09;">Java 7 &#xFF08;&#x76F4;&#x81F3; Java7u40&#xFF09;</h4><p>&#x5728; Java7 &#x4E2D;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4F60;&#x88AB;&#x9650;&#x5236;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x9884;&#x5148;&#x8BBE;&#x7F6E;&#x597D; String &#x6C60;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x8FD9;&#x4E2A;&#x503C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x6C42;&#xFF09;&#x3002;&#x901A;&#x5E38;&#x8BF4;&#x6765;&#xFF0C;&#x4E00;&#x65E6;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x5185;&#x5B58;&#x6D88;&#x8017;&#xFF0C;&#x5185;&#x5B58;&#x90FD;&#x662F;&#x6210;&#x767E;&#x5146;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7ED9;&#x4E00;&#x4E2A;&#x62E5;&#x6709; 100 &#x4E07;&#x5B57;&#x7B26;&#x4E32;&#x5BF9;&#x8C61;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5206;&#x914D; 8-16M &#x7684;&#x5185;&#x5B58;&#x770B;&#x8D77;&#x6765;&#x662F;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7684;&#xFF08;&#x4E0D;&#x8981;&#x4F7F;&#x7528;1,000,000 &#x4F5C;&#x4E3A; -XX:StringTaleSize &#x7684;&#x503C; &#x2013; &#x5B83;&#x4E0D;&#x662F;&#x8D28;&#x6570;&#xFF1B;&#x4F7F;&#x7528; 1,000,003&#x4EE3;&#x66FF;&#xFF09;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x671F;&#x5F85;&#x5173;&#x4E8E; String &#x5728; Map &#x4E2D;&#x7684;&#x5206;&#x914D; &#x2014; &#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x6211;&#x4E4B;&#x524D;&#x5173;&#x4E8E; HashCode &#x65B9;&#x6CD5;&#x8C03;&#x4F18;&#x7684;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x4F60;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684; -XX:StringTalbeSize &#x503C;(&#x76F8;&#x6BD4;&#x8F83;&#x9ED8;&#x8BA4;&#x7684; 1009 ),&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x66F4;&#x591A;&#x7684;&#x4F7F;&#x7528; String.intern() &#x2014; &#x5426;&#x5219;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C06;&#x5F88;&#x5FEB;&#x9012;&#x51CF;&#x5230; 0 &#xFF08;&#x6C60;&#x5927;&#x5C0F;&#xFF09;&#x3002;</p>
<p>&#x6211;&#x6CA1;&#x6709;&#x6CE8;&#x610F;&#x5230;&#x5728; intern &#x5C0F;&#x4E8E; 100 &#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#x7684;&#x4F9D;&#x8D56;&#x60C5;&#x51B5;&#xFF08;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x4E00;&#x4E2A;&#x5305;&#x542B; 50 &#x4E2A;&#x91CD;&#x590D;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0E;&#x73B0;&#x5B9E;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x76F8;&#x4F3C;&#xFF0C;&#x56E0;&#x6B64; 100 &#x4E2A;&#x5B57;&#x7B26;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6D4B;&#x8BD5;&#x9650;&#x5236;&#xFF09;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x9ED8;&#x8BA4;&#x6C60;&#x5927;&#x5C0F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E5;&#x5FD7;&#xFF1A;&#x7B2C;&#x4E00;&#x5217;&#x662F;&#x5DF2;&#x7ECF; intern &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x91CF;&#xFF0C;&#x7B2C;&#x4E8C;&#x5217; intern 10,000 &#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6240;&#x6709;&#x7684;&#x65F6;&#x95F4;&#xFF08;&#x79D2;&#xFF09;</p>
<p>0; time = 0.0 sec</p>
<p>50000; time = 0.03 sec</p>
<p>100000; time = 0.073 sec</p>
<p>150000; time = 0.13 sec</p>
<p>200000; time = 0.196 sec</p>
<p>250000; time = 0.279 sec</p>
<p>300000; time = 0.376 sec</p>
<p>350000; time = 0.471 sec</p>
<p>400000; time = 0.574 sec</p>
<p>450000; time = 0.666 sec</p>
<p>500000; time = 0.755 sec</p>
<p>550000; time = 0.854 sec</p>
<p>600000; time = 0.916 sec</p>
<p>650000; time = 1.006 sec</p>
<p>700000; time = 1.095 sec</p>
<p>750000; time = 1.273 sec</p>
<p>800000; time = 1.248 sec</p>
<p>850000; time = 1.446 sec</p>
<p>900000; time = 1.585 sec</p>
<p>950000; time = 1.635 sec</p>
<p>1000000; time = 1.913 sec</p>
<p>&#x6D4B;&#x8BD5;&#x662F;&#x5728; Core i5-3317U@1.7Ghz CPU &#x8BBE;&#x5907;&#x4E0A;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5B83;&#x6210;&#x7EBF;&#x6027;&#x589E;&#x957F;&#xFF0C;&#x5E76;&#x4E14;&#x5728; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5305;&#x542B;&#x4E00;&#x767E;&#x4E07;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8FD1;&#x4F3C;&#x6BCF;&#x79D2; intern 5000 &#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5904;&#x7406;&#x5927;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x592A;&#x6162;&#x4E86;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8C03;&#x6574; -XX:StringTableSize=100003 &#x53C2;&#x6570;&#x6765;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<p>50000; time = 0.017 sec</p>
<p>100000; time = 0.009 sec</p>
<p>150000; time = 0.01 sec</p>
<p>200000; time = 0.009 sec</p>
<p>250000; time = 0.007 sec</p>
<p>300000; time = 0.008 sec</p>
<p>350000; time = 0.009 sec</p>
<p>400000; time = 0.009 sec</p>
<p>450000; time = 0.01 sec</p>
<p>500000; time = 0.013 sec</p>
<p>550000; time = 0.011 sec</p>
<p>600000; time = 0.012 sec</p>
<p>650000; time = 0.015 sec</p>
<p>700000; time = 0.015 sec</p>
<p>750000; time = 0.01 sec</p>
<p>800000; time = 0.01 sec</p>
<p>850000; time = 0.011 sec</p>
<p>900000; time = 0.011 sec</p>
<p>950000; time = 0.012 sec</p>
<p>1000000; time = 0.012 sec</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x65F6;&#x63D2;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x65F6;&#x95F4;&#x8FD1;&#x4F3C;&#x4E8E;&#x5E38;&#x91CF;&#xFF08;&#x5728; Map &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5217;&#x8868;&#x4E2D;&#x5E73;&#x5747;&#x5B57;&#x7B26;&#x4E32;&#x4E2A;&#x6570;&#x4E0D;&#x8D85;&#x8FC7; 10 &#x4E2A;&#xFF09;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x76F8;&#x540C;&#x8BBE;&#x7F6E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x5C06;&#x5411;&#x6C60;&#x4E2D;&#x63D2;&#x5165; 1000 &#x4E07;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x8FD9;&#x610F;&#x5473;&#x7740; Map &#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5217;&#x8868;&#x5E73;&#x5747;&#x5305;&#x542B; 100 &#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF09;</p>
<p>2000000; time = 0.024 sec</p>
<p>3000000; time = 0.028 sec</p>
<p>4000000; time = 0.053 sec</p>
<p>5000000; time = 0.051 sec</p>
<p>6000000; time = 0.034 sec</p>
<p>7000000; time = 0.041 sec</p>
<p>8000000; time = 0.089 sec</p>
<p>9000000; time = 0.111 sec</p>
<p>10000000; time = 0.123 sec</p>
<p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x5C06;&#x5403;&#x7684;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x5230; 100 &#x4E07;&#xFF08;&#x7CBE;&#x786E;&#x7684;&#x8BF4;&#x662F; 1,000,003&#xFF09;</p>
<p>1000000; time = 0.005 sec</p>
<p>2000000; time = 0.005 sec</p>
<p>3000000; time = 0.005 sec</p>
<p>4000000; time = 0.004 sec</p>
<p>5000000; time = 0.004 sec</p>
<p>6000000; time = 0.009 sec</p>
<p>7000000; time = 0.01 sec</p>
<p>8000000; time = 0.009 sec</p>
<p>9000000; time = 0.009 sec</p>
<p>10000000; time = 0.009 sec</p>
<p>&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;,&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x5E73;&#x5747;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E; &#x201C;0 &#x5230; 100&#x4E07;&#x201D; &#x7684;&#x8868;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5DEE;&#x522B;&#x3002;&#x751A;&#x81F3;&#x5728;&#x6C60;&#x5927;&#x5C0F;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x4E5F;&#x80FD;&#x6BCF;&#x79D2;&#x6DFB;&#x52A0;1,000,000&#x4E2A;&#x5B57;&#x7B26;&#x5BF9;&#x8C61;&#x3002;</p>
<h4 id="&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x7BA1;&#x7406;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5417;&#xFF1F;">&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x7BA1;&#x7406;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5417;&#xFF1F;</h4><p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x6BD4; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x548C; WeakHashMap&lt;String, WeakReference&lt;String&gt;&gt; &#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6A21;&#x62DF; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x66FF;&#x6362; String.intern&#xFF1A;</p>
<p>private static final WeakHashMap&lt;String, WeakReference&lt;String&gt;&gt; s_manualCache =</p>
<p>new WeakHashMap&lt;String, WeakReference&lt;String&gt;&gt;( 100000 );</p>
<p>private static String manualIntern( final String str )</p>
<p>{</p>
<p>final WeakReference&lt;String&gt; cached = s_manualCache.get( str );</p>
<p>if ( cached != null )</p>
<p>{</p>
<p>final String value = cached.get();</p>
<p>if ( value != null )</p>
<p>return value;</p>
<p>}</p>
<p>s_manualCache.put( str, new WeakReference&lt;String&gt;( str ) );</p>
<p>return str;</p>
<p>}</p>
<p>&#xFFFD;&#xFFFD;&#xFFFD;&#x9762;&#x9488;&#x5BF9;&#x624B;&#x5DE5;&#x6C60;&#x7684;&#x76F8;&#x540C;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<p>0; manual time = 0.001 sec</p>
<p>50000; manual time = 0.03 sec</p>
<p>100000; manual time = 0.034 sec</p>
<p>150000; manual time = 0.008 sec</p>
<p>200000; manual time = 0.019 sec</p>
<p>250000; manual time = 0.011 sec</p>
<p>300000; manual time = 0.011 sec</p>
<p>350000; manual time = 0.008 sec</p>
<p>400000; manual time = 0.027 sec</p>
<p>450000; manual time = 0.008 sec</p>
<p>500000; manual time = 0.009 sec</p>
<p>550000; manual time = 0.008 sec</p>
<p>600000; manual time = 0.008 sec</p>
<p>650000; manual time = 0.008 sec</p>
<p>700000; manual time = 0.008 sec</p>
<p>750000; manual time = 0.011 sec</p>
<p>800000; manual time = 0.007 sec</p>
<p>850000; manual time = 0.008 sec</p>
<p>900000; manual time = 0.008 sec</p>
<p>950000; manual time = 0.008 sec</p>
<p>1000000; manual time = 0.008 sec</p>
<p>&#x5F53; JVM &#x6709;&#x8DB3;&#x591F;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x624B;&#x5DE5;&#x7F16;&#x5199;&#x7684;&#x6C60;&#x63D0;&#x4F9B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4E0D;&#x8FC7;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7684;&#x6D4B;&#x8BD5;&#xFF08;&#x4FDD;&#x7559; String.valueOf(0 &lt; N &lt; 1,000,000,000)&#xFF09;&#x4FDD;&#x7559;&#x975E;&#x5E38;&#x77ED;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5728;&#x4F7F;&#x7528; -Xmx1280M &#x53C2;&#x6570;&#x65F6;&#x5B83;&#x5141;&#x8BB8;&#x6211;&#x4FDD;&#x7559;&#x6708;&#x4E3A; 2.5M &#x7684;&#x8FD9;&#x7C7B;&#x5B57;&#x7B26;&#x4E32;&#x3002;JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60; (size=1,000,003&#xFF09;&#x4ECE;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x8BB2;&#x5728; JVM &#x5185;&#x5B58;&#x8DB3;&#x591F;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x6027;&#x80FD;&#x7279;&#x6027;&#xFF0C;&#x77E5;&#x9053; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5305;&#x542B; 12.72M &#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x6D88;&#x8017;&#x6389;&#x6240;&#x6709;&#x5185;&#x5B58;&#xFF08;5&#x500D;&#x591A;&#xFF09;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x4F60;&#x5728;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x53BB;&#x6389;&#x6240;&#x6709;&#x624B;&#x5DE5;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;</p>
<h4 id="&#x5728;_Java_7u40+_&#x4EE5;&#x53CA;_Java_8_&#x4E2D;&#x7684;_String-intern()">&#x5728; Java 7u40+ &#x4EE5;&#x53CA; Java 8 &#x4E2D;&#x7684; String.intern()</h4><p>Java7u40 &#x7248;&#x672C;&#x6269;&#x5C55;&#x4E86;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x8FD9;&#x662F;&#x7EC4;&#x8981;&#x7684;&#x6027;&#x80FD;&#x66F4;&#x65B0;&#xFF09;&#x5230; 60013.&#x8FD9;&#x4E2A;&#x503C;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x6C60;&#x4E2D;&#x5305;&#x542B;&#x5927;&#x7EA6; 30000 &#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BF4;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; -XX:+PrintFlagsFinal JVM &#x53C2;&#x6570;&#x83B7;&#x5F97;&#x8FD9;&#x4E2A;&#x503C;&#x3002;</p>
<p>&#x6211;&#x5C1D;&#x8BD5;&#x5728;&#x539F;&#x59CB;&#x53D1;&#x5E03;&#x7684; Java 8 &#x4E2D;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;Java 8 &#x4ECD;&#x7136;&#x652F;&#x6301; -XX:StringTableSize &#x53C2;&#x6570;&#x6765;&#x517C;&#x5BB9; Java 7 &#x7279;&#x6027;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E; Java 8 &#x4E2D;&#x9ED8;&#x8BA4;&#x7684;&#x6C60;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x5230; 60013&#xFF1A;</p>
<p>50000; time = 0.019 sec</p>
<p>100000; time = 0.009 sec</p>
<p>150000; time = 0.009 sec</p>
<p>200000; time = 0.009 sec</p>
<p>250000; time = 0.009 sec</p>
<p>300000; time = 0.009 sec</p>
<p>350000; time = 0.011 sec</p>
<p>400000; time = 0.012 sec</p>
<p>450000; time = 0.01 sec</p>
<p>500000; time = 0.013 sec</p>
<p>550000; time = 0.013 sec</p>
<p>600000; time = 0.014 sec</p>
<p>650000; time = 0.018 sec</p>
<p>700000; time = 0.015 sec</p>
<p>750000; time = 0.029 sec</p>
<p>800000; time = 0.018 sec</p>
<p>850000; time = 0.02 sec</p>
<p>900000; time = 0.017 sec</p>
<p>950000; time = 0.018 sec</p>
<p>1000000; time = 0.021 sec</p>
<h4 id="&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;">&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;</h4><p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x5FAA;&#x73AF;&#x521B;&#x5EFA;&#x5E76;&#x4FDD;&#x7559;&#x65B0;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x5B83;&#x4FDD;&#x7559; 10000 &#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6240;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6700;&#x597D;&#x914D;&#x5408; -verbose:gc JVM &#x53C2;&#x6570;&#x6765;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5783;&#x573E;&#x6536;&#x96C6;&#x662F;&#x4F55;&#x65F6;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x53D1;&#x751F;&#x7684;&#x3002;&#x53E6;&#x5916;&#x6700;&#x597D;&#x4F7F;&#x7528; -Xmx &#x53C2;&#x6570;&#x6765;&#x6267;&#x884C;&#x5806;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;&#x6D4B;&#x8BD5;&#xFF1A;testStringPoolGarbageCollection &#x5C06;&#x663E;&#x793A; JVM &#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6; &#x2014; &#x68C0;&#x67E5;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#x3002;&#x5728; Java 6 &#x7684;&#x9ED8;&#x8BA4; PermGen &#x5927;&#x5C0F;&#x914D;&#x7F6E;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x597D;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x65B0;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528; Java 7.</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x6D4B;&#x8BD5;&#x663E;&#x793A;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x7559;&#x4E86;&#x591A;&#x5C11;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5728; Java 6 &#x4E2D;&#x6267;&#x884C;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5B58;&#x914D;&#x7F6E; &#x6BD4;&#x5982;&#xFF1A; -Xmx128M &#x4EE5;&#x53CA; -Xmx1280M &#xFF08;10 &#x500D;&#x4EE5;&#x4E0A;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x503C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x653E;&#x5165;&#x6C60;&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6570;&#x91CF;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728; Java 7 &#x4E2D;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x5806;&#x4E2D;&#x586B;&#x6EE1;&#x4F60;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<p>/**</p>
<ul>
<li>Testing String.intern.</li>
</ul>
<p>*</p>
<ul>
<li>Run this class at least with -verbose:gc JVM parameter.</li>
</ul>
<p>*/</p>
<p>public class InternTest {</p>
<p>public static void main( String[] args ) {</p>
<p>testStringPoolGarbageCollection();</p>
<p>testLongLoop();</p>
<p>}</p>
<p>/**</p>
<ul>
<li><p>Use this method to see where interned strings are stored</p>
</li>
<li><p>and how many of them can you fit for the given heap size.</p>
</li>
</ul>
<p>*/</p>
<p>private static void testLongLoop()</p>
<p>{</p>
<p>test( 1000 <em> 1000 </em> 1000 );</p>
<p>//uncomment the following line to see the hand-written cache performance</p>
<p>//testManual( 1000 <em> 1000 </em> 1000 );</p>
<p>}</p>
<p>/**</p>
<ul>
<li>Use this method to check that not used interned strings are garbage collected.</li>
</ul>
<p>*/</p>
<p>private static void testStringPoolGarbageCollection()</p>
<p>{</p>
<p>//first method call - use it as a reference</p>
<p>test( 1000 * 1000 );</p>
<p>//we are going to clean the cache here.</p>
<p>System.gc();</p>
<p>//check the memory consumption and how long does it take to intern strings</p>
<p>//in the second method call.</p>
<p>test( 1000 * 1000 );</p>
<p>}</p>
<p>private static void test( final int cnt )</p>
<p>{</p>
<p>final List&lt;String&gt; lst = new ArrayList&lt;String&gt;( 100 );</p>
<p>long start = System.currentTimeMillis();</p>
<p>for ( int i = 0; i &lt; cnt; ++i )</p>
<p>{</p>
<p>final String str = &quot;Very long test string, which tells you about something &quot; +</p>
<p>&quot;very-very important, definitely deserving to be interned #&quot; + i;</p>
<p>//uncomment the following line to test dependency from string length</p>
<p>// final String str = Integer.toString( i );</p>
<p>lst.add( str.intern() );</p>
<p>if ( i % 10000 == 0 )</p>
<p>{</p>
<p>System.out.println( i + &quot;; time = &quot; + ( System.currentTimeMillis() - start ) / 1000.0 + &quot; sec&quot; );</p>
<p>start = System.currentTimeMillis();</p>
<p>}</p>
<p>}</p>
<p>System.out.println( &quot;Total length = &quot; + lst.size() );</p>
<p>}</p>
<p>private static final WeakHashMap&lt;String, WeakReference&lt;String&gt;&gt; s_manualCache =</p>
<p>new WeakHashMap&lt;String, WeakReference&lt;String&gt;&gt;( 100000 );</p>
<p>private static String manualIntern( final String str )</p>
<p>{</p>
<p>final WeakReference&lt;String&gt; cached = s_manualCache.get( str );</p>
<p>if ( cached != null )</p>
<p>{</p>
<p>final String value = cached.get();</p>
<p>if ( value != null )</p>
<p>return value;</p>
<p>}</p>
<p>s_manualCache.put( str, new WeakReference&lt;String&gt;( str ) );</p>
<p>return str;</p>
<p>}</p>
<p>private static void testManual( final int cnt )</p>
<p>{</p>
<p>final List&lt;String&gt; lst = new ArrayList&lt;String&gt;( 100 );</p>
<p>long start = System.currentTimeMillis();</p>
<p>for ( int i = 0; i &lt; cnt; ++i )</p>
<p>{</p>
<p>final String str = &quot;Very long test string, which tells you about something &quot; +</p>
<p>&quot;very-very important, definitely deserving to be interned #&quot; + i;</p>
<p>lst.add( manualIntern( str ) );</p>
<p>if ( i % 10000 == 0 )</p>
<p>{</p>
<p>System.out.println( i + &quot;; manual time = &quot; + ( System.currentTimeMillis() - start ) / 1000.0 + &quot; sec&quot; );</p>
<p>start = System.currentTimeMillis();</p>
<p>}</p>
<p>}</p>
<p>System.out.println( &quot;Total length = &quot; + lst.size() );</p>
<p>}</p>
<p>}</p>
<h4 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h4><ul>
<li>&#x7531;&#x4E8E; Java 6 &#x4E2D;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF08;PermGen&#xFF09;&#x56E0;&#x6B64;&#x4E0D;&#x8981;&#x4F7F;&#x7528; String.intern() &#x65B9;&#x6CD5;</li>
<li>Java7 &#x548C; 8 &#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x5B9E;&#x73B0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;&#x8FD9;&#x4EE5;&#x4E3A;&#x8FD9;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5185;&#x5B58;&#x9650;&#x5236;&#x7B49;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x5B58;&#x9650;&#x5236;&#x3002;</li>
<li>&#x5728; Java 7 &#x548C; 8 &#x4E2D;&#x4F7F;&#x7528; -XX:StringTableSize &#x6765;&#x8BBE;&#x7F6E;&#x5B57;&#x7B26;&#x4E32;&#x6C60; Map &#x7684;&#x5927;&#x5C0F;&#x3002;&#x5B83;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x7528; HashMap &#x5B9E;&#x73B0;&#x3002;&#x8FD1;&#x4F3C;&#x4E8E;&#x4F60;&#x5E94;&#x7528;&#x5355;&#x72EC;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E2A;&#x6570;&#xFF08;&#x4F60;&#x5E0C;&#x671B;&#x4FDD;&#x7559;&#x7684;&#xFF09;&#x5E76;&#x4E14;&#x8BBE;&#x7F6E;&#x6C60;&#x7684;&#x5927;&#x5C0F;&#x4E3A;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x8D28;&#x6570;&#x5E76;&#x4E58;&#x4EE5; 2 &#xFF08;&#x51CF;&#x5C11;&#x78B0;&#x649E;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF09;&#x3002;&#x5B83;&#x662F;&#x7684; String.intern &#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#xFF08;&#x56FA;&#x5B9A;&#xFF09;&#x7684;&#x65F6;&#x95F4;&#x5E76;&#x4E14;&#x5728;&#x6BCF;&#x6B21;&#x63D2;&#x5165;&#x65F6;&#x6D88;&#x8017;&#x66F4;&#x5C0F;&#x7684;&#x5185;&#x5B58;(&#x540C;&#x6837;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F7F;&#x7528;java WeakHashMap&#x5C06;&#x6D88;&#x8017;4-5&#x500D;&#x7684;&#x5185;&#x5B58;)&#x3002;</li>
<li>&#x5728; Java 6 &#x548C; 7&#xFF08;Java7u40&#x4EE5;&#x524D;&#xFF09; &#x4E2D; -XX:StringTableSize &#x53C2;&#x6570;&#x7684;&#x503C;&#x662F; 1009&#x3002;Java7u40 &#x4EE5;&#x540E;&#x8FD9;&#x4E2A;&#x503C;&#x8C03;&#x6574;&#x4E3A; 60013 &#xFF08;Java 8 &#x4E2D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x7528;&#x91CF;&#xFF0C;&#x53C2;&#x8003;&#xFF1A;-XX:+PrintStringTableStatistics JVM &#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x6302;&#x6389;&#x65F6;&#x5B83;&#x544A;&#x8BC9;&#x4F60;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x4F7F;&#x7528;&#x91CF;&#x4FE1;&#x606F;&#x3002;</li>
</ul>
<p>&#x51FA;&#x5904;&#xFF1A;&#x5B57;&#x8282;&#x6280;&#x672F;</p>
<p>&#x94FE;&#x63A5;&#xFF1A;<a href="http://www.4byte.cn/learning/84930/java-xing-neng-you-hua-shou-ce-ti-gao-java-dai-ma-xing-neng-de-ge-zhong-ji-qiao.html" target="_blank" rel="external">http://www.4byte.cn/learning/84930/java-xing-neng-you-hua-shou-ce-ti-gao-java-dai-ma-xing-neng-de-ge-zhong-ji-qiao.html</a></p>
<p> <strong>ImportNew &#x4E13;&#x6CE8; Java &#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x3002;</strong></p>
<p>&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; ImportNew</p>
<p> <img src="http://taojinke.github.io/img/20150702/f4067c9.png" alt=""></p>
<p>&#xFF08;&#x957F;&#x6309;&#x4E0A;&#x56FE; &#x2191;&#x2191;&#x2191; &#x53EF;&#x81EA;&#x52A8;&#x8BC6;&#x522B;&#x4E8C;&#x7EF4;&#x7801;&#xFF09;</p>
<p><img src="http://taojinke.github.io/img/20150702/f40718d.jpg" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f4019a9/" title="Java中的String、StringBuilder、StringBuffer -" itemprop="url">Java中的String、StringBuilder、StringBuffer -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>Java&#x4E2D;&#x7684;String&#x662F;&#x4E2A;&#x6C38;&#x6052;&#x7684;&#x8BDD;&#x9898;&#xFF0C;&#x76F4;&#x8BF4;&#x6211;&#x60F3;&#x8BF4;&#x7684;&#x3002;</p>
<p>1&#x3001;String &#x662F;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x53D8;&#x7684;&#xFF0C;&#x4F20;&#x9012;&#x7684;&#x5F15;&#x7528;&#x7684;&#x4E00;&#x4E2A;Copy&#xFF0C;&#x65E0;&#x8BBA;&#x522E;&#x98CE;&#x4E0B;&#x96E8;&#xFF0C;&#x5B83;&#x90FD;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x7A9D;&#x91CC;&#x5446;&#x7684;&#x597D;&#x597D;&#x7684;&#x3002;</p>
<p>2&#x3001;&#x91CD;&#x8F7D;&#x201C;+&#x201D;&#x548C;StringBuilder</p>
<p>&#x8FDE;&#x63A5;&#x5B57;&#x7B26;&#x4E32;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x201C;+&#x201D;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;StringBuilder&#x4E2D;&#x7684;append();&#x6709;&#x65F6;&#x5019;&#x4E3A;&#x4E86;&#x5077;&#x61D2;&#x5C31;&#x76F4;&#x63A5; &#x7528;&#x201C;+&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x7EA0;&#x7ED3;&#x5FC3;&#xFF0C;&#x603B;&#x5728;&#x89C9;&#x5F97;&#x662F;&#x4E0D;&#x662F;&#x4F1A;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#x3002;&#x5148;&#x5BF9;&#x6B64;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#xFF1A;</p>
<p>&#x901A;&#x8FC7;jvm&#x53CD;&#x5E94;&#x7684;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x201C;+&#x201D;&#x5B9E;&#x73B0;&#x8FDE;&#x63A5;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;JVM&#x4F1A;&#x81EA;&#x52A8;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x5DE5;&#x4F5C;&#xFF0C;&#x5F15;&#x5165;StringBuilder&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F9D;&#x9760;JVM&#x76F4;&#x63A5;&#x4F7F;&#x7528;&#x201C;+&#x201D;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x4F46;&#x8FD9;&#x4E2A;&#x5C3D;&#x9650;&#x4E8E;&#x7B80;&#x5355;&#x7684;&#x62FC;&#x63A5;(&#x5F53;&#x7136;&#x96BE;&#x7684;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#xFF0C;&#x53EA;&#x662F;&#x3002;&#x3002;&#x3002;&#x4F60;&#x61C2;&#x7684;)&#xFF0C;&#x5BF9;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x62FC;&#x63A5;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x6D89;&#x53CA;&#x5230;&#x6709;&#x5FAA;&#x73AF;&#x7684;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;StringBuilder&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x662F;&#x201C;+&#x201D;,&#x5728;JVM&#x8FDB;&#x884C;&#x5B9E;&#x73B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x91CD;&#x590D;&#x7684;&#x521B;&#x5EFA;StringBuilder&#x5BF9;&#x8C61;&#x3002;StringBuilder&#x53EF;&#x4EE5;&#x662F;&#x4F7F;&#x4EE3;&#x7801;&#x7B80;&#x77ED;&#xFF0C;&#x7B80;&#x5355;&#xFF0C;&#x800C;&#x4E14;&#x53EA;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;StringBuilder&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x5141;&#x8BB8;&#x4F60;&#x9884;&#x5148;&#x6307;&#x5B9A;&#x5927;&#x5C0F;(&#x5982;&#x679C;&#x4F60;&#x5DF2;&#x7ECF;&#x5927;&#x6982;&#x77E5;&#x9053;&#x6700;&#x7EC8;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x9884;&#x5148;&#x6307;&#x5B9A;&#x5927;&#x5C0F;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5BF9;&#x6B64;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x7F13;&#x51B2;&#x533A;)&#x3002;</p>
<p>3&#x3001;StringBuilder&#x548C;StringBuffer</p>
<p>StringBuffer&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5F00;&#x9500;&#x5927;&#x4E9B;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x6D89;&#x53CA;&#x5230;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x95EE;&#x9898;&#xFF0C;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;StringBuilder&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x66F4;&#x9AD8;&#x6548;&#xFF1B;</p>
<p> &#xFF01;&#xFF01;&#xFF01; &#x8981;&#x5C3D;&#x91CF;&#x675C;&#x7EDD;&#x4F7F;&#x7528;append(a+&quot;,&quot;+c);&#x56E0;&#xFFFD;&#xFFFD;&#xFFFD;&#x8FD9;&#x4E2A;JVM&#x4F1A;&#x518D;&#x4E3A;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;StringBuilder&#x5BF9;&#x8C61;&#x5904;&#x7406;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x62FC;&#x63A5;&#x5DE5;&#x4F5C;&#x3002; </p>
<p>&#x4E0B;&#x8FB9;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;StingBuilder&#x7684;&#x7B80;&#x5355;&#x4F7F;&#x7528;&#x4F8B;&#x5B50;</p>
<pre><code><span class="keyword">import</span> java.util.<span class="type">Random</span>;

public class <span class="type">TestStringBuilder</span> {

    public <span class="keyword">static</span> <span class="type">Random</span> rand = new <span class="type">Random</span>();

    public <span class="type">String</span> toString(){
        <span class="type">StringBuilder</span> <span class="literal">result</span> = new <span class="type">StringBuilder</span>(&amp;quot;[&amp;quot;);
        <span class="keyword">for</span> (<span class="type">int</span> i = <span class="number">0</span>; i &amp;lt; <span class="number">25</span>; i++) {
            <span class="literal">result</span>.append(rand.nextInt(<span class="number">100</span>));
            <span class="literal">result</span>.append(&amp;quot;, &amp;quot;);
        }
        //&amp;<span class="comment">#x53BB;&amp;#x9664;&amp;#x6700;&amp;#x540E;&amp;#x7684;&amp;#x9017;&amp;#x53F7;&amp;#x548C;&amp;#x7A7A;&amp;#x683C;</span>
        <span class="literal">result</span>.delete(<span class="literal">result</span>.length()-<span class="number">2</span>, <span class="literal">result</span>.length());
        <span class="literal">result</span>.append(&amp;quot;]&amp;quot;);
        <span class="keyword">return</span> <span class="literal">result</span>.toString() ;
    }

    public <span class="keyword">static</span> <span class="type">void</span> main(<span class="type">String</span>[] args) {
        <span class="type">TestStringBuilder</span> ts = new <span class="type">TestStringBuilder</span>();
        <span class="type">System</span>.<span class="keyword">out</span>.println(ts);
    }
}
</code></pre>
        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f3e86d4/" title="JVM如何操作缓冲区 -" itemprop="url">JVM如何操作缓冲区 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;JVM&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x505A;&#x4E86;&#x5982;&#x4E0B;&#x51E0;&#x4EF6;&#x4E8B;&#xFF1A;</p>
<ol>
<li>JVM&#x786E;&#x4FDD;Heap&#x533A;&#x57DF;&#x5185;&#x7684;&#x7A7A;&#x95F4;&#x8DB3;&#x591F;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x591F;&#x5219;&#x4F7F;&#x7528;&#x89E6;&#x53D1;GC&#x5728;&#x5185;&#x7684;&#x65B9;&#x6CD5;&#x83B7;&#x5F97;&#x7A7A;&#x95F4;;</li>
<li>&#x83B7;&#x5F97;&#x7A7A;&#x95F4;&#x4E4B;&#x540E;&#x4F1A;&#x627E;&#x4E00;&#x7EC4;&#x5806;&#x5185;&#x7684;&#x8FDE;&#x7EED;&#x5730;&#x5740;&#x5206;&#x914D;&#x6570;&#x7EC4;, &#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B57;&#x8282;&#x662F;&#x4E0D;&#x4E00;&#x5B9A;&#x8FDE;&#x7EED;&#x7684;;</li>
</ol>
<p>&#x5BF9;&#x4E8E;&#x4E0D;&#x6D89;&#x53CA;&#x5230;IO&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x5904;&#x7406;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5F53;&#x8FDB;&#x884C;IO&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x70B9;&#x6027;&#x80FD;&#x95EE;&#x9898;.</p>
<p>&#x6240;&#x6709;&#x7684;IO&#x64CD;&#x4F5C;&#x90FD;&#x9700;&#x8981;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x5165;&#x5185;&#x6838;&#x6001;&#x624D;&#x884C;&#xFF0C;&#x800C;JVM&#x8FDB;&#x7A0B;&#x5C5E;&#x4E8E;&#x7528;&#x6237;&#x6001;&#x8FDB;&#x7A0B;, &#x5F53;JVM&#x9700;&#x8981;&#x628A;&#x4E00;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x5199;&#x5230;&#x67D0;&#x4E2A;Channel&#x6216;Socket&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x5207;&#x6362;&#x5230;&#x5185;&#x6838;&#x6001;.</p>
<p>&#x800C;&#x5185;&#x6838;&#x6001;&#x7531;&#x4E8E;&#x5E76;&#x4E0D;&#x77E5;&#x9053;JVM&#x91CC;&#x9762;&#x8FD9;&#x4E2A;&#x7F13;&#x51B2;&#x533A;&#x5B58;&#x50A8;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x7684;&#x4EC0;&#x4E48;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x4E14;&#x8FD9;&#x4E9B;&#x7269;&#x7406;&#x5730;&#x5740;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x8FDE;&#x7EED;&#x7684;(&#x6216;&#x8005;&#x8BF4;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;IO&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x7684;&#x5757;&#x7ED3;&#x6784;)&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5207;&#x6362;&#x4E4B;&#x524D;JVM&#x9700;&#x8981;&#x628A;&#x7F13;&#x51B2;&#x533A;&#x590D;&#x5236;&#x5230;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E00;&#x5757;&#x8FDE;&#x7EED;&#x7684;&#x5185;&#x5B58;&#x4E0A;, &#x7136;&#x540E;&#x7531;&#x5185;&#x6838;&#x53BB;&#x8BFB;&#x53D6;&#x8FD9;&#x5757;&#x7269;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x6574;&#x5408;&#x6210;&#x8FDE;&#x7EED;&#x7684;&#x3001;&#x5206;&#x5757;&#x7684;&#x5185;&#x5B58;.</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;, Java&#x7684;&#x67D0;&#x4E9B;&#x7248;&#x672C;&#x4F1A;&#x628A;&#x7269;&#x7406;&#x533A;&#x57DF;&#x5206;&#x914D;&#x597D;&#x7684;&#x90E8;&#x5206;&#x5185;&#x5B58;&#x505A;&#x7F13;&#x5B58;&#x5C31;&#x4E0D;&#x7528;&#x6BCF;&#x6B21;&#x90FD;&#x5F00;&#x8F9F;&#x4E00;&#x5757;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x6548;&#x679C;&#x8FD8;&#x4E0D;&#x591F;&#x597D;&#xFF0C;&#x6BD5;&#x7ADF;&#x590D;&#x5236;&#x7684;&#x90E8;&#x5206;&#x662F;&#x5C11;&#x4E0D;&#x4E86;&#x7684;.</p>
<p>JDK1.4&#x4E4B;&#x540E;&#x5F15;&#x5165;&#x4E86;NIO, &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x6280;&#x672F;, &#x8BA9;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4ECE;Java&#x4EE3;&#x7801;&#x4E2D;&#x521B;&#x5EFA;DirectBuffer&#xFF0C;&#x8FD9;&#x79CD;Buffer&#x5728;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x5C31;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x4E00;&#x5757;&#x8FDE;&#x7EED;&#x5185;&#x5B58;&#xFF0C;&#x5F53;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x590D;&#x5236;&#xFF0C;&#x5185;&#x6838;&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x5373;&#x53EF;. &#x4F46;&#x7F3A;&#x70B9;&#x4E5F;&#x662F;&#x663E;&#x800C;&#x6613;&#xFFFD;&#xFFFD;&#xFFFD;&#x7684;&#xFF0C;&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x5206;&#x914D;&#x90FD;&#x6BD4;&#x8F83;&#x6602;&#x8D35;&#x4E00;&#x70B9;&#xFF0C;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x4E0D;&#x5728;Java Heap&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D7;&#x7528;&#x6237;&#x8BBE;&#x7F6E;&#x7684;&#x5806;&#x5927;&#x5C0F;&#x7684;&#x9650;&#x5236;.</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5927;&#x91CF;&#x4F7F;&#x7528;IO&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x4F7F;&#x7528;&#x5185;&#x5B58;&#x6620;&#x5C04;&#x662F;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x753B;&#x7684;&#x4E00;&#x5F20;&#x56FE;&#xFF0C;&#x65B9;&#x4FBF;&#x8BB0;&#x5FC6;:</p>
<p><img src="http://taojinke.github.io/img/20150702/f3e734c.png" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f050a08/" title="提高 Java 代码性能的各种技巧 -" itemprop="url">提高 Java 代码性能的各种技巧 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:23.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><strong>Java&#xA0;6,7,8&#xA0;&#x4E2D;&#x7684;&#xA0;String.intern&#xA0;&#x2013;&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;</strong></p>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5C06;&#x8981;&#x8BA8;&#x8BBA;&#xA0;Java&#xA0;6&#xA0;&#x4E2D;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#xA0;String.intern&#xA0;&#x65B9;&#x6CD5;&#x7684;&#xFF0C;&#x4EE5;&#x53CA;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5728;&#xA0;Java&#xA0;7&#xA0;&#x4EE5;&#x53CA;&#xA0;Java&#xA0;8&#xA0;&#x4E2D;&#x505A;&#x4E86;&#x54EA;&#x4E9B;&#x8C03;&#x6574;&#x3002;</p>
<p><strong>&#x5B57;&#x7B26;&#x4E32;&#x6C60;</strong></p>
<p>&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#xFF08;&#x6709;&#x540D;&#x5B57;&#x7B26;&#x4E32;&#x6807;&#x51C6;&#x5316;&#xFF09;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x552F;&#x4E00;&#x7684;&#x5171;&#x4EAB;&#xA0;String&#xA0;&#x5BF9;&#x8C61;&#x6765;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x5740;&#x8868;&#x793A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#xA0;Map&lt;String,&#xA0;String&gt;&#xA0;&#xFF08;&#x6839;&#x636E;&#x9700;&#x8981;&#x4F7F;&#x7528;&#xA0;weak&#xA0;&#x5F15;&#x7528;&#x6216;&#x8005;&#xA0;soft&#xA0;&#x5F15;&#x7528;&#xFF09;&#x5E76;&#x4F7F;&#x7528;&#xA0;map&#xA0;&#x4E2D;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x6807;&#x51C6;&#x503C;&#x6765;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#xFF0C;&#x6216;&#x8005;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xA0;JDK&#xA0;&#x63D0;&#x4F9B;&#x7684;String.intern()&#x3002;</p>
<p>&#x5F88;&#x591A;&#x6807;&#x51C6;&#x7981;&#x6B62;&#x5728;&#xA0;Java&#xA0;6&#xA0;&#x4E2D;&#x4F7F;&#x7528;&#xA0;String.intern()&#xA0;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x9891;&#x7E41;&#x4F7F;&#x7528;&#x6C60;&#x4F1A;&#x5E02;&#x533A;&#x63A7;&#x5236;&#xFF0C;&#x6709;&#x5F88;&#x5927;&#x7684;&#x51E0;&#x7387;&#x89E6;&#x53D1;&#xA0;OutOfMemoryException&#x3002;Oracle&#xA0;Java&#xA0;7&#xA0;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x505A;&#x4E86;&#x5F88;&#x591A;&#x6539;&#x8FDB;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x4E86;&#x89E3;&#xA0; <a href="http://bugs.sun.com/view_bug.do?bug_id=6962931" target="_blank" rel="external">http://bugs.sun.com/view_bug.do?bug_id=6962931</a> &#x4EE5;&#x53CA; <a href="http://bugs.sun.com/view_bug.do?bug_id=6962930" target="_blank" rel="external">http://bugs.sun.com/view_bug.do?bug_id=6962930</a></p>
<p><strong>Java&#xA0;6&#xA0;&#x4E2D;&#x7684;&#xA0;String.intern()</strong></p>
<p>&#x5728;&#x7F8E;&#x597D;&#x7684;&#x8FC7;&#x53BB;&#x6240;&#x6709;&#x5171;&#x4EAB;&#x7684;&#xA0;String&#xA0;&#x5BF9;&#x8C61;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#xA0;PermGen&#xA0;&#x4E2D;&#xA0;&#x2014;&#xA0;&#x5806;&#x4E2D;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x90E8;&#x5206;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x52A0;&#x8F7D;&#x7684;&#x7C7B;&#x5BF9;&#x8C61;&#x548C;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;&#x9664;&#x4E86;&#x660E;&#x786E;&#x7684;&#x5171;&#x4EAB;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;PermGen&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x8FD8;&#x5305;&#x542B;&#x6240;&#x6709;&#x7A0B;&#x5E8F;&#x4E2D;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x662F;&#x4F7F;&#x7528;&#x8FC7;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5982;&#x679C;&#x7C7B;&#x6216;&#x8005;&#x65B9;&#x6CD5;&#x4ECE;&#x672A;&#x52A0;&#x8F7D;&#x6216;&#x8005;&#x88AB;&#x6761;&#x7528;&#xFF0C;&#x5728;&#x5176;&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x4EFB;&#x4F55;&#x5E38;&#x91CF;&#x90FD;&#x4E0D;&#x4F1A;&#x88AB;&#x52A0;&#x8F7D;&#xFF09;</p>
<p>Java&#xA0;6&#xA0;&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x6700;&#x5927;&#x95EE;&#x9898;&#x662F;&#x5B83;&#x7684;&#x4F4D;&#x7F6E;&#xA0;&#x2014;&#xA0;PermGen&#x3002;PermGen&#xA0;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x5E76;&#x4E14;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x662F;&#x65E0;&#x6CD5;&#x6269;&#x5C55;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#xA0;-XX:MaxPermSize=N&#xA0;&#x914D;&#x7F6E;&#x6765;&#x8C03;&#x6574;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x636E;&#x6211;&#x4E86;&#x89E3;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x5E73;&#x53F0;&#x9ED8;&#x8BA4;&#x7684;&#xA0;PermGen&#xA0;&#x5927;&#x5C0F;&#x5728;&#xA0;32M&#xA0;&#x5230;&#xA0;96M&#xA0;&#x4E4B;&#x95F4;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x5B83;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4E0D;&#x8FC7;&#x5927;&#x5C0F;&#x4F7F;&#x7528;&#x90FD;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x9650;&#x5236;&#x9700;&#x8981;&#x4F60;&#x5728;&#x4F7F;&#x7528;&#xA0;String.intern&#xA0;&#x65F6;&#x9700;&#x8981;&#x975E;&#x5E38;&#x5C0F;&#x5FC3;&#xA0;&#x2014;&#xA0;&#x4F60;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#xA0;intern&#xA0;&#x4EFB;&#x4F55;&#x65E0;&#x6CD5;&#x63A7;&#x5236;&#x7684;&#x7528;&#x6237;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#xA0;JAVA6&#xA0;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x4F7F;&#x7528;&#x624B;&#x52A8;&#x7BA1;&#x7406;&#xA0;Map&#xA0;&#x6765;&#x5B9E;&#x73B0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;</p>
<p><strong>Java&#xA0;7&#xA0;&#x4E2D;&#x7684;&#xA0;String.intern()</strong></p>
<p>Java&#xA0;7&#xA0;&#x4E2D;&#xA0;Oracle&#xA0;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x5BF9;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x903B;&#x8F91;&#x505A;&#x4E86;&#x5F88;&#x5927;&#x7684;&#x6539;&#x53D8;&#xA0;&#x2014;&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x4F4D;&#x7F6E;&#x88AB;&#x8C03;&#x6574;&#x5230;&#xA0;heap&#xA0;&#x4E2D;&#x4E86;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x518D;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x9650;&#x5236;&#x4E86;&#x3002;&#x6240;&#x6709;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x90FD;&#x4FDD;&#x5B58;&#x5728;&#x5806;&#xFF08;heap&#xFF09;&#x4E2D;&#x540C;&#x5176;&#x4ED6;&#x666E;&#x901A;&#x5BF9;&#x8C61;&#x4E00;&#x6837;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x4F60;&#x5728;&#x8C03;&#x4F18;&#x5E94;&#x7528;&#x65F6;&#x4EC5;&#x9700;&#x8981;&#x8C03;&#x6574;&#x5806;&#x5927;&#x5C0F;&#x3002;&#x8FD9;&#xA0;&#x4E2A;&#x6539;&#x52A8;&#x4F7F;&#x5F97;&#x6211;&#x4EEC;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7406;&#x7531;&#x8BA9;&#x6211;&#x4EEC;&#x91CD;&#x65B0;&#x8003;&#x8651;&#x5728;&#xA0;Java&#xA0;7&#xA0;&#x4E2D;&#x4F7F;&#x7528;&#xA0;String.intern()&#x3002;</p>
<p><strong>&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;</strong></p>
<p>&#x6CA1;&#x9519;&#xFF0C;&#x5728;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B57;&#x7B26;&#x4E32;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x503C;&#x5728;&#x5E94;&#x7528;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x662F;&#x7528;&#x4E8E;&#x6240;&#x6709;&#x7248;&#x672C;&#x7684;&#xA0;Java&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#xA0;interned&#xA0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5728;&#x4F5C;&#x7528;&#x57DF;&#x5916;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F15;&#x7528;&#xA0;&#x2014;&#xA0;&#x5B83;&#x5C06;&#x4F1A;&#x4ECE;&#xA0;JVM&#xA0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x4E2D;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6389;&#x3002;</p>
<p>&#x56E0;&#x4E3A;&#x88AB;&#x91CD;&#x65B0;&#x5B9A;&#x4F4D;&#xFFFD;&#xFFFD;&#xFFFD;&#x5806;&#x4E2D;&#x4EE5;&#x53CA;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;JVM&#xA0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x5B58;&#x653E;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x5408;&#x9002;&#x4F4D;&#x7F6E;&#xFF0C;&#x662F;&#x5417;&#xFF1F;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#xA0;&#x2014;&#xA0;&#x8FDD;&#x80CC;&#x4F7F;&#x7528;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4F1A;&#x4ECE;&#x6C60;&#x4E2D;&#x6536;&#x96C6;&#x6389;&#xFF0C;&#x5F53;&#x5916;&#x90E8;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4F20;&#x4E14;&#x6C60;&#x4E2D;&#x5B58;&#x5728;&#x65F6;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5185;&#x5B58;&#x3002;&#x770B;&#x8D77;&#x6765;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x8282;&#x7701;&#x5185;&#x5B58;&#x7684;&#x7B56;&#x7565;&#xFF1F;&#x5728;&#x4F60;&#x56DE;&#x7B54;&#x8FD9;&#x4E2A;&#x4E4B;&#x524D;&#xFF0C;&#x53EF;&#x4EE5;&#x80AF;&#x5B9A;&#x7684;&#x662F;&#x4F60;&#xA0;&#x9700;&#x8981;&#x77E5;&#x9053;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x7684;&#x3002;</p>
<p><strong>&#x5728;&#xA0;Java&#xA0;6&#xFF0C;7&#xFF0C;8&#xA0;&#x4E2D;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5B9E;&#x73B0;</strong></p>
<p>&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x662F;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x56FA;&#x5B9A;&#x5BB9;&#x91CF;&#x7684;&#xA0;HashMap&#xA0;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5305;&#x542B;&#x5177;&#x6709;&#x76F8;&#x540C;&#xA0;hash&#xA0;&#x503C;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5217;&#x8868;&#x3002;&#x4E00;&#x4E9B;&#x5B9E;&#x73B0;&#x7684;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x4ECE;&#xA0;Java&#xA0;bug&#xA0;&#x62A5;&#x544A;&#x4E2D;&#x83B7;&#x5F97;&#xA0; <a href="http://bugs.sun.com/view_bug.do?bug_id=6962930" target="_blank" rel="external">http://bugs.sun.com/view_bug.do?bug_id=6962930</a></p>
<p>&#x9ED8;&#x8BA4;&#x7684;&#x6C60;&#x5927;&#x5C0F;&#x662F;&#xA0;1009&#xA0;(&#x51FA;&#x73B0;&#x5728;&#x4E0A;&#x9762;&#x63D0;&#x53CA;&#x7684;&#xA0;bug&#xA0;&#x62A5;&#x544A;&#x7684;&#x6E90;&#x7801;&#x4E2D;&#xFF0C;&#x5728;&#xA0;Java7u40&#xA0;&#x4E2D;&#x589E;&#x52A0;&#x4E86;)&#x3002;&#x5728;&#xA0;JAVA&#xA0;6&#xA0;&#x65E9;&#x671F;&#x7248;&#x672C;&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x91CF;&#xFF0C;&#x5728;&#x968F;&#x540E;&#x7684;&#xA0;java6u30&#xA0;&#x81F3;&#xA0;java6u41&#xA0;&#x4E2D;&#x8C03;&#x6574;&#x4E3A;&#x53EF;&#x914D;&#x7F6E;&#x7684;&#x3002;&#x800C;&#x5728;java&#xA0;7&#x4E2D;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x7684;&#xFF08;&#x81F3;&#x5C11;&#x5728;java7u02&#x4E2D;&#x662F;&#x53EF;&#x4EE5;&#x914D;&#x7F6E;&#x7684;&#xFF09;&#x3002;&#x4F60;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x53C2;&#x6570;&#xA0;-XX:StringTableSize=N,&#xA0;N&#xA0;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#xA0;Map&#xA0;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x786E;&#x4FDD;&#x5B83;&#x662F;&#x4E3A;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x800C;&#x9884;&#x5148;&#x51C6;&#x5907;&#x7684;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5728;&#xA0;Java&#xA0;6&#xA0;&#x4E2D;&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x5E2E;&#x52A9;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x4ECD;&#x4EFB;&#x88AB;&#x9650;&#x5236;&#x5728;&#x56FA;&#x5B9A;&#x7684;&#xA0;PermGen&#xA0;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x4E2D;&#x3002;&#x540E;&#x7EED;&#x7684;&#x8BA8;&#x8BBA;&#x5C06;&#x76F4;&#x63A5;&#x5FFD;&#x7565;&#xA0;Java&#xA0;6 </p>
<p><strong>Java&#xA0;7&#xA0;&#xFF08;&#x76F4;&#x81F3;&#xA0;Java7u40&#xFF09;</strong></p>
<p>&#x5728;&#xA0;Java7&#xA0;&#x4E2D;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x4F60;&#x88AB;&#x9650;&#x5236;&#x5728;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x9884;&#x5148;&#x8BBE;&#x7F6E;&#x597D;&#xA0;String&#xA0;&#x6C60;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x8FD9;&#x4E2A;&#x503C;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x6C42;&#xFF09;&#x3002;&#x901A;&#x5E38;&#x8BF4;&#x6765;&#xFF0C;&#x4E00;&#x65E6;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#x5185;&#x5B58;&#x6D88;&#x8017;&#xFF0C;&#x5185;&#x5B58;&#x90FD;&#x662F;&#x6210;&#x767E;&#x5146;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7ED9;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#xA0;100&#xA0;&#x4E07;&#x5B57;&#x7B26;&#x4E32;&#x5BF9;&#x8C61;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5206;&#x914D;&#xA0;8-16M&#xA0;&#x7684;&#x5185;&#x5B58;&#x770B;&#x8D77;&#x6765;&#x662F;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x7684;&#xFF08;&#x4E0D;&#x8981;&#x4F7F;&#x7528;1,000,000&#xA0;&#x4F5C;&#x4E3A;&#xA0;-XX:StringTaleSize&#xA0;&#x7684;&#x503C;&#xA0;&#x2013;&#xA0;&#x5B83;&#x4E0D;&#x662F;&#x8D28;&#x6570;&#xFF1B;&#x4F7F;&#x7528;1,000,003&#x4EE3;&#x66FF;&#xFF09;</p>
<p>&#x4F60;&#x53EF;&#x80FD;&#x671F;&#x5F85;&#x5173;&#x4E8E;&#xA0;String&#xA0;&#x5728;&#xA0;Map&#xA0;&#x4E2D;&#x7684;&#x5206;&#x914D;&#xA0;&#x2014;&#xA0;&#x53EF;&#x4EE5;&#x9605;&#x8BFB;&#x6211;&#x4E4B;&#x524D;&#x5173;&#x4E8E;&#xA0;HashCode&#xA0;&#x65B9;&#x6CD5;&#x8C03;&#x4F18;&#x7684;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x4F60;&#x5FC5;&#x987B;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#xA0;-XX:StringTalbeSize&#xA0;&#x503C;(&#x76F8;&#x6BD4;&#x8F83;&#x9ED8;&#x8BA4;&#x7684;&#xA0;1009&#xA0;),&#x5982;&#x679C;&#x4F60;&#x5E0C;&#x671B;&#x66F4;&#x591A;&#x7684;&#x4F7F;&#x7528;&#xA0;String.intern()&#xA0;&#x2014;&#xA0;&#x5426;&#x5219;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C06;&#x5F88;&#x5FEB;&#x9012;&#x51CF;&#x5230;&#xA0;0&#xA0;&#xFF08;&#x6C60;&#x5927;&#x5C0F;&#xFF09;&#x3002; </p>
<p>&#x6211;&#x6CA1;&#x6709;&#x6CE8;&#x610F;&#x5230;&#x5728;&#xA0;intern&#xA0;&#x5C0F;&#x4E8E;&#xA0;100&#xA0;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#x7684;&#x4F9D;&#x8D56;&#x60C5;&#x51B5;&#xFF08;&#x6211;&#x8BA4;&#x4E3A;&#x5728;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#xA0;50&#xA0;&#x4E2A;&#x91CD;&#x590D;&#x5B57;&#x7B26;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E0E;&#x73B0;&#x5B9E;&#x6570;&#x636E;&#x5E76;&#x4E0D;&#x76F8;&#x4F3C;&#xFF0C;&#x56E0;&#x6B64;&#xA0;100&#xA0;&#x4E2A;&#x5B57;&#x7B26;&#x770B;&#x4E0A;&#x53BB;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6D4B;&#x8BD5;&#x9650;&#x5236;&#xFF09;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x9ED8;&#x8BA4;&#x6C60;&#x5927;&#x5C0F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E5;&#x5FD7;&#xFF1A;&#x7B2C;&#x4E00;&#x5217;&#x662F;&#x5DF2;&#x7ECF;&#xA0;intern&#xA0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x6570;&#x91CF;&#xFF0C;&#x7B2C;&#x4E8C;&#x5217;&#xA0;intern&#xA0;10,000&#xA0;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6240;&#x6709;&#x7684;&#x65F6;&#x95F4;&#xFF08;&#x79D2;&#xFF09;</p>
<pre><code><span class="number">0</span>; <span class="built_in">time</span> = <span class="number">0.0</span> <span class="built_in">sec</span>
<span class="number">50000</span>; <span class="built_in">time</span> = <span class="number">0.03</span> <span class="built_in">sec</span>
<span class="number">100000</span>; <span class="built_in">time</span> = <span class="number">0.073</span> <span class="built_in">sec</span>
<span class="number">150000</span>; <span class="built_in">time</span> = <span class="number">0.13</span> <span class="built_in">sec</span>
<span class="number">200000</span>; <span class="built_in">time</span> = <span class="number">0.196</span> <span class="built_in">sec</span>
<span class="number">250000</span>; <span class="built_in">time</span> = <span class="number">0.279</span> <span class="built_in">sec</span>
<span class="number">300000</span>; <span class="built_in">time</span> = <span class="number">0.376</span> <span class="built_in">sec</span>
<span class="number">350000</span>; <span class="built_in">time</span> = <span class="number">0.471</span> <span class="built_in">sec</span>
<span class="number">400000</span>; <span class="built_in">time</span> = <span class="number">0.574</span> <span class="built_in">sec</span>
<span class="number">450000</span>; <span class="built_in">time</span> = <span class="number">0.666</span> <span class="built_in">sec</span>
<span class="number">500000</span>; <span class="built_in">time</span> = <span class="number">0.755</span> <span class="built_in">sec</span>
<span class="number">550000</span>; <span class="built_in">time</span> = <span class="number">0.854</span> <span class="built_in">sec</span>
<span class="number">600000</span>; <span class="built_in">time</span> = <span class="number">0.916</span> <span class="built_in">sec</span>
<span class="number">650000</span>; <span class="built_in">time</span> = <span class="number">1.006</span> <span class="built_in">sec</span>
<span class="number">700000</span>; <span class="built_in">time</span> = <span class="number">1.095</span> <span class="built_in">sec</span>
<span class="number">750000</span>; <span class="built_in">time</span> = <span class="number">1.273</span> <span class="built_in">sec</span>
<span class="number">800000</span>; <span class="built_in">time</span> = <span class="number">1.248</span> <span class="built_in">sec</span>
<span class="number">850000</span>; <span class="built_in">time</span> = <span class="number">1.446</span> <span class="built_in">sec</span>
<span class="number">900000</span>; <span class="built_in">time</span> = <span class="number">1.585</span> <span class="built_in">sec</span>
<span class="number">950000</span>; <span class="built_in">time</span> = <span class="number">1.635</span> <span class="built_in">sec</span>
<span class="number">1000000</span>; <span class="built_in">time</span> = <span class="number">1.913</span> <span class="built_in">sec</span>
</code></pre><p>&#x6D4B;&#x8BD5;&#x662F;&#x5728;&#xA0;Core&#xA0;i5-3317U@1.7Ghz&#xA0;CPU&#xA0;&#x8BBE;&#x5907;&#x4E0A;&#x8FDB;&#x884C;&#x7684;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5B83;&#x6210;&#x7EBF;&#x6027;&#x589E;&#x957F;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5305;&#x542B;&#x4E00;&#x767E;&#x4E07;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#xFF0C;&#x6211;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x8FD1;&#x4F3C;&#x6BCF;&#x79D2;&#xA0;intern&#xA0;5000&#xA0;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5904;&#x7406;&#x5927;&#x91CF;&#x6570;&#x636E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#x592A;&#x6162;&#x4E86;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8C03;&#x6574;&#xA0;-XX:StringTableSize=100003&#xA0;&#x53C2;&#x6570;&#x6765;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<pre><code><span class="number">50000</span>; <span class="built_in">time</span> = <span class="number">0.017</span> <span class="built_in">sec</span>
<span class="number">100000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">150000</span>; <span class="built_in">time</span> = <span class="number">0.01</span> <span class="built_in">sec</span>
<span class="number">200000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">250000</span>; <span class="built_in">time</span> = <span class="number">0.007</span> <span class="built_in">sec</span>
<span class="number">300000</span>; <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">350000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">400000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">450000</span>; <span class="built_in">time</span> = <span class="number">0.01</span> <span class="built_in">sec</span>
<span class="number">500000</span>; <span class="built_in">time</span> = <span class="number">0.013</span> <span class="built_in">sec</span>
<span class="number">550000</span>; <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">600000</span>; <span class="built_in">time</span> = <span class="number">0.012</span> <span class="built_in">sec</span>
<span class="number">650000</span>; <span class="built_in">time</span> = <span class="number">0.015</span> <span class="built_in">sec</span>
<span class="number">700000</span>; <span class="built_in">time</span> = <span class="number">0.015</span> <span class="built_in">sec</span>
<span class="number">750000</span>; <span class="built_in">time</span> = <span class="number">0.01</span> <span class="built_in">sec</span>
<span class="number">800000</span>; <span class="built_in">time</span> = <span class="number">0.01</span> <span class="built_in">sec</span>
<span class="number">850000</span>; <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">900000</span>; <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">950000</span>; <span class="built_in">time</span> = <span class="number">0.012</span> <span class="built_in">sec</span>
<span class="number">1000000</span>; <span class="built_in">time</span> = <span class="number">0.012</span> <span class="built_in">sec</span>
</code></pre><p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x65F6;&#x63D2;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x65F6;&#x95F4;&#x8FD1;&#x4F3C;&#x4E8E;&#x5E38;&#x91CF;&#xFF08;&#x5728;&#xA0;Map&#xA0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5217;&#x8868;&#x4E2D;&#x5E73;&#x5747;&#x5B57;&#x7B26;&#x4E32;&#x4E2A;&#x6570;&#x4E0D;&#x8D85;&#x8FC7;&#xA0;10&#xA0;&#x4E2A;&#xFF09;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x76F8;&#x540C;&#x8BBE;&#x7F6E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E0D;&#x8FC7;&#x8FD9;&#x6B21;&#x6211;&#x4EEC;&#x5C06;&#x5411;&#x6C60;&#x4E2D;&#x63D2;&#x5165;&#xA0;1000&#xA0;&#x4E07;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF08;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xA0;Map&#xA0;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5217;&#x8868;&#x5E73;&#x5747;&#x5305;&#x542B;&#xA0;100&#xA0;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF09;</p>
<pre><code><span class="number">2000000</span><span class="comment">; time = 0.024 sec</span>
<span class="number">3000000</span><span class="comment">; time = 0.028 sec</span>
<span class="number">4000000</span><span class="comment">; time = 0.053 sec</span>
<span class="number">5000000</span><span class="comment">; time = 0.051 sec</span>
<span class="number">6000000</span><span class="comment">; time = 0.034 sec</span>
<span class="number">7000000</span><span class="comment">; time = 0.041 sec</span>
<span class="number">8000000</span><span class="comment">; time = 0.089 sec</span>
<span class="number">9000000</span><span class="comment">; time = 0.111 sec</span>
<span class="number">10000000</span><span class="comment">; time = 0.123 sec</span>
</code></pre><p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x5C06;&#x5403;&#x7684;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x5230;&#xA0;100&#xA0;&#x4E07;&#xFF08;&#x7CBE;&#x786E;&#x7684;&#x8BF4;&#x662F;&#xA0;1,000,003&#xFF09;</p>
<pre><code><span class="number">1000000</span><span class="comment">; time = 0.005 sec</span>
<span class="number">2000000</span><span class="comment">; time = 0.005 sec</span>
<span class="number">3000000</span><span class="comment">; time = 0.005 sec</span>
<span class="number">4000000</span><span class="comment">; time = 0.004 sec</span>
<span class="number">5000000</span><span class="comment">; time = 0.004 sec</span>
<span class="number">6000000</span><span class="comment">; time = 0.009 sec</span>
<span class="number">7000000</span><span class="comment">; time = 0.01 sec</span>
<span class="number">8000000</span><span class="comment">; time = 0.009 sec</span>
<span class="number">9000000</span><span class="comment">; time = 0.009 sec</span>
<span class="number">10000000</span><span class="comment">; time = 0.009 sec</span>
</code></pre><p>&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;,&#x65F6;&#x95F4;&#x975E;&#x5E38;&#x5E73;&#x5747;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#xA0;&#x201C;0&#xA0;&#x5230;&#xA0;100&#x4E07;&#x201D;&#xA0;&#x7684;&#x8868;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x5DEE;&#x522B;&#x3002;&#x751A;&#x81F3;&#x5728;&#x6C60;&#x5927;&#x5C0F;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6211;&#x7684;&#x7B14;&#x8BB0;&#x672C;&#x4E5F;&#x80FD;&#x6BCF;&#x79D2;&#x6DFB;&#x52A0;1,000,000&#x4E2A;&#x5B57;&#x7B26;&#x5BF9;&#x8C61;&#x3002;</p>
<p><strong>&#x6211;&#xFFFD;&#xFFFD;&#xFFFD;&#x8FD8;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x7BA1;&#x7406;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5417;&#xFF1F;</strong></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x6BD4;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x548C;&#xA0;WeakHashMap&lt;String,&#xA0;WeakReference&lt;String&gt;&gt;&#xA0;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6A21;&#x62DF;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;&#x4E0B;&#x9762;&#x7684;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x66FF;&#x6362;&#xA0;String.intern&#xFF1A;</p>
<pre><code><span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">final</span> WeakHashMap&amp;lt;<span class="keyword">String</span>, WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt;&amp;gt; s_manualCache = 
    <span class="keyword">new</span> WeakHashMap&amp;lt;<span class="keyword">String</span>, WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt;&amp;gt;( <span class="number">100000</span> );
<span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">String</span> manualIntern( <span class="keyword">final</span> <span class="keyword">String</span> <span class="built_in">str</span> )
{
    <span class="keyword">final</span> WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt; cached = s_manualCache.<span class="built_in">get</span>( <span class="built_in">str</span> );
    <span class="keyword">if</span> ( cached != <span class="keyword">null</span> )
    {
        <span class="keyword">final</span> <span class="keyword">String</span> value = cached.<span class="built_in">get</span>();
        <span class="keyword">if</span> ( value != <span class="keyword">null</span> )
            <span class="keyword">return</span> value;
    }
    s_manualCache.put( <span class="built_in">str</span>, <span class="keyword">new</span> WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt;( <span class="built_in">str</span> ) );
    <span class="keyword">return</span> <span class="built_in">str</span>;
}
</code></pre><p>&#x4E0B;&#x9762;&#x9488;&#x5BF9;&#x624B;&#x5DE5;&#x6C60;&#x7684;&#x76F8;&#x540C;&#x6D4B;&#x8BD5;&#xFF1A;</p>
<pre><code><span class="number">0</span>; manual <span class="built_in">time</span> = <span class="number">0.001</span> <span class="built_in">sec</span>
<span class="number">50000</span>; manual <span class="built_in">time</span> = <span class="number">0.03</span> <span class="built_in">sec</span>
<span class="number">100000</span>; manual <span class="built_in">time</span> = <span class="number">0.034</span> <span class="built_in">sec</span>
<span class="number">150000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">200000</span>; manual <span class="built_in">time</span> = <span class="number">0.019</span> <span class="built_in">sec</span>
<span class="number">250000</span>; manual <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">300000</span>; manual <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">350000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">400000</span>; manual <span class="built_in">time</span> = <span class="number">0.027</span> <span class="built_in">sec</span>
<span class="number">450000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">500000</span>; manual <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">550000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">600000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">650000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">700000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">750000</span>; manual <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">800000</span>; manual <span class="built_in">time</span> = <span class="number">0.007</span> <span class="built_in">sec</span>
<span class="number">850000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">900000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">950000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
<span class="number">1000000</span>; manual <span class="built_in">time</span> = <span class="number">0.008</span> <span class="built_in">sec</span>
</code></pre><p>&#x5F53;&#xA0;JVM&#xA0;&#x6709;&#x8DB3;&#x591F;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x624B;&#x5DE5;&#x7F16;&#x5199;&#x7684;&#x6C60;&#x63D0;&#x4F9B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x6027;&#x80FD;&#x3002;&#x4E0D;&#x8FC7;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x6211;&#x7684;&#x6D4B;&#x8BD5;&#xFF08;&#x4FDD;&#x7559;String.valueOf(0&#xA0;&lt;&#xA0;N&#xA0;&lt;&#xA0;1,000,000,000)&#xFF09;&#x4FDD;&#x7559;&#x975E;&#x5E38;&#x77ED;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x5728;&#x4F7F;&#x7528;&#xA0;-Xmx1280M&#xA0;&#x53C2;&#x6570;&#x65F6;&#x5B83;&#x5141;&#x8BB8;&#x6211;&#x4FDD;&#x7559;&#x6708;&#x4E3A;&#xA0;2.5M&#xA0;&#x7684;&#x8FD9;&#x7C7B;&#x5B57;&#x7B26;&#x4E32;&#x3002;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#xA0;(size=1,000,003&#xFF09;&#x4ECE;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x8BB2;&#x5728;&#xA0;JVM&#xA0;&#x5185;&#x5B58;&#x8DB3;&#x591F;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x76F8;&#x540C;&#x7684;&#x6027;&#x80FD;&#x7279;&#x6027;&#xFF0C;&#x77E5;&#x9053;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x5305;&#x542B;&#xA0;12.72M&#xA0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x6D88;&#x8017;&#x6389;&#x6240;&#x6709;&#x5185;&#x5B58;&#xFF08;5&#x500D;&#x591A;&#xFF09;&#x3002;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x8FD9;&#x975E;&#x5E38;&#x503C;&#x5F97;&#x4F60;&#x5728;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x53BB;&#x6389;&#x6240;&#x6709;&#x624B;&#x5DE5;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;</p>
<p><strong>&#x5728;&#xA0;Java&#xA0;7u40+&#xA0;&#x4EE5;&#x53CA;&#xA0;Java&#xA0;8&#xA0;&#x4E2D;&#x7684;&#xA0;String.intern()</strong></p>
<p>Java7u40&#xA0;&#x7248;&#x672C;&#x6269;&#x5C55;&#x4E86;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x8FD9;&#x662F;&#x7EC4;&#x8981;&#x7684;&#x6027;&#x80FD;&#x66F4;&#x65B0;&#xFF09;&#x5230;&#xA0;60013.&#x8FD9;&#x4E2A;&#x503C;&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x6C60;&#x4E2D;&#x5305;&#x542B;&#x5927;&#x7EA6;&#xA0;30000&#xA0;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x7684;&#x6570;&#x636E;&#x6765;&#x8BF4;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;-XX:+PrintFlagsFinal&#xA0;JVM&#xA0;&#x53C2;&#x6570;&#x83B7;&#x5F97;&#x8FD9;&#x4E2A;&#x503C;&#x3002;</p>
<p>&#x6211;&#x5C1D;&#x8BD5;&#x5728;&#x539F;&#x59CB;&#x53D1;&#x5E03;&#x7684;&#xA0;Java&#xA0;8&#xA0;&#x4E2D;&#x8FD0;&#x884C;&#x76F8;&#x540C;&#x7684;&#x6D4B;&#x8BD5;&#xFF0C;Java&#xA0;8&#xA0;&#x4ECD;&#x7136;&#x652F;&#x6301;&#xA0;-XX:StringTableSize&#xA0;&#x53C2;&#x6570;&#x6765;&#x517C;&#x5BB9;&#xA0;Java&#xA0;7&#xA0;&#x7279;&#x6027;&#x3002;&#x4E3B;&#x8981;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xA0;Java&#xA0;8&#xA0;&#x4E2D;&#x9ED8;&#x8BA4;&#x7684;&#x6C60;&#x5927;&#x5C0F;&#x589E;&#x52A0;&#x5230;&#xA0;60013&#xFF1A;</p>
<pre><code><span class="number">50000</span>; <span class="built_in">time</span> = <span class="number">0.019</span> <span class="built_in">sec</span>
<span class="number">100000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">150000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">200000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">250000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">300000</span>; <span class="built_in">time</span> = <span class="number">0.009</span> <span class="built_in">sec</span>
<span class="number">350000</span>; <span class="built_in">time</span> = <span class="number">0.011</span> <span class="built_in">sec</span>
<span class="number">400000</span>; <span class="built_in">time</span> = <span class="number">0.012</span> <span class="built_in">sec</span>
<span class="number">450000</span>; <span class="built_in">time</span> = <span class="number">0.01</span> <span class="built_in">sec</span>
<span class="number">500000</span>; <span class="built_in">time</span> = <span class="number">0.013</span> <span class="built_in">sec</span>
<span class="number">550000</span>; <span class="built_in">time</span> = <span class="number">0.013</span> <span class="built_in">sec</span>
<span class="number">600000</span>; <span class="built_in">time</span> = <span class="number">0.014</span> <span class="built_in">sec</span>
<span class="number">650000</span>; <span class="built_in">time</span> = <span class="number">0.018</span> <span class="built_in">sec</span>
<span class="number">700000</span>; <span class="built_in">time</span> = <span class="number">0.015</span> <span class="built_in">sec</span>
<span class="number">750000</span>; <span class="built_in">time</span> = <span class="number">0.029</span> <span class="built_in">sec</span>
<span class="number">800000</span>; <span class="built_in">time</span> = <span class="number">0.018</span> <span class="built_in">sec</span>
<span class="number">850000</span>; <span class="built_in">time</span> = <span class="number">0.02</span> <span class="built_in">sec</span>
<span class="number">900000</span>; <span class="built_in">time</span> = <span class="number">0.017</span> <span class="built_in">sec</span>
<span class="number">950000</span>; <span class="built_in">time</span> = <span class="number">0.018</span> <span class="built_in">sec</span>
<span class="number">1000000</span>; <span class="built_in">time</span> = <span class="number">0.021</span> <span class="built_in">sec</span>
</code></pre><p><strong>&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;</strong></p>
<p>&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x5FAA;&#x73AF;&#x521B;&#x5EFA;&#x5E76;&#x4FDD;&#x7559;&#x65B0;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x6D4B;&#x91CF;&#x5B83;&#x4FDD;&#x7559;&#xA0;10000&#xA0;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x6240;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x6700;&#x597D;&#x914D;&#x5408;&#xA0;-verbose:gc&#xA0;JVM&#xA0;&#x53C2;&#x6570;&#x6765;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5783;&#x573E;&#x6536;&#x96C6;&#x662F;&#x4F55;&#x65F6;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x53D1;&#x751F;&#x7684;&#x3002;&#x53E6;&#x5916;&#x6700;&#x597D;&#x4F7F;&#x7528;&#xA0;-Xmx&#xA0;&#x53C2;&#x6570;&#x6765;&#x6267;&#x884C;&#x5806;&#x7684;&#x6700;&#x5927;&#x503C;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;&#x6D4B;&#x8BD5;&#xFF1A;testStringPoolGarbageCollection&#xA0;&#x5C06;&#x663E;&#x793A;&#xA0;JVM&#xA0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x88AB;&#x5783;&#x573E;&#x6536;&#x96C6;&#xA0;&#x2014;&#xA0;&#x68C0;&#x67E5;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65E5;&#x5FD7;&#x6D88;&#x606F;&#x3002;&#x5728;&#xA0;Java&#xA0;6&#xA0;&#x7684;&#x9ED8;&#x8BA4;&#xA0;PermGen&#xA0;&#x5927;&#x5C0F;&#x914D;&#x7F6E;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x56E0;&#x6B64;&#x6700;&#x597D;&#x589E;&#x52A0;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x65B0;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#xA0;Java&#xA0;7.</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x6D4B;&#x8BD5;&#x663E;&#x793A;&#x5185;&#x5B58;&#x4E2D;&#x4FDD;&#x7559;&#x4E86;&#x591A;&#x5C11;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5728;&#xA0;Java&#xA0;6&#xA0;&#x4E2D;&#x6267;&#x884C;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5185;&#x5B58;&#x914D;&#x7F6E;&#xA0;&#x6BD4;&#x5982;&#xFF1A;&#xA0;-Xmx128M&#xA0;&#x4EE5;&#x53CA;&#xA0;-Xmx1280M&#xA0;&#xFF08;10&#xA0;&#x500D;&#x4EE5;&#x4E0A;&#xFF09;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x8FD9;&#x4E2A;&#x503C;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x653E;&#x5165;&#x6C60;&#x4E2D;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x6570;&#x91CF;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x5728;&#xA0;Java&#xA0;7&#xA0;&#x4E2D;&#x4F60;&#x80FD;&#x591F;&#x5728;&#x5806;&#x4E2D;&#x586B;&#x6EE1;&#x4F60;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;</p>
<pre><code><span class="comment">/**
 - Testing String.intern.
 *
 - Run this class at least with -verbose:gc JVM parameter.
 */</span>
<span class="keyword">public</span> class InternTest {
    <span class="keyword">public</span> <span class="keyword">static</span> <span class="keyword">void</span> main( <span class="keyword">String</span>[] args ) {
        testStringPoolGarbageCollection();
        testLongLoop();
    }
    <span class="comment">/**
     - Use this method to see where interned strings are stored
     - and how many of them can you fit for the given heap size.
     */</span>
    <span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">void</span> testLongLoop()
    {
        test( <span class="number">1000</span> * <span class="number">1000</span> * <span class="number">1000</span> );
        <span class="comment">//uncomment the following line to see the hand-written cache performance</span>
        <span class="comment">//testManual( 1000 * 1000 * 1000 );</span>
    }
    <span class="comment">/**
     - Use this method to check that not used interned strings are garbage collected.
     */</span>
    <span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">void</span> testStringPoolGarbageCollection()
    {
        <span class="comment">//first method call - use it as a reference</span>
        test( <span class="number">1000</span> * <span class="number">1000</span> );
        <span class="comment">//we are going to clean the cache here.</span>
        System.gc();
        <span class="comment">//check the memory consumption and how long does it take to intern strings</span>
        <span class="comment">//in the second method call.</span>
        test( <span class="number">1000</span> * <span class="number">1000</span> );
    }
    <span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">void</span> test( <span class="keyword">final</span> <span class="built_in">int</span> cnt )
    {
        <span class="keyword">final</span> List&amp;lt;<span class="keyword">String</span>&amp;gt; lst = <span class="keyword">new</span> ArrayList&amp;lt;<span class="keyword">String</span>&amp;gt;( <span class="number">100</span> );
        <span class="keyword">long</span> start = System.currentTimeMillis();
        <span class="keyword">for</span> ( <span class="built_in">int</span> i = <span class="number">0</span>; i &amp;lt; cnt; ++i )
        {
            <span class="keyword">final</span> <span class="keyword">String</span> <span class="built_in">str</span> = &amp;quot;Very <span class="keyword">long</span> test string, which tells you about something &amp;quot; +
            &amp;quot;very-very important, definitely deserving to be interned #&amp;quot; + i;
<span class="comment">//uncomment the following line to test dependency from string length</span>
<span class="comment">//            final String str = Integer.toString( i );</span>
            lst.<span class="built_in">add</span>( <span class="built_in">str</span>.intern() );
            <span class="keyword">if</span> ( i % <span class="number">10000</span> == <span class="number">0</span> )
            {
                System.out.<span class="built_in">println</span>( i + &amp;quot;; time = &amp;quot; + ( System.currentTimeMillis() - start ) / <span class="number">1000.0</span> + &amp;quot; sec&amp;quot; );
                start = System.currentTimeMillis();
            }
        }
        System.out.<span class="built_in">println</span>( &amp;quot;Total length = &amp;quot; + lst.<span class="built_in">size</span>() );
    }
    <span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">final</span> WeakHashMap&amp;lt;<span class="keyword">String</span>, WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt;&amp;gt; s_manualCache =
        <span class="keyword">new</span> WeakHashMap&amp;lt;<span class="keyword">String</span>, WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt;&amp;gt;( <span class="number">100000</span> );
    <span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">String</span> manualIntern( <span class="keyword">final</span> <span class="keyword">String</span> <span class="built_in">str</span> )
    {
        <span class="keyword">final</span> WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt; cached = s_manualCache.<span class="built_in">get</span>( <span class="built_in">str</span> );
        <span class="keyword">if</span> ( cached != <span class="keyword">null</span> )
        {
            <span class="keyword">final</span> <span class="keyword">String</span> value = cached.<span class="built_in">get</span>();
            <span class="keyword">if</span> ( value != <span class="keyword">null</span> )
                <span class="keyword">return</span> value;
        }
        s_manualCache.put( <span class="built_in">str</span>, <span class="keyword">new</span> WeakReference&amp;lt;<span class="keyword">String</span>&amp;gt;( <span class="built_in">str</span> ) );
        <span class="keyword">return</span> <span class="built_in">str</span>;
    }
    <span class="keyword">private</span> <span class="keyword">static</span> <span class="keyword">void</span> testManual( <span class="keyword">final</span> <span class="built_in">int</span> cnt )
    {
        <span class="keyword">final</span> List&amp;lt;<span class="keyword">String</span>&amp;gt; lst = <span class="keyword">new</span> ArrayList&amp;lt;<span class="keyword">String</span>&amp;gt;( <span class="number">100</span> );
        <span class="keyword">long</span> start = System.currentTimeMillis();
        <span class="keyword">for</span> ( <span class="built_in">int</span> i = <span class="number">0</span>; i &amp;lt; cnt; ++i )
        {
            <span class="keyword">final</span> <span class="keyword">String</span> <span class="built_in">str</span> = &amp;quot;Very <span class="keyword">long</span> test string, which tells you about something &amp;quot; +
                &amp;quot;very-very important, definitely deserving to be interned #&amp;quot; + i;
            lst.<span class="built_in">add</span>( manualIntern( <span class="built_in">str</span> ) );
            <span class="keyword">if</span> ( i % <span class="number">10000</span> == <span class="number">0</span> )
            {
                System.out.<span class="built_in">println</span>( i + &amp;quot;; manual time = &amp;quot; + ( System.currentTimeMillis() - start ) / <span class="number">1000.0</span> + &amp;quot; sec&amp;quot; );
                start = System.currentTimeMillis();
            }
        }
        System.out.<span class="built_in">println</span>( &amp;quot;Total length = &amp;quot; + lst.<span class="built_in">size</span>() );
    }
}
</code></pre><p><strong>&#x603B;&#x7ED3;</strong></p>
<ul>
<li>&#x7531;&#x4E8E;&#xA0;Java&#xA0;6&#xA0;&#x4E2D;&#x4F7F;&#x7528;&#x56FA;&#x5B9A;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#xFF08;PermGen&#xFF09;&#x56E0;&#x6B64;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#xA0;String.intern()&#xA0;&#x65B9;&#x6CD5;</li>
<li>Java7&#xA0;&#x548C;&#xA0;8&#xA0;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x5B9E;&#x73B0;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x3002;&#x8FD9;&#x4EE5;&#x4E3A;&#x8FD9;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x5185;&#x5B58;&#x9650;&#x5236;&#x7B49;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x5B58;&#x9650;&#x5236;&#x3002;</li>
<li>&#x5728;&#xA0;Java&#xA0;7&#xA0;&#x548C;&#xA0;8&#xA0;&#x4E2D;&#x4F7F;&#x7528;&#xA0;-XX:StringTableSize&#xA0;&#x6765;&#x8BBE;&#x7F6E;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#xA0;Map&#xA0;&#x7684;&#x5927;&#x5C0F;&#x3002;&#x5B83;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F7F;&#x7528;&#xA0;HashMap&#xA0;&#x5B9E;&#x73B0;&#x3002;&#x8FD1;&#x4F3C;&#x4E8E;&#x4F60;&#x5E94;&#x7528;&#x5355;&#x72EC;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x4E2A;&#x6570;&#xFF08;&#x4F60;&#x5E0C;&#x671B;&#x4FDD;&#x7559;&#x7684;&#xFF09;&#x5E76;&#x4E14;&#x8BBE;&#x7F6E;&#x6C60;&#x7684;&#x5927;&#x5C0F;&#x4E3A;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x8D28;&#x6570;&#x5E76;&#x4E58;&#x4EE5;&#xA0;2&#xA0;&#xFF08;&#x51CF;&#x5C11;&#x78B0;&#x649E;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF09;&#x3002;&#x5B83;&#x662F;&#x7684;&#xA0;String.intern&#xA0;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#xFF08;&#x56FA;&#x5B9A;&#xFF09;&#x7684;&#x65F6;&#x95F4;&#x5E76;&#x4E14;&#x5728;&#x6BCF;&#x6B21;&#x63D2;&#x5165;&#x65F6;&#x6D88;&#x8017;&#x66F4;&#x5C0F;&#x7684;&#x5185;&#x5B58;(&#x540C;&#x6837;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F7F;&#x7528;java&#xA0;WeakHashMap&#x5C06;&#x6D88;&#x8017;4-5&#x500D;&#x7684;&#x5185;&#x5B58;)&#x3002;</li>
<li>&#x5728;&#xA0;Java&#xA0;6&#xA0;&#x548C;&#xA0;7&#xFF08;Java7u40&#x4EE5;&#x524D;&#xFF09;&#xA0;&#x4E2D;&#xA0;-XX:StringTableSize&#xA0;&#x53C2;&#x6570;&#x7684;&#x503C;&#x662F;&#xA0;1009&#x3002;Java7u40&#xA0;&#x4EE5;&#x540E;&#x8FD9;&#x4E2A;&#x503C;&#x8C03;&#x6574;&#x4E3A;&#xA0;60013&#xA0;&#xFF08;Java&#xA0;8&#xA0;&#x4E2D;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x7684;&#x503C;&#xFF09;</li>
<li>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x786E;&#x5B9A;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x7528;&#x91CF;&#xFF0C;&#x53C2;&#x8003;&#xFF1A;-XX:+PrintStringTableStatistics&#xA0;JVM&#xA0;&#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x6302;&#x6389;&#x65F6;&#x5B83;&#x544A;&#x8BC9;&#x4F60;&#x5B57;&#x7B26;&#x4E32;&#x6C60;&#x7684;&#x4F7F;&#x7528;&#x91CF;&#x4FE1;&#x606F;&#x3002;<br>[*]<br>&#x6765;&#x81EA;&#xFF1A; <a href="http://www.php100.com/html/it/biancheng/2015/0507/8953.html" target="_blank" rel="external">PHP100</a></li>
</ul>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f057092/" title="JVM研究 -" itemprop="url">JVM研究 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:23.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> 1 JVM <strong>&#x7B80;&#x4ECB;</strong></p>
<p>JVM&#x662F;&#x6211;&#x4EEC;Javaer&#x7684;&#x6700;&#x57FA;&#x672C;&#x529F;&#x5E95;&#x4E86;&#xFF0C;&#x521A;&#x5F00;&#x59CB;&#x5B66;Java&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x4ECE;&#x201C;Hello World&#x201D;&#x5F00;&#x59CB;&#x7684;&#xFF0C;&#x7136;&#x540E;&#x4F1A;&#x5199;&#x4E2A;&#x590D;&#x6742;&#x70B9;class&#xFF0C;&#x7136;&#x540E;&#x518D;&#x627E;&#x4E00;&#x4E9B;&#x5F00;&#x6E90;&#x6846;&#x67B6;&#xFF0C;&#x6BD4;&#x5982;Spring&#xFF0C;Hibernate&#x7B49;&#x7B49;&#xFF0C;&#x518D;&#x7136;&#x540E;&#x5C31;&#x5F00;&#x53D1;&#x4F01;&#x4E1A;&#x7EA7;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x7F51;&#x7AD9;&#x3001;&#x4F01;&#x4E1A;&#x5185;&#x90E8;&#x5E94;&#x7528;&#x3001;&#x5B9E;&#x65F6;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x7B49;&#x7B49;&#xFF0C;&#x76F4;&#x5230;&#x67D0;&#x4E00;&#x5929;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x505A;&#x7684;&#x7CFB;&#x7EDF;&#x548B;&#x5C31;&#x8FD9;&#x4E48;&#x6162;&#x5462;&#xFF0C;&#x800C;&#x4E14;&#x65F6;&#x4E0D;&#x65F6;&#x8FD8;&#x6765;&#x4E2A;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4ECA;&#x5929;&#x662F;&#x4EA4;&#x6613;&#x7CFB;&#x7EDF;&#x62A5;&#x4E86;StackOverflowError&#xFF0C;&#x660E;&#x5929;&#x662F;&#x7F51;&#x7AD9;&#x7CFB;&#x7EDF;&#x62A5;&#x4E86;&#x4E2A;OutOfMemoryError&#xFF0C;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x53C8;&#x5F88;&#x96BE;&#x91CD;&#x73B0;&#xFF0C;&#x53EA;&#x6709;&#x5206;&#x6790;Javacore&#x548C;dump&#x6587;&#x4EF6;&#xFF0C;&#x8FD0;&#x6C14;&#x597D;&#x70B9;&#x8FD8;&#x80FD;&#x5206;&#x6790;&#x51FA;&#x4E2A;&#x7ED3;&#x679C;&#xFF0C;&#x8FD0;&#x884C;&#x906D;&#x7684;&#x70B9;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x53BB;&#x5E99;&#x91CC;&#x70E7;&#x9999;&#x5427;&#xFF01;&#x6BCF;&#x5929;&#x63A5;&#x5BA2;&#x6237;&#x7684;&#x7535;&#x8BDD;&#x90FD;&#x662F;&#x6218;&#x6218;&#x5162;&#x5162;&#x7684;&#xFF0C;&#x751F;&#x6015;&#x518D;&#x51FA;&#x4EC0;&#x4E48;&#x5E7A;&#x86FE;&#x5B50;&#x4E86;&#x3002;&#x6211;&#x60F3;Java&#x505A;&#x7684;&#x4E45;&#x4E00;&#x70B9;&#x7684;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x90A3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x6700;&#x7EC8;&#x6839;&#x7ED3;&#x662F;&#x5728;&#x54EA;&#x5462;&#xFF1F;&#x2014;&#x2014; JVM&#x3002;</p>
<p>JVM&#x5168;&#x79F0;&#x662F;Java Virtual Machine&#xFF0C;Java&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x518D;&#x865A;&#x62DF;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x8FD9;&#x548C;&#x6211;&#x4EEC;&#x4F7F;&#x7528; VMWare&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x90A3;&#x4E2A;&#x865A;&#x62DF;&#x7684;&#x4E1C;&#x897F;&#x4F60;&#x662F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;JVM&#x4F60;&#x662F;&#x770B;&#x4E0D;&#x5230;&#x7684;&#xFF0C;&#x5B83;&#x5B58;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x57FA;&#x672C;&#x6784;&#x6210;&#x662F;&#xFF1A;&#x8FD0;&#x7B97;&#x5668;&#x3001;&#x63A7;&#x5236;&#x5668;&#x3001;&#x5B58;&#x50A8;&#x5668;&#x3001;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x8BBE;&#x5907;&#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;JVM&#x4E5F;&#x662F;&#x6709;&#x8FD9;&#x6210;&#x5957;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x8FD0;&#x7B97;&#x5668;&#x662F;&#x5F53;&#x7136;&#x662F;&#x4EA4;&#x7ED9;&#x786C;&#x4EF6;CPU&#x8FD8;&#x5904;&#x7406;&#x4E86;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x9002;&#x5E94;&#x201C;&#x4E00;&#x6B21;&#x7F16;&#x8BD1;&#xFF0C;&#x968F;&#x5904;&#x8FD0;&#x884C;&#x201D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E2A;&#x7FFB;&#x8BD1;&#x52A8;&#x4F5C;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x7528;&#x4E86;JVM&#x81EA;&#x5DF1;&#x7684;&#x547D;&#x4EE4;&#x96C6;&#xFF0C;&#x8FD9;&#x4E0E;&#x6C47;&#x7F16;&#x7684;&#x547D;&#x4EE4;&#x96C6;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#xFF0C;&#x6BCF;&#x4E00;&#x79CD;&#x6C47;&#x7F16;&#x547D;&#x4EE4;&#x96C6;&#x9488;&#x5BF9;&#x4E00;&#x4E2A;&#x7CFB;&#x5217;&#x7684;CPU&#xFF0C;&#x6BD4;&#x5982;8086&#x7CFB;&#x5217;&#x7684;&#x6C47;&#x7F16;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7528;&#x5728;8088&#x4E0A;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5C31;&#x4E0D;&#x80FD;&#x8DD1;&#x5728;8051&#x4E0A;&#xFF0C;&#x800C;JVM&#x7684;&#x547D;&#x4EE4;&#x96C6;&#x5219;&#x662F;&#x53EF;&#x4EE5;&#x5230;&#x5904;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;JVM&#x505A;&#x4E86;&#x7FFB;&#x8BD1;&#xFF0C;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;CPU&#xFF0C;&#x7FFB;&#x8BD1;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x3002;</p>
<p>JVM&#x4E2D;&#x6211;&#x4EEC;&#x6700;&#x9700;&#x8981;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x7684;&#x5C31;&#x662F;&#x5B83;&#x7684;&#x5B58;&#x50A8;&#x90E8;&#x5206;&#xFF0C;&#x5B58;&#x50A8;&#xFF1F;&#x786C;&#x76D8;&#xFF1F;NO&#xFF0C;NO&#xFF0C; JVM&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x865A;&#x62DF;&#x673A;&#xFF0C;&#x90A3;&#x5B83;&#x7684;&#x5B58;&#x50A8;&#x5C31;&#x662F;&#x5185;&#x5B58;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x5199;&#x7684;&#x6240;&#x6709;&#x7C7B;&#x3001;&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x3001;&#x65B9;&#x6CD5;&#x90FD;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8FD9;&#x51B3;&#x5B9A;&#x7740;&#x6211;&#x4EEC;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x662F;&#x5426;&#x5065;&#x58EE;&#x3001;&#x662F;&#x5426;&#x9AD8;&#x6548;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x90E8;&#x5206;&#x5C31;&#x662F;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x4E4B;&#x3002;</p>
<p>2 JVM <strong>&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;</strong></p>
<p>&#x6211;&#x4EEC;&#x5148;&#x628A;JVM&#x8FD9;&#x4E2A;&#x865A;&#x62DF;&#x673A;&#x753B;&#x51FA;&#x6765;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/f052c36.png" alt=""></p>
<p>&#x4ECE;&#x8FD9;&#x4E2A;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;JVM&#x662F;&#x8FD0;&#x884C;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E4B;&#x4E0A;&#x7684;&#xFF0C;&#x5B83;&#x4E0E;&#x786C;&#x4EF6;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x7684;&#x4EA4;&#x4E92;&#x3002;&#x6211;&#x4EEC;&#x518D;&#x6765;&#x770B;&#x4E0B;JVM&#x6709;&#x54EA;&#x4E9B;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/f052ea7.png" alt=""></p>
<p>&#x8BE5;&#x56FE;&#x53C2;&#x8003;&#x4E86;&#x7F51;&#x4E0A;&#x5E7F;&#x4E3A;&#x6D41;&#x4F20;&#x7684;JVM&#x6784;&#x6210;&#x56FE;&#xFF0C;&#x5927;&#x5BB6;&#x770B;&#x8FD9;&#x4E2A;&#x56FE;&#xFF0C;&#x6574;&#x4E2A;JVM&#x5206;&#x4E3A;&#x56DB;&#x90E8;&#x5206;&#xFF1A; </p>
<p>q&#xA0; Class Loader &#x7C7B;&#x52A0;&#x8F7D;&#x5668;</p>
<p>&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x52A0;&#x8F7D;&#x7C7B;&#x6587;&#x4EF6;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x6BD4;&#x5982;&#x7F16;&#x5199;&#x4E00;&#x4E2A;HelloWord.java&#x7A0B;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;javac&#x7F16;&#x8BD1;&#x6210;class&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x88AB;&#x6267;&#x884C;&#x5462;&#xFF1F;Class Loader&#x627F;&#x62C5;&#x7684;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x8D23;&#x4EFB;&#xFF0C;&#x90A3;&#x4E0D;&#x53EF;&#x80FD;&#x968F;&#x4FBF;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;.class&#x6587;&#x4EF6;&#x5C31;&#x80FD;&#x88AB;&#x52A0;&#x8F7D;&#x7684;&#xFF0C;Class Loader&#x52A0;&#x8F7D;&#x7684;class&#x6587;&#x4EF6;&#x662F;&#x6709;&#x683C;&#x5F0F;&#x8981;&#x6C42;&#xFF0C;&#x5728;&#x300A;JVM Specification&#x300B;&#x4E2D;&#x5F0F;&#x8FD9;&#x6837;&#x5B9A;&#x4E49;Class&#x6587;&#x4EF6;&#x7684;&#x7ED3;&#x6784;&#xFF1A;</p>
<p>ClassFile {</p>
<p>u4 magic;</p>
<p>u2 minor_version;</p>
<p>u2 major_version;</p>
<p>u2 constant_pool_count;</p>
<p>cp_info constant_pool[constant_pool_count-1];</p>
<p>u2 access_flags;</p>
<p>u2 this_class;</p>
<p>u2 super_class;</p>
<p>u2 interfaces_count;</p>
<p>u2 interfaces[interfaces_count];</p>
<p>u2 fields_count;</p>
<p>field_info fields[fields_count];</p>
<p>u2 methods_count;</p>
<p>method_info methods[methods_count];</p>
<p>u2 attributes_count;</p>
<p>attribute_info attributes[attributes_count];</p>
<p>}</p>
<p>&#x9700;&#x8981;&#x8BE6;&#x7EC6;&#x4E86;&#x89E3;&#x7684;&#x8BDD;&#xFF0C;&#x53EF;&#x4EE5;&#x4ED4;&#x7EC6;&#x9605;&#x8BFB;&#x300A;JVM Specification&#x300B;&#x7684;&#x7B2C;&#x56DB;&#x7AE0;&#x201C;The class File Format&#x201D;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x3002;</p>
<p>&#x53CB;&#x60C5;&#x63D0;&#x793A;&#xFF1A;Class Loader&#x53EA;&#x7BA1;&#x52A0;&#x8F7D;&#xFF0C;&#x53EA;&#x8981;&#x7B26;&#x5408;&#x6587;&#x4EF6;&#x7ED3;&#x6784;&#x5C31;&#x52A0;&#x8F7D;&#xFF0C;&#x81F3;&#x4E8E;&#x8BF4;&#x80FD;&#x4E0D;&#x80FD;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x4E0D;&#x662F;&#x5B83;&#x8D1F;&#x8D23;&#x7684;&#xFF0C;&#x90A3;&#x662F;&#x7531;Execution Engine&#x8D1F;&#x8D23;&#x7684;&#x3002;</p>
<p>q&#xA0; Execution Engine &#x6267;&#x884C;&#x5F15;&#x64CE;</p>
<p>&#x6267;&#x884C;&#x5F15;&#x64CE;&#x4E5F;&#x53EB;&#x505A;&#x89E3;&#x91CA;&#x5668;(Interpreter)&#xFF0C;&#x8D1F;&#x8D23;&#x89E3;&#x91CA;&#x547D;&#x4EE4;&#xFF0C;&#x63D0;&#x4EA4;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6267;&#x884C;&#x3002;</p>
<p>q&#xA0; Native Interface&#x672C;&#x5730;&#x63A5;&#x53E3;</p>
<p>&#x672C;&#x5730;&#x63A5;&#x53E3;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x878D;&#x5408;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E3A;Java&#x6240;&#x7528;&#xFF0C;&#x5B83;&#x7684;&#x521D;&#x8877;&#x662F;&#x878D;&#x5408;C/C++&#x7A0B;&#x5E8F;&#xFF0C;Java&#x8BDE;&#x751F;&#x7684;&#x65F6;&#x5019;&#x662F;C/C++&#x6A2A;&#x884C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x60F3;&#x7ACB;&#x8DB3;&#xFF0C;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E2A;&#x806A;&#x660E;&#x7684;&#x3001;&#x777F;&#x667A;&#x7684;&#x8C03;&#x7528;C/C++&#x7A0B;&#x5E8F;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x4E13;&#x95E8;&#x5F00;&#x8F9F;&#x4E86;&#x4E00;&#x5757;&#x533A;&#x57DF;&#x5904;&#x7406;&#x6807;&#x8BB0;&#x4E3A;native&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x7684;&#x5177;&#x4F53;&#x505A;&#x6CD5;&#x662F;Native Method Stack&#x4E2D;&#x767B;&#x8BB0;native&#x65B9;&#x6CD5;&#xFF0C;&#x5728;Execution Engine&#x6267;&#x884C;&#x65F6;&#x52A0;&#x8F7D;native libraies&#x3002;&#x76EE;&#x524D;&#x8BE5;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x8D8A;&#x6765;&#x8D8A;&#x5C11;&#x4E86;&#xFF0C;&#x9664;&#x975E;&#x662F;&#x4E0E;&#x786C;&#x4EF6;&#x6709;&#x5173;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6BD4;&#x5982;&#x901A;&#x8FC7;Java&#x7A0B;&#x5E8F;&#x9A71;&#x52A8;&#x6253;&#x5370;&#x673A;&#xFF0C;&#x6216;&#x8005;Java&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x751F;&#x4EA7;&#x8BBE;&#x5907;&#xFF0C;&#x5728;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x4E2D;&#x5DF2;&#x7ECF;&#x6BD4;&#x8F83;&#x5C11;&#x89C1;&#xFF0C;&#x56E0;&#x4E3A;&#x73B0;&#x5728;&#x7684;&#x5F02;&#x6784;&#x9886;&#x57DF;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x5F88;&#x53D1;&#x8FBE;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Socket&#x901A;&#x4FE1;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Web Service&#x7B49;&#x7B49;&#xFF0C;&#x4E0D;&#x591A;&#x505A;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>q&#xA0; Runtime data area&#x8FD0;&#x884C;&#x6570;&#x636E;&#x533A;</p>
<p>&#x8FD0;&#x884C;&#x6570;&#x636E;&#x533A;&#x662F;&#x6574;&#x4E2A;JVM&#x7684;&#x91CD;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x6240;&#x6709;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x90FD;&#x88AB;&#x52A0;&#x8F7D;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x4E4B;&#x540E;&#x624D;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#xFF0C;Java&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x5982;&#x6B64;&#x7684;&#x7E41;&#x8363;&#xFF0C;&#x5F97;&#x76CA;&#x4E8E;&#x8BE5;&#x533A;&#x57DF;&#x7684;&#x4F18;&#x826F;&#x81EA;&#x6CBB;&#xFF0C;&#x4E0B;&#x4E00;&#x7AE0;&#x8282;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E4B;&#x3002;</p>
<p>&#x6574;&#x4E2A;JVM&#x6846;&#x67B6;&#x7531;&#x52A0;&#x8F7D;&#x5668;&#x52A0;&#x8F7D;&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;&#x5668;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x5904;&#x7406;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x4E0E;&#x5F02;&#x6784;&#x7CFB;&#x7EDF;&#x4EA4;&#x4E92;&#x662F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x672C;&#x5730;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#xFF0C;&#x77A7;&#xFF0C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7CFB;&#x7EDF;&#x8BDE;&#x751F;&#x4E86;&#xFF01;</p>
<p>2 JVM <strong>&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;</strong></p>
<p>&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x548C;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x6570;&#x636E;&#x533A;&#x5B58;&#x653E;&#xFF0C;&#x5B83;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x51E0;&#x90E8;&#x5206;&#xFF1A;</p>
<p>q&#xA0; Stack &#x6808;</p>
<p>&#x6808;&#x4E5F;&#x53EB;&#x6808;&#x5185;&#x5B58;&#xFF0C;&#x662F;Java&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x533A;&#xFF0C;&#x662F;&#x5728;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x65F6;&#x521B;&#x5EFA;&#xFF0C;&#x5B83;&#x7684;&#x751F;&#x547D;&#x671F;&#x662F;&#x8DDF;&#x968F;&#x7EBF;&#x7A0B;&#x7684;&#x751F;&#x547D;&#x671F;&#xFF0C;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x6808;&#x5185;&#x5B58;&#x4E5F;&#x5C31;&#x91CA;&#x653E;&#xFF0C;&#x5BF9;&#x4E8E;&#x6808;&#x6765;&#x8BF4;&#x4E0D;&#x5B58;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x95EE;&#x9898;&#xFF0C;&#x53EA;&#x8981;&#x7EBF;&#x7A0B;&#x4E00;&#x7ED3;&#x675F;&#xFF0C;&#x8BE5;&#x6808;&#x5C31;Over&#x3002;&#x95EE;&#x9898;&#x51FA;&#x6765;&#x4E86;&#xFF1A;&#x6808;&#x4E2D;&#x5B58;&#x7684;&#x662F;&#x90A3;&#x4E9B;&#x6570;&#x636E;&#x5462;&#xFF1F;&#x53C8;&#x4EC0;&#x4E48;&#x662F;&#x683C;&#x5F0F;&#x5462;&#xFF1F;</p>
<p>&#x6808;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x4EE5;&#x6808;&#x5E27;&#xFF08;Stack Frame&#xFF09;&#x7684;&#x683C;&#x5F0F;&#x5B58;&#x5728;&#xFF0C;&#x6808;&#x5E27;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&#x533A;&#x5757;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x5173;&#x65B9;&#x6CD5;(Method)&#x548C;&#x8FD0;&#x884C;&#x671F;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;A&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x5C31;&#x4EA7;&#x751F;&#x4E86;&#x4E00;&#x4E2A;&#x6808;&#x5E27;F1&#xFF0C;&#x5E76;&#x88AB;&#x538B;&#x5165;&#x5230;&#x6808;&#x4E2D;&#xFF0C;A&#x65B9;&#x6CD5;&#x53C8;&#x8C03;&#x7528;&#x4E86;B&#x65B9;&#x6CD5;&#xFF0C;&#x4E8E;&#x662F;&#x4EA7;&#x751F;&#x6808;&#x5E27;F2&#x4E5F;&#x88AB;&#x538B;&#x5165;&#x6808;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x5148;&#x5F39;&#x51FA;F2&#x6808;&#x5E27;&#xFF0C;&#x518D;&#x5F39;&#x51FA;F1&#x6808;&#x5E27;&#xFF0C;&#x9075;&#x5FAA;&#x201C;&#x5148;&#x8FDB;&#x540E;&#x51FA;&#x201D;&#x539F;&#x5219;&#x3002;</p>
<p>&#x90A3;&#x6808;&#x5E27;&#x4E2D;&#x5230;&#x5E95;&#x5B58;&#x5728;&#x7740;&#x4EC0;&#x4E48;&#x6570;&#x636E;&#x5462;&#xFF1F;&#x6808;&#x5E27;&#x4E2D;&#x4E3B;&#x8981;&#x4FDD;&#x5B58;3&#x7C7B;&#x6570;&#x636E;&#xFF1A;&#x672C;&#x5730;&#x53D8;&#x91CF;&#xFF08;Local Variables&#xFF09;&#xFF0C;&#x5305;&#x62EC;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x548C;&#x8F93;&#x51FA;&#x53C2;&#x6570;&#x4EE5;&#x53CA;&#x65B9;&#x6CD5;&#x5185;&#x7684;&#x53D8;&#x91CF;&#xFF1B;&#x6808;&#x64CD;&#x4F5C;&#xFF08;Operand Stack&#xFF09;&#xFF0C;&#x8BB0;&#x5F55;&#x51FA;&#x6808;&#x3001;&#x5165;&#x6808;&#x7684;&#x64CD;&#x4F5C;&#xFF1B;&#x6808;&#x5E27;&#x6570;&#x636E;&#xFF08;Frame Data&#xFF09;&#xFF0C;&#x5305;&#x62EC;&#x7C7B;&#x6587;&#x4EF6;&#x3001;&#x65B9;&#x6CD5;&#x7B49;&#x7B49;&#x3002;&#x5149;&#x8BF4;&#x6BD4;&#x8F83;&#x67AF;&#x71E5;&#xFF0C;&#x6211;&#x4EEC;&#x753B;&#x4E2A;&#x56FE;&#x6765;&#x7406;&#x89E3;&#x4E00;&#x4E0B;Java&#x6808;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/f053118.png" alt=""></p>
<p>&#x56FE;&#x793A;&#x5728;&#x4E00;&#x4E2A;&#x6808;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x6808;&#x5E27;&#xFF0C;&#x6808;&#x5E27;2&#x662F;&#x6700;&#x5148;&#x88AB;&#x8C03;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5148;&#x5165;&#x6808;&#xFF0C;&#x7136;&#x540E;&#x65B9;&#x6CD5;2&#x53C8;&#x8C03;&#x7528;&#x4E86;&#x65B9;&#x6CD5;1&#xFF0C;&#x6808;&#x5E27;1&#x5904;&#x4E8E;&#x6808;&#x9876;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x6808;&#x5E27;2&#x5904;&#x4E8E;&#x6808;&#x5E95;&#xFF0C;&#x6267;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x4F9D;&#x6B21;&#x5F39;&#x51FA;&#x6808;&#x5E27;1&#x548C;&#x6808;&#x5E27;2&#xFF0C;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#xFF0C;&#x6808;&#x91CA;&#x653E;&#x3002; </p>
<p>q&#xA0; Heap &#x5806;&#x5185;&#x5B58;</p>
<p>&#x4E00;&#x4E2A;JVM&#x5B9E;&#x4F8B;&#x53EA;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5806;&#x7C7B;&#x5B58;&#xFF0C;&#x5806;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#x7684;&#x3002;&#x7C7B;&#x52A0;&#x8F7D;&#x5668;&#x8BFB;&#x53D6;&#x4E86;&#x7C7B;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x7C7B;&#x3001;&#x65B9;&#x6CD5;&#x3001;&#x5E38;&#x53D8;&#x91CF;&#x653E;&#x5230;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x6267;&#x884C;&#x5668;&#x6267;&#x884C;&#xFF0C;&#x5806;&#x5185;&#x5B58;&#x5206;&#x4E3A;&#x4E09;&#x90E8;&#x5206;&#xFF1A;</p>
<p>Permanent Space <strong>&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#x533A;</strong></p>
<p>&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#x533A;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x9A7B;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x653E;JDK&#x81EA;&#x8EAB;&#x6240;&#x643A;&#x5E26;&#x7684;Class,Interface&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x5B58;&#x50A8;&#x7684;&#x662F;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x5FC5;&#x987B;&#x7684;&#x7C7B;&#x4FE1;&#x606F;&#xFF0C;&#x88AB;&#x88C5;&#x8F7D;&#x8FDB;&#x6B64;&#x533A;&#x57DF;&#x7684;&#x6570;&#x636E;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x56DE;&#x6536;&#x6389;&#x7684;&#xFF0C;&#x5173;&#x95ED;JVM&#x624D;&#x4F1A;&#x91CA;&#x653E;&#x6B64;&#x533A;&#x57DF;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>Young Generation Space <strong>&#x65B0;&#x751F;&#x533A;</strong></p>
<p>&#x65B0;&#x751F;&#x533A;&#x662F;&#x7C7B;&#x7684;&#x8BDE;&#x751F;&#x3001;&#x6210;&#x957F;&#x3001;&#x6D88;&#x4EA1;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x4E00;&#x4E2A;&#x7C7B;&#x5728;&#x8FD9;&#x91CC;&#x4EA7;&#x751F;&#xFF0C;&#x5E94;&#x7528;&#xFF0C;&#x6700;&#x540E;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6536;&#x96C6;&#xFF0C;&#x7ED3;&#x675F;&#x751F;&#x547D;&#x3002;&#x65B0;&#x751F;&#x533A;&#x53C8;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x4F0A;&#x7538;&#x533A;&#xFF08;Eden space&#xFF09;&#x548C;&#x5E78;&#x5B58;&#x8005;&#x533A;&#xFF08;Survivor pace&#xFF09;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7C7B;&#x90FD;&#x662F;&#x5728;&#x4F0A;&#x7538;&#x533A;&#x88AB;new&#x51FA;&#x6765;&#x7684;&#x3002;&#x5E78;&#x5B58;&#x533A;&#x6709;&#x4E24;&#x4E2A;&#xFF1A; 0&#x533A;&#xFF08;Survivor 0 space&#xFF09;&#x548C;1&#x533A;&#xFF08;Survivor 1 space&#xFF09;&#x3002;&#x5F53;&#x4F0A;&#x7538;&#x56ED;&#x7684;&#x7A7A;&#x95F4;&#x7528;&#x5B8C;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x53C8;&#x9700;&#x8981;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xFF0C;JVM&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x5C06;&#x5BF9;&#x4F0A;&#x7538;&#x56ED;&#x533A;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5C06;&#x4F0A;&#x7538;&#x56ED;&#x533A;&#x4E2D;&#x7684;&#x4E0D;&#x518D;&#x88AB;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x6240;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x9500;&#x6BC1;&#x3002;&#x7136;&#x540E;&#x5C06;&#x4F0A;&#x7538;&#x56ED;&#x4E2D;&#x7684;&#x5269;&#x4F59;&#x5BF9;&#x8C61;&#x79FB;&#x52A8;&#x5230;&#x5E78;&#x5B58;0&#x533A;&#x3002;&#x82E5;&#x5E78;&#x5B58;0&#x533A;&#x4E5F;&#x6EE1;&#x4E86;&#xFF0C;&#x518D;&#x5BF9;&#x8BE5;&#x533A;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x7136;&#x540E;&#x79FB;&#x52A8;&#x5230;1&#x533A;&#x3002;&#x90A3;&#x5982;&#x679C;1&#x533A;&#x4E5F;&#x6EE1;&#x4E86;&#x5462;&#xFF1F;&#x518D;&#x79FB;&#x52A8;&#x5230;&#x517B;&#x8001;&#x533A;&#x3002;</p>
<p>Tenure generation space <strong>&#x517B;&#x8001;&#x533A;</strong></p>
<p>&#x517B;&#x8001;&#x533A;&#x7528;&#x4E8E;&#x4FDD;&#x5B58;&#x4ECE;&#x65B0;&#x751F;&#x533A;&#x7B5B;&#x9009;&#x51FA;&#x6765;&#x7684;JAVA&#x5BF9;&#x8C61;&#xFF0C;&#x4E00;&#x822C;&#x6C60;&#x5BF9;&#x8C61;&#x90FD;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x57DF;&#x6D3B;&#x8DC3;&#x3002;&#xA0;&#xA0; &#x4E09;&#x4E2A;&#x533A;&#x7684;&#x793A;&#x610F;&#x56FE;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/f0535fa.jpg" alt=""></p>
<p>q&#xA0; Method Area &#x65B9;&#x6CD5;&#x533A; </p>
<p>&#x65B9;&#x6CD5;&#x533A;&#x662F;&#x88AB;&#x6240;&#x6709;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#xFF0C;&#x8BE5;&#x533A;&#x57DF;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x548C;&#x65B9;&#x6CD5;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x65B9;&#x6CD5;&#x5982;&#x6784;&#x9020;&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x53E3;&#x4EE3;&#x7801;&#x4E5F;&#x5728;&#x6B64;&#x5B9A;&#x4E49;&#x3002;</p>
<p>q&#xA0; PC Register &#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;</p>
<p>&#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#xFF0C;&#x6307;&#x5411;&#x65B9;&#x6CD5;&#x533A;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x5B57;&#x8282;&#x7801;&#xFF0C;&#x7531;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x8BFB;&#x53D6;&#x4E0B;&#x4E00;&#x6761;&#x6307;&#x4EE4;&#x3002;</p>
<p>q&#xA0; Native Method Stack &#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6808;</p>
<p>3 JVM <strong>&#x76F8;&#x5173;&#x95EE;&#x9898;</strong></p>
<h4 id="&#x95EE;&#xFF1A;&#x5806;&#x548C;&#x6808;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;">&#x95EE;&#xFF1A;&#x5806;&#x548C;&#x6808;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;</h4><p>&#x7B54;&#xFF1A;&#x5806;&#x662F;&#x5B58;&#x653E;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x8C61;&#x5185;&#x7684;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x662F;&#x5B58;&#x5728;&#x6808;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x5982;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;methodVar&#x662F;&#x5728;&#x8FD0;&#x884C;&#x671F;&#x5B58;&#x653E;&#x5230;&#x6808;&#x4E2D;&#x7684;&#x3002;</p>
<p>&#x6808;&#x662F;&#x8DDF;&#x968F;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x6709;&#x7EBF;&#x7A0B;&#x5C31;&#x6709;&#x6808;&#xFF0C;&#x5806;&#x662F;&#x8DDF;&#x968F;JVM&#x7684;&#xFF0C;&#x6709;JVM&#x5C31;&#x6709;&#x5806;&#x5185;&#x5B58;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x5230;&#x5E95;&#x5B58;&#x5728;&#x7740;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF1F;">&#x95EE;&#xFF1A;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x5230;&#x5E95;&#x5B58;&#x5728;&#x7740;&#x4EC0;&#x4E48;&#x4E1C;&#x897F;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x5BF9;&#x8C61;&#xFF0C;&#x5305;&#x62EC;&#x5BF9;&#x8C61;&#x53D8;&#x91CF;&#x4EE5;&#x53CA;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x7C7B;&#x53D8;&#x91CF;&#x548C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;">&#x95EE;&#xFF1A;&#x7C7B;&#x53D8;&#x91CF;&#x548C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x6709;&#x4EC0;&#x4E48;&#x533A;&#x522B;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x662F;&#x7C7B;&#x53D8;&#x91CF;&#xFF0C;&#x975E;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x662F;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x76F4;&#x767D;&#x7684;&#x8BF4;&#xFF0C;&#x6709;static&#x4FEE;&#x9970;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x9759;&#x6001;&#x53D8;&#x91CF;&#xFF0C;&#x6CA1;&#x6709;static&#x4FEE;&#x9970;&#x7684;&#x53D8;&#x91CF;&#x662F;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x3002;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x5B58;&#x5728;&#x65B9;&#x6CD5;&#x533A;&#x4E2D;&#xFF0C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x5B58;&#x5728;&#x5806;&#x5185;&#x5B58;&#x4E2D;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x6211;&#x542C;&#x8BF4;&#x7C7B;&#x53D8;&#x91CF;&#x662F;&#x5728;JVM&#x542F;&#x52A8;&#x65F6;&#x5C31;&#x521D;&#x59CB;&#x5316;&#x597D;&#x7684;&#xFF0C;&#x548C;&#x4F60;&#x8FD9;&#x8BF4;&#x7684;&#x4E0D;&#x540C;&#x5440;&#xFF01;">&#x95EE;&#xFF1A;&#x6211;&#x542C;&#x8BF4;&#x7C7B;&#x53D8;&#x91CF;&#x662F;&#x5728;JVM&#x542F;&#x52A8;&#x65F6;&#x5C31;&#x521D;&#x59CB;&#x5316;&#x597D;&#x7684;&#xFF0C;&#x548C;&#x4F60;&#x8FD9;&#x8BF4;&#x7684;&#x4E0D;&#x540C;&#x5440;&#xFF01;</h4><p>&#x7B54;&#xFF1A;&#x90A3;&#x4F60;&#x662F;&#x9053;&#x542C;&#x9014;&#x8BF4;&#xFF0C;&#x4FE1;&#x6211;&#x7684;&#xFF0C;&#x6CA1;&#x9519;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;Java&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x51FD;&#x6570;&#xFF09;&#x5230;&#x5E95;&#x662F;&#x4F20;&#x503C;&#x8FD8;&#x662F;&#x4F20;&#x5740;&#xFF1F;">&#x95EE;&#xFF1A;Java&#x7684;&#x65B9;&#x6CD5;&#xFF08;&#x51FD;&#x6570;&#xFF09;&#x5230;&#x5E95;&#x662F;&#x4F20;&#x503C;&#x8FD8;&#x662F;&#x4F20;&#x5740;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x90FD;&#x4E0D;&#x662F;&#xFF0C;&#x662F;&#x4EE5;&#x4F20;&#x503C;&#x7684;&#x65B9;&#x5F0F;&#x4F20;&#x9012;&#x5730;&#x5740;&#xFF0C;&#x5177;&#x4F53;&#x7684;&#x8BF4;&#x539F;&#x751F;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x4F20;&#x9012;&#x7684;&#x503C;&#xFF0C;&#x5F15;&#x7528;&#x7C7B;&#x578B;&#x4F20;&#x9012;&#x7684;&#x5730;&#x5740;&#x3002;&#x5BF9;&#x4E8E;&#x539F;&#x59CB;&#x6570;&#x636E;&#x7C7B;&#x578B;&#xFF0C;JVM&#x7684;&#x5904;&#x7406;&#x65B9;&#x6CD5;&#x662F;&#x4ECE;Method Area&#x6216;Heap&#x4E2D;&#x62F7;&#x8D1D;&#x5230;Stack&#xFF0C;&#x7136;&#x540E;&#x8FD0;&#x884C;frame&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD0;&#x884C;&#x5B8C;&#x6BD5;&#x540E;&#x518D;&#x628A;&#x53D8;&#x91CF;&#x6307;&#x62F7;&#x8D1D;&#x56DE;&#x53BB;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4EA7;&#x751F;OutOfMemory&#x4EA7;&#x751F;&#xFF1F;">&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4EA7;&#x751F;OutOfMemory&#x4EA7;&#x751F;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;Heap&#x5185;&#x5B58;&#x4E2D;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x4E86;&#x3002;&#x8FD9;&#x53E5;&#x8BDD;&#x8981;&#x597D;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x4E0D;&#x662F;&#x8BF4;Heap&#x6CA1;&#x6709;&#x5185;&#x5B58;&#x4E86;&#xFF0C;&#x662F;&#x8BF4;&#x65B0;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#x7684;&#x5BF9;&#x8C61;&#x5927;&#x4E8E;Heap&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;Heap&#x8FD8;&#x7A7A;&#x95F2;1M&#xFF0C;&#x4F46;&#x662F;&#x65B0;&#x7533;&#x8BF7;&#x7684;&#x5185;&#x5B58;&#x9700;&#x8981;1.1M&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x4F1A;&#x62A5;OutOfMemory&#x4E86;&#xFF0C;&#x53EF;&#x80FD;&#x4EE5;&#x540E;&#x7684;&#x5BF9;&#x8C61;&#x7533;&#x8BF7;&#x7684;&#x5185;&#x5B58;&#x90FD;&#x53EA;&#x8981;0.9M&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x53EA;&#x51FA;&#x73B0;&#x4E00;&#x6B21;OutOfMemory&#xFF0C;GC&#x4E5F;&#x6B63;&#x5E38;&#x4E86;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x5076;&#x53D1;&#x4E8B;&#x4EF6;&#xFF0C;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x56DE;&#x4E8B;&#x3002;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; &#x4F46;&#x5982;&#x679C;&#x6B64;&#x65F6;GC&#x6CA1;&#x6709;&#x56DE;&#x6536;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x6302;&#x8D77;&#x60C5;&#x51B5;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E0D;&#x54CD;&#x5E94;&#x4E86;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x6211;&#x4EA7;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x591A;&#x5440;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x4F1A;&#x4EA7;&#x751F;OutOfMemory&#xFF1F;">&#x95EE;&#xFF1A;&#x6211;&#x4EA7;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x591A;&#x5440;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD8;&#x4F1A;&#x4EA7;&#x751F;OutOfMemory&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x4F60;&#x7EE7;&#x627F;&#x5C42;&#x6B21;&#x5FD2;&#x591A;&#x4E86;&#xFF0C;Heap&#x4E2D; &#x4EA7;&#x751F;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5148;&#x4EA7;&#x751F; &#x7236;&#x7C7B;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x4EA7;&#x751F;&#x5B50;&#x7C7B;&#xFF0C;&#x660E;&#x767D;&#x4E0D;&#xFF1F;</p>
<h4 id="&#x95EE;&#xFF1A;OutOfMemory&#x9519;&#x8BEF;&#x5206;&#x51E0;&#x79CD;&#xFF1F;">&#x95EE;&#xFF1A;OutOfMemory&#x9519;&#x8BEF;&#x5206;&#x51E0;&#x79CD;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x5206;&#x4E24;&#x79CD;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x201C;OutOfMemoryError:java heap size&#x201D;&#x548C;&#x201D;OutOfMemoryError: PermGen space&#x201D;&#xFF0C;&#x4E24;&#x79CD;&#x90FD;&#x662F;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#xFF0C;heap size&#x662F;&#x8BF4;&#x7533;&#x8BF7;&#x4E0D;&#x5230;&#x65B0;&#x7684;&#x5185;&#x5B58;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x68C0;&#x67E5;&#x5E94;&#x7528;&#x6216;&#x8C03;&#x6574;&#x5806;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x201C;PermGen space&#x201D;&#x662F;&#x56E0;&#x4E3A;&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#x533A;&#x6EE1;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x5F88;&#x5E38;&#x89C1;&#xFF0C;&#x4E00;&#x822C;&#x5728;&#x70ED;&#x53D1;&#x5E03;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x51FA;&#x73B0;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x53D1;&#x5E03;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x90FD;&#x4E0D;&#x91CD;&#x542F;&#xFF0C;&#x4E45;&#x800C;&#x4E45;&#x4E4B;&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#x533A;&#x4E2D;&#x7684;&#x6B7B;&#x5BF9;&#x8C61;&#x592A;&#x591A;&#x5BFC;&#x81F4;&#x65B0;&#x5BF9;&#x8C61;&#x65E0;&#x6CD5;&#x7533;&#x8BF7;&#x5185;&#x5B58;&#xFF0C;&#x4E00;&#x822C;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x4E00;&#x4E0B;&#x5373;&#x53EF;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4EA7;&#x751F;StackOverflowError&#xFF1F;">&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x4EA7;&#x751F;StackOverflowError&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x628A;Stack&#x5185;&#x5B58;&#x5168;&#x90E8;&#x8017;&#x5C3D;&#x4E86;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x9012;&#x5F52;&#x51FD;&#x6570;&#x9020;&#x6210;&#x7684;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x53EF;&#x4EE5;&#x770B;&#x591A;&#x4E2A;JVM&#x5417;&#xFF1F;JVM&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x4E92;&#x8BBF;&#x5417;&#xFF1F;">&#x95EE;&#xFF1A;&#x4E00;&#x4E2A;&#x673A;&#x5668;&#x4E0A;&#x53EF;&#x4EE5;&#x770B;&#x591A;&#x4E2A;JVM&#x5417;&#xFF1F;JVM&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x4E92;&#x8BBF;&#x5417;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x53EF;&#x4EE5;&#x591A;&#x4E2A;JVM&#xFF0C;&#x53EA;&#x8981;&#x673A;&#x5668;&#x627F;&#x53D7;&#x5F97;&#x4E86;&#x3002;JVM&#x4E4B;&#x95F4;&#x662F;&#x4E0D;&#x53EF;&#x4EE5;&#x4E92;&#x8BBF;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x5728;A-JVM&#x4E2D;&#x8BBF;&#x95EE;B-JVM&#x7684;Heap&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x5728;&#x4EE5;&#x524D;&#x8001;&#x7248;&#x672C;&#x7684;JVM&#x4E2D;&#xFF0C;&#x4F1A;&#x51FA;&#x73B0;A-JVM Crack&#x540E;&#x5F71;&#x54CD;&#x5230;B-JVM&#xFF0C;&#x73B0;&#x5728;&#x7248;&#x672C;&#x975E;&#x5E38;&#x5C11;&#x89C1;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;Java&#x8981;&#x91C7;&#x7528;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x91C7;&#x7528;C/C++&#x7684;&#x663E;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF1F;">&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;Java&#x8981;&#x91C7;&#x7528;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF0C;&#x800C;&#x4E0D;&#x91C7;&#x7528;C/C++&#x7684;&#x663E;&#x5F0F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#xFF0C;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x4E0D;&#x662F;&#x6BCF;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x80FD;&#x6298;&#x817E;&#x597D;&#x7684;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF1F;">&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x6CA1;&#x6709;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x6BCF;&#x4E2A;JVM&#x90FD;&#x4E0D;&#x540C;&#xFF0C;JVM Specification&#x53EA;&#x662F;&#x5B9A;&#x4E49;&#x4E86;&#x8981;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x53EA;&#x5B9A;&#x4E49;&#x4E86;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x62BD;&#x8C61;&#x65B9;&#x6CD5;&#xFF0C;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x5404;&#x4E2A;&#x5382;&#x5546;&#x90FD;&#x4E0D;&#x540C;&#xFF0C;&#x7B97;&#x6CD5;&#x5404;&#x5F02;&#xFF0C;&#x8FD9;&#x4E1C;&#x897F;&#x5B9E;&#x5728;&#x6CA1;&#x5FC5;&#x8981;&#x6DF1;&#x5165;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;JVM&#x4E2D;&#x5230;&#x5E95;&#x54EA;&#x4E9B;&#x533A;&#x57DF;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF1F;&#x54EA;&#x4E9B;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF1F;">&#x95EE;&#xFF1A;JVM&#x4E2D;&#x5230;&#x5E95;&#x54EA;&#x4E9B;&#x533A;&#x57DF;&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF1F;&#x54EA;&#x4E9B;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;Heap&#x548C;Method Area&#x662F;&#x5171;&#x4EAB;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x90FD;&#x662F;&#x79C1;&#x6709;&#x7684;&#xFF0C;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;JIT&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x6CA1;&#x8BF4;&#xFF1F;">&#x95EE;&#xFF1A;&#x4EC0;&#x4E48;&#x662F;JIT&#xFF0C;&#x4F60;&#x600E;&#x4E48;&#x6CA1;&#x8BF4;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;JIT&#x662F;&#x6307;Just In Time&#xFF0C;&#x6709;&#x7684;&#x6587;&#x6863;&#x628A;JIT&#x4F5C;&#x4E3A;JVM&#x7684;&#x4E00;&#x4E2A;&#x90E8;&#x4EF6;&#x6765;&#x4ECB;&#x7ECD;&#xFF0C;&#x6709;&#x7684;&#x662F;&#x4F5C;&#x4E3A;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x6765;&#x4ECB;&#x7ECD;&#xFF0C;&#x8FD9;&#x90FD;&#x80FD;&#x7406;&#x89E3;&#x3002;Java&#x521A;&#x8BDE;&#x751F;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x6027;&#x8BED;&#x8A00;&#xFF0C;&#x522B;&#x5618;&#xFF0C;&#x5373;&#x4F7F;&#x7F16;&#x8BD1;&#x6210;&#x4E86;&#x5B57;&#x8282;&#x7801;&#xFF08;byte code&#xFF09;&#x4E5F;&#x662F;&#x9488;&#x5BF9;JVM&#x7684;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x518D;&#x6B21;&#x7FFB;&#x8BD1;&#x6210;&#x539F;&#x751F;&#x4EE3;&#x7801;(native code)&#x624D;&#x80FD;&#x88AB;&#x673A;&#x5668;&#x6267;&#x884C;&#xFF0C;&#x4E8E;&#x662F;&#x6548;&#x7387;&#x7684;&#x62C5;&#x5FE7;&#x5C31;&#x63D0;&#x51FA;&#x6765;&#x4E86;&#x3002;Sun&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8BE5;&#x95EE;&#x9898;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x5957;&#x65B0;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x597D;&#xFF0C;&#x4F60;&#x60F3;&#x7F16;&#x8BD1;&#x6210;&#x539F;&#x751F;&#x4EE3;&#x7801;&#xFF0C;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x5728;JVM&#x4E0A;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5DE5;&#x5177;&#xFF0C;&#x628A;&#x5B57;&#x8282;&#x7801;&#x7F16;&#x8BD1;&#x6210;&#x539F;&#x751F;&#x7801;&#xFF0C;&#x4E0B;&#x6B21;&#x4F60;&#x6765;&#x8BBF;&#x95EE;&#x7684;&#x65F6;&#x5019;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x539F;&#x751F;&#x7801;&#x5C31;&#x6210;&#x4E86;&#xFF0C;&#x4E8E;&#x662F;JIT&#x5C31;&#x8BDE;&#x751F;&#x4E86;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x56DE;&#x4E8B;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;JVM&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x7684;&#xFF1F;">&#x95EE;&#xFF1A;JVM&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x90E8;&#x5206;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x63D0;&#x5230;&#x7684;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;JVM&#x662F;&#x4E00;&#x4E2A;&#x5F02;&#x5E38;&#x590D;&#x6742;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5199;&#x4E00;&#x672C;&#x7816;&#x5934;&#x4E66;&#x90FD;&#x4E0D;&#x4E3A;&#x8FC7;&#xFF0C;&#x8FD8;&#x6709;&#x51E0;&#x4E2A;&#x8981;&#x8BF4;&#x660E;&#x7684;&#xFF1A;</p>
<p>&#x5E38;&#x91CF;&#x6C60;&#xFF08;constant pool&#xFF09;&#xFF1A;&#x6309;&#x7167;&#x987A;&#x5E8F;&#x5B58;&#x653E;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x5E38;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#x7F16;&#x53F7;&#x7684;&#x533A;&#x57DF;&#x3002;&#x6BD4;&#x5982;int i =100&#xFF0C;&#x8FD9;&#x4E2A;100&#x5C31;&#x653E;&#x5728;&#x5E38;&#x91CF;&#x6C60;&#x4E2D;&#x3002;</p>
<p>&#x5B89;&#x5168;&#x7BA1;&#x7406;&#x5668;&#xFF08;Security Manager&#xFF09;&#xFF1A;&#x63D0;&#x4F9B;Java&#x8FD0;&#x884C;&#x671F;&#x7684;&#x5B89;&#x5168;&#x63A7;&#x5236;&#xFF0C;&#x9632;&#x6B62;&#x6076;&#x610F;&#x653B;&#x51FB;&#xFF0C;&#x6BD4;&#x5982;&#x6307;&#x5B9A;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#xFF0C;&#x5199;&#x5165;&#x6587;&#x4EF6;&#x6743;&#x9650;&#xFF0C;&#x7F51;&#x7EDC;&#x8BBF;&#x95EE;&#xFF0C;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#x7B49;&#x7B49;&#xFF0C;Class Loader&#x5728;Security Manager&#x8BA4;&#x8BC1;&#x901A;&#x8FC7;&#x540E;&#x624D;&#x80FD;&#x52A0;&#x8F7D;class&#x6587;&#x4EF6;&#x7684;&#x3002;</p>
<p>&#x65B9;&#x6CD5;&#x7D22;&#x5F15;&#x8868;&#xFF08;Methods table&#xFF09;&#xFF0C;&#x8BB0;&#x5F55;&#x7684;&#x662F;&#x6BCF;&#x4E2A;method&#x7684;&#x5730;&#x5740;&#x4FE1;&#x606F;&#xFF0C;Stack&#x548C;Heap&#x4E2D;&#x7684;&#x5730;&#x5740;&#x6307;&#x9488;&#x5176;&#x5B9E;&#x662F;&#x6307;&#x5411;Methods table&#x5730;&#x5740;&#x3002;</p>
<h4 id="&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5EFA;&#x8BAE;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x663E;&#x5F0F;&#x7684;&#x751F;&#x547D;System-gc()&#xFF1F;">&#x95EE;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5EFA;&#x8BAE;&#x5728;&#x7A0B;&#x5E8F;&#x4E2D;&#x663E;&#x5F0F;&#x7684;&#x751F;&#x547D;System.gc()&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x56E0;&#x4E3A;&#x663E;&#x5F0F;&#x58F0;&#x660E;&#x662F;&#x505A;&#x5806;&#x5185;&#x5B58;&#x5168;&#x626B;&#x63CF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;Full GC&#xFF0C;&#x662F;&#x9700;&#x8981;&#x505C;&#x6B62;&#x6240;&#x6709;&#x7684;&#x6D3B;&#x52A8;&#x7684;&#xFF08;Stop &#xA0;The World Collection&#xFF09;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x80FD;&#x627F;&#x53D7;&#x8FD9;&#x4E2A;&#x5417;&#xFF1F;</p>
<h4 id="&#x95EE;&#xFF1A;JVM&#x6709;&#x54EA;&#x4E9B;&#x8C03;&#x6574;&#x53C2;&#x6570;&#xFF1F;">&#x95EE;&#xFF1A;JVM&#x6709;&#x54EA;&#x4E9B;&#x8C03;&#x6574;&#x53C2;&#x6570;&#xFF1F;</h4><p>&#x7B54;&#xFF1A;&#x975E;&#x5E38;&#x591A;&#xFF0C;&#x81EA;&#x5DF1;&#x53BB;&#x627E;&#xFF0C;&#x5806;&#x5185;&#x5B58;&#x3001;&#x6808;&#x5185;&#x5B58;&#x7684;&#x5927;&#x5C0F;&#x90FD;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x5806;&#x5185;&#x5B58;&#x7684;&#x4E09;&#x4E2A;&#x90E8;&#x5206;&#x3001;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5404;&#x4E2A;&#x6BD4;&#x4F8B;&#x90FD;&#x80FD;&#x8C03;&#x6574;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/efe81ab/" title="JVM上的并发和Java内存模型之同步块笔记 -" itemprop="url">JVM上的并发和Java内存模型之同步块笔记 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x672C;&#x6587;&#x6765;&#x81EA; &#x56FE;&#x7075;&#x793E;&#x533A;@fairjm&#x8F6C;&#x622A;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904; </p>
<p>&#x8FD9;&#x4E2A;&#x662F;&#x4E66;&#x7684;&#x7B14;&#x8BB0; &#x4E66;&#x53EF;&#x4EE5;&#x5728; <a href="https://www.safaribooksonline.com/library/view/learning-concurrent-programming/9781783281411/ch02.html" target="_blank" rel="external">safaribooksonline</a> &#x770B;&#xFF0C;&#x8BDD;&#x8BF4;&#x8FD9;&#x4E2A;&#x771F;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x8BFB;&#x5916;&#x6587;&#x4E66;&#x7684;&#x7F51;&#x7AD9;&#x554A;&#xFF0C;&#x4E00;&#x4E2A;&#x6708;39&#x5200;&#x5C31;&#x53EF;&#x4EE5;&#x7545;&#x60F3;&#x5168;&#x7AD9;&#x7684;&#x4E66;&#xFF0C;&#x5F88;&#x503C;&#x3002;&#xFF08;&#x8BA2;&#x8BA2;&#x8BA2;&#x8BA2;&#x8BA2; </p>
<p>&#x56E0;&#x4E3A;&#x662F;&#x7B14;&#x8BB0;&#x6240;&#x4EE5;&#x89C9;&#x5F97;&#x6563;&#x4E0D;&#x662F;&#x4F60;&#x7684;&#x9519;&#x89C9;…&#x56E0;&#x4E3A;&#x672C;&#x6765;&#x5C31;&#x662F;&#x6563;&#x7684;…&#x7B14;&#x8BB0;&#x8BB0;&#x5F55;&#x4E86;&#x4E00;&#x4E9B;&#x6982;&#x5FF5; &#x65B9;&#x4FBF;&#x590D;&#x4E60;&#x56DE;&#x987E;&#x7684;&#x65F6;&#x5019;&#x770B; &#x66F4;&#x591A;&#x5185;&#x5BB9;&#x53EF;&#x4EE5;&#x6233;&#x4E0A;&#x9762;&#x7684;&#x94FE;&#x63A5; </p>
<p>Scala &#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B; &#x591A;&#x7EBF;&#x7A0B;&#x80FD;&#x529B; &#x548C;&#x5B83;&#x7684;&#x7EBF;&#x7A0B;&#x95F4;&#x540C;&#x6B65;&#x5168;&#x90E8;&#x7EE7;&#x627F;&#x81EA; JVM</p>
<p>&#x6240;&#x6709;&#x7684;&#x62BD;&#x8C61;&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x6CC4;&#x6F0F; &#xFF08;all abstractions are to some extent leaky&#xFF09;</p>
<h4 id="Processes_and_Threads">Processes and Threads</h4><p>&#x8FD9;&#x901A;&#x5E38;&#x662F;OS&#x7684;&#x4EFB;&#x52A1;&#xFF1A;&#x6307;&#x6D3E;&#x7A0B;&#x5E8F;&#x7684;&#x6267;&#x884C;&#x90E8;&#x5206;&#x7ED9;&#x7279;&#x5B9A;&#x7684;&#x5904;&#x7406;&#x5668; - &#x8FD9;&#x4E2A;&#x673A;&#x5236;&#x88AB;&#x79F0;&#x4E3A;&#x591A;&#x4EFB;&#x52A1;,&#x5E76;&#x4E14;&#x8FD9;&#x5BF9;&#x4E8E;&#x8BA1;&#x7B97;&#x673A;&#x7528;&#x6237;&#x6765;&#x8BF4;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x7247;(time slices)</p>
<p>&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x662F;&#x6B63;&#x88AB;&#x6267;&#x884C;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7A0B;&#x5E8F;&#x7684;&#x5B9E;&#x4F8B;&#x3002;&#x4E24;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8BFB;&#x53D6;&#x5F7C;&#x6B64;&#x7684;&#x5185;&#x5B58;&#x6216;&#x8005;&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x5927;&#x90E8;&#x5206;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x4F7F;&#x7528;&#x591A;&#x8FDB;&#x7A0B;&#x6765;&#x8868;&#x8FF0;&#x591A;&#x4EFB;&#x52A1;&#x4F1A;&#x975E;&#x5E38;&#x9EBB;&#x70E6; &#x3002;</p>
<p>&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#x7684;&#x8FD0;&#x7B97;&#x5355;&#x5143;&#x88AB;&#x79F0;&#x4E3A;&#x7EBF;&#x7A0B;&#x3002;&#x5728;&#x5178;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x7EBF;&#x7A0B;&#x7684;&#x6570;&#x91CF;&#x6BD4;&#x8FDB;&#x7A0B;&#x591A;&#x5F97;&#x591A;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x5728;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x63CF;&#x8FF0;&#x4E86;&#x5F53;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF1A;&#x901A;&#x8FC7;&#x7A0B;&#x5E8F;&#x6808;&#x548C;&#x7A0B;&#x5E8F;&#x8BA1;&#x6570;&#x5668;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x8BF4;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x4E86;&#x4E00;&#x4E2A;&#x52A8;&#x4F5C;(&#x6BD4;&#x5982;&#x5411;&#x5185;&#x5B58;&#x5199;&#xFFFD;&#xFFFD;&#xFFFD;&#x5185;&#x5BB9;) &#x6211;&#x4EEC;&#x7684;&#x610F;&#x601D;&#x662F;&#x4E00;&#x4E2A;&#x5904;&#x7406;&#x5668;&#x6267;&#x884C;&#x4E86;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x52A8;&#x4F5C;&#x7684;&#x7EBF;&#x7A0B;&#x3002;(&#x6CE8;&#x610F;&#x8FD9;&#x8FB9;&#x7684;&#x5206;&#x53E5;&#xFF0C;&#x6211;&#x81EA;&#x5DF1;&#x4ECE;onenote&#x4E0A;&#x7C98;&#x8D34;&#x4E0A;&#x6765;&#x90FD;&#x770B;&#x4E86;&#x597D;&#x51E0;&#x904D;…&#xFF09;</p>
<p>OS&#x7EBF;&#x7A0B;&#x662F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;&#x7F16;&#x7A0B;&#x8BBE;&#x7F6E; &#x901A;&#x5E38;&#x901A;&#x8FC7;OS&#x76F8;&#x5173;&#x7684;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#x6765;&#x66B4;&#x9732;&#x51FA;&#x6765;&#x88AB;&#x4F7F;&#x7528;</p>
<p>&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#x7684;&#x5206;&#x9694;&#x7684;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x533A;&#x57DF;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x901A;&#x8FC7;&#x8BFB;&#x5199;&#x5185;&#x5B58;&#x6765;&#x5F7C;&#x6B64;&#x4EA4;&#x4E92;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x6765;&#x5B9A;&#x4E49;&#x8FDB;&#x7A0B;&#x7684;&#x65B9;&#x5F0F;&#x662F;: &#x4E00;&#x7CFB;&#x5217;&#x7684;OS&#x7EBF;&#x7A0B;&#x548C;&#x8FD9;&#x4E9B;&#x7EBF;&#x7A0B;&#x5171;&#x4EAB;&#x7684;&#x5185;&#x5B58;&#x548C;&#x8D44;&#x6E90;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/efe5348.jpg" alt=""></p>
<p>&#x7CFB;&#x7EDF;&#x5468;&#x671F;&#x6027;&#x5730;&#x6307;&#x6D3E;&#x4E0D;&#x540C;&#x7684;OS&#x7EBF;&#x7A0B;&#x5230;CPU&#x6838;&#x5FC3;&#x4E2D;&#x6765;&#x5141;&#x8BB8;&#x8BA1;&#x7B97;&#x5728;&#x6240;&#x6709;&#x5904;&#x7406;&#x5668;&#x4E2D;&#x8FDB;&#x884C;&#x3002;</p>
<p>java.lang.Thread Java&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x76F4;&#x63A5;&#x6620;&#x5C04;&#x5230;&#x7CFB;&#x7EDF;&#x7EBF;&#x7A0B;&#x7684; &#x8FD9;&#x610F;&#x5473;&#x7740;Java&#x7EBF;&#x7A0B;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x548C;OS&#x7EBF;&#x7A0B;&#x662F;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#x7684; </p>
<h4 id="&#x521B;&#x5EFA;&#x548C;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;">&#x521B;&#x5EFA;&#x548C;&#x542F;&#x52A8;&#x7EBF;&#x7A0B;</h4><p>&#x5F53;JVM&#x8FDB;&#x7A0B;&#x542F;&#x52A8;&#x65F6; &#x4ED6;&#x9ED8;&#x8BA4;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E9B;&#x7EBF;&#x7A0B;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x7EBF;&#x7A0B;&#x662F;&#x4E3B;&#x7EBF;&#x7A0B;( main thread ) &#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x7684; main &#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x540D;&#x5B57;&#x5C31;&#x53EB; main &#x3002; </p>
<p>Thread&#x7684;&#x72B6;&#x6001;&#xFF1A;</p>
<p>&#x521A;&#x88AB;&#x521B;&#x5EFA;&#x65F6;&#x662F; new</p>
<p>&#x5F53;&#x88AB;&#x6267;&#x884C;&#x65F6;&#x662F; runnable</p>
<p>&#x7ED3;&#x675F;&#x6267;&#x884C;&#x662F; terminated</p>
<p>&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7EBF;&#x7A0B;&#x5305;&#x542B;&#x4E24;&#x6B65;:</p>
<p>1 &#x521B;&#x5EFA;&#x7EBF;&#x7A0B;&#x5BF9;&#x8C61;</p>
<p>2 &#x7528;start&#x65B9;&#x6CD5;&#x6267;&#x884C;</p>
<pre><code><span class="class"><span class="keyword">object</span> <span class="title">ThreadsCreation</span> <span class="keyword"><span class="keyword">extends</span></span> <span class="title">App</span> {</span>
  <span class="class"><span class="keyword">class</span> <span class="title">MyThread</span> <span class="keyword"><span class="keyword">extends</span></span> <span class="title">Thread</span> {</span>
    <span class="keyword">override</span> <span class="function"><span class="keyword">def</span> <span class="title">run</span>(</span>): <span class="type">Unit</span> = {
      println(&amp;quot;<span class="type">New</span> thread running.&amp;quot;)
    }
  }
  <span class="function"><span class="keyword">val</span> <span class="title">t</span> =</span> <span class="keyword">new</span> <span class="type">MyThread</span>
  t.start()
  t.join()
  println(&amp;quot;<span class="type">New</span> thread joined.&amp;quot;)
}
</code></pre><p>join &#x65B9;&#x6CD5;&#x662F;&#x4E2D;&#x6B62;main&#x7EBF;&#x7A0B;&#x7684;&#x8FD0;&#x884C;&#x76F4;&#x5230;t&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x5B8C;&#x6BD5; </p>
<p>&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5; &#x5C06;main&#x7EBF;&#x7A0B;&#x8F6C;&#x6362;&#x5230;&#x4E86; waiting &#x72B6;&#x6001; </p>
<p>&#x7B49;&#x5F85;&#x7684;&#x7EBF;&#x7A0B;&#x653E;&#x5F03;&#x4E86;&#x4ED6;&#x7684;&#x6267;&#x884C;&#x673A;&#x4F1A; OS&#x53EF;&#x4EE5;&#x5C06;&#x5904;&#x7406;&#x5668;&#x7528;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x7A0B;</p>
<p>&#x6CE8;&#x610F;: &#x7B49;&#x5F85;&#x7684;&#x7EBF;&#x7A0B;&#x63D0;&#x9192;OS&#x5B83;&#x4EEC;&#x6B63;&#x5728;&#x7B49;&#x5F85;&#x67D0;&#x4E2A;&#x72B6;&#x6001;&#x5E76;&#x4E14; <strong>&#x505C;&#x6B62;&#x6D88;&#x8017;</strong> CPU&#x5468;&#x671F; &#x800C;&#x4E0D;&#x662F;&#x91CD;&#x590D;&#x5730;&#x68C0;&#x67E5;&#x8FD9;&#x4E2A;&#x72B6;&#x6001; </p>
<p>sleep &#x65B9;&#x6CD5;&#x5C06;&#x7EBF;&#x7A0B;&#x653E;&#x5165; timed waiting &#x72B6;&#x6001; </p>
<p>OS&#x540C;&#x6837;&#x53EF;&#x4EE5;&#x5C06;&#x672C;&#x8BE5;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5904;&#x7406;&#x5668;&#x7528;&#x6765;&#x8FD0;&#x884C;&#x5176;&#x4ED6;&#x7684;&#x7EBF;&#x7A0B;</p>
<p>&#x786E;&#x5B9A;&#x6027;: &#x7279;&#x5B9A;&#x7684;&#x8F93;&#x5165; &#x7A0B;&#x5E8F;&#x603B;&#x4F1A;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x8F93;&#x51FA; &#x800C;&#x4E0D;&#x7BA1;OS&#x9009;&#x62E9;&#x7684;&#x6267;&#x884C;&#x8C03;&#x5EA6;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C; &#x7531;OS&#x9009;&#x62E9;&#x7684;&#x8C03;&#x5EA6;&#x4E0D;&#x540C;&#x800C;&#x4F1A;&#x5BF9;&#x76F8;&#x540C;&#x8F93;&#x51FA;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7ED3;&#x679C;&#x7684;&#x79F0;&#x4E3A; <strong>&#x4E0D;&#x786E;&#x5B9A;&#x6027;</strong></p>
<p>&#x5927;&#x591A;&#x6570;&#x7684;&#x591A;&#x7EBF;&#x7A0B;&#x7A0B;&#x5E8F;&#x662F;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x7684; &#x8FD9;&#x4E5F;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x591A;&#x7EBF;&#x7A0B;&#x7F16;&#x7A0B;&#x5982;&#x6B64;&#x56F0;&#x96BE;&#x7684;&#x539F;&#x56E0;</p>
<h4 id="&#x539F;&#x5B50;&#x6027;&#x6267;&#x884C;(Atomic_execution)">&#x539F;&#x5B50;&#x6027;&#x6267;&#x884C;(Atomic execution)</h4><p>&#x7ADE;&#x6001;&#x6761;&#x4EF6;(race condition) &#x662F;&#x4E00;&#x79CD;&#x73B0;&#x8C61;:&#x5E76;&#x53D1;&#x7A0B;&#x5E8F;&#x7684;&#x8F93;&#x51FA;&#x4F9D;&#x8D56;&#x4E8E;&#x8BED;&#x53E5;&#x7684;&#x6267;&#x884C;&#x8C03;&#x5EA6;&#x3002;</p>
<p>&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4F46;&#x5982;&#x679C;&#x4E00;&#x4E9B;&#x8C03;&#x5EA6;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x6211;&#x4EEC;&#x4E0D;&#x9884;&#x671F;&#x7684; &#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x7ADE;&#x6001;&#x6761;&#x4EF6;&#x5C31;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x662F;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x9519;&#x8BEF;</p>
<p>&#x539F;&#x5B50;&#x6027;&#x6267;&#x884C;:&#x4EE3;&#x7801;&#x5757;&#x7684;&#x539F;&#x5B50;&#x6267;&#x884C;&#x610F;&#x5473;&#x7740;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x8BED;&#x53E5;&#x4E0D;&#x80FD;&#x7531;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x7EBF;&#x7A0B;&#x548C;&#x53E6;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x7684;&#x7EBF;&#x7A0B;&#x4EA4;&#x9519;&#x6267;&#x884C;&#x3002; </p>
<p>&#x5728;&#x539F;&#x5B50;&#x6027;&#x6267;&#x884C;&#x4E2D; &#x8981;&#x4E48;&#x6240;&#x8981;&#x6267;&#x884C;&#x7684;&#x4EE3;&#x7801;&#x90FD;&#x6267;&#x884C;&#x4E86; &#x8981;&#x4E48;&#x90FD;&#x6CA1;&#x6267;&#x884C;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x540C;&#x6B65;&#x5757;&#x4FDD;&#x8BC1;&#x539F;&#x5B50;&#x6027;&#xFF1A;</p>
<pre><code><span class="function"><span class="keyword">def</span> <span class="title">getUniqueId</span>(</span>) = <span class="keyword">this</span>.synchronized {
  <span class="function"><span class="keyword">val</span> <span class="title">freshUid</span> =</span> uidCount + <span class="number">1</span>
  uidCount = freshUid
  freshUid
}
</code></pre><p>&#x5728;&#x9519;&#x8BEF;&#x7684;&#x5BF9;&#x8C61;&#x4E0A;&#x540C;&#x6B65;&#x4F1A;&#x9020;&#x6210;&#x6BD4;&#x8F83;&#x96BE;&#x4EE5;&#x627E;&#x5230;&#x7684;&#x5E76;&#x53D1;&#x9519;&#x8BEF;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;JVM&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5B9E;&#x4F53;&#x6210;&#x4E3A; &#x5185;&#x90E8;&#x9501;(intrinsic lock) &#x6216;&#x8005;&#x6210;&#x4E3A; &#x76D1;&#x89C6;&#x5668;(monitor) &#x7528;&#x6765;&#x4FDD;&#x8BC1;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x5728;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x540C;&#x6B65;&#x5757; </p>
<p>&#x5F53;T&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5728;x&#x5BF9;&#x8C61;&#x7684;&#x540C;&#x6B65;&#x5757;&#x65F6; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4; T&#x7EBF;&#x7A0B;&#x83B7;&#x5F97;&#x4E86;x&#x7684;&#x76D1;&#x89C6;&#x5668;&#x7684;&#x6240;&#x6709;&#x6743;&#x3002;&#x5F53;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x5B8C;&#x8FD9;&#x4E2A;&#x540C;&#x6B65;&#x5757; &#x6211;&#x4EEC;&#x8BF4;&#x4ED6;&#x91CA;&#x653E;&#x4E86;&#x8FD9;&#x4E2A;&#x76D1;&#x89C6;&#x5668;&#x3002;</p>
<p>&#x540C;&#x6B65;&#x5757;&#x8BED;&#x53E5;&#x662F;&#x7EBF;&#x7A0B;&#x5185;&#x901A;&#x4FE1;&#x7684;&#x57FA;&#x672C;&#x673A;&#x5236;&#x3002;&#x65E0;&#x8BBA;&#x4F55;&#x65F6;&#xFF0C;&#x5F53;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8981;&#x8BBF;&#x95EE;&#x5E76;&#x4FEE;&#x6539;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x5B57;&#x6BB5;&#x65F6; &#x4F60;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x5757;&#x3002;</p>
<p>&#x91CD;&#x6392;&#x5E8F;(reordering) </p>
<p>&#x540C;&#x6B65;&#x5757;&#x4E5F;&#x4E0D;&#x662F;&#x6CA1;&#x6709;&#x5F00;&#x9500;&#x7684;</p>
<p>&#x5BF9;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x5199;&#x5165;&#x5C06;&#x66F4;&#x52A0;&#x6602;&#x8D35;</p>
<p>&#x540C;&#x6B65;&#x5757;&#x7684;&#x6027;&#x80FD;&#x635F;&#x5931;&#x7A0B;&#x5EA6;&#x53D6;&#x51B3;&#x4E8E;JVM&#x5B9E;&#x73B0; &#x4F46;&#x901A;&#x5E38;&#x4E0D;&#x4F1A;&#x5F88;&#x5927;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x8D8B;&#x5411;&#x4E8E;&#x907F;&#x514D;&#x4F7F;&#x7528;&#x540C;&#x6B65;&#x5757;&#x5F53;&#x4F60;&#x89C9;&#x5F97;&#x8FD9;&#x91CC;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x597D;&#x7684;&#x8BED;&#x53E5;&#x4EA4;&#x4E92;&#x6267;&#x884C;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x6BD4;&#x5982;&#x4E0A;&#x9762;&#x90A3;&#x4E2A;&#x4F8B;&#x5B50;&#x4E00;&#x6837;(&#x5C31;&#x662F;&#x4E0A;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x6CA1;&#x52A0;&#x540C;&#x6B65;&#x5757;&#x88AB;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x8BBF;&#x95EE;&#xFF09;&#x3002;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF01;(&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x9AD8;&#x4F30;&#x81EA;&#x5DF1;) </p>
<pre><code><span class="class"><span class="keyword">object</span> <span class="title">ThreadSharedStateAccessReordering</span> <span class="keyword"><span class="keyword">extends</span></span> <span class="title">App</span> {</span>
  <span class="keyword">for</span> (i &amp;lt;- <span class="number">0</span> until <span class="number">100000</span>) {
    <span class="keyword">var</span> a = <span class="literal">false</span>
    <span class="keyword">var</span> b = <span class="literal">false</span>
    <span class="keyword">var</span> x = -<span class="number">1</span>
    <span class="keyword">var</span> y = -<span class="number">1</span>
    <span class="function"><span class="keyword">val</span> <span class="title">t1</span> =</span> thread {
      a = <span class="literal">true</span>
      y = <span class="keyword">if</span> (b) <span class="number">0</span> <span class="keyword">else</span> <span class="number">1</span>
    }
    <span class="function"><span class="keyword">val</span> <span class="title">t2</span> =</span> thread {
      b = <span class="literal">true</span>
      x = <span class="keyword">if</span> (a) <span class="number">0</span> <span class="keyword">else</span> <span class="number">1</span>
    }
    t1.join()
    t2.join()
    assert(!(x == <span class="number">1</span> &amp;amp;&amp;amp; y == <span class="number">1</span>), s&amp;quot;x = $x, y = $y&amp;quot;)
  }
}
</code></pre><p>&#x6BD4;&#x5982;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x671F;&#x662F;0 0&#xFF0C;10&#xFF0C;0 1&#x3002;1 1&#x662F;&#x6211;&#x4EEC;&#x6240;&#x4E0D;&#x9884;&#x671F;&#x7684;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#x4E0D;&#x7BA1;&#x6211;&#x4EEC;&#x8FD0;&#x884C;&#x591A;&#x5C11;&#x6B21; &#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6709; x=1 y=1&#x7684;&#x60C5;&#x51B5;&#x53D1;&#x751F;(&#x6240;&#x4EE5;assert&#x4E0D;&#x4F1A;&#x4E0D;&#x6210;&#x7ACB; &#x4E5F;&#x5C31;&#x4E0D;&#x4F1A;&#x629B;&#x9519;)</p>
<p>&#x4F46;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x5C31;&#x4F1A;..</p>
<p>JVM&#x5141;&#x8BB8;&#x91CD;&#x6392;&#x5E8F;&#x7531;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x7684;&#x7279;&#x5B9A;&#x7A0B;&#x5E8F;&#x7684;&#x8BED;&#x53E5; &#x53EA;&#x8981;&#x8FD9;&#x4E2A;&#x91CD;&#x6392;&#x5E8F;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x8FD9;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x6267;&#x884C;&#x8BED;&#x4E49;&#x3002;(the JVM is allowed to reorder certain program statements executed by one thread as long as it does not change the serial semantics of the program for that particular thread)PS &#x8FD9;&#x91CC;&#x7B80;&#x5355;&#x8BF4;&#x4E0B;: </p>
<pre><code><span class="variable">a =</span> <span class="constant">true</span>
<span class="variable">y =</span> <span class="keyword">if</span> (b) <span class="number">0</span> <span class="keyword">else</span> <span class="number">1</span>
</code></pre><p>&#x548C;</p>
<pre><code><span class="variable">y =</span> <span class="keyword">if</span> (b) <span class="number">0</span> <span class="keyword">else</span> <span class="number">1</span>
<span class="variable">a =</span> <span class="constant">true</span>
</code></pre><p>&#x5BF9;&#x4E8E;&#x5E8F;&#x5217;&#x5316;&#x6267;&#x884C;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5E76;&#x6CA1;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#xFF08;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#x662F;&#x53EF;&#x4EE5;&#x91CD;&#x6392;&#x5E8F;&#xFF08;&#x4E0D;&#x9700;&#x8981;&#x6309;&#x7167;&#x6307;&#x4EE4;&#x7684;&#x6267;&#x884C;&#x987A;&#x5E8F;&#xFF09;</p>
<p>&#x56E0;&#x4E3A;&#x4E00;&#x4E9B;&#x5904;&#x7406;&#x5668;&#x4E0D;&#x603B;&#x662F;&#x4F1A;&#x6309;&#x7167;&#x7A0B;&#x5E8F;&#x7684;&#x6307;&#x4EE4;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x800C;&#x4E14; &#x7EBF;&#x7A0B;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x5C06;&#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x6539;&#x52A8;&#x7ACB;&#x9A6C;&#x5199;&#x5165;&#x4E3B;&#x5B58; &#x800C;&#x662F;&#x6682;&#x65F6;&#x5B58;&#x5728;&#x5904;&#x7406;&#x5668;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x7F13;&#x5B58;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x5316;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x5E76;&#x4E14;&#x5141;&#x8BB8;&#x66F4;&#x597D;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x4F18;&#x5316;&#x3002; </p>
<p>&#x4EE5;&#x4E0A;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x6211;&#x4EEC;&#x5047;&#x5B9A;&#x7EBF;&#x7A0B;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5199;&#x64CD;&#x4F5C;&#x90FD;&#x53EF;&#x4EE5;&#x7ACB;&#x9A6C;&#x88AB;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x770B;&#x5230;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5E94;&#x7528;&#x4E00;&#x4E9B;&#x5408;&#x9002;&#x7684;&#x540C;&#x6B65;&#x6765;&#x786E;&#x4FDD;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4FEE;&#x6539;&#x88AB;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x770B;&#x5230;&#x7684;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>
<p>&#x540C;&#x6B65;&#x5757;&#x662F;&#x5176;&#x4E2D;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x8FD9;&#x4E2A;&#x53EF;&#x89C1;&#x6027;&#x7684;&#x540C;&#x6B65;&#x65B9;&#x5F0F;&#x3002;&#x540C;&#x6B65;&#x5757;&#x4E0D;&#x4EC5;&#x786E;&#x4FDD;&#x539F;&#x5B50;&#x6027;&#x4E5F;&#x786E;&#x4FDD;&#x53EF;&#x89C1;&#x6027;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/5/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/4/">4</a><a class="page-number" href="/page/5/">5</a><span class="page-number current">6</span><a class="page-number" href="/page/7/">7</a><a class="page-number" href="/page/8/">8</a><span class="space">&hellip;</span><a class="page-number" href="/page/22/">22</a><a class="extend next" rel="next" href="/page/7/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>215</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/IT/" title="IT">IT<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Debian/" title="Debian">Debian<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/WildFly/" title="WildFly">WildFly<sup>3</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
