
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏 | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="1.&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x9700;&amp;#x6C42;&amp;#xFF1A;
&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x9700;&amp;#x6C42;&amp;#x662F;&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x8F">
<meta property="og:type" content="article">
<meta property="og:title" content="《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏">
<meta property="og:url" content="http://taojinke.github.io/2015/07/01/0358c4f/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="1.&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x9700;&amp;#x6C42;&amp;#xFF1A;
&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x9700;&amp;#x6C42;&amp;#x662F;&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x8F">
<meta property="og:updated_time" content="2015-07-01T15:29:50.438Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏">
<meta name="twitter:description" content="1.&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x9700;&amp;#x6C42;&amp;#xFF1A;
&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7684;&amp;#x7CFB;&amp;#x7EDF;&amp;#x9700;&amp;#x6C42;&amp;#x662F;&amp;#x5E94;&amp;#x7528;&amp;#x7A0B;&amp;#x5E8F;&amp;#x8F">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/0358c4f/" title="《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏" itemprop="url">《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:29:50.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			
		
		</div>
		
		<p>1.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF1A;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x67D0;&#x65B9;&#x9762;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x8B6C;&#x5982;&#x541E;&#x5410;&#x91CF;&#x3001;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3001;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x91CF;&#x3001;&#x53EF;&#x7528;&#x6027;&#x3001;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x7B49;&#x3002; JVM &#x6027;&#x80FD;&#x8C03;&#x4F18;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x5982;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF1A;</p>
<p>(1). &#x53EF;&#x7528;&#x6027;&#xFF1A;</p>
<p>&#x662F;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5904;&#x4E8E;&#x53EF;&#x64CD;&#x4F5C;&#x3001;&#x53EF;&#x4F7F;&#x7528;&#x72B6;&#x6001;&#x7684;&#x5EA6;&#x91CF;&#x3002;&#x53EF;&#x7528;&#x6027;&#x9700;&#x6C42;&#x6307;&#x7684;&#x662F;&#x5F53;&#x7A0B;&#x5E8F;&#x7684;&#x67D0;&#x4E9B;&#x7EC4;&#x4EF6;&#x53D1;&#x751F;&#x6545;&#x969C;&#x6216;&#x5931;&#x6548;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x591A;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x6D77;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;</p>
<p>Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x5229;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EC4;&#x4EF6;&#x5316;&#x3001;&#x5728;&#x591A;&#x4E2A; JVM &#x4E2D;&#x8FD0;&#x884C;&#x6216;&#x5728;&#x591A;&#x4E2A; JVM &#x4E0A;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x90FD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3002;&#x5F3A;&#x8C03;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x7684;&#x4EE3;&#x4EF7;&#x4E4B;&#x4E00;&#x662F;&#x7BA1;&#x7406;&#x6210;&#x672C;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5F15;&#x5165;&#x66F4;&#x591A;&#x7684; JVM &#x610F;&#x5473;&#x7740;&#x8981;&#x7BA1;&#x7406;&#x66F4;&#x591A;&#x7684; JVM &#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x589E;&#x52A0;&#x4EE5;&#x53CA;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x7684;&#x7BA1;&#x7406;&#x6210;&#x672C;&#x3002;</p>
<p>(2). &#x53EF;&#x7BA1;&#x7406;&#x6027;&#xFF1A;</p>
<p>&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x662F;&#x5BF9;&#x7531;&#x8FD0;&#x884C;&#x3001;&#x76D1;&#x63A7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x64CD;&#x4F5C;&#x6027;&#x5F00;&#x9500;&#x7684;&#x5EA6;&#x91CF;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#x3002;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x9700;&#x6C42;&#x7528;&#x4E8E;&#x8861;&#x91CF;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>(3). &#x541E;&#x5410;&#x91CF;&#xFF1A;</p>
<p>&#x541E;&#x5410;&#x91CF;&#x662F;&#x5806;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x5EA6;&#x91CF;&#x3002;&#x8BBE;&#x8BA1;&#x541E;&#x5410;&#x91CF;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x8003;&#x8651;&#x5B83;&#x5BF9;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x589E;&#x52A0;&#x541E;&#x5410;&#x91CF;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x5EF6;&#x8FDF;&#x7684;&#x589E;&#x52A0;&#x6216;&#x8005;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x7684;&#x589E;&#x52A0;&#x3002;</p>
<p>(4). &#x5EF6;&#x8FDF;&#x53CA;&#x54CD;&#x5E94;&#x6027;&#xFF1A;</p>
<p>&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x54CD;&#x5E94;&#x6027;&#x662F;&#x6307;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6536;&#x5230;&#x6307;&#x4EE4;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x76F4;&#x5230;&#x5B8C;&#x6210;&#x8BE5;&#x5DE5;&#x4F5C;&#x6240;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x7684;&#x5EA6;&#x91CF;&#x3002;</p>
<p>&#x5B9A;&#x4E49;&#x5EF6;&#x8FDF;&#x53CA;&#x54CD;&#x5E94;&#x6027;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x8003;&#x8651;&#x7A0B;&#x5E8F;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63D0;&#x9AD8;&#x54CD;&#x5E94;&#x6027;&#x6216;&#x7F29;&#x5C0F;&#x5EF6;&#x8FDF;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x66F4;&#x4F4E;&#x541E;&#x5410;&#x91CF;&#x3001;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5B58;&#x6D88;&#x8017; ( &#x6216;&#x8005;&#x4E8C;&#x8005;&#x540C;&#x65F6;&#x53D1;&#x751F; ) &#x3002;</p>
<p>(5). &#x5185;&#x5B58;&#x5360;&#x7528;&#xFF1A;</p>
<p>&#x5185;&#x5B58;&#x5360;&#x7528;&#x662F;&#x6307;&#x5728;&#x540C;&#x7B49;&#x7A0B;&#x5EA6;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3001;&#x5EF6;&#x8FDF;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5185;&#x5B58;&#x5360;&#x7528;&#x901A;&#x5E38;&#x4EE5;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684; java &#x5806;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x603B;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x6765;&#x8868;&#x8FF0;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x589E;&#x5927; java &#x5806;&#x7684;&#x65B9;&#x5F0F;&#x589E;&#x52A0;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x541E;&#x5410;&#x91CF;&#x3001;&#x964D;&#x4F4E;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x517C;&#x987E;&#x4E8C;&#x8005;&#x3002;</p>
<p>(6). &#x542F;&#x52A8;&#x65F6;&#x95F4;&#xFF1A;</p>
<p>&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x3002;&#x6B64;&#x5916;&#xFF0C; java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x6307;&#x6807;&#x662F;&#x73B0;&#x4EE3; JVM &#x5B8C;&#x6210;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x70ED;&#x533A;&#x4F18;&#x5316;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E;&#x5F88;&#x591A;&#x56E0;&#x7D20;&#xFF0C;&#x5305;&#x62EC; ( &#x4F46;&#x4E0D;&#x9650;&#x4E8E; ) &#xFF1A;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x8F7D;&#x5165;&#x7684;&#x7C7B;&#x7684;&#x6570;&#x91CF;&#x3001;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x91CF;&#x3001;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5982;&#x4F55;&#x521D;&#x59CB;&#x5316;&#x4EE5;&#x53CA; HotSpot&#xA0;VM &#x7684;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#x9009;&#x62E9;&#xFF0C;&#x5373; Client &#x6A21;&#x5F0F;&#x8FD8;&#x662F; Server &#x6A21;&#x5F0F;&#x3002;</p>
<p>2.JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#xFF1A;</p>
<p>JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x7684;&#x9009;&#x62E9;&#x662F;&#x6307;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5230;&#x5355;&#x4E2A; JVM &#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x90E8;&#x7F72;&#x5230;&#x591A;&#x4E2A; JVM &#x5B9E;&#x4F8B;&#x4E0A;&#x3002;</p>
<p>(1). &#x5355; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#xFF1A;</p>
<p>&#x5C06; java &#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5728;&#x5355;&#x4E2A; JVM &#x4E0A;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x591A;&#x4E2A; JVM &#xFF0C;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x7BA1;&#x7406;&#x6210;&#x672C;&#xFF0C;&#x6B64;&#x5916;&#x6BCF;&#x4E2A;&#x90E8;&#x7F72;&#x7684; JVM &#x90FD;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x5F00;&#x9500;&#xFF0C;&#x4F7F;&#x7528;&#x5355; JVM &#x907F;&#x514D;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6D88;&#x8017;&#x7684;&#x603B;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x4F1A;&#x51CF;&#x5C11;&#x3002;</p>
<p>&#x5355; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x5B58;&#x5728;&#x5355;&#x70B9;&#x6545;&#x969C;&#xFF0C;&#x5373;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x906D;&#x9047;&#x707E;&#x96BE;&#x6027;&#x9519;&#x8BEF;&#x6216; JVM &#x5931;&#x6548;&#x65F6;&#xFF0C;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x8D85;&#x8FC7;&#x4E86; 32 &#x4F4D; JVM &#x5904;&#x7406;&#x80FD;&#x529B;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528; 64 &#x4F4D; JVM &#xFF0C;&#x9700;&#x8981;&#x786E;&#x8BA4;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6A21;&#x5757;&#x662F;&#x5426;&#x652F;&#x6301; 64 &#x4F4D; JVM &#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x4F7F;&#x7528;&#x4E86; JNI &#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528; 64 &#x4F4D;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x3002;</p>
<p>(2). &#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#xFF1A;</p>
<p>&#x5C06; java &#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5230;&#x591A;&#x4E2A; JVM &#x5B9E;&#x4F8B;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x91C7;&#x7528;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x5355;&#x4E00;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216; JVM &#x5B9E;&#x4F8B;&#x7684;&#x5931;&#x6548;&#x53EA;&#x4F1A;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x3002;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x5728;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C; java &#x5806;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x8F83;&#x5C0F;&#x7684;&#x5806;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x505C;&#x987F;&#x66F4;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x63D0;&#x4F9B;&#x66F4;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x91C7;&#x7528;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x7531;&#x4E8E;&#x5C06;&#x8D1F;&#x8377;&#x5206;&#x53D1;&#x5230;&#x591A;&#x4E2A; JVM &#xFF0C;&#x80FD;&#x591F;&#x6539;&#x5584;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5904;&#x7406;&#x66F4;&#x9AD8;&#x8D1F;&#x8377;&#xFF0C;&#x63D0;&#x4F9B;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>3.JVM &#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#xFF1A;</p>
<p>(1).Client/Server &#x6A21;&#x5F0F;&#xFF1A;</p>
<p>A.Client &#x6A21;&#x5F0F;&#xFF1A;&#x7279;&#x70B9;&#x662F;&#x542F;&#x52A8;&#x5FEB;&#x3001;&#x5360;&#x7528;&#x5185;&#x5B58;&#x5C11;&#x3001; JIT &#x7F16;&#x8BD1;&#x5668;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x901F;&#x5EA6;&#x4E5F;&#x66F4;&#x5FEB;&#xFF0C;&#x4F46;&#x662F; JIT &#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x7684;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x4E0D;&#x5982; Server &#x6A21;&#x5F0F;&#x9AD8;&#x3002;</p>
<p>B.Server &#x6A21;&#x5F0F;&#xFF1A; JIT &#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x9700;&#x8981;&#x6D88;&#x8017;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x4EE5;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#xFF0C;&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x66F4;&#x957F;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x751F;&#x6210;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x673A;&#x5668;&#x7801;&#x3002;</p>
<p>C.Tiered&#xA0;Server &#x6A21;&#x5F0F;&#xFF1A;&#x5728; JDK7 &#x4E2D;&#x6B63;&#x5F0F;&#x53D1;&#x5E03;&#xFF0C;&#x7ED3;&#x5408;&#x4E86; Client &#x548C; Server &#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x5373;&#x5FEB;&#x901F;&#x542F;&#x52A8;&#x548C;&#x9AD8;&#x6548;&#x7684;&#x751F;&#x6210;&#x7801;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7684;&#x662F; java7 &#x6216;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#x7684; JVM &#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; &#x201D;-server&#xA0;-XX:+TieredCompilation&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x542F;&#x52A8; Tiered&#xA0;Server &#x6A21;&#x5F0F;&#x3002;</p>
<p>(2).32 &#x4F4D; /64 &#x4F4D;&#xFF1A;</p>
<p>HotSpot&#xA0;VM &#x9ED8;&#x8BA4;&#x4F7F;&#x7528; 32 &#x4F4D;&#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x914D;&#x7F6E;&#x3001;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x662F;&#x5426;&#x652F;&#x6301; 64 &#x4F4D; JVM &#x4EE5;&#x53CA; JNI &#x662F;&#x5426;&#x4F7F;&#x7528; 64 &#x4F4D;&#x7F16;&#x8BD1;&#x4E5F;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x9002;&#x5408;&#x4F7F;&#x7528; 64 &#x4F4D; JVM &#x3002;</p>
<p>A.32 &#x4F4D; JVM &#xFF1A;</p>
<p>&#x9ED8;&#x8BA4;&#x7684; HotSpot&#xA0;VM &#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#xFF0C; java &#x5806;&#x5185;&#x5B58;&#x5C0F;&#x4E8E; 2G &#x7684;&#x63A8;&#x8350;&#x9009;&#x62E9;&#x3002;</p>
<p>B.64 &#x4F4D; JVM &#xFF1A;</p>
<p>&#x5F53; java &#x5806;&#x4ECB;&#x4E8E; 2G~32G &#x65F6;&#xFF0C;&#x4F7F;&#x7528; &#x201D;-d64&#xA0;-XX:+UseCompressedOops&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x7684; 64 &#x4F4D; JVM &#x3002;</p>
<p>&#x5F53; java &#x5806;&#x5927;&#x4E8E; 32G &#x65F6;&#xFF0C;&#x4F7F;&#x7528; &#x201D;-d64&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x7684; 64 &#x4F4D; JVM &#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x4F7F;&#x7528;&#x201D;&#xA0;-XX:+UseCompressedOops&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x7684; HotSpot&#xA0;VM &#xFF0C;&#x6700;&#x5927; java &#x5806;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; 26G &#x65F6;&#x6027;&#x80FD;&#x6700;&#x597D;&#xFF0C; java6&#xA0;Update18 &#x4E4B;&#x540E;&#x7684; HotSpot&#xA0;VM &#x80FD;&#x6839;&#x636E;&#x6700;&#x5927; java &#x5806;&#x7684;&#x60C5;&#x51B5;&#x81EA;&#x52A8;&#x542F;&#x7528;&#x5B83;&#x3002;</p>
<p>(3). &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x9009;&#x62E9;&#xFF1A;</p>
<p>JVM &#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x9009;&#x62E9;&#x4E5F;&#x5F71;&#x54CD;&#x7740;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF0C; HotSpot&#xA0;VM &#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528; Throughput &#x6216; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7CFB;&#x7EDF;&#x5BF9;&#x541E;&#x5410;&#x91CF;&#x3001;&#x54CD;&#x5E94;&#x6027;&#x7B49;&#x9700;&#x6C42;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>4.&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x57FA;&#x7840;&#xFF1A;</p>
<p>(1). &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x7684;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#xFF1A;</p>
<p>A.&#x541E;&#x5410;&#x91CF;&#xFF1A;</p>
<p>&#x8BC4;&#x4EF7;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#x4E4B;&#x4E00;&#xFF0C;&#x6307;&#x4E0D;&#x8003;&#x8651;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F15;&#x8D77;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6216;&#x5185;&#x5B58;&#x6D88;&#x8017;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x80FD;&#x652F;&#x6491;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FBE;&#x5230;&#x7684;&#x6700;&#x9AD8;&#x6027;&#x80FD;&#x6307;&#x6807;&#x3002;</p>
<p>B.&#x5EF6;&#x8FDF;&#xFF1A;</p>
<p>&#x4E5F;&#x662F;&#x8BC4;&#x4EF7;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x80FD;&#x529B;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#xFF0C;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x662F;&#x7F29;&#x77ED;&#x7531;&#x4E8E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F15;&#x8D77;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6216;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x56E0;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x505C;&#x987F;&#xFF0C;&#x907F;&#x514D;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x53D1;&#x751F;&#x6296;&#x52A8;&#x3002;</p>
<p>C.&#x5185;&#x5B58;&#x5360;&#x7528;&#xFF1A;</p>
<p>&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x6D41;&#x7545;&#x8FD0;&#x884C;&#x6240;&#x9700;&#x8981;&#x7684;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x4E0A;&#x8FF0; 3 &#x4E2A;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x63D0;&#x9AD8;&#xFF0C;&#x90FD;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#x5E26;&#x6765;&#x635F;&#x5931;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x6839;&#x636E;&#x5E94;&#x7528;&#x573A;&#x666F;&#x786E;&#x5B9A;&#x4E0A;&#x8FF0;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p>
<p>(2). &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.Minor&#xA0;GC &#x56DE;&#x6536;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x6BCF;&#x6B21; Minor&#xA0;GC &#x90FD;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x6536;&#x96C6;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#xFF0C;&#x9075;&#x5FAA;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x53EF;&#x4EE5;&#x51CF;&#x5C11; Full&#xA0;GC &#x7684;&#x9891;&#x7387;&#xFF0C; Full&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x603B;&#x662F;&#x6700;&#x957F;&#x7684;&#xFF0C;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x5176;&#x5EF6;&#x8FDF;&#x6216;&#x541E;&#x5410;&#x91CF;&#x8981;&#x6C42;&#x7684;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#x3002;</p>
<p>B.GC &#x5185;&#x5B58;&#x6700;&#x5927;&#x5316;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x5904;&#x7406;&#x541E;&#x5410;&#x91CF;&#x548C;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5783;&#x573E;&#x5904;&#x7406;&#x5668;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x8D8A;&#x5927;&#xFF0C;&#x5373; java &#x5806;&#x7A7A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6548;&#x679C;&#x8D8A;&#x597D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E5F;&#x7EA6;&#x6D41;&#x7545;&#x3002;</p>
<p>C.GC &#x8C03;&#x4F18;&#x7684; 3 &#x9009; 2 &#x539F;&#x5219;&#xFF1A;</p>
<p>&#x5728;&#x4E09;&#x4E2A;&#x6027;&#x80FD;&#x5C5E;&#x6027; ( &#x541E;&#x5410;&#x91CF;&#x3001;&#x5EF6;&#x8FDF;&#x548C;&#x5185;&#x5B58;&#x5360;&#x7528; ) &#x4E2D;&#x4EFB;&#x610F;&#x9009;&#x62E9;&#x4E24;&#x4E2A;&#x8FDB;&#x884C; JVM &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x3002;</p>
<p>5.&#x786E;&#x5B9A;&#x5185;&#x5B58;&#x5360;&#x7528;&#xFF1A;</p>
<p>(1). &#x8BA1;&#x7B97;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x6307;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x957F;&#x671F;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684; java &#x5806;&#x5185;&#x5B58;&#x91CF;&#xFF0C;&#x5373;&#x5B83;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E8E;&#x7A33;&#x5B9A;&#x6001;&#x65F6;&#xFF0C; Full&#xA0;GC &#x4E4B;&#x540E; java &#x5806;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F; ( &#x5305;&#x62EC;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E; ) &#x3002;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x662F;&#x786E;&#x5B9A;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700; java &#x5806;&#x5927;&#x5C0F;&#x7684;&#x5207;&#x5165;&#x70B9;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5EA6;&#x91CF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x591A;&#x6B21; Full&#xA0;GC &#x4E4B;&#x540E;&#x5728;&#x67E5;&#x770B; java &#x5806;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x786E;&#x4FDD; Full&#xA0;GC &#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6B63;&#x5904;&#x4E8E;&#x7A33;&#x5B9A;&#x6001;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x53D1;&#x751F; Full&#xA0;GC &#x6216;&#x8005;&#x4E0D;&#x7ECF;&#x5E38;&#x53D1;&#x751F; Full&#xA0;GC &#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; JConsole &#x3001; VisualVM &#x6216;&#x8005; jmap( &#x9700;&#x8981;&#x4F7F;&#x7528; &#x201D;jmap&#xA0;-histo:live&#xA0;PID&#x201D;&#x547D;&#x4EE4; ) &#x4EBA;&#x5DE5;&#x89E6;&#x53D1; Full&#xA0;GC &#x3002;</p>
<p>(2). &#x521D;&#x59CB;&#x5806;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x914D;&#x7F6E;&#xFF1A;</p>
<p>&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x521D;&#x59CB;&#x5806;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x914D;&#x7F6E;&#x7684;&#x901A;&#x7528;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.java &#x5806;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -Xmx &#x548C; -Xms &#x5C06; java &#x5806;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 3~4 &#x500D;&#x3002;</p>
<p>B.&#x6C38;&#x4E45;&#x4EE3;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -XX:PermSize &#x548C; -XX:MaxPermSize &#x5C06;&#x6C38;&#x4E45;&#x4EE3;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x6C38;&#x4E45;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1.2~1.5 &#x500D;&#x3002;</p>
<p>C.&#x65B0;&#x751F;&#x4EE3;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -Xmn &#x5C06;&#x65B0;&#x751F;&#x4EE3;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1~1.5 &#x500D;&#x3002;</p>
<p>D.&#x8001;&#x5E74;&#x4EE3;&#xFF1A;</p>
<p>&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5927;&#x5C0F; =java &#x5806; - &#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x5E94;&#x8BBE;&#x7F6E;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 2~3 &#x500D;&#x3002;</p>
<p>6.&#x8C03;&#x4F18;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#xFF1A;</p>
<p>(1). &#x786E;&#x5B9A;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#xFF1A;</p>
<p>A.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x5E73;&#x5747;&#x505C;&#x6EDE;&#x65F6;&#x95F4;&#x3002;</p>
<p>B.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684; Minor&#xA0;GC( &#x4F1A;&#x5BFC;&#x81F4;&#x5EF6;&#x8FDF; ) &#x9891;&#x7387;&#x3002;</p>
<p>C.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x5927;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;</p>
<p>D.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x5927;&#x505C;&#x987F;&#x53D1;&#x751F;&#x9891;&#x7387;&#x3002;</p>
<p>(2). &#x8BC4;&#x4F30;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5BF9;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#xFF1A;</p>
<p>A.&#x6D4B;&#x91CF; Minor&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>B.&#x7EDF;&#x8BA1; Minor&#xA0;GC &#x7684;&#x9891;&#x7387;&#x3002;</p>
<p>C.&#x6D4B;&#x91CF; Full&#xA0;GC &#x7684;&#x6700;&#x5DEE; ( &#x6700;&#x957F; ) &#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>D.&#x7EDF;&#x8BA1;&#x6700;&#x5DEE;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; Full&#xA0;GC &#x7684;&#x9891;&#x7387;&#x3002;</p>
<p>(3). &#x4F18;&#x5316;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>Minor&#xA0;GC &#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x53CA;&#x9891;&#x7387;&#x4E0E;&#x65B0;&#x751F;&#x4EE3;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x8D8A;&#x5C0F;&#xFF0C; Minor&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8D8A;&#x77ED;&#xFF0C;&#x4F46;&#x662F; Minor&#xA0;GC &#x7684;&#x9891;&#x7387;&#x4F1A;&#x8D8A;&#x5927;&#xFF1B;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C; Minor&#xA0;GC &#x7684;&#x53D1;&#x751F;&#x9891;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x4F46;&#x662F; Minor&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#x3002;</p>
<p>&#x8C03;&#x6574;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E0D;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1.5 &#x500D;&#xFF0C;&#x5728;&#x56E0;&#x8C03;&#x6574; Minor&#xA0;GC &#x6301;&#x7EED;&#x65F6;&#x95F4;&#x548C;&#x9891;&#x7387;&#x800C;&#x8C03;&#x6574;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x65F6;&#xFF0C;&#x8981;&#x786E;&#x4FDD;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x540C;&#x6B65;&#x8C03;&#x6574; java &#x5806;&#x548C;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x3002;</p>
<p>B. &#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x81F3;&#x5C11;&#x5E94;&#x4E3A; java &#x5806;&#x5927;&#x5C0F;&#x7684; 10% &#x3002;</p>
<p>C.java &#x5806;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>java &#x5806;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E0D;&#x8981;&#x8D85;&#x8FC7; JVM &#x53EF;&#x7528;&#x7269;&#x7406;&#x5185;&#x5B58;&#x3002;</p>
<p>(4). &#x4F18;&#x5316;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x53D1;&#x751F;&#x4E8E;&#x7A33;&#x5B9A;&#x6001;&#x7684; Full&#xA0;GC &#x6301;&#x7EED;&#x65F6;&#x95F4;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x5DEE; Full&#xA0;GC &#x6301;&#x7EED;&#x65F6;&#x95F4;&#xFF0C; Full&#xA0;GC &#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x662F;&#x6700;&#x5DEE; Full&#xA0;GC &#x9891;&#x7387;&#x3002;</p>
<p>&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x65F6;&#xFF0C;&#x786E;&#x4FDD;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x540C;&#x6B65;&#x8C03;&#x6574; java &#x5806;&#x5927;&#x5C0F;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x3002;</p>
<p>B.Full&#xA0;GC &#x9891;&#x7387;&#x7684;&#x9884;&#x4F30;&#x5E94;&#x8BE5;&#x4F9D;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x63D0;&#x5347;&#x7387;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF1A;</p>
<p>&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x7387;&#x662F;&#x5BF9;&#x8C61;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x590D;&#x5236;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x5BF9;&#x8C61;&#x7684;&#x6BD4;&#x7387;&#xFF0C;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x89C2;&#x5BDF; Full&#xA0;GC &#x4E4B;&#x524D;&#x7684;&#x8FDE;&#x7EED;&#x591A;&#x4E2A; Minor&#xA0;GC &#x4E2D;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x8BA1;&#x7B97;&#x76F8;&#x90BB; Minor&#xA0;GC &#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#xFF0C;&#x8BA1;&#x7B97; Minor&#xA0;GC &#x5BF9;&#x8C61;&#x5E73;&#x5747;&#x63D0;&#x5347;&#x901F;&#x5EA6; = &#x76F8;&#x90BB; Minor&#xA0;GC &#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528; /Minor&#xA0;GC &#x95F4;&#x9694;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#xFF0C;&#x4F30;&#x7B97; Full&#xA0;GC &#x9891;&#x7387; = &#x8001;&#x5E74;&#x4EE3;&#x5269;&#x4F59;&#x7A7A;&#x95F4; /Minor&#xA0;GC &#x5BF9;&#x8C61;&#x5E73;&#x5747;&#x63D0;&#x5347;&#x901F;&#x5EA6;&#x3002;</p>
<p>7.CMS &#x8C03;&#x4F18;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#xFF1A;</p>
<p>CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E2D; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x4E0E; Full&#xA0;GC &#x6709;&#x7EC6;&#x5FAE;&#x533A;&#x522B;&#xFF1A;&#x82E5;&#x8001;&#x5E74;&#x4EE3;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7A7A;&#x95F4;&#x5904;&#x7406;&#x6765;&#x81EA;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5373;&#x8001;&#x5E74;&#x4EE3;&#x6EA2;&#x51FA;&#xFF0C;&#x5219;&#x53EA;&#x4F1A;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x89E6;&#x53D1;&#x4E00;&#x6B21; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF1B;&#x53D1;&#x751F; Full&#xA0;GC &#x65F6;&#xFF0C;&#x89E6;&#x53D1;&#x4F7F;&#x7528;&#x4E86; -XX:-ScavengeBeforeFullGC &#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x5426;&#x5219;&#x8001;&#x5E74;&#x4EE3;&#x548C;&#x65B0;&#x751F;&#x4EE3;&#x90FD;&#x4F1A;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;</p>
<p>&#x7531;&#x4E8E; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x5BF9;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#xFF0C;&#x8017;&#x65F6;&#x6BD4;&#x8F83;&#x957F;&#xFF0C;&#x56E0;&#x6B64;&#x8C03;&#x4F18; CMS &#x6536;&#x96C6;&#x5668;&#x7684;&#x76EE;&#x7684;&#x662F;&#x907F;&#x514D; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x3002;</p>
<p>(1). &#x8C03;&#x7528;&#x65B0;&#x751F;&#x4EE3;&#x7684; Survivor &#x7A7A;&#x95F4;&#xFF1A;</p>
<p>HotSpot&#xA0;VM &#x7684;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x4E09;&#x90E8;&#x5206;&#xFF1A; Eden &#x3001; Survivor&#xA0;From &#x548C; Survivor&#xA0;To &#xFF0C;&#x5176;&#x4E2D; Survivor&#xA0;From &#x548C; Survivor&#xA0;To &#x662F;&#x76F8;&#x4E92;&#x4E92;&#x6362;&#x7684;&#xFF0C;&#x65B0;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x901A;&#x5E38;&#x5B58;&#x653E;&#x5728; Eden &#x548C; Survivor&#xA0;From &#x4E2D;&#xFF0C; Minor&#xA0;GC &#x4E4B;&#x540E;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x5B58;&#x653E;&#x5728; Survivor&#xA0;To &#x4E2D;&#xFF0C;&#x5408;&#x9002;&#x5927;&#x5C0F;&#x7684; Survivor &#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97; Minor&#xA0;GC &#x56DE;&#x6536;&#x6700;&#x591A;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#xFF0C;&#x907F;&#x514D;&#x77ED;&#x671F;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x589E;&#x52A0;&#x8001;&#x5E74;&#x4EE3;&#x788E;&#x7247;&#x3002;</p>
<p>A.Survivor &#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7; -XX:SurvivorRation=&lt;ration&gt; &#x9009;&#x9879;&#x6765;&#x63A7;&#x5236;&#xFF0C;</p>
<p>Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F; =-Xmn&lt;value&gt;/(-XX:SurvivorRation=&lt;ration&gt;+2) &#x3002;</p>
<p>B.Survivor &#x7A7A;&#x95F4;&#x8C03;&#x6574;&#xFF1A;</p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x65B0;&#x751F;&#x4EE3;&#xFF0C;&#x51CF;&#x5C11; Survivor &#x6BD4;&#x7387;&#x4F1A;&#x589E;&#x5927; Survivor &#x7A7A;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x51CF;&#x5C11; Eden &#x7A7A;&#x95F4;&#xFF0C;&#x5BFC;&#x81F4;&#x66F4;&#x9891;&#x7E41;&#x7684; Minor&#xA0;GC &#xFF0C;&#x5373;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x9891;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x7684;&#x901F;&#x5EA6;&#x8D8A;&#x5FEB;&#xFF1B;&#x589E;&#x5927; Survivor &#x6BD4;&#x7387;&#x4F1A;&#x51CF;&#x5C11; Survivor &#x7A7A;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x589E;&#x5927; Eden &#x7A7A;&#x95F4;&#xFF0C;&#x51CF;&#x5C11; Minor&#xA0;GC &#x9891;&#x7387;&#xFF0C;&#x5373;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x9891;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x7684;&#x901F;&#x5EA6;&#x8D8A;&#x6162;&#x3002;</p>
<p>C.&#x8C03;&#x6574; Survivor &#x7A7A;&#x95F4;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x82E5;&#x53EF;&#x4EE5;&#x589E;&#x52A0; Minor&#xA0;GC &#x9891;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4E00;&#x90E8;&#x5206; Eden &#x7A7A;&#x95F4;&#x6765;&#x589E;&#x5927; Survivor &#x7A7A;&#x95F4;&#xFF1B;&#x82E5;&#x5185;&#x5B58;&#x8DB3;&#x591F;&#xFF0C;&#x6700;&#x597D;&#x589E;&#x52A0;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x4FDD;&#x6301; Eden &#x7A7A;&#x95F4;&#x6052;&#x5B9A;&#x7684;&#x540C;&#x65F6;&#x589E;&#x52A0; Survivor &#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x8C03;&#x6574; Survivor &#x7A7A;&#x95F4;&#x8981;&#x548C;&#x76D1;&#x63A7;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#x4E00;&#x8D77;&#x914D;&#x5408;&#x3002;</p>
<p>(2). &#x8C03;&#x6574;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF1A;</p>
<p>&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5E74;&#x9F84;&#x662F;&#x5B83;&#x6240;&#x7ECF;&#x5386;&#x7684; Minor&#xA0;GC &#x6B21;&#x6570;&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x4E2D;&#x5E74;&#x9F84;&#x5927;&#x4E8E;&#x664B;&#x5347;&#x9600;&#x503C;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4F1A;&#x88AB;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#xFF0C;&#x5373;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#x51B3;&#x5B9A;&#x4E86;&#x5BF9;&#x8C61;&#x5728;&#x65B0;&#x751F;&#x4EE3; Survivor &#x7A7A;&#x95F4;&#x4FDD;&#x7559;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x4E2D;&#x7684;&#x6709;&#x6548;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5C06;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x7387;&#x589E;&#x957F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x964D;&#x4F4E;&#x4E86; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x6267;&#x884C;&#x9891;&#x7387;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x53EF;&#x80FD;&#x7684;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x788E;&#x7247;&#x3002;</p>
<p>A.&#x76D1;&#x63A7;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -XX:+PrintTenuringDistribution &#x9009;&#x9879;&#x53EF;&#x4EE5;&#x76D1;&#x63A7;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x7684;&#x53D1;&#x5E03;&#x6216;&#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x53D1;&#x5E03;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>Desired&#xA0;survivor&#xA0;size&#xA0;3506176&#xA0;bytes,&#xA0;new&#xA0;threshold&#xA0;1&#xA0;(max&#xA0;15)</p>
<p>-&#xA0;age&#xA0;&#xA0;&#xA0;1:&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;bytes,&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;total</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#x9ED8;&#x8BA4;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x4E3A;15 &#xFF0C;&#x7531; (max&#xA0;15)&#x6807;&#x8BC6;&#xFF1B;&#x901A;&#x8FC7;new&#xA0;threshold&#xA0;1&#xA0;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x865A;&#x62DF;&#x673A;&#x5185;&#x90E8;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x4E3A;1 &#xFF1B; Desired&#xA0;survivor&#xA0;size&#xA0;3506176&#xA0;bytes&#x662F;Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E58;&#x4EE5;&#x76EE;&#x6807;&#x5B58;&#x6D3B;&#x7387; ( &#x7531; -XX:TargetSurvivorRation=&lt;percent&gt; &#x9009;&#x9879;&#x63A7;&#x5236;&#xFF0C;&#x9ED8;&#x8BA4;&#x662F; 50) &#x5F97;&#x5230;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF1B; -&#xA0;age&#xA0;&#xA0;&#xA0;1:&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;bytes,&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;total&#x662F;&#x6BCF;&#x4E2A;&#x5E74;&#x9F84;&#x6BB5;&#x5BF9;&#x8C61;&#x53CA;&#x5176;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x5355;&#x72EC;&#x5217;&#x4E3A;&#x4E00;&#x884C;&#x3002;</p>
<p>&#x7531;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x770B;&#x51FA;&#x671F;&#x671B;&#x7684;Survivor &#x7A7A;&#x95F4; 3506176&#xA0;bytes&#x8FDC;&#x5C0F;&#x4E8E;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;7012344&#xA0;bytes&#xFF0C;&#x5BFC;&#x81F4;Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97; Minor&#xA0;GC &#x5C06;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x3002;</p>
<p>&#x89C2;&#x5BDF;&#x5230; Survivor &#x7A7A;&#x95F4;&#x8FC7;&#x5C0F;&#x65F6;&#xFF0C;&#x8C03;&#x6574; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x4F7F;&#x5F97;&#x603B;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;&#x671F;&#x671B;&#x7684; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;&#x4F7F;&#x5F97;&#x664B;&#x5347;&#x9600;&#x503C;&#x7B49;&#x4E8E;&#x6700;&#x5927;&#x664B;&#x5347;&#x9600;&#x503C;&#x3002;</p>
<p>B.&#x8C03;&#x6574;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -XX:MaxTenuringThreshold=&lt;n&gt; &#x9009;&#x9879;&#x6307;&#x5B9A; HotSpot&#xA0;VM &#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x6700;&#x5927;&#x664B;&#x5347;&#x9600;&#x503C;&#xFF0C;&#x5F53;&#x76EE;&#x6807; Survivor &#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; HotSpot&#xA0;VM &#x671F;&#x671B;&#x7EF4;&#x62A4;&#x7684;&#x503C;&#x65F6;&#xFF0C; HotSpot&#xA0;VM &#x5C06;&#x4F7F;&#x7528;&#x6700;&#x5927;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x4F5C;&#x4E3A;&#x5176;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#xFF1B;&#x5F53;&#x76EE;&#x6807; Survivor &#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x5927;&#x4E8E; HotSpot&#xA0;VM &#x671F;&#x671B;&#x7EF4;&#x62A4;&#x7684;&#x503C;&#x65F6;&#xFF0C; HotSpot&#xA0;VM &#x5C06;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x4F4E;&#x4E8E;&#x6700;&#x5927;&#x9600;&#x503C;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x6765;&#x4FDD;&#x8BC1;&#x76EE;&#x6807; Survivor &#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x4E0D;&#x5EFA;&#x8BAE;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A; 0 &#xFF0C;&#x8FD9;&#x4F1A;&#x9020;&#x6210;&#x521A;&#x521A;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x5728;&#x968F;&#x540E;&#x7684; Minor&#xA0;GC &#x4E2D;&#x76F4;&#x63A5;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x5F15;&#x8D77;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x8FC5;&#x901F;&#x589E;&#x957F;&#xFF0C;&#x5BFC;&#x81F4;&#x9891;&#x7E41;&#x7684; Full&#xA0;GC &#xFF1B;</p>
<p>&#x4E5F;&#x4E0D;&#x5EFA;&#x8BAE;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x8FDC;&#x5927;&#x4E8E;&#x5B9E;&#x9645;&#x53EF;&#x80FD;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x8FD9;&#x4F1A;&#x9020;&#x6210;&#x5BF9;&#x8C61;&#x957F;&#x671F;&#x5B58;&#x5728;&#x4E8E; Survivor &#x7A7A;&#x95F4;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E; Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x4E00;&#x65E6; Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x5BF9;&#x8C61;&#x5C06;&#x88AB;&#x5168;&#x90E8;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x4E0D;&#x518D;&#x4F9D;&#x636E;&#x5176;&#x5B9E;&#x9645;&#x5E74;&#x9F84;&#x8FDB;&#x884C;&#x63D0;&#x5347;&#xFF0C;&#x5BFC;&#x81F4;&#x77ED;&#x671F;&#x5BF9;&#x8C61;&#x5728;&#x957F;&#x671F;&#x5BF9;&#x8C61;&#x4E4B;&#x524D;&#x88AB;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x673A;&#x5236;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;</p>
<p>(3). &#x8C03;&#x7528;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#xFF1A;</p>
<p>CMS &#x7684;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x548C;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#x8C03;&#x6574;&#x597D;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5927;&#x90E8;&#x5206;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#x5728; Minor&#xA0;GC &#x65F6;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x8BC1;&#x5BF9;&#x8C61;&#x6709;&#x6548;&#x8001;&#x5316;&#xFF0C;&#x5373;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#x589E;&#x957F;&#x53EF;&#x63A7;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x8981;&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x907F;&#x514D;&#x8001;&#x5E74;&#x4EE3;&#x53D1;&#x751F; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x3002;</p>
<p>&#x6210;&#x529F;&#x7684; CMS &#x6536;&#x96C6;&#x5668;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x8981;&#x80FD;&#x4EE5;&#x5BF9;&#x8C61;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x540C;&#x7B49;&#x901F;&#x5EA6;&#x5BF9;&#x8001;&#x5E74;&#x4EE3;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x8FBE;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x5219;&#x79F0;&#x4E4B;&#x4E3A; &#x201D;&#x5931;&#x901F;&#x201D;(Lost&#xA0;the&#xA0;race) &#xFF0C;&#x5931;&#x901F;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x53D1;&#x751F; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x3002;&#x907F;&#x514D;&#x5931;&#x901F;&#x7684;&#x5173;&#x952E;&#x662F;&#x8981;&#x7ED3;&#x5408;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x548C;&#x8DB3;&#x591F;&#x5FEB;&#x5730;&#x521D;&#x59CB;&#x5316; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#xFF0C;&#x8BA9;&#x5B83;&#x6BD4;&#x63D0;&#x5347;&#x901F;&#x7387;&#x66F4;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x56DE;&#x6536;&#x7A7A;&#x95F4;&#x3002;</p>
<p>CMS &#x5468;&#x671F;&#x7684;&#x521D;&#x59CB;&#x5316;&#x5468;&#x671F;&#x57FA;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C; CMS &#x5F00;&#x59CB;&#x7684;&#x592A;&#x665A;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x5931;&#x901F;&#xFF1B;&#x4F46;&#x662F;&#x5982;&#x679C; CMS &#x5468;&#x671F;&#x542F;&#x52A8;&#x7684;&#x592A;&#x65E9;&#xFF0C;&#x53C8;&#x4F1A;&#x5F15;&#x8D77;&#x65E0;&#x7528;&#x7684;&#x6D88;&#x8017;&#xFF0C;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>HotSpot&#xA0;VM &#x4F1A;&#x5C1D;&#x8BD5;&#x81EA;&#x9002;&#x5E94;&#x7B2C;&#x8BA1;&#x7B97;&#x5728;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x591A;&#x5927;&#x65F6;&#x5F00;&#x542F; CMS &#x6536;&#x96C6;&#x5468;&#x671F;&#xFF0C;&#x4F46;&#x662F;&#x505A;&#x7684;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x4F1A;&#x51FA;&#x73B0; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF0C;&#x901A;&#x8FC7;&#x5728; GC &#x65E5;&#x5FD7;&#x4E2D;&#x67E5;&#x627E;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#x5931;&#x6548; (Concurrent&#xA0;Mode&#xA0;Failure) &#x5B9A;&#x4F4D; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x914D;&#x7F6E;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#x4EE5;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#xFF1A;</p>
<p>A.-XX:CMSInitiatingOccupancyFraction=&lt;percent&gt; &#xFF1A;</p>
<p>&#x8BBE;&#x5B9A;&#x7684;&#x503C;&#x662F; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x8FBE;&#x5230;&#x591A;&#x5C11;&#x767E;&#x5206;&#x6BD4;&#x65F6;&#x542F;&#x52A8;&#xFF0C;&#x4EC5;&#x5728;&#x7B2C;&#x4E00;&#x4E2A; CMS &#x5468;&#x671F;&#x4E2D;&#x4F7F;&#x7528;&#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#xFF0C;&#x4E4B;&#x540E;&#x5468;&#x671F;&#x53C8;&#x8F6C;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x7684;&#x539F;&#x5219;&#x4E3A;&#x81F3;&#x5C11;&#x5E94;&#x8BE5;&#x662F;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1.5 &#x500D;&#x3002;</p>
<p>B.-XX:+UseCMSInitiatingOccupancyOnly &#xFF1A;</p>
<p>&#x4E0E; -XX:CMSInitiatingOccupancyFraction=&lt;percent&gt; &#x9009;&#x9879;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x544A;&#x77E5; HotSpot&#xA0;VM &#x603B;&#x662F;&#x4F7F;&#x7528; -XX:CMSInitiatingOccupancyFraction=&lt;percent&gt; &#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#x4F5C;&#x4E3A;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x7684;&#x9600;&#x503C;&#x3002;</p>
<p>(4). &#x8C03;&#x4F18; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x6536;&#x96C6;&#xFF1A;</p>
<p>Full&#xA0;GC &#x4E5F;&#x53EF;&#x80FD;&#x6E90;&#x4E8E;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x7528;&#x5C3D;&#xFF0C;&#x901A;&#x8FC7;&#x76D1;&#x63A7; GC &#x65E5;&#x5FD7;&#xFF0C;&#x53EF;&#x4EE5;&#x5224;&#x65AD; Full&#xA0;GC &#x662F;&#x5426;&#x7531;&#x6C38;&#x4E45;&#x4EE3;&#x8017;&#x5C3D;&#x5F15;&#x8D77;&#x3002;</p>
<p>&#x5728; CMS &#x4E2D;&#xFF0C; HotSpot&#xA0;VM &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F1A;&#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x63A7;&#x5236; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x6536;&#x96C6;&#xFF1A;</p>
<p>A.&#x5F00;&#x542F; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF1A;</p>
<p>-XX:+CMSClassUnloadingEnabled &#xFF0C; Java6&#xA0;Update3 &#x6216;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:+CMSPermGenSweepingEnabled &#x4E0E; -XX:+CMSClassUnloadingEnabled &#x4E00;&#x8D77;&#x914D;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<p>B.&#x8C03;&#x6574;&#x6C38;&#x4E45;&#x4EE3;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x7C7B;&#x4F3C;&#xFF0C;&#x5F00;&#x542F; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E4B;&#x540E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x5B9A;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#xFF0C;&#x6765;&#x63A7;&#x5236; CMS &#x5728;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x53C2;&#x6570;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>-XX:CMSInitiatingPermOccupancyFraction=&lt;percent&gt; &#xFF1A;</p>
<p>&#x6307;&#x5B9A;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#x8FBE;&#x5230;&#x591A;&#x5C11;&#x767E;&#x5206;&#x6BD4;&#x65F6;&#x542F;&#x52A8; CMS &#x5728;&#x6C38;&#x4E45;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x4EC5;&#x5728;&#x4EC5;&#x5728;&#x7B2C;&#x4E00;&#x4E2A; CMS &#x5468;&#x671F;&#x4E2D;&#x4F7F;&#x7528;&#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#xFF0C;&#x4E4B;&#x540E;&#x5468;&#x671F;&#x53C8;&#x8F6C;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x3002;</p>
<p>-XX:+UseCMSInitiatingOccupancyOnly &#xFF1A;<br>&#x4E0E; -XX:CMSInitiatingPermOccupancyFraction=&lt;percent&gt; &#x4E00;&#x8D77;&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x544A;&#x77E5; HotSpot&#xA0;VM &#x603B;&#x662F;&#x4F7F;&#x7528; -XX:CMSInitiatingPermOccupancyFraction=&lt;percent&gt; &#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#x4F5C;&#x4E3A;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x7684;&#x9600;&#x503C;&#x3002;</p>
<p>(5). &#x8C03;&#x4F18; CMS &#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF1A;</p>
<p>CMS &#x5468;&#x671F;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x662F; Stop-The-World &#x7684;&#x9636;&#x6BB5;&#xFF1A;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x548C;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#xFF0C;&#x5904;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x867D;&#x7136;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x5374;&#x6781;&#x5C11;&#x5360;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x8FDC;&#x5C0F;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x505C;&#x987F;&#xFF0C;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684; HotSpot&#xA0;VM &#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x63A7;&#x5236;&#xFF1A;</p>
<p>A.-XX:ParallelGCThreads=&lt;n&gt; &#xFF1A;<br>&#x63A7;&#x5236;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#xFF0C;&#x82E5;Runtime.getRuntime().availableProcessors()&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; 8 &#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x7B49;&#x4E8E;&#x8FD9;&#x4E2A;&#x503C;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x8BE5;&#x9ED8;&#x8BA4;&#x503C; =8+( Runtime.getRuntime().availableProcessors()&#xA0;-&#xA0;8)&#xA0;*&#xA0;5&#xA0;/&#xA0;8 &#x3002;</p>
<p>&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E8E;&#x540C;&#x4E00;&#x7CFB;&#x7EDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5EFA;&#x8BAE;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x7684;&#x5C0F;&#x4E8E;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x7531;&#x4E8E;&#x5927;&#x91CF;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x4F1A;&#x53D7;&#x5230;&#x6781;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>B.-XX:+CMSScavengeBeforeRemark &#xFF1A;</p>
<p>&#x5F3A;&#x5236; HotSpot&#xA0;VM &#x5728;&#x8FDB;&#x5165; CMS &#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x4E4B;&#x524D;&#x5148;&#x8FDB;&#x884C;&#x4E00;&#x6B21; Minor&#xA0;GC &#xFF0C;&#x51CF;&#x5C11;&#x5F15;&#x7528;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x65B0;&#x751F;&#x4EE3;&#x5BF9;&#x8C61;&#x6570;&#x76EE;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>C.-XX:+ParallelRefProcEnabled &#xFF1A;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x6216;&#x53EF;&#x7EC8;&#x7ED3;&#x5BF9;&#x8C61;&#x8981;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>8.&#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>(1).CMS &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>CMS &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#x4E0E;&#x5176;&#x5EF6;&#x8FDF;&#x8C03;&#x4F18;&#x7C7B;&#x4F3C;&#xFF0C;&#x7B80;&#x5355;&#x539F;&#x5219;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>A.&#x589E;&#x52A0;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x964D;&#x4F4E; Minor&#xA0;GC &#x9891;&#x7387;&#x3002;</p>
<p>B.&#x589E;&#x52A0;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x964D;&#x4F4E; CMS &#x5468;&#x671F;&#x9891;&#x7387;&#x5E76;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#x5931;&#x6548;&#x4EE5;&#x53CA; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x53D1;&#x751F;&#x51E0;&#x7387;&#x3002;</p>
<p>C.&#x8C03;&#x6574;&#x65B0;&#x751F;&#x4EE3;&#x4E2D; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4EE5;&#x4F18;&#x5316;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#xFF0C;&#x51CF;&#x5C11;&#x7531;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x7684;&#x5BF9;&#x8C61;&#x6570;&#x76EE;&#xFF0C;&#x6700;&#x7EC8;&#x51CF;&#x5C11; CMS &#x5468;&#x671F;&#x53D1;&#x751F;&#x6570;&#x3002;</p>
<p>D.&#x4F18;&#x5316; CMS &#x5468;&#x671F;&#x542F;&#x52A8;&#x6761;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x665A;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x3002;</p>
<p>CMS &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#x7684;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x662F; CMS &#x5305;&#x62EC; Minor&#xA0;GC &#x6240;&#x5E26;&#x6765;&#x7684;&#x5F00;&#x9500;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E; 10% &#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5C06;&#x5F00;&#x9500;&#x964D;&#x4F4E;&#x5230; 1%~3% &#x3002;</p>
<p>(2).Throughput &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>Throughput &#x6536;&#x96C6;&#x5668;&#x662F;&#x4EE5;&#x541E;&#x5410;&#x91CF;&#x6700;&#x4F18;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x53D1;&#x751F; Full&#xA0;GC &#xFF0C;&#x6216;&#x8005;&#x66F4;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5728;&#x7A33;&#x5B9A;&#x6001;&#x65F6;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x53D1;&#x751F; Full&#xA0;GC &#x3002;</p>
<p>Throughput &#x6536;&#x96C6;&#x5668;&#x9ED8;&#x8BA4;&#x542F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x4EE5;&#x53CA;&#x5B58;&#x6D3B;&#x7387;&#x81EA;&#x52A8;&#x5730;&#x5BF9;&#x65B0;&#x751F;&#x4EE3;&#x7684; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x4EE5;&#x6700;&#x4F18;&#x5316;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x9891;&#x7387;&#x3002;&#x81EA;&#x9002;&#x5E94;&#x8C03;&#x4F18;&#x65E2;&#x6613;&#x4E8E; JVM &#x8C03;&#x4F18;&#xFF0C;&#x53C8;&#x8FBE;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x7981;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x800C;&#x624B;&#x52A8;&#x8C03;&#x6574; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>A.-XX:-UseAdaptiveSizePolicy &#xFF1A;</p>
<p>&#x8BE5;&#x547D;&#x4EE4;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x7981;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x7279;&#x6027;&#xFF0C;&#x53EA;&#x5BF9; Throughput &#x6536;&#x96C6;&#x5668;&#x6709;&#x6548;&#x3002;</p>
<p>&#x7981;&#x7528;&#x5B83;&#x5C06;&#x4F1A;&#x727A;&#x7272;&#x6539;&#x53D8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>
<p>B.-XX:+PrintAdaptiveSizePolicy &#xFF1A;</p>
<p>&#x8BE5;&#x547D;&#x4EE4;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x6253;&#x5370; Survivor &#x7A7A;&#x95F4;&#x5360;&#x7528;&#x65E5;&#x5FD7;&#xFF0C;&#x901A;&#x5E38;&#x4E0E; XX:+PrintGCDetails&#xA0; &#x3001; -XX:+PrintGCDateStamps &#x6216; -XX:+PrintGCTimeStamps &#x7B49;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x4E00;&#x8D77;&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x76D1;&#x63A7; GC &#x65E5;&#x5FD7;&#x4E2D; Survivor &#x7A7A;&#x95F4;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x4E3A;&#x624B;&#x52A8;&#x8C03;&#x6574; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x63D0;&#x4F9B;&#x4F9D;&#x636E;&#xFF0C;&#x4F8B;&#x5B50;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>2015-05-20T11:01:59.507+0800:&#xA0; [GCAdaptiveSizePolicy::compute_survivor_space_size_and_thresh:&#xA0;&#xA0;</p>
<p>survived:&#xA0;651584&#xA0;&#xA0;</p>
<p>promoted:&#xA0;1622112&#xA0;&#xA0;</p>
<p>overflow:&#xA0;true&#xA0;</p>
<p>[PSYoungGen:&#xA0;4160K-&gt;636K(4800K)]&#xA0;</p>
<p>4160K-&gt;2220K(15744K),&#xA0;0.0057260&#xA0;secs]&#xA0;</p>
<p>[Times:&#xA0;user=0.00&#xA0;sys=0.00,&#xA0;real=0.01&#xA0;secs]</p>
<p>GCAdaptiveSizePolicy&#x6807;&#x7B7E;&#x8868;&#x660E;GC &#x65E5;&#x5FD7;&#x662F;&#x4EE5; -XX:+PrintAdaptiveSizePolicy &#x9009;&#x9879;&#x5F00;&#x542F;&#x7684;&#x3002;</p>
<p>Survived&#x6807;&#x7B7E;&#x540E;&#x9762;&#x7684;651584&#x662F;Survived&#xA0;To &#x7A7A;&#x95F4;&#x4E2D;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x3002;</p>
<p>Promoted&#x6807;&#x7B7E;&#x540E;&#x9762;&#x7684;1622112&#x662F;&#x7531;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x3002;</p>
<p>Overflow&#x6807;&#x7B7E;&#x8868;&#x660E;&#x662F;&#x5426;Survived&#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x5373;&#x6709;&#x65B0;&#x751F;&#x4EE3;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5BF9;Throughput &#x6536;&#x96C6;&#x5668;&#x7684; Survivor &#x7A7A;&#x95F4;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x548C;&#x76D1;&#x63A7;&#xFF0C;&#x8BBE;&#x7F6E;&#x5408;&#x7406;&#x7684; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x4F7F;&#x5F97;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x53D1;&#x751F; Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#x3002;</p>
<p>Throughput &#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x539F;&#x5219;&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5F00;&#x9500;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E; 5% &#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5C06;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5F00;&#x9500;&#x51CF;&#x5C11;&#x5230; 1% &#x751A;&#x81F3;&#x66F4;&#x5C11;&#xFF0C;&#x5C31;&#x8FBE;&#x5230;&#x6781;&#x9650;&#x4E86;&#x3002;</p>
<p>(3).NUMA &#x7CFB;&#x7EDF;&#x4E0A;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>NUMA &#x7CFB;&#x7EDF;&#x662F;&#x975E;&#x4E00;&#x81F4;&#x6027;&#x5185;&#x5B58;&#x67B6;&#x6784;&#xFF0C;&#x652F;&#x6301; NUMA &#x7684; JVM &#x4F1A;&#x6839;&#x636E; NUMA &#x8282;&#x70B9;&#x5212;&#x5206;&#x5806;&#xFF0C;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x53EA;&#x4F1A;&#x5728;&#x8BE5;&#x7EBF;&#x7A0B;&#x6240;&#x5728;&#x6838;&#x7684; NUMA &#x8282;&#x70B9;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#xFF0C;&#x540E;&#x7EED;&#x8BE5;&#x7EBF;&#x7A0B;&#x5982;&#x679C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x4ECE;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8DE8; CPU &#x548C;&#x8DE8;&#x5185;&#x5B58;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x547D;&#x4EE4; (RHEL &#x4E0B;&#x4F7F;&#x7528; numactl) &#x8BBE;&#x7F6E; CPU &#x4EB2;&#x548C;&#x6027; (Affinity) &#xFF0C;&#x9ED8;&#x8BA4;&#x5C31;&#x8DE8;&#x591A;&#x4E2A;&#x5185;&#x5B58;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8DE8; CPU &#x6216;&#x5185;&#x5B58;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#xFF0C; HotSpot &#x4E3A; Throughput &#x6536;&#x96C6;&#x5668;&#x63D0;&#x4F9B; -XX:+UseNUMA &#x9009;&#x9879;&#xFF0C;&#x6839;&#x636E; CPU &#x4E0E;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x7684;&#x5173;&#x7CFB;&#x5728;&#x5206;&#x914D;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x3002;</p>
<p>9.&#x5176;&#x4ED6;&#x4F18;&#x5316;&#x7B56;&#x7565;&#xFF1A;</p>
<p>(1). &#x5B9E;&#x9A8C;&#x6027; ( &#x6700;&#x8FD1;&#x6700;&#x5927; ) &#x4F18;&#x5316;&#xFF1A;</p>
<p>&#x65B0;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x96C6;&#x6210;&#x5230; HotSpot&#xA0;VM &#x65F6;&#xFF0C;&#x5E38;&#x5E38;&#x9996;&#x5148;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879; -XX:+AggressiveOpts &#x4E2D;&#x5F15;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x7684;&#x4F18;&#x5316;&#x9009;&#x9879;&#x7ECF;&#x8FC7;&#x8BC1;&#x660E;&#x8DB3;&#x591F;&#x7A33;&#x5B9A;&#xFF0C;&#x5C31;&#x4F1A;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x9AD8;&#x4E8E;&#x7A33;&#x5B9A;&#x6027;&#x8981;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x542F;&#x7528;&#x5B9E;&#x9A8C;&#x6027;&#x4F18;&#x5316;&#x3002;</p>
<p>(2). &#x9003;&#x9038;&#x5206;&#x6790;&#xFF1A;</p>
<p>&#x9003;&#x9038;&#x5206;&#x6790; (Escape&#xA0;Analysis) &#x662F;&#x4E00;&#x79CD;&#x8BC4;&#x4F30; java &#x5BF9;&#x8C61;&#x53EF;&#x89C1;&#x8303;&#x56F4;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x82E5;&#x7531;&#x67D0;&#x4E2A;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x7684; java &#x5BF9;&#x8C61;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x5C31;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x8BE5;&#x5BF9;&#x8C61;&#x9003;&#x9038;&#x4E86;&#xFF0C;&#x82E5; java &#x5BF9;&#x8C61;&#x4E0D;&#x53D1;&#x751F;&#x9003;&#x9038;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8C03;&#x4F18;&#xFF0C;&#x8FD9;&#x79CD;&#x4F18;&#x5316;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;&#x9003;&#x9038;&#x5206;&#x6790;&#x3002;</p>
<p>HotSpot&#xA0;VM &#x4F7F;&#x7528; -XX:+DoEscapeAnalysis &#x547D;&#x4EE4;&#x9009;&#x9879;&#x5F00;&#x542F;&#x9003;&#x9038;&#x5206;&#x6790; ( &#x5728; Java6&#xA0;Update23 &#x4E4B;&#x540E;&#x9ED8;&#x8BA4;&#x5F00;&#x542F; ) &#xFF0C;&#x501F;&#x52A9;&#x9003;&#x9038;&#x5206;&#x6790;&#xFF0C; JIT &#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x505A;&#x5982;&#x4E0B;&#x4F18;&#x5316;&#xFF1A;</p>
<p>A.&#x5BF9;&#x8C61;&#x5C55;&#x5F00;&#xFF1A;&#x5728;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x56DE;&#x6536;&#x7684;&#x7A7A;&#x95F4;&#x800C;&#x975E; java &#x5806;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x5B57;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x8C61;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5B58;&#x653E;&#x5728; CPU &#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x5728;&#x6808;&#x4E0A;&#x800C;&#x4E0D;&#x662F; java &#x5806;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x3002;</p>
<p>B.&#x6807;&#x91CF;&#x66FF;&#x6362;&#xFF1A;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x628A; java &#x5BF9;&#x8C61;&#x62C6;&#x6563;&#x4E3A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#x76F4;&#x63A5;&#x5728; CPU &#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x6B21;&#x6570;&#x3002;</p>
<p>C.&#x6808;&#x4E0A;&#x5206;&#x914D;&#xFF1A;&#x5728;&#x7EBF;&#x7A0B;&#x7684;&#x6808;&#x5E27;&#x4E0A;&#x800C;&#x975E; java &#x5806;&#x4E2D;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#xFF0C;&#x51CF;&#x5C11;&#x5783;&#x573E;&#x6536;&#x96C6;&#x9891;&#x7387;&#x3002;</p>
<p>D.&#x6D88;&#x9664;&#x540C;&#x6B65;&#xFF1A;&#x82E5;&#x7EBF;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x9003;&#x9038;&#xFF0C;&#x4E14;&#x8BE5;&#x7EBF;&#x7A0B;&#x6301;&#x6709;&#x8BE5;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x9501;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E0D;&#x4F1A;&#x8BBF;&#x95EE;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; JIT &#x7F16;&#x8BD1;&#x5668;&#x79FB;&#x9664;&#x9501;&#x3002;</p>
<p>E.&#x6D88;&#x9664;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x8BFB; / &#x5199;&#x5C4F;&#x969C;&#xFF1A;&#x53EA;&#x6709;&#x7EBF;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x5728;&#x53E6;&#x4E00;&#x7EBF;&#x7A0B;&#x4E2D;&#x88AB;&#x8BBF;&#x95EE;&#x65F6;&#x624D;&#x9700;&#x8981;&#x8BFB; / &#x5199;&#x5C4F;&#x969C;&#xFF0C;&#x82E5;&#x8BE5;&#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x7531;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x7684;&#x6839;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#xFF0C;&#x5219;&#x5728;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x4E2D;&#x5B58;&#x50A8;&#x5176;&#x5730;&#x5740;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x6267;&#x884C;&#x8BFB; / &#x5199;&#x5C4F;&#x969C;&#x3002;</p>
<p>(3). &#x504F;&#x5411;&#x9501;&#xFF1A;</p>
<p>&#x504F;&#x5411;&#x9501;&#x662F;&#x504F;&#x5411;&#x4E8E;&#x6700;&#x540E;&#x83B7;&#x5F97;&#x5BF9;&#x8C61;&#x9501;&#x7EBF;&#x7A0B;&#x7684;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x5373;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x521A;&#x521A;&#x83B7;&#x5F97;&#x5BF9;&#x8C61;&#x9501;&#xFF0C;&#x5F53;&#x4E0B;&#x4E00;&#x6B21;&#x518D;&#x83B7;&#x53D6;&#x8BE5;&#x5BF9;&#x8C61;&#x9501;&#x65F6; HotSpot &#x8BA4;&#x4E3A;&#x8BE5;&#x7EBF;&#x7A0B;&#x8FD8;&#x80FD;&#x83B7;&#x53D6;&#x6210;&#x529F;&#x800C;&#x76F4;&#x63A5;&#x628A;&#x5BF9;&#x8C61;&#x9501;&#x4EA4;&#x4E88;&#x8BE5;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x5F53;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x9501;&#x5B9A;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x6CA1;&#x6709;&#x9501;&#x51B2;&#x7A81;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x9501;&#x5F00;&#x9500;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x65E0;&#x9501;&#x3002;</p>
<p>&#x504F;&#x5411;&#x9501;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x6027;&#x80FD;&#x63D0;&#x9AD8;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:+UseBiasedLocking &#x5F00;&#x542F;&#x504F;&#x5411;&#x9501; ( &#x5728; JDK &#x4E2D;&#x9ED8;&#x8BA4;&#x5F00;&#x542F; ) &#xFF1B;&#x4F46;&#x5BF9;&#x4E8E;&#x6709;&#x9501;&#x5207;&#x6362;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6027;&#x80FD;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:-UseBiasedLocking &#x5173;&#x95ED;&#x504F;&#x5411;&#x9501;&#x3002;</p>
<p>&#x5EFA;&#x8BAE;&#x5206;&#x522B;&#x6D4B;&#x91CF;&#x5F00;&#x542F;&#x548C;&#x5173;&#x95ED;&#x504F;&#x5411;&#x9501;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E94;&#x7528;&#x6027;&#x80FD;&#xFF0C;&#x518D;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5173;&#x95ED;&#x504F;&#x5411;&#x9501;&#x4F18;&#x5316;&#x3002;</p>
<p>(4). &#x5927;&#x9875;&#x9762;&#x5185;&#x5B58;&#x652F;&#x6301;&#xFF1A;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x88AB;&#x5212;&#x5206;&#x6210;&#x79F0;&#x4E3A;&#x9875;&#x7684;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5757;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5C06;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x4E00;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x662F;&#x901A;&#x8FC7;&#x9875;&#x8868;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x904D;&#x5386;&#x9875;&#x8868;&#x7684;&#x4EE3;&#x4EF7;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x6BCF;&#x6B21;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x65F6;&#x8BBF;&#x95EE;&#x9875;&#x8868;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E00;&#x5757;&#x88AB;&#x79F0;&#x4E3A;&#x8F6C;&#x8BD1;&#x5FEB;&#x67E5;&#x7F13;&#x5B58; (TLB) &#x7684;&#x5FEB;&#x901F;&#x7F13;&#x5B58;&#x5BF9;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x8F6C;&#x6362;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#x3002; TLB &#x901A;&#x5E38;&#x53EA;&#x80FD;&#x5BB9;&#x7EB3;&#x56FA;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x5176;&#x6BCF;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x5C31;&#x662F;&#x6309;&#x9875;&#x9762;&#x5927;&#x5C0F;&#x7EDF;&#x8BA1;&#x7684;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x5730;&#x5740;&#x533A;&#x95F4;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5B58;&#x9875;&#x9762;&#x8D8A;&#x5927;&#xFF0C;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x80FD;&#x6620;&#x5C04;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x533A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C;&#x6BCF;&#x4E2A; TLB &#x80FD;&#x7BA1;&#x7406;&#x7684;&#x7A7A;&#x95F4;&#x4E5F;&#x8D8A;&#x5927;&#xFF0C;&#x5730;&#x5740;&#x8F6C;&#x8BD1;&#x8BF7;&#x6C42;&#x5728; TLB &#x4E2D;&#x5931;&#x6548;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x5C0F;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x8F6C;&#x8BD1;&#x8BF7;&#x6C42;&#x5931;&#x6548;&#x5373;&#x65E0;&#x6CD5;&#x5728; TLB &#x4E2D;&#x627E;&#x5230;&#x5339;&#x914D;&#x9879;&#x65F6;&#xFF0C;&#x5E38;&#x5E38;&#x9700;&#x8981;&#x904D;&#x5386;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x9875;&#x8868;&#x67E5;&#x627E;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x5927;&#x9875;&#x9762;&#x5185;&#x5B58;&#x7684;&#x597D;&#x5904;&#x662F;&#x51CF;&#x5C11;&#x4E86; TLB &#x5931;&#x6548;&#x7684;&#x51E0;&#x7387;&#x3002;</p>
<p>Linux &#x548C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x505A;&#x5927;&#x9875;&#x9762;&#x76F8;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x4E4B;&#x540E;&#xFF0C;&#x4F7F;&#x7528; -XX:+UseLargePages &#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x5F00;&#x542F; HotSpot&#xA0;VM &#x7684;&#x5927;&#x9875;&#x9762;&#x5185;&#x5B58;&#x652F;&#x6301;&#x3002;</p>
<p>&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;&#x672C;&#x6587;&#x4E3A;&#x535A;&#x4E3B;&#x539F;&#x521B;&#x6587;&#x7AE0;&#xFF0C;&#x672A;&#x7ECF;&#x535A;&#x4E3B;&#x5141;&#x8BB8;&#x4E0D;&#x5F97;&#x8F6C;&#x8F7D;&#x3002;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/分类：-java技术/">分类： java技术</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/01/0370e0d/" title="基于JVM（内存）和Tomcat性能调优 - caomiao2006的专栏">
  <strong>上一篇：</strong><br/>
  <span>
  基于JVM（内存）和Tomcat性能调优 - caomiao2006的专栏</span>
</a>
</div>


<div class="next">
<a href="/2015/07/01/03386bb/"  title="JVM学习笔记（四）------内存调优 - kobejayandy的专栏">
 <strong>下一篇：</strong><br/> 
 <span>JVM学习笔记（四）------内存调优 - kobejayandy的专栏
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>294</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
