
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="edwin jin dianzi blog">
<meta property="og:type" content="website">
<meta property="og:title" content="dianzi blog">
<meta property="og:url" content="http://taojinke.github.io/page/8/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="edwin jin dianzi blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="dianzi blog">
<meta name="twitter:description" content="edwin jin dianzi blog">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/2ddbaf1/" title="在业余项目使用 Node.js -" itemprop="url">在业余项目使用 Node.js -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T03:01:12.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h4 id="&#x672C;&#x6587;&#x662F;&#x7FFB;&#x8BD1;&#xFF0C;&#x7248;&#x6743;&#x5F52;&#x539F;&#x4F5C;&#x8005;&#x6240;&#x6709;">&#x672C;&#x6587;&#x662F;&#x7FFB;&#x8BD1;&#xFF0C;&#x7248;&#x6743;&#x5F52;&#x539F;&#x4F5C;&#x8005;&#x6240;&#x6709;</h4><ul>
<li>&#x539F;&#x6587;&#x5730;&#x5740;&#xFF08;original source&#xFF09;&#xFF1A; <a href="http://jkchu.com/2015/06/23/node-js-for-side-projects/" target="_blank" rel="external">http://jkchu.com/2015/06/23/node-js-for-side-projects/</a></li>
</ul>
<p>&#x6709;&#x4E00;&#x79CD;&#x4E1C;&#x897F;&#xFF0C;&#x628A;&#x8F6F;&#x4EF6;&#x884C;&#x4E1A;&#x7684;&#x4EBA;&#x4EEC;&#x8054;&#x7CFB;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#xFF1A;&#x6211;&#x4EEC;&#x559C;&#x6B22;&#x521B;&#x9020;&#x80FD;&#x591F;&#x8FD0;&#x884C;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x3001;&#x6216;&#x521A;&#x597D;&#x7B26;&#x5408;&#x9884;&#x671F;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x662F;&#x6700;&#x8BA9;&#x4EBA;&#x6EE1;&#x610F;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x6211;&#x7684;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#xFF08;side projects&#xFF09;&#xFF0C;&#x6211;&#x70ED;&#x7231;&#x5B66;&#x4E60;&#x65B0;&#x6846;&#x67B6;&#x3001;&#x6280;&#x672F;&#x548C;&#x8BED;&#x8A00;&#x3002;&#x4F46;&#x662F;&#x5230;&#x4E86;&#x6700;&#x540E;&#xFF0C;&#x6700;&#x6709;&#x6536;&#x83B7;&#x548C;&#x6B23;&#x6170;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x662F;&#x5B8C;&#x6210;&#x4E86;&#x9879;&#x76EE;&#x5E76;&#x5BF9;&#x5916;&#x53D1;&#x5E03;&#x4E86;&#x67D0;&#x4E9B;&#x4E1C;&#x897F;&#x3002;&#x8001;&#x5B9E;&#x8BB2;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6709;&#x5168;&#x804C;&#x5DE5;&#x4F5C;&#xFF0C; <a href="http://www.labazhou.net/2014/09/work-life-imbalance/" target="_blank" rel="external">&#x62C5;&#x5FC3;&#x953B;&#x70BC;&#x8EAB;&#x4F53;&#x3001;&#x6742;&#x4E8B;&#x548C;&#x53EF;&#x80FD;&#x8FD8;&#x8981;&#x7761;&#x89C9;</a> &#xFF0C;&#x90A3;&#x4E48;&#xFF0C;&#x5E38;&#x5E38;&#x96BE;&#x4EE5;&#x627E;&#x5230;&#x5B8C;&#x6210;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5F53;&#x6211;&#x8C08;&#x5230;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x7406;&#x89E3;&#x7684;&#x3002;&#x501F;&#x52A9;&#x63D0;&#x524D;&#x89C4;&#x5212;&#xFF0C;&#x6216;&#x8BB8;&#x5229;&#x7528;&#x4E00;&#x4E9B;&#x4E0D;&#x9519;&#x7684;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x81EA;&#x5DF1;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x6280;&#x672F;&#x6808;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x5982;&#x679C;&#x5B8C;&#x6210;&#x5E76;&#x53D1;&#x5E03;&#x9879;&#x76EE;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x90A3;&#x4E48;&#x6311;&#x9009;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x8F83;&#x597D;&#x9002;&#x5E94;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x7684;&#x6280;&#x672F;&#x6808;&#x5C31;&#x663E;&#x5F97;&#x5341;&#x5206;&#x91CD;&#x8981;&#x4E86;&#x3002; </p>
<p><a href="https://nodejs.org/" target="_blank" rel="external">Node.js</a> &#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x6D41;&#x884C;&#x7684;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5E73;&#x53F0;&#xFF0C;&#x7528;&#x4F5C;&#x5F88;&#x591A;&#x73B0;&#x4EE3; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684; web &#x670D;&#x52A1;&#x5668;&#x3002;&#x5728;&#x5F00;&#x53D1; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x4F60;&#x5C06;&#x4F7F;&#x7528; JavaScript &#x7F16;&#x5199;&#x6240;&#x6709;&#x4E1C;&#x897F;&#xFF0C;&#x8FD8;&#x80FD;&#x591F;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF08;Windows&#x3001;Mac &#x6216; Linux&#xFF09;&#x4E0A;&#x8FD0;&#x884C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;Node.js &#x7531;&#x5927;&#x91CF;&#x7684;&#x9650;&#x5B9A;&#x8303;&#x56F4;&#x7684;&#x6A21;&#x5757;&#xFF08;module&#xFF09; &#x548C; &#x5305;&#xFF08;package&#xFF09; &#x7EC4;&#x6210;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x5229;&#x7528;&#x8D77;&#x6765;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4F60;&#x6700;&#x597D;&#x53D6;&#x4F60;&#x6240;&#x9700;&#xFF0C;&#x786E;&#x4FDD;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;&#x5728;&#x4E00;&#x5929;&#x7ED3;&#x675F;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4EAB;&#x53D7;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#xFF0C;Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5199;&#x8D77;&#x6765;&#x6BD4;&#x8F83;&#x6709;&#x4E50;&#x8DA3;&#x3002; </p>
<h3 id="1-Node-js_&#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">1.Node.js &#x7A76;&#x7ADF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h3><p>Node.js &#x672C;&#x8EAB;&#x53EA;&#x662F;&#x4E00;&#x79CD;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#xFF0C;&#x9002;&#x5408;&#x4F7F;&#x7528; JavaScript &#x6765;&#x7F16;&#x5199;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002; Node.js &#x4E0D;&#x662F; JavaScript &#x6846;&#x67B6;&#xFF0C;&#x4F46;&#x662F;&#x5927;&#x90E8;&#x5206; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E86;&#x6846;&#x67B6; &#x3002; <a href="http://expressjs.com/" target="_blank" rel="external">Express.js</a> &#x662F;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684; Node.js &#x6846;&#x67B6;&#xFF0C;&#x6709;&#x7740;&#x51FA;&#x8272;&#x7684;&#x6587;&#x6863;&#x548C;&#x6D77;&#x91CF;&#x7684;&#x4F18;&#x79C0;&#x8D44;&#x6E90;&#x3002;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E; Node.js web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6808;&#x800C;&#x8A00;&#xFF0C;&#x4F60;&#x5E94;&#x5B89;&#x88C5; Node.js &#x548C; Express.js &#x6765;&#x8FD0;&#x884C;&#x4F60;&#x7684; web &#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD9;&#x5C06;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5FEB;&#x901F;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x4E2D;&#x95F4;&#x4EBA;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x5728;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x548C;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x8FC5;&#x901F;&#x5730;&#x4F20;&#x9012;&#x8BF7;&#x6C42;&#x548C;&#x54CD;&#x5E94;&#x3002; </p>
<h3 id="2-&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;_Node-js_&#x7684;&#x573A;&#x666F;">2.&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js &#x7684;&#x573A;&#x666F;</h3><p>&#x5728;&#x6211;&#x4EEC;&#x6DF1;&#x5165; Node.js &#x5F00;&#x53D1;&#x7684;&#x7CBE;&#x5F69;&#x90E8;&#x5206;&#x4E4B;&#x524D;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BF4;&#x6E05;&#x695A;&#x4F60;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js &#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x8981;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6D89;&#x53CA;&#x5230; CPU &#x5BC6;&#x96C6;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js&#x3002;Node.js &#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;&#x8981;&#x8017;&#x8D39;&#x592A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x4F1A;&#x62D6;&#x57AE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x4EFB;&#x4F55;&#x79CD;&#x7C7B;&#x7684;&#x5927;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90FD;&#x4E0D;&#x5E94;&#x8BE5;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x3002;&#x8981;&#x4E48;&#x628A;&#x8FD9;&#x90E8;&#x5206;&#x5DE5;&#x4F5C;&#x8F6C;&#x79FB;&#x5230;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8981;&#x4E48;&#x7C97;&#x66B4;&#x5730;&#x5207;&#x6362;&#x5230;&#x66F4;&#x9002;&#x5408;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x559C;&#x6B22; JavaScript &#x5F00;&#x53D1;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x5E94;&#x8BE5;&#x4F7F;&#x7528; Node.js&#x3002;&#x4F60;&#x5E94;&#x8BE5;&#x4EAB;&#x53D7;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#xFF0C;&#x4E0D;&#x8981;&#x56E0;&#x4E3A;&#x7F51;&#x4E0A;&#x6709;&#x4EBA;&#x544A;&#x8BC9;&#x4F60;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x5C31;&#x628A;&#x4E0D;&#x6109;&#x5FEB;&#x7684;&#x4E1C;&#x897F;&#x5F3A;&#x52A0;&#x7ED9;&#x81EA;&#x5DF1;&#x3002;&#x4F46;&#x662F;&#x5728;&#x4F60;&#x653E;&#x5F03;&#x4E4B;&#x524D;&#xFF0C;&#x542C;&#x6211;&#x628A;&#x8BDD;&#x8BF4;&#x5B8C;&#xFF0C;&#x6211;&#x9047;&#x5230;&#x8FC7;&#x5F88;&#x591A;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x6F20;&#x89C6;&#x7740; JavaScript&#xFF0C;&#x751A;&#x81F3;&#x6CA1;&#x6709;&#x7ED9; JavaScript &#x4E00;&#x4E2A;&#x516C;&#x5E73;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x521A;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;JavaScript &#x8C8C;&#x4F3C;&#x72C2;&#x91CE;&#x3001;&#x96BE;&#x4EE5;&#x9A7E;&#x9A6D;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x4F60;&#x5B66;&#x4F1A;&#x4E86;&#x5982;&#x4F55;&#x6B63;&#x786E;&#x5730;&#x4F7F;&#x7528;&#xFF0C;&#x4F60;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x5B83;&#x7684;&#x529B;&#x91CF;&#x6709;&#x591A;&#x5927;&#x4E86;&#x3002;JavaScript &#x662F;&#x5E94;&#x7528;&#x6700;&#x5E7F;&#x6CDB;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x4E4B;&#x4E00;&#xFF0C;&#x968F;&#x7740; <a href="https://github.com/lukehoban/es6features" target="_blank" rel="external">ECMAScript 6</a> &#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x5B83;&#x5C06;&#x53D8;&#x5F97;&#x66F4;&#x597D;&#x3002; </p>
<h3 id="3-JavaScript_&#x2014;&#x2014;&#x524D;&#x7AEF;&#x548C;&#x540E;&#x7AEF;">3.JavaScript &#x2014;&#x2014;&#x524D;&#x7AEF;&#x548C;&#x540E;&#x7AEF;</h3><p>&#x8BA9;&#x6211;&#x4EEC;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;Node.js &#x6700;&#x5927;&#x5316;&#x4F60;&#x7684;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x751F;&#x4EA7;&#x529B;&#x7684;&#x65B9;&#x5F0F;&#x3002;JavaScript &#x5DF2;&#x7ECF;&#x63A5;&#x7BA1;&#x4E86;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x4E0D;&#x518D;&#x5355;&#x7EAF;&#x7528;&#x4E8E;&#x7410;&#x788E;&#x529F;&#x80FD;&#x3002;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x73B0;&#x4EE3; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x8FD0;&#x884C;&#x5728;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x662F;&#x7531; JavaScript &#x63D0;&#x4F9B;&#x7684;&#x3002;&#x9664;&#x4E86;&#x6539;&#x5584;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#xFF0C;&#x5B83;&#x8FD8;&#x4ECE; web &#x670D;&#x52A1;&#x5668;&#x5206;&#x62C5;&#x4E86;&#x5927;&#x91CF;&#x5DE5;&#x4F5C;&#x3002;&#x8FD8;&#x8BB0;&#x5F97;&#x4E4B;&#x524D;&#x6211;&#x4EEC;&#x8BA8;&#x8BBA;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5417;&#xFF1F;&#x8BA9;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x627F;&#x62C5;&#x81EA;&#x5DF1;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x591F;&#x5145;&#x5206;&#x5229;&#x7528; Node.js &#x7684;&#x6700;&#x5927;&#x529B;&#x91CF;&#x2014;&#x2014;&#x51CF;&#x8F7B;&#x5FEB;&#x6377;&#x7684; I/O&#x3002;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x903B;&#x8F91;&#x5728;&#x524D;&#x540E;&#x7AEF;&#x4E4B;&#x95F4;&#x4F20;&#x64AD;&#xFF1B;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B; Node.js &#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6211;&#x4EEC;&#x80FD;&#x591F;&#x5E78;&#x8FD0;&#x5730;&#x5728;&#x524D;&#x540E;&#x7AEF;&#x4F7F;&#x7528;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5927;&#x90E8;&#x5206;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5BF9;&#x4E8E;&#x4E0A;&#x4E0B;&#x6587;&#x5207;&#x6362;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x4E0D;&#x5F97;&#x4E0D;&#x628A;&#x4F60;&#x7684;&#x601D;&#x7EF4;&#x91CD;&#x65B0;&#x805A;&#x7126;&#x548C;&#x8C03;&#x6574;&#x5728;&#x65B0;&#x4EFB;&#x52A1;&#x3001;&#x65B0;&#x8BED;&#x8A00;&#x3001;&#x4EE5;&#x53CA;&#x65B0;&#x95EE;&#x9898;&#x4E0A;&#xFF0C;&#x5E38;&#x5E38;&#x4F1A;&#x8BA9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x8017;&#x8D39;&#x4E00;&#x4E9B;&#x5B9D;&#x8D35;&#x7684;&#x6709;&#x6548;&#x7387;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x51CF;&#x5C11;&#x4E0A;&#x4E0B;&#x6587;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x4F7F;&#x6211;&#x4EEC;&#x5728;&#x5404;&#x79CD;&#x4EFB;&#x52A1;&#x7684;&#x5904;&#x7406;&#x4E0A;&#x6E38;&#x5203;&#x6709;&#x4F59;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x6062;&#x590D;&#x65F6;&#x95F4;&#x4E5F;&#x66F4;&#x52A0;&#x8FC5;&#x901F;&#x3002;</p>
<h3 id="4-JSON&#x2014;&#x2014;&#x6570;&#x636E;&#x4E1B;&#x6797;&#x4E4B;&#x738B;">4.JSON&#x2014;&#x2014;&#x6570;&#x636E;&#x4E1B;&#x6797;&#x4E4B;&#x738B;</h3><p>&#x5BF9;&#x4E8E;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x548C;&#x5BA2;&#x6237;&#x7AEF;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;JSON&#xFF08;JavaScript Object Notation&#xFF09;&#x3010;&#x6CE8;1&#x3011;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x3002;&#x6839;&#x636E;&#x6211;&#x5728;&#x5176;&#x5B83;&#x5E73;&#x53F0;&#x4E0A;&#x5F00;&#x53D1; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7ECF;&#x5386;&#xFF0C;&#x628A;&#x4F60;&#x7684;&#x6570;&#x636E;&#x8F6C;&#x6362;&#x6210;&#x5404;&#x79CD;&#x683C;&#x5F0F;&#x548C;&#x6A21;&#x578B;&#xFF0C;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x76F8;&#x5F53;&#x60CA;&#x4EBA;&#x7684;&#x3002;&#x5BF9;&#x4E8E; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;JSON &#x53EF;&#x4EE5;&#x7528;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6240;&#x6709;&#x4E09;&#x4E2A;&#x9886;&#x57DF;&#x2014;&#x2014;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x548C;&#x6570;&#x636E;&#x5E93;&#x3002; <a href="https://www.mongodb.org/" target="_blank" rel="external">MongoDB</a> &#x548C; <a href="http://couchdb.apache.org/" target="_blank" rel="external">CouchDB</a> &#x662F;&#x6D41;&#x884C;&#x7684; NoSQL &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4F7F;&#x7528; JSON &#x5B58;&#x50A8;&#x6570;&#x636E;&#x3002; <a href="http://www.postgresql.org/" target="_blank" rel="external">PostgreSQL</a> &#xFF0C;&#x4E00;&#x4E2A;&#x6D41;&#x884C;&#x7684;&#x5F00;&#x6E90;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x652F;&#x6301;&#x5B58;&#x50A8; JSON &#x5BF9;&#x8C61;&#x3002;&#x5FAE;&#x8F6F;&#x751A;&#x81F3; <a href="http://blogs.msdn.com/b/jocapc/archive/2015/05/16/json-support-in-sql-server-2016.aspx" target="_blank" rel="external">&#x5BA3;&#x5E03;</a> SQL Server 2016 &#x5C06;&#x652F;&#x6301; JSON&#x3002;&#x6709;&#x5982;&#x6B64;&#x4E30;&#x5BCC;&#x7684;&#x53EF;&#x9009;&#x9879;&#xFF0C;&#x5C31;&#x53EF;&#x8F7B;&#x677E;&#x5730;&#x7ED9;&#x4F60;&#x7684; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6311;&#x9009;&#x4E00;&#x79CD;&#x53EF;&#x9760;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4EE5;&#x6324;&#x51FA;&#x6BCF;&#x4E00;&#x70B9;&#x751F;&#x4EA7;&#x529B;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x62C5;&#x5FC3;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x7684;&#x8F6C;&#x6362;&#x3002; </p>
<h3 id="5-&#x6A21;&#x5757;&#x2014;&#x2014;&#x53D6;&#x4F60;&#x6240;&#x9700;">5.&#x6A21;&#x5757;&#x2014;&#x2014;&#x53D6;&#x4F60;&#x6240;&#x9700;</h3><p>&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x7684;&#x4E00;&#x4E2A;&#x7ECF;&#x9A8C;&#x6CD5;&#x5219;&#x5C31;&#x662F;&#x4FDD;&#x6301;&#x5C0F;&#x800C;&#x4E13;&#x6CE8;&#x3002;&#x8BE5;&#x6CD5;&#x5219;&#x6709;&#x52A9;&#x4E8E;&#x786E;&#x4FDD;&#x771F;&#x6B63;&#x5730;&#x5B8C;&#x6210;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x3002;&#x540C;&#x6837;&#x7684;&#x6982;&#x5FF5;&#x53EF;&#x5728; Node.js &#x9879;&#x76EE;&#x4E2D;&#x627E;&#x5230;&#x2014;&#x2014;&#x4F60;&#x53EA;&#x4F7F;&#x7528;&#x90A3;&#x4E9B;&#x771F;&#x6B63;&#x9700;&#x8981;&#x7684;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8DB3;&#x591F;&#x8F7B;&#x91CF;&#x7EA7;&#x3002;&#x548C;&#x5176;&#x5B83;&#x90A3;&#x4E9B;&#x4EE5;&#x4F01;&#x4E1A;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x5E73;&#x53F0;&#x4E0D;&#x540C;&#xFF0C;&#x4F60;&#x4E0D;&#x4F1A;&#x6709;&#x5927;&#x91CF;&#x6839;&#x672C;&#x7528;&#x4E0D;&#x5230;&#x7684;&#x989D;&#x5916;&#x4E1C;&#x4E1C;&#x3002;&#x4F60;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x90E8;&#x7F72;&#x5C06;&#x66F4;&#x8FC5;&#x901F;&#xFF0C;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x5C06;&#x5360;&#x7528;&#x66F4;&#x5C11;&#x7A7A;&#x95F4;&#xFF0C;&#x9879;&#x76EE;&#x91CC;&#x7684;&#x6BCF;&#x6837;&#x4E1C;&#x897F;&#x6070;&#x6070;&#x90FD;&#x662F;&#x4F60;&#x9700;&#x8981;&#x7684;&#xFF0C;&#x4F60;&#x660E;&#x767D;&#x8FD9;&#x4E9B;&#xFF0C;&#x5185;&#x5FC3;&#x611F;&#x5230;&#x5E73;&#x9759;&#x3002; <a href="https://www.npmjs.com/" target="_blank" rel="external">NPM</a> &#xFF08;Node Package Manager&#xFF09;&#x3010;&#x6CE8;2&#x3011;&#x662F; Node.js &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x5927;&#x5356;&#x70B9;&#x3002;&#x5B83;&#x8BA9;&#x4F60;&#x7B80;&#x5355;&#x5FEB;&#x6377;&#x5730;&#x8BBF;&#x95EE;&#x6240;&#x6709;&#x516C;&#x5171; Node &#x6A21;&#x5757;&#xFF0C;&#x9009;&#x62E9;&#x8303;&#x56F4;&#x8D85;&#x8FC7;&#x4E86; 150,000 &#x4E2A;&#x5305;&#x3002;&#x51CF;&#x5C11;&#x5F00;&#x53D1;&#x65F6;&#x95F4;&#x3001;&#x5229;&#x7528;&#x5DF2;&#x6709;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x5DE5;&#x5177;&#xFF0C;&#x4ECE;&#x672A;&#x5982;&#x6B64;&#x7B80;&#x5355;&#x8FC7;&#x3002; </p>
<h3 id="6-&#x603B;&#x7ED3;">6.&#x603B;&#x7ED3;</h3><p>Node.js &#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E86;&#x4E0D;&#x8D77;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E73;&#x53F0;&#xFF0C;&#x56E0;&#x5176;&#x9AD8; I/O &#x9700;&#x6C42;&#x800C;&#x771F;&#x6B63;&#x80DC;&#x51FA;&#x7684; web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6253;&#x7B97;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x4E1A;&#x4F59;&#x9879;&#x76EE;&#x4F7F;&#x7528; Node.js&#xFF0C;&#x5C31;&#x5C3D;&#x91CF;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7684; web &#x670D;&#x52A1;&#x5668; API&#xFF0C;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7684;&#x771F;&#x6B63;&#x8D1F;&#x8F7D;&#x3002;Node.js &#x6781;&#x6613;&#x7406;&#x89E3;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5B66;&#x4E60;&#x548C;&#x638C;&#x63E1;&#x8D77;&#x6765;&#xFF0C;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x4E9B;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x5C1D;&#x8BD5;&#x4E00;&#x4E0B;&#x5462;&#xFF1F;</p>
<h3 id="7-&#x6211;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x89C4;&#x5212;">7.&#x6211;&#x7684;&#x4E0B;&#x4E00;&#x6B65;&#x89C4;&#x5212;</h3><p>&#x6211;&#x60F3;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x4F18;&#x79C0;&#x8D44;&#x6E90;&#x7684;&#x7B80;&#x5355;&#x6E05;&#x5355;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x638C;&#x63E1; Node.js&#x3002;</p>
<ul>
<li><a href="https://thinkster.io/mean-stack-tutorial/" target="_blank" rel="external">https://thinkster.io/mean-stack-tutorial/</a> &#xFF1A;&#x5B83;&#x662F;&#x5BF9;&#x6211;&#x5E2E;&#x52A9;&#x6700;&#x5927;&#x7684;&#x6559;&#x7A0B;&#x3002;&#x8BE5;&#x6559;&#x7A0B;&#x7ED3;&#x6784;&#x7CBE;&#x5999;&#xFF0C;&#x8986;&#x76D6;&#x4E86;&#x6781;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x6D77;&#x91CF;&#x5185;&#x5BB9;&#x3002;&#x8BE5;&#x6559;&#x7A0B;&#x514D;&#x8D39;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x8FD8;&#x80FD;&#x4ED8;&#x8D39;&#xFF0C;&#x4EE5;&#x8BBF;&#x95EE;&#x5230;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x89C6;&#x9891;&#xFF08;&#x5F53;&#x65F6;&#x6211;&#x4E3A;&#x6E90;&#x4EE3;&#x7801;&#x652F;&#x4ED8;&#x4E86; 25 &#x7F8E;&#x5143;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x4EEC;&#x597D;&#x50CF;&#x53D8;&#x6210;&#x4E86;&#x6BCF;&#x6708; 20 &#x7F8E;&#x5143;&#x7684;&#x8BA2;&#x9605;&#xFF0C;&#x5C31;&#x53EF;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x6240;&#x6709;&#x6559;&#x7A0B;&#xFF09;&#x3002;</li>
<li><p><a href="http://www.toptal.com/nodejs/why-the-hell-would-i-use-node-js" target="_blank" rel="external">http://www.toptal.com/nodejs/why-the-hell-would-i-use-node-js</a> &#xFF1A;&#x4E00;&#x7BC7;&#x5199;&#x5F97;&#x4E0D;&#x9519;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x7406;&#x89E3;&#x4E86; Node.js &#x7684;&#x4F18;&#x70B9;&#x548C;&#x7F3A;&#x70B9;&#x3002;</p>
</li>
<li><p>&#x6CE8;1&#xFF1A;JSON&#xFF08;JavaScript Object Notation&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x9053;&#x683C;&#x62C9;&#x65AF;&#xB7;&#x514B;&#x7F57;&#x514B;&#x798F;&#x7279;&#x6784;&#x60F3;&#x8BBE;&#x8BA1;&#x3001;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x8BED;&#x8A00;&#xFF0C;&#x4EE5;&#x6587;&#x5B57;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x4E14;&#x6613;&#x4E8E;&#x8BA9;&#x4EBA;&#x9605;&#x8BFB;&#x3002;&#x5C3D;&#x7BA1;JSON&#x662F;Javascript&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x96C6;&#xFF0C;&#x4F46;JSON&#x662F;&#x72EC;&#x7ACB;&#x4E8E;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x672C;&#x683C;&#x5F0F;&#xFF0C;&#x5E76;&#x4E14;&#x91C7;&#x7528;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E;C&#x8BED;&#x8A00;&#x5BB6;&#x65CF;&#x7684;&#x4E00;&#x4E9B;&#x4E60;&#x60EF;&#x3002; <a href="https://zh.wikipedia.org/wiki/JSON" target="_blank" rel="external">https://zh.wikipedia.org/wiki/JSON</a></p>
</li>
<li>&#x6CE8;2&#xFF1A;Node&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF08;Node Package Manager&#xFF09;&#x3002;&#x5B83;&#x662F;&#x4E00;&#x4E2A;javascript&#x7684;&#x8F6F;&#x4EF6;&#x5305;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#xFF0C;&#x9ED8;&#x8BA4;&#x73AF;&#x5883;&#x4E3A;Node.js&#xFF0C;&#x4ECE;Node.js0.6.3&#x7248;&#x672C;&#x5F00;&#x59CB;&#xFF0C;npm&#x88AB;&#x81EA;&#x52A8;&#x9644;&#x5E26;&#x5728;&#x5B89;&#x88C5;&#x5305;&#x4E2D;&#x3002; <a href="https://zh.wikipedia.org/wiki/Node%E5%8C%85%E7%AE%A1%E7%90%86%E5%99%A8" target="_blank" rel="external">https://zh.wikipedia.org/wiki/Node%E5%8C%85%E7%AE%A1%E7%90%86%E5%99%A8</a></li>
</ul>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Node-js/">Node.js</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/2ddebc5/" title="Limiting Parallelism In Meteor -" itemprop="url">Limiting Parallelism In Meteor -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T03:01:12.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> In thelatest blog post we&apos;ve touched the topic of parallelism in the <a href="https://www.meteor.com/" target="_blank" rel="external">Meteor framework</a> using <a href="https://github.com/laverdet/node-fibers" target="_blank" rel="external">node-fibers</a> . We&apos;ve shown how to do multiple HTTP requests at the same time. </p>
<p>As we&apos;ve seen, unbounded parallelism in Meteor is relatively easy. There are, however, cases when you wish to limit the degree of concurrency (akin to async&apos;s <a href="https://github.com/caolan/async#eachSeries" target="_blank" rel="external">eachSeries</a> ). For example when issuing a lot of HTTP requests or accessing the file system; there&apos;s only so much open files and/or sockets one can have at the same time. How would one do that with blocking fibers? </p>
<p>Turns out it&apos;s not that hard either! Let&apos;s have a look at a simple implementation. What we want is something like this:</p>
<pre><code>Future.task(() =&amp;<span class="keyword">gt</span>; {  
  <span class="regexp">//</span> Call <span class="string">`getRandomGif`</span> <span class="number">50</span> <span class="keyword">times</span> but <span class="keyword">use</span> max <span class="number">5</span> connections at the same <span class="keyword">time</span>.
  <span class="keyword">return</span> eachWithLimit(<span class="number">_</span>.<span class="keyword">times</span>(<span class="number">50</span>, () =&amp;<span class="keyword">gt</span>; getRandomGif), <span class="number">5</span>);
}).resolve(() =&amp;<span class="keyword">gt</span>; console.<span class="keyword">log</span>(&amp;apos;I have a lot of GIFs now.&amp;apos;))
</code></pre><p>where getRandomGif returns a future for the result of HTTP GET request to a service that returns random GIFs. Now this here&apos;s a simple way to implement eachWithLimit : </p>
<pre><code>const eachWithLimit = (futureFuns, limit = Number.MAX_VALUE) =&amp;gt; {  
  <span class="variable"><span class="keyword">var</span> info</span> = {
    blockedTasks: [],
    futures: [],
    running: <span class="number">0</span>,
    limit
  }

  <span class="comment">// Queue up our tasks.</span>
  futureFuns.forEach((<span class="function"><span class="keyword">fun</span>) =&amp;gt; {</span>
    addTask(<span class="function"><span class="keyword">fun</span>, info)</span>
  });

  <span class="comment">// Wait for the results.</span>
  let fut, results = [];
  <span class="keyword">while</span> (fut = info.futures.shift()) {
    results.push(fut.wait());
  }

  <span class="keyword">return</span> results;
};
</code></pre><p>And here&apos;s how we could implement the addTask function that takes care of scheduling and running the actual parallel jobs. </p>
<pre><code><span class="variable"><span class="keyword">var</span> addTask</span> = (<span class="function"><span class="keyword">fun</span>, info) =&amp;gt; {  </span>
  <span class="keyword">if</span> (info.running &amp;gt;= info.limit) {
    <span class="comment">// We&amp;apos;ve hit the concurrency limit. Wait up.</span>
    info.blockedTasks.push(<span class="function"><span class="keyword">fun</span>);</span>
    <span class="keyword">return</span>;
  }

  ++info.running;

  <span class="comment">// Run the task in a future.</span>
  let fut = <span class="function"><span class="title">fun</span><span class="params">()</span>;</span>
  info.futures.push(fut);

  <span class="comment">// Wait for the task to finish.</span>
  fut.resolve((err, <span class="variable"><span class="keyword">val</span>)</span> =&amp;gt; {
    --info.running;
    <span class="comment">// Schedule the next waiting task in the queue.</span>
    <span class="keyword">if</span> (info.blockedTasks.length &amp;gt; <span class="number">0</span>) {
      addTask(info.blockedTasks.shift(), info);
    }
  });
}
</code></pre><p>Everything is pretty straightforward here. We queue up the jobs if we reach the concurrency limit and every time a job is done, we schedule the next one from the blockedTasks queue. When they&apos;re all done, blockedTasks will become empty rendering the while cycle condition in eachWithLimit falsy and returning an array with results. This way we can easily run N jobs in parallel and limit the concurrency to acceptable level. Easy enough right? </p>
<p>For a mature implementation of concurrency throttling with fibers, I recommend you check out the very fine <a href="https://github.com/scriby/asyncblock/blob/master/docs/maxparallel.md" target="_blank" rel="external">asyncblock</a> and <a href="https://github.com/sethyuan/asyncflow/wiki/Tutorial#concurrency-limit" target="_blank" rel="external">asyncflow</a> libraries. </p>
<p>Have fun with Meteor and fibers! I&apos;m <a href="https://twitter.com/tomas_brambora" target="_blank" rel="external">@tomas_brambora</a> . </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Meteor/">Meteor</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/2de80b2/" title="npm please stop hurting Visual Studio -" itemprop="url">npm please stop hurting Visual Studio -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T03:01:12.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>I don&apos;t know about you but I personally feel that the following sentence may well be the saddest in the English language:</p>
<p>2&gt;ASPNETCOMPILER : error ASPRUNTIME: The specified path, file name, or both are too long. The fully qualified file name must be less than 260 characters, and the directory name must be less than 248 characters.</p>
<p>The message above would suggest there is some kind of ASP.Net issue going on. There isn&apos;t - the problem actually lies with Windows. It&apos;s <a href="http://blog.icanmakethiswork.io/2014/12/gulp-npm-long-paths-and-visual-studio-fight.html" target="_blank" rel="external">not the first time it&apos;s come up</a> but for those of you not aware there is something you need to know about Windows: <em>It handles long paths badly.</em></p>
<p>There&apos;s a number of caveats which people may attach the above sentence. But essentially what I have said is true. And it becomes brutally apparent to you the moment you start using a few node powered tools in your workflow. You will likely see that horrible message and you won&apos;t be able to get much further forward. Sigh. I thought this was the future…</p>
<h4 id="The_Latest_Infraction">The Latest Infraction</h4><p>I&apos;m a big fan of Gulp and Bower. They rock. <a href="https://twitter.com/codecadwallader" target="_blank" rel="external">Steve Cadwallader</a> wrote an excellent blog post about <a href="http://www.codecadwallader.com/2015/03/15/integrating-gulp-into-your-tfs-builds-and-web-deploy/" target="_blank" rel="external">integrating Gulp into your Visual Studio build</a> . Essentially the Gist of his post is this: forget using <a href="https://visualstudiogallery.msdn.microsoft.com/8e1b4368-4afb-467a-bc13-9650572db708" target="_blank" rel="external">Task Runner Explorer</a>to trigger your Gulp / Grunt jobs. No, actually plug it into the build process by tweaking your file. The first time I used this approach it was a dream come true. It just worked and I was a very happy man. </p>
<p>Since this approach was so marvellous I took a look at the demo / docs part of <a href="https://github.com/johnnyreilly/jQuery.Validation.Unobtrusive.Native" target="_blank" rel="external">jQuery Validation Unobtrusive Native</a>with a view to applying it there. I originally wrote this back in 2013 and at the time used NuGet for both server and client side package management. I decided to migrate it to use Bower for the client side packages (which I planned to combine with a Gulp script which was going to pull out the required JS / CSS etc as needed). However it wasn&apos;t the plain sailing I&apos;d imagined. The actual switchover from NuGet to Bower was simple. Just a case of removing NuGet packages and adding their associated Bower counterpart. The problem came when the migration was done and I hit &quot;compile&quot;. That&apos;s when I got to see etc </p>
<p>For reasons that I don&apos;t fully understand, Visual Studio is really upset by the presence in the project structure of one almighty long path. Oddly enough, not a path that&apos;s actually part of the Visual Studio project in question at all. Rather one that has come along as a result of our Gulp / Bower / npm shenanigans. Quick as a flash, I whipped out Daniel Schroeder&apos;s <a href="https://pathlengthchecker.codeplex.com/" target="_blank" rel="external">Path Length Checker</a> to see where the problem lay: </p>
<p><img src="http://taojinke.github.io/img/20150702/2de65d7.png" alt=""></p>
<p>And lo, the fault lay with Bower. Poor show, Bower, poor show.</p>
<h4 id="rimraf_to_the_Rescue">rimraf to the Rescue</h4><p><a href="https://github.com/isaacs/rimraf" target="_blank" rel="external">rimraf</a> is &quot;the <a href="https://en.wikipedia.org/wiki/Rm_(Unix)" target="_blank" rel="external">UNIX command</a> for node&quot;. (By the way, what is it with node and the pathological hatred of capital letters?) </p>
<p>What this means is: rimraf can delete. Properly. So let&apos;s get it: . Then at any time at the command line we can dispose of a long path in 2 shakes of lamb&apos;s tail. </p>
<p>In my current situation the contents of thefolder is causing me heartache. But with rimraf in play I can get rid of it with the magic words:. Alakazam! So let&apos;s poke this command into the extra commands that I&apos;ve already shoplifted from Steve&apos;s blog post. I&apos;ll end up with the following section of XML at the end of my : </p>
<pre><code><span class="subst">&amp;</span><span class="literal">lt</span>;PropertyGroup<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;CompileDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
    $(CompileDependsOn);
    GulpBuild;
  <span class="subst">&amp;</span><span class="literal">lt</span>;/CompileDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;CleanDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
    $(CleanDependsOn);
    GulpClean
  <span class="subst">&amp;</span><span class="literal">lt</span>;/CleanDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;CopyAllFilesToSingleFolderForPackageDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
    CollectGulpOutput;
    $(CopyAllFilesToSingleFolderForPackageDependsOn);
  <span class="subst">&amp;</span><span class="literal">lt</span>;/CopyAllFilesToSingleFolderForPackageDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;CopyAllFilesToSingleFolderForMsdeployDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
    CollectGulpOutput;
    $(CopyAllFilesToSingleFolderForPackageDependsOn);
  <span class="subst">&amp;</span><span class="literal">lt</span>;/CopyAllFilesToSingleFolderForMsdeployDependsOn<span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;/PropertyGroup<span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;Target Name<span class="subst">=&amp;</span>quot;GulpBuild<span class="subst">&amp;</span>quot;<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;Exec Command<span class="subst">=&amp;</span>quot;npm install<span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;Exec Command<span class="subst">=&amp;</span>quot;bower install<span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;Exec Command<span class="subst">=&amp;</span>quot;gulp<span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;Exec Command<span class="subst">=&amp;</span>quot;rimraf <span class="built_in">.</span>/node_modules<span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;/Target<span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;Target Name<span class="subst">=&amp;</span>quot;GulpClean<span class="subst">&amp;</span>quot;<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;Exec Command<span class="subst">=&amp;</span>quot;gulp clean<span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;/Target<span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;Target Name<span class="subst">=&amp;</span>quot;CollectGulpOutput<span class="subst">&amp;</span>quot;<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;ItemGroup<span class="subst">&amp;</span><span class="literal">gt</span>;
    <span class="subst">&amp;</span><span class="literal">lt</span>;_CustomFiles Include<span class="subst">=&amp;</span>quot;build<span class="subst">\**\*&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
    <span class="subst">&amp;</span><span class="literal">lt</span>;FilesForPackagingFromProject Include<span class="subst">=&amp;</span>quot;<span class="subst">%</span>(_CustomFiles<span class="built_in">.</span>Identity)<span class="subst">&amp;</span>quot;<span class="subst">&amp;</span><span class="literal">gt</span>;
      <span class="subst">&amp;</span><span class="literal">lt</span>;DestinationRelativePath<span class="subst">&amp;</span><span class="literal">gt</span>;build<span class="subst">\%</span>(RecursiveDir)<span class="subst">%</span>(Filename)<span class="subst">%</span>(Extension)<span class="subst">&amp;</span><span class="literal">lt</span>;/DestinationRelativePath<span class="subst">&amp;</span><span class="literal">gt</span>;
    <span class="subst">&amp;</span><span class="literal">lt</span>;/FilesForPackagingFromProject<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;/ItemGroup<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;Message Text<span class="subst">=&amp;</span>quot;CollectGulpOutput <span class="built_in">list</span>: <span class="subst">%</span>(_CustomFiles<span class="built_in">.</span>Identity)<span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;/Target<span class="subst">&amp;</span><span class="literal">gt</span>;
</code></pre><p>So let&apos;s focus on the important bits in the middle:</p>
<ul>
<li><ul>
<li>install the node packages our project uses as specified in . This will include Gulp and Bower. The latter package is going to contain super-long, Windows wrecking paths.</li>
</ul>
</li>
<li><ul>
<li>install the bower packages specified in using Bower (which was installed by npm just now).</li>
</ul>
</li>
<li><ul>
<li>do a little dance, make a little love, copy a few files, get down tonight.</li>
</ul>
</li>
<li><ul>
<li>remove thefolder populated by the command.</li>
</ul>
</li>
</ul>
<p>With that addition of to the build phase the problem goes away. During each build a big, big Windows path is being constructed but then it&apos;s wiped again before it has chance to upset anyone. </p>
<p>You are very welcome.</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Gulp/">Gulp</a><a href="/tags/Visual-Studio/">Visual Studio</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/567d04d/" title="TransitionAnimation 的内存预加载（不知可否称预渲染），优化不同尺寸图片的顺滑穿越 -" itemprop="url">TransitionAnimation 的内存预加载（不知可否称预渲染），优化不同尺寸图片的顺滑穿越 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T02:40:52.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><img src="http://taojinke.github.io/img/20150702/567b090.gif" alt=""></p>
<p>&#x5728;&#x505A; &#x59B9;&#x7EB8;.gank.io &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x6211;&#x4F7F;&#x7528; 5.0 &#x6240;&#x5E26;&#x6765;&#x7684;&#x65B0;&#xA0;TransitionAnimation &#x7279;&#x6027;&#x7684;&#x65F6;&#x5019;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x7B80;&#x5355;&#x8BF4;&#x5C31;&#x662F;&#x8BA9;&#x4E24;&#x4E2A;&#x9875;&#x9762;&#x76F8;&#x540C;&#x7684;&#x7EC4;&#x4EF6;&#x80FD;&#x591F;&#x6765;&#x56DE;&#x7A7F;&#x8D8A;&#xFF0C;&#x5982; gif &#x56FE;&#x6240;&#x793A;&#x2014;&#x2014;&#x6211;&#x53D1;&#x73B0;&#x6211;&#x70B9;&#x51FB;&#x4E3B;&#x9875;&#x7684;&#x59B9;&#x7EB8;&#x56FE;&#xFF0C;&#x8DF3;&#x5230;&#x67E5;&#x770B;&#x59B9;&#x7EB8;&#x539F;&#x56FE;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x4F1A;&#x5728;&#x59B9;&#x7EB8;&#x539F;&#x56FE;&#x7684;&#x9875;&#x9762;&#x51FA;&#x73B0;&#x5C0F;&#x95EE;&#x9898;&#xFF0C;&#x5373;&#x6709;&#x65F6;&#x59B9;&#x7EB8;&#x56FE;&#x4F1A;&#x5361;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#x6CA1;&#x6709;&#x6269;&#x5C55;&#x5230;&#x6574;&#x4E2A;&#x5C4F;&#x5E55;&#x5927;&#x5C0F;&#x3002;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5728;5.0&#x4EE5;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x5C24;&#x5176;&#x660E;&#x663E;&#x3002;</p>
<p>&#x539F;&#x56E0;&#x6211;&#x60F3;&#x662F;&#x56E0;&#x4E3A;&#x4E24;&#x5F20;&#x59B9;&#x7EB8;&#x56FE;&#x7684;&#x5C3A;&#x5BF8;&#x5176;&#x5B9E;&#x662F;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x5728;&#x4E3B;&#x9875;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x7565;&#x7F29;&#x56FE;&#xFF0C;&#x800C;&#x5728; PictureActivity &#x4F7F;&#x7528;&#x7684;&#x662F;&#x539F;&#x56FE;&#xFF0C;&#x4E24;&#x5F20;&#x5C3A;&#x5BF8;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x4E8E;&#x662F; load &#x56FE;&#x7247;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x91CD;&#x590D;&#x53BB;&#x53D6;&#x7F13;&#x5B58;&#x6587;&#x4EF6;&#xFF08;&#x6216;&#x7F51;&#x7EDC;&#x6587;&#x4EF6;&#xFF09;&#x518D;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x5F53;&#x4E2D;&#xFF0C;&#x8BFB;&#x53D6;&#x6587;&#x4EF6;&#x603B;&#x662F;&#x8981;&#x4E00;&#x5B9A;&#x65F6;&#x95F4;&#xFF0C;&#x5BFC;&#x81F4;&#x8DF3;&#x8DC3;&#x6216;&#x5361;&#x5728;&#x5DE6;&#x4E0A;&#x89D2;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x6211;&#x53D1;&#x73B0;&#x5F53;&#x7B2C;&#x4E8C;&#x6B21;&#x70B9;&#x51FB;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5C31;&#x4E0D;&#x4F1A;&#x5361;&#x6216;&#x8DF3;&#x8DC3;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5F20;&#x539F;&#x56FE;&#x5DF2;&#x7ECF;&#x5728;&#x7B2C;&#x4E00;&#x6B21; load &#x7684;&#x65F6;&#x5019;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x6B21;&#x5C31;&#x76F4;&#x63A5;&#x5185;&#x5B58;&#x4E2D;&#x53D6;&#x4E86;&#xFF0C;&#x56E0;&#x800C;&#x5F88;&#x987A;&#x6ED1;&#x5B8C;&#x7F8E;&#x3002;</p>
<p>&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x4E24;&#x70B9;&#x4EE5;&#x540E;&#xFF0C;&#x6211;&#x5F88;&#x5FEB;&#x60F3;&#x5230;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BA9;&#x7B2C;&#x4E00;&#x6B21;&#x5982;&#x7B2C;&#x4E8C;&#x6B21;&#x4E00;&#x822C;&#x987A;&#x6ED1;&#x6D41;&#x7545;&#x3002;&#x60F3;&#x5230;&#xFF1A;&#x53EA;&#x8981;&#x539F;&#x56FE;&#x5728;&#xFFFD;&#xFFFD;&#xFFFD;&#x5B58;&#x4E2D;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF0C;&#x70B9;&#x51FB;&#x4E4B;&#x540E;&#x5230;&#x539F;&#x56FE;&#x9875;&#x9762;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x53EA;&#x8981;&#x8BA9;&#x7A0B;&#x5E8F;&#x5728;&#x70B9;&#x51FB;&#x7684;&#x65F6;&#x5019;&#x9884;&#x5148;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#xFF0C;&#x7B49;&#x52A0;&#x8F7D;&#x597D;&#x4E86;&#xFF0C;&#x518D;&#x8FDB;&#x884C;&#x56DE;&#x8C03;&#xA0;startActivity() &#x662F;&#x4E0D;&#x662F;&#x5C31;&#x597D;&#x4E86;&#xFF1F;&#x5E94;&#x8BE5;&#x6CA1;&#x9519;&#xFF0C;&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x624D;&#x80FD;&#x9884;&#x52A0;&#x8F7D;&#x5230;&#x5185;&#x5B58;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#x5230;&#x4E86;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x770B;&#x5230; Instagram &#x7684;&#x4E00;&#x7BC7;&#x4F18;&#x5316;&#x6587;&#x7AE0;&#xFF0C;&#x8BB2;&#x5F97;&#x662F; Instagram &#x5BF9;&#x4E8E; TextView &#x7684;&#x9884;&#x52A0;&#x8F7D;&#x9884;&#x6E32;&#x67D3;&#x65B9;&#x6848;&#xFF0C;&#x4FBF;&#x662F;&#x5728;&#x4E00;&#x5757;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x8FDB;&#x884C;&#x9884;&#x5148;&#x52A0;&#x8F7D;&#x6E32;&#x67D3;&#x3002;&#x2014;&#x2014;&#x56E0;&#x6B64;&#x6211;&#x5F88;&#x81EA;&#x7136;&#x4E5F;&#x662F;&#x60F3;&#x5230;&#x5728;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x5730;&#x65B9;&#x653E;&#x4E00;&#x4E2A; ImageView &#x6765;&#x4F5C;&#x4E3A;&#x9884;&#x52A0;&#x8F7D;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x7B49;&#x52A0;&#x8F7D;&#x5B8C;&#x4E86;&#xFF0C;&#x539F;&#x56FE;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8FD9;&#x65F6;&#x5019;&#x518D; load &#x5C31;&#x987A;&#x6ED1;&#x4E86;&#x3002;</p>
<p>&#x6CA1;&#x60F3;&#x5230;&#x8FD9;&#x4E2A;&#x60F3;&#x6CD5;&#x5B9E;&#x73B0;&#x8D77;&#x6765;&#x4E00;&#x4E0B;&#x5B50;&#x5C31;&#x594F;&#x6548;&#x4E86;&#xFF0C;&#x90FD;&#x6CA1;&#x60F3;&#x5230;&#x8FD9;&#x4E48;&#x5B8C;&#x7F8E;&#xFF0C;&#x4FBF;&#x662F;&#x5982;&#x53F3;&#x4E0A;&#x8FB9;&#x7684; gif &#x56FE;&#x6240;&#x793A;&#xFF0C;&#x987A;&#x6ED1;&#x7A7F;&#x8D8A;~</p>
<p>&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x5C0F;&#x7EC6;&#x8282;&#x5C0F;&#x95EE;&#x9898;&#x88AB;&#x89E3;&#x51B3;&#xFF0C;&#x771F;&#x662F;&#x7279;&#x522B;&#x5F00;&#x5FC3;&#xFF0C;&#x771F;&#x7684;&#x662F;&#x5199;&#x7A0B;&#x5E8F;&#x7684;&#x4E50;&#x8DA3;&#x4E0D;&#x8FC7;&#x5982;&#x6B64;&#xFF0C;&#x81EA;&#x6211;&#x9676;&#x9189;&#xFF0C;&#x54C8;&#x54C8;&#xFF01;&#x53E6;&#x5916;&#xFF0C;&#x8BF4;&#x6765;&#x4E5F;&#x611F;&#x6168;&#xFF0C;&#x5728;&#x770B;&#x4E54;&#x5E03;&#x65AF;&#x7684;&#x90A3;&#x6B21;&#x300C;Stay hungry. Stay foolish.&#x300D;&#x7684;&#x6F14;&#x8BB2;&#xFF0C;&#x6211;&#x8BB0;&#x5F97;&#x4E54;&#x5E03;&#x65AF;&#x5206;&#x4EAB;&#x8FC7;&#x4ED6;&#x7684;&#x4E00;&#x4E2A;&#x6545;&#x4E8B;&#xFF0C;&#x8BF4;&#x5982;&#x679C;&#x5B83;&#x6CA1;&#x6709;&#x5728;&#x5341;&#x5E74;&#x524D;&#x5B66;&#x8FC7;&#x5B57;&#x4F53;&#x7684;&#x521B;&#x9020;&#x77E5;&#x8BC6;&#xFF0C;&#x4E5F;&#x5C31;&#x4E0D;&#x80FD;&#x591F;&#x5728;&#x5341;&#x5E74;&#x540E;&#x7684; Mac &#x7535;&#x8111;&#x4E0A;&#x7528;&#x4E0A;&#xFF08;&#x5B9E;&#x73B0;&#x3001;&#x521B;&#x9020;&#xFF09;&#x90A3;&#x4E48;&#x6F02;&#x4EAE;&#x7684;&#x5B57;&#x4F53;&#xFF0C;&#x4E0D;&#x61C2;&#x5F97;&#x8003;&#x7A76;&#x3002;&#x800C;&#x6211;&#x5982;&#x679C;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x90A3;&#x7BC7; Instagram &#x7684; TextView &#x4F18;&#x5316;&#xFF0C;&#x6211;&#x4F30;&#x8BA1;&#x4E5F;&#x60F3;&#x4E0D;&#x51FA;&#x73B0;&#x4ECA;&#x8FD9;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x3002;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/软件开发/">软件开发</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/567fc3f/" title="IPv4地址真的快耗尽了 地址段使用还需要排队 -" itemprop="url">IPv4地址真的快耗尽了 地址段使用还需要排队 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T02:40:52.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><img src="http://taojinke.github.io/img/20150702/567eb28.jpg" alt="IPv4&#x5730;&#x5740;&#x771F;&#x7684;&#x5FEB;&#x8017;&#x5C3D;&#x4E86;"></p>
<p>ARIN&#x8868;&#x793A;&#xFF0C;&#x5F53;&#x524D;&#x4ECD;&#x6709;&#x4E00;&#x4E9B;&#x66F4;&#x5C0F;&#x578B;&#x7684;IP&#x5730;&#x5740;&#x5757;&#x5C1A;&#x5B58;&#xFF0C;&#x4E5F;&#x4E3A;&#x4F01;&#x4E1A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;3&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9009;&#x62E9;&#x3002;&#x4F01;&#x4E1A;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x52A0;&#x5165;&#x5230;&#x7B49;&#x5019;&#x540D;&#x5355;&#x4E2D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x9700;&#x8981;&#x6392;&#x961F;&#x63A5;&#x53D7;&#x8FD9;&#x4E9B;IP&#x5730;&#x5740;&#x5757;&#x5206;&#x914D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x91C7;&#x7528;&#x8BF7;&#x6C42;IP&#x5730;&#x5740;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6216;&#x8005;&#x5E72;&#x8106;&#x5C06;&#x8BF7;&#x6C42;IP&#x5730;&#x5740;&#x7684;&#x65B9;&#x5F0F;&#x5F7B;&#x5E95;&#x629B;&#x5F03;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x7684;&#x786E;&#x9700;&#x8981;&#x66F4;&#x5927;&#x578B;IP&#x5730;&#x5740;&#x6BB5;&#x7684;&#x4F01;&#x4E1A;&#x7528;&#x6237;&#xFF0C;&#x53EF;&#x80FD;&#x5C31;&#x9700;&#x8981;&#x91C7;&#x7528;&#x4ED8;&#x8D39;&#x7684;&#x65B9;&#x5F0F;&#x4E86;&#x3002;</p>
<p>IPv4&#x5730;&#x5740;&#x8D44;&#x6E90;&#x7684;&#x8017;&#x8D39;&#x5728;2011&#x5E74;&#x65F6;&#x8FBE;&#x5230;&#x9876;&#x5CF0;&#xFF0C;&#x800C;&#x4E14;&#x5B9E;&#x9645;2014&#x5E74;&#x524D;&#x5728;&#x7F8E;&#x56FD;&#xFF0C;IPv4&#x5730;&#x5740;&#x5C31;&#x5DEE;&#x4E0D;&#x591A;&#x8017;&#x5B8C;&#x4E86;&#x3002;&#x8FD9;&#x8FEB;&#x4F7F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x4F01;&#x4E1A;&#x5F00;&#x59CB;&#x5347;&#x7EA7;&#x81F3;IPv6&#xFF08;IP&#x7B2C;&#x516D;&#x7248;&#xFF09;&#xFF0C;&#x6BD4;&#x8F83;&#x5178;&#x578B;&#x7684;&#x50CF;&#x662F;&#x5FAE;&#x8F6F;&#xFF0C;&#x7531;&#x4E8E;Azure&#x4E91;&#x670D;&#x52A1;&#x7528;&#x6237;&#x6BD4;&#x9884;&#x671F;&#x4E2D;&#x66F4;&#x5FEB;&#x52A0;&#x901F;IPv4&#x5730;&#x5740;&#x8D44;&#x6E90;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x5FAE;&#x8F6F;&#x7684;&#x5347;&#x7EA7;&#x5C31;&#x663E;&#x5F97;&#x76F8;&#x5F53;&#x79EF;&#x6781;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;IPv6&#x5730;&#x5740;&#x662F;&#x5728;1998&#x5E74;&#x5C31;&#x63D0;&#x51FA;&#x7684;&#xFF0C;&#x91C7;&#x7528;&#x66F4;&#x957F;&#x7684;&#x5730;&#x5740;&#x4F4D;&#x6570;&#xFF0C;&#x793A;&#x4F8B;&#x50CF;&#x662F;FE80:0000:0000:0000:0202:B3FF:FE1E:8329&#xFF0C;IPv6&#x534F;&#x8BAE;&#x7684;&#x63D0;&#x51FA;&#x9664;&#x4E86;&#x5BF9;IP&#x534F;&#x8BAE;&#x6808;&#x672C;&#x8EAB;&#x505A;&#x6539;&#x8FDB;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x7684;&#x786E;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;IPv4&#x5730;&#x5740;&#x4E0D;&#x591F;&#x7528;&#x7684;&#x95EE;&#x9898;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;IPv6&#x7684;&#x63A8;&#x8FDB;&#x6BD4;&#x4EBA;&#x4EEC;&#x9884;&#x60F3;&#x5F97;&#x6162;&#x4E86;&#x5F88;&#x591A;&#xFF0C;&#x597D;&#x50CF;&#x53EA;&#x5728;IPv4&#x8017;&#x5C3D;&#x8FEB;&#x5728;&#x7709;&#x776B;&#x7684;&#x65F6;&#x5019;&#xFF0C;IPv6&#x624D;&#x771F;&#x6B63;&#x88AB;&#x63D0;&#x4E0A;&#x65E5;&#x7A0B;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/567ed99.png" alt="Screen-Shot-2015-07-02-at-9.54.39-AM.png"></p>
<p>&#x8C37;&#x6B4C;&#x4E00;&#x76F4;&#x6709;&#x5728;&#x5BF9;&#x7528;&#x6237;&#x7684;IPv6&#x5730;&#x5740;&#x91C7;&#x7528;&#x60C5;&#x51B5;&#x505A;&#x8FFD;&#x8E2A;&#xFF0C;&#x62A5;&#x544A;&#x663E;&#x793A;&#xFF0C;&#x5176;7%&#x7684;&#x7528;&#x6237;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x4F7F;&#x7528;IPv6&#x534F;&#x8BAE;&#xFF0C;&#x76F8;&#x8F83;2&#x5E74;&#x524D;&#x589E;&#x957F;&#x4E86;2%&#x3002;&#x5F53;&#x524D;IPv6&#x91C7;&#x7528;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x4E24;&#x4E2A;&#x5730;&#x65B9;&#x662F;&#x6BD4;&#x5229;&#x65F6;&#x548C;&#x745E;&#x58EB;&#x3002;&#x8FD9;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x5230;IPv6&#x7684;&#x66F4;&#x65B0;&#x6362;&#x4EE3;&#x7684;&#x786E;&#x662F;&#x9700;&#x8981;&#x52A0;&#x901F;&#x4E86;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/IPv6/">IPv6</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/568912c/" title="【超级干货】Axure学习总结之功能篇 -" itemprop="url">【超级干货】Axure学习总结之功能篇 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T02:40:52.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x3010;&#x6587;&#x7AE0;&#x6458;&#x8981;&#x3011;&#x4F5C;&#x8005;&#x5B66;&#x4E60;Axure&#x7684;&#x7B14;&#x8BB0;&#x6574;&#x7406;&#xFF0C;&#x8D85;&#x5B9E;&#x7528;&#xFF01;</p>
<p><img src="http://taojinke.github.io/img/20150702/56867ab.jpg" alt=""></p>
<p>&#x4F5C;&#x8005;&#x4FE1;&#x606F;</p>
<p>&#x59D3;&#x540D;&#xFF1A;&#x6F58;&#x5029;&#x5029;&#xFF08;Maria&#xFF09;</p>
<p>&#x672C;&#x6587;&#x4E3A;&#x539F;&#x521B;&#x4F5C;&#x54C1;&#xFF0C;&#x4EC5;&#x4F9B;&#x5B66;&#x4E60;&#x4EA4;&#x6D41;&#x4F7F;&#x7528;&#xFF0C;&#x672A;&#x7ECF;&#x5141;&#x8BB8;&#xFF0C;&#x8BF7;&#x52FF;&#x505A;&#x5546;&#x4E1A;&#x5316;&#x7528;&#x9014;&#x3002;</p>
<h2 id="&#xFF08;&#x4E00;&#xFF09;&#x53D8;&#x91CF;&#x5E94;&#x7528;">&#xFF08;&#x4E00;&#xFF09;&#x53D8;&#x91CF;&#x5E94;&#x7528;</h2><p>&#x672C;&#x7AE0;&#x8282;&#x4EE5;&#x5B9E;&#x73B0;&#x201C;&#x7F51;&#x9875;&#x5012;&#x8BA1;&#x65F6;&#x201D;&#x52A8;&#x753B;&#x6548;&#x679C;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E86;&#x89E3;&#x53D8;&#x91CF;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x53EF;&#x767B;&#x9646;<a href="http://uyn25u.axshare.com&#x67E5;&#x770B;&#x6F14;&#x793A;&#x6548;&#x679C;&#xFF0C;&#x5BC6;&#x7801;pqq123" target="_blank" rel="external">http://uyn25u.axshare.com&#x67E5;&#x770B;&#x6F14;&#x793A;&#x6548;&#x679C;&#xFF0C;&#x5BC6;&#x7801;pqq123</a></p>
<h4 id="1-_&#x53D8;&#x91CF;&#x521B;&#x5EFA;">1. &#x53D8;&#x91CF;&#x521B;&#x5EFA;</h4><p>Axure&#x7684;&#x53D8;&#x91CF;&#x6709;&#x4E24;&#x79CD;&#xFF0C;&#x4E00;&#x7C7B;&#x662F;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x5728;&#x5168;&#x5C40;&#x8303;&#x56F4;&#x5185;&#x6709;&#x6548;&#xFF0C;&#x53E6;&#x4E00;&#x7C7B;&#x662F;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x53EA;&#x5728;&#x5B9A;&#x4E49;&#x5B83;&#x7684;&#x90E8;&#x4EF6;&#x8303;&#x56F4;&#x5185;&#x6709;&#x6548;&#x3002;</p>
<p>1.1 &#x5168;&#x5C40;&#x53D8;&#x91CF;</p>
<p>&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5B9E;&#x73B0;&#x4E0D;&#x540C;&#x9875;&#x9762;&#x95F4;&#x7684;&#x6570;&#x636E;&#x4F20;&#x9012;&#x3002;&#x4E00;&#x4E2A;&#x539F;&#x578B;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x5B9A;&#x4E49;&#x7684;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5EFA;&#x8BAE;&#x4E0D;&#x8981;&#x8D85;&#x8FC7;25&#x4E2A;&#x3002;</p>
<p>&#x4F4D;&#x7F6E;&#xFF1A;&#x7EBF;&#x6846;&#x56FE;&#x2014;&#x2014;&#x7BA1;&#x7406;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x53EF;&#x5728;&#x7BA1;&#x7406;&#x754C;&#x9762;&#xFF0C;&#x589E;&#x52A0;&#x3001;&#x5220;&#x9664;&#x3001;&#x7F16;&#x8F91;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/5686a1c.png" alt=""></p>
<p>1.2 &#x5C40;&#x90E8;&#x53D8;&#x91CF;</p>
<p>&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x4E00;&#x822C;&#x5728;&#x4EA4;&#x4E92;&#x4E2D;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x5728;&#x7F16;&#x5199;&#x4EA4;&#x4E92;&#x4E8B;&#x4EF6;&#x65F6;&#x5B9A;&#x4E49;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/5686c8d.png" alt=""></p>
<p>1&#xFF09;&#x53EF;&#x5728;&#x6761;&#x4EF6;&#x5206;&#x652F;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/5686efe.png" alt=""></p>
<p>&#x5728;&#x51FA;&#x73B0; &#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5747;&#x53EF;&#x70B9;&#x51FB;&#x8FDB;&#x5165;&#x53D8;&#x91CF;&#x7F16;&#x8F91;&#x9875;&#x9762;&#x3002;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/568716f.png" alt=""></p>
<p>&#x4E0B;&#x9762;&#x7684;&#x533A;&#x57DF;&#x4E3A;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7F16;&#x8F91;&#x6846;&#xFF0C;&#x53EF;&#x6DFB;&#x52A0;&#x3001;&#x5220;&#x9664;&#x3001;&#x4FEE;&#x6539;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x53EF;&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;&#x7684;&#x521D;&#x59CB;&#x503C;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x7684;&#x533A;&#x57DF;&#x4E3A;&#x53D8;&#x91CF;&#x5E94;&#x7528;&#x533A;&#xFF0C;&#x53EF;&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x8868;&#x8FBE;&#x5F0F;&#x3002;</p>
<p>2&#xFF09;&#x53EF;&#x5728;&#x503C;&#x7F16;&#x8F91;&#x5668;&#x4E2D;&#x5B9A;&#x4E49;&#xFF0C;&#x7528;&#x4F8B;&#x7F16;&#x8F91;&#x5668;&#x2014;&#x2014;&#x8BBE;&#x7F6E;&#x53D8;&#x91CF;/&#x90E8;&#x4EF6;&#x503C;&#x2014;&#x2014;&#x6253;&#x5F00;&#x8BBE;&#x7F6E;&#x503C;&#x7F16;&#x8F91;&#x5668;&#x3002;</p>
<h4 id="2-_&#x53D8;&#x91CF;&#x5E94;&#x7528;">2. &#x53D8;&#x91CF;&#x5E94;&#x7528;</h4><p>&#x4E0B;&#x9762;&#x4EE5;&#x5B9E;&#x73B0;&#x201C;&#x7F51;&#x9875;&#x5012;&#x8BA1;&#x65F6;&#x201D;&#x52A8;&#x753B;&#x6548;&#x679C;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E86;&#x89E3;&#x53D8;&#x91CF;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x3010;&#x6548;&#x679C;&#x63CF;&#x8FF0;&#x3011;</p>
<p>&#x4ECE;01&#x65F6;01&#x5206;00&#x79D2;&#x5F00;&#x59CB;&#x5012;&#x8BA1;&#x65F6;&#xFF0C;&#x52A8;&#x6001;&#x663E;&#x793A;&#x5012;&#x8BA1;&#x65F6;&#x6548;&#x679C;&#xFF0C;&#x5982;01&#x65F6;00&#x5206;59&#x79D2;&#x3001;01&#x65F6;00&#x5206;58&#x79D2;&#x3001;01&#x65F6;00&#x5206;57&#x79D2;&#x2026;&#x2026;</p>
<p>&#x3010;&#x8BBE;&#x8BA1;&#x63CF;&#x8FF0;&#x3011;</p>
<p>&#x5012;&#x8BA1;&#x65F6;&#x7684;&#x6301;&#x7EED;&#x9700;&#x8981;&#x5FAA;&#x73AF;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x52A8;&#x6001;&#x9762;&#x677F;&#x7684;&#x663E;&#x793A;&#x548C;&#x9690;&#x85CF;&#x4E8B;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#x5FAA;&#x73AF;&#x3002;</p>
<p>1&#xFF09;&#x5728;&#x9762;&#x677F;&#x663E;&#x793A;&#x65F6;&#x6539;&#x53D8;&#x76F8;&#x5E94;&#x6570;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x8BA9;&#x9762;&#x677F;&#x9690;&#x85CF;&#xFF0C;&#x89E6;&#x53D1;&#x9690;&#x85CF;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>2&#xFF09;&#x9762;&#x677F;&#x9690;&#x85CF;&#x65F6;&#x7B49;&#x5F85;1000&#x6BEB;&#x79D2;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x8BFB;&#x79D2;&#x6548;&#x679C;&#xFF0C;&#x518D;&#x8BA9;&#x9762;&#x677F;&#x663E;&#x793A;&#xFF0C;&#x89E6;&#x53D1;&#x663E;&#x793A;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>3&#xFF09;&#x5982;&#x6B64;&#x5FAA;&#x73AF;&#x5F80;&#x590D;&#xFF0C;&#x5373;&#x53EF;&#x5B9E;&#x73B0;&#x5012;&#x8BA1;&#x65F6;&#x6548;&#x679C;&#x3002;</p>
<p>&#x3010;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x3011;</p>
<p>1&#xFF09;&#x5C06;&#x9700;&#x8981;&#x7684;&#x90E8;&#x4EF6;&#x62D6;&#x52A8;&#x5230;&#x9875;&#x9762;&#x4E0A;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/56873e0.png" alt=""></p>
<p>6&#x4E2A;&#x6587;&#x672C;&#x9762;&#x677F;&#xFF0C;&#x5176;&#x4E2D;3&#x4E2A;&#x7528;&#x6765;&#x6807;&#x8BC6;&#x65F6;&#x3001;&#x5206;&#x3001;&#x79D2;&#xFF0C;&#x5B9E;&#x73B0;&#x6570;&#x5B57;&#x7684;&#x52A8;&#x6001;&#x663E;&#x793A;&#xFF1B;</p>
<p>1&#x4E2A;&#x5F00;&#x59CB;&#x6309;&#x94AE;&#xFF0C;&#x89E6;&#x53D1;&#x5012;&#x8BA1;&#x65F6;&#xFF1B;</p>
<p>1&#x4E2A;&#x52A8;&#x6001;&#x9762;&#x677F;&#xFF0C;&#x5B9E;&#x73B0;&#x5FAA;&#x73AF;&#x3002;</p>
<p>2&#xFF09;&#x8BBE;&#x8BA1;&#x5F00;&#x59CB;&#x6309;&#x94AE;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/5687651.png" alt=""></p>
<p>&#x5207;&#x6362;&#x52A8;&#x6001;&#x9762;&#x677F;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x89E6;&#x53D1;&#x52A8;&#x6001;&#x9762;&#x677F;&#x663E;&#x793A;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>3&#xFF09;&#x8BBE;&#x8BA1;&#x52A8;&#x6001;&#x9762;&#x677F;&#x663E;&#x793A;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/56878c2.png" alt=""></p>
<p>&#x5B9E;&#x73B0;&#x5012;&#x8BA1;&#x65F6;&#x6548;&#x679C;&#x3002;&#x5F53;&#x5206;&#x51CF;1&#x65F6;&#xFF0C;&#x79D2;&#x4ECE;59&#x5F00;&#x59CB;&#xFF1B;&#x5F53;&#x65F6;&#x51CF;1&#x65F6;&#xFF0C;&#x5206;&#x3001;&#x79D2;&#x90FD;&#x4ECE;59&#x5F00;&#x59CB;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/56878c2.jpg" alt=""></p>
<p>&#x5F53;&#x65F6;&#x3001;&#x5206;&#x3001;&#x79D2;&#x7684;&#x957F;&#x5EA6;&#x5C0F;&#x4E8E;2&#x65F6;&#xFF0C;&#x5982;&#x4E3A;5&#xFF0C;&#x5219;&#x5728;&#x524D;&#x9762;&#x8865;0&#xFF0C;&#x53D8;&#x6210;05&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/5687b33.png" alt=""></p>
<p>&#x5207;&#x6362;&#x52A8;&#x6001;&#x9762;&#x677F;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x89E6;&#x53D1;&#x52A8;&#x6001;&#x9762;&#x677F;&#x9690;&#x85CF;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>4&#xFF09;&#x8BBE;&#x8BA1;&#x52A8;&#x6001;&#x9762;&#x677F;&#x9690;&#x85CF;&#x4E8B;&#x4EF6;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/5687b33.png" alt=""></p>
<p>&#x5148;&#x7B49;&#x5F85;1000ms&#xFF0C;&#x5B9E;&#x73B0;&#x8BFB;&#x79D2;&#x6548;&#x679C;&#xFF0C;&#x518D;&#x5207;&#x6362;&#x52A8;&#x6001;&#x9762;&#x677F;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x89E6;&#x53D1;&#x52A8;&#x6001;&#x9762;&#x677F;&#x663E;&#x793A;&#x4E8B;&#x4EF6;&#x3002;</p>
<p>&#x81F3;&#x6B64;&#x8BBE;&#x8BA1;&#x5B8C;&#x6210;&#xFF0C;&#x53EF;&#x8FD0;&#x884C;&#x770B;&#x6267;&#x884C;&#x6548;&#x679C;&#x4E86;~~~</p>
<p>&#x5176;&#x5B9E;&#xFF0C;&#x4E0A;&#x8FF0;&#x52A8;&#x6001;&#x6548;&#x679C;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;3&#x4E2A;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0D;&#x8FC7;&#x5BF9;&#x4E8E;&#x9875;&#x9762;&#x8F83;&#x591A;&#x3001;&#x4EA4;&#x4E92;&#x6548;&#x679C;&#x8F83;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x539F;&#x578B;&#x800C;&#x8A00;&#xFF0C;&#x80FD;&#x7528;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x5C3D;&#x91CF;&#x4E0D;&#x8981;&#x7528;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#xFF0C;&#x56E0;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x6570;&#x91CF;&#x6709;&#x9650;&#xFF0C;&#x4E14;&#x5168;&#x5C40;&#x53D8;&#x91CF;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x6CA1;&#x6709;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x7684;&#x9AD8;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JavaScript/">JavaScript</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/56919e4/" title="Kafka实战－Flume到Kafka -" itemprop="url">Kafka实战－Flume到Kafka -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T02:40:52.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h2 id="1-&#x6982;&#x8FF0;">1.&#x6982;&#x8FF0;</h2><p>&#x524D;&#x9762;&#x7ED9;&#x5927;&#x5BB6;&#x4ECB;&#x7ECD;&#x4E86;&#x6574;&#x4E2A;Kafka&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x6D41;&#x7A0B;&#xFF0C;&#x4ECA;&#x5929;&#x7ED9;&#x5927;&#x5BB6;&#x5206;&#x4EAB;Kafka&#x5982;&#x4F55;&#x83B7;&#x53D6;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x5373;Kafka&#x751F;&#x4EA7;&#x6570;&#x636E;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4ECA;&#x5929;&#x8981;&#x5206;&#x4EAB;&#x7684;&#x76EE;&#x5F55;&#xFF1A;</p>
<ul>
<li>&#x6570;&#x636E;&#x6765;&#x6E90;</li>
<li>Flume&#x5230;Kafka</li>
<li>&#x6570;&#x636E;&#x6E90;&#x52A0;&#x8F7D;</li>
<li>&#x9884;&#x89C8;</li>
</ul>
<p>&#x4E0B;&#x9762;&#x5F00;&#x59CB;&#x4ECA;&#x5929;&#x7684;&#x5206;&#x4EAB;&#x5185;&#x5BB9;&#x3002;</p>
<h2 id="2-&#x6570;&#x636E;&#x6765;&#x6E90;">2.&#x6570;&#x636E;&#x6765;&#x6E90;</h2><p>Kafka&#x751F;&#x4EA7;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x662F;&#x7531;Flume&#x7684;Sink&#x63D0;&#x4F9B;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x7528;&#x5230;Flume&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x8FC7;Flume&#x96C6;&#x7FA4;&#x5C06;Agent&#x7684;&#x65E5;&#x5FD7;&#x6536;&#x96C6;&#x5206;&#x53D1;&#x5230;Kafka&#xFF08;&#x4F9B;&#x5B9E;&#x65F6;&#x8BA1;&#x7B97;&#x5904;&#x7406;&#xFF09;&#x548C;HDFS&#xFF08;&#x79BB;&#x7EBF;&#x8BA1;&#x7B97;&#x5904;&#x7406;&#xFF09;&#x3002;&#x5173;&#x4E8E;Flume&#x96C6;&#x7FA4;&#x7684;Agent&#x90E8;&#x7F72;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x591A;&#x505A;&#x8D58;&#x8FF0;&#x4E86;&#xFF0C;&#x4E0D;&#x6E05;&#x695A;&#x7684;&#x540C;&#x5B66;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x300A; <a href="http://www.cnblogs.com/smartloli/p/4468708.html" target="_blank" rel="external">&#x9AD8;&#x53EF;&#x7528;Hadoop&#x5E73;&#x53F0;&#xFF0D;Flume NG&#x5B9E;&#x6218;&#x56FE;&#x89E3;&#x7BC7;</a> &#x300B;&#x4E00;&#x6587;&#x4E2D;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x4E0B;&#x9762;&#x7ED9;&#x5927;&#x5BB6;&#x4ECB;&#x7ECD;&#x6570;&#x636E;&#x6765;&#x6E90;&#x7684;&#x6D41;&#x7A0B;&#x56FE;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A; </p>
<p><img src="http://taojinke.github.io/img/20150702/568edf2.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;Flume&#x4F5C;&#x4E3A;&#x65E5;&#x5FD7;&#x6536;&#x96C6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x6536;&#x96C6;&#x5230;&#x7684;&#x6570;&#x636E;&#x8F93;&#x9001;&#x5230;Kafka&#x4E2D;&#x95F4;&#x4EF6;&#xFF0C;&#x4EE5;&#x4F9B;Storm&#x53BB;&#x5B9E;&#x65F6;&#x6D88;&#x8D39;&#x8BA1;&#x7B97;&#xFF0C;&#x6574;&#x4E2A;&#x6D41;&#x7A0B;&#x4ECE;&#x5404;&#x4E2A;Web&#x8282;&#x70B9;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;Flume&#x7684;Agent&#x4EE3;&#x7406;&#x6536;&#x96C6;&#x65E5;&#x5FD7;&#xFF0C;&#x7136;&#x540E;&#x6C47;&#x603B;&#x5230;Flume&#x96C6;&#x7FA4;&#xFF0C;&#x5728;&#x7531;Flume&#x7684;Sink&#x5C06;&#x65E5;&#x5FD7;&#x8F93;&#x9001;&#x5230;Kafka&#x96C6;&#x7FA4;&#xFF0C;&#x5B8C;&#x6210;&#x6570;&#x636E;&#x7684;&#x751F;&#x4EA7;&#x6D41;&#x7A0B;&#x3002;</p>
<h2 id="3-Flume&#x5230;Kafka">3.Flume&#x5230;Kafka</h2><p>&#x4ECE;&#x56FE;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6E05;&#x695A;&#x4E86;&#x6570;&#x636E;&#x751F;&#x4EA7;&#x7684;&#x6D41;&#x7A0B;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5B9E;&#x73B0;Flume&#x5230;Kafka&#x7684;&#xFFFD;&#xFFFD;&#xFFFD;&#x9001;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x7528;&#x4E00;&#x4E2A;&#x7B80;&#x8981;&#x7684;&#x56FE;&#x6765;&#x8BF4;&#x660E;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/568f063.png" alt=""></p>
<p>&#x8FD9;&#x4E2A;&#x8868;&#x8FBE;&#x4E86;&#x4ECE;Flume&#x5230;Kafka&#x7684;&#x8F93;&#x9001;&#x5DE5;&#x7A0B;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x8FD9;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x5B8C;&#x6210;&#x8FD9;&#x90E8;&#x5206;&#x6D41;&#x7A0B;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6211;&#x4EEC;&#x5C06;Flume&#x96C6;&#x7FA4;&#x548C;Kafka&#x96C6;&#x7FA4;&#x90FD;&#x90E8;&#x7F72;&#x5B8C;&#x6210;&#xFF0C;&#x5728;&#x5B8C;&#x6210;&#x90E8;&#x7F72;&#x76F8;&#x5173;&#x96C6;&#x7FA4;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x914D;&#x7F6E;Flume&#x7684;Sink&#x6570;&#x636E;&#x6D41;&#x5411;&#xFF0C;&#x914D;&#x7F6E;&#x4FE1;&#x606F;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<ul>
<li><p>&#x9996;&#x5148;&#x662F;&#x914D;&#x7F6E;spooldir&#x65B9;&#x5F0F;&#xFF0C;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>  producer.sources.s.type = spooldir<br>  producer.sources.s.spoolDir = /home/hadoop/dir/logdfs</p>
</li>
<li><p>&#x5F53;&#x7136;&#xFF0C;Flume&#x7684;&#x6570;&#x636E;&#x53D1;&#x9001;&#x65B9;&#x7C7B;&#x578B;&#x4E5F;&#x662F;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#xFF0C;&#x6709;&#xFF1A;Console&#x3001;Text&#x3001;HDFS&#x3001;RPC&#x7B49;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4EEC;&#x7CFB;&#x7EDF;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x662F;Kafka&#x4E2D;&#x95F4;&#x4EF6;&#x6765;&#x63A5;&#x6536;&#xFF0C;&#x914D;&#x7F6E;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>  producer.sinks.r.type = org.apache.flume.plugins.KafkaSink<br>  producer.sinks.r.metadata.broker.list=dn1:9092,dn2:9092,dn3:9092<br>  producer.sinks.r.partition.key=0<br>  producer.sinks.r.partitioner.class=org.apache.flume.plugins.SinglePartition<br>  producer.sinks.r.serializer.class=kafka.serializer.StringEncoder<br>  producer.sinks.r.request.required.acks=0<br>  producer.sinks.r.max.message.size=1000000<br>  producer.sinks.r.producer.type=sync<br>  producer.sinks.r.custom.encoding=UTF-8<br>  producer.sinks.r.custom.topic.name=test</p>
</li>
</ul>
<p>&#x8FD9;&#x6837;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x5728;Flume&#x7684;Sink&#x7AEF;&#x914D;&#x7F6E;&#x597D;&#x4E86;&#x6570;&#x636E;&#x6D41;&#x5411;&#x63A5;&#x53D7;&#x65B9;&#x3002;</p>
<h2 id="4-&#x6570;&#x636E;&#x52A0;&#x8F7D;">4.&#x6570;&#x636E;&#x52A0;&#x8F7D;</h2><p>&#x5728;&#x5B8C;&#x6210;&#x914D;&#x7F6E;&#x540E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x5728;Flume&#x7684;spooldir&#x7AEF;&#x751F;&#x4EA7;&#x65E5;&#x5FD7;&#xFF0C;&#x4EE5;&#x4F9B;Flume&#x53BB;&#x6536;&#x96C6;&#x8FD9;&#x4E9B;&#x65E5;&#x5FD7;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;Kafka&#x7684;KafkaOffsetMonitor&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF0C;&#x53BB;&#x76D1;&#x63A7;&#x6570;&#x636E;&#x751F;&#x4EA7;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x52A0;&#x8F7D;&#x3002;</p>
<ul>
<li><p>&#x542F;&#x52A8;ZK&#x96C6;&#x7FA4;&#xFF0C;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>  zkServer.sh start</p>
</li>
</ul>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x5206;&#x522B;&#x5728;ZK&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x542F;&#x52A8;&#x3002;</p>
<ul>
<li><p>&#x542F;&#x52A8;Kafka&#x96C6;&#x7FA4;</p>
<p>  kafka-server-start.sh config/server.properties &amp;</p>
</li>
</ul>
<p>&#x5728;&#x5176;&#x4ED6;&#x7684;Kafka&#x8282;&#x70B9;&#x8F93;&#x5165;&#x540C;&#x6837;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5B8C;&#x6210;&#x542F;&#x52A8;&#x3002;</p>
<ul>
<li><p>&#x542F;&#x52A8;Kafka&#x76D1;&#x63A7;&#x5DE5;&#x5177;</p>
<p>  java -cp KafkaOffsetMonitor-assembly-0.2.0.jar \<br>   com.quantifind.kafka.offsetapp.OffsetGetterWeb \<br>   —zk dn1:2181,dn2:2181,dn3:2181 \<br>   —port 8089 \<br>   —refresh 10.seconds \<br>   —retain 1.days</p>
</li>
<li><p>&#x542F;&#x52A8;Flume&#x96C6;&#x7FA4;</p>
<p>  flume-ng agent -n producer -c conf -f flume-kafka-sink.properties -Dflume.root.logger=ERROR,console</p>
</li>
</ul>
<p>&#x7136;&#x540E;&#xFF0C;&#x6211;&#x5728;/home/hadoop/dir/logdfs&#x76EE;&#x5F55;&#x4E0B;&#x4E0A;&#x4F20;log&#x65E5;&#x5FD7;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x53EA;&#x62BD;&#x53D6;&#x4E86;&#x4E00;&#x5C11;&#x90E8;&#x5206;&#x65E5;&#x5FD7;&#x8FDB;&#x884C;&#x4E0A;&#x4F20;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x8868;&#x793A;&#x65E5;&#x5FD7;&#x4E0A;&#x4F20;&#x6210;&#x529F;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/568f545.png" alt=""></p>
<h2 id="5-&#x9884;&#x89C8;">5.&#x9884;&#x89C8;</h2><p>&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;Kafka&#x7684;&#x76D1;&#x63A7;&#x5DE5;&#x5177;&#xFF0C;&#x6765;&#x9884;&#x89C8;&#x6211;&#x4EEC;&#x4E0A;&#x4F20;&#x7684;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x5728;Kafka&#x4E2D;&#x4EA7;&#x751F;&#x6D88;&#x606F;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<ul>
<li>&#x542F;&#x52A8;Kafka&#x96C6;&#x7FA4;&#xFF0C;&#x4E3A;&#x751F;&#x4EA7;&#x6D88;&#x606F;&#x622A;&#x56FE;&#x9884;&#x89C8;</li>
</ul>
<p><img src="http://taojinke.github.io/img/20150702/568fc98.png" alt=""></p>
<ul>
<li>&#x901A;&#x8FC7;Flume&#x4E0A;&#x4F20;&#x65E5;&#x5FD7;&#xFF0C;&#x5728;Kafka&#x4E2D;&#x4EA7;&#x751F;&#x6D88;&#x606F;&#x6570;&#x636E;</li>
</ul>
<p><img src="http://taojinke.github.io/img/20150702/568ff09.png" alt=""></p>
<h2 id="6-&#x603B;&#x7ED3;">6.&#x603B;&#x7ED3;</h2><p>&#x672C;&#x7BC7;&#x6587;&#x7AE0;&#x7ED9;&#x5927;&#x5BB6;&#x8BB2;&#x8FF0;&#x4E86;Kafka&#x7684;&#x6D88;&#x606F;&#x4EA7;&#x751F;&#x6D41;&#x7A0B;&#xFF0C;&#x540E;&#x7EED;&#x4F1A;&#x5728;Kafka&#x5B9E;&#x6218;&#x7CFB;&#x5217;&#x4E2D;&#x4E3A;&#x5927;&#x5BB6;&#x8BB2;&#x8FF0;Kafka&#x7684;&#x6D88;&#x606F;&#x6D88;&#x8D39;&#x6D41;&#x7A0B;&#x7B49;&#x4E00;&#x6574;&#x5957;&#x6D41;&#x7A0B;&#xFF0C;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x4E3A;&#x540E;&#x7EED;&#x7684;Kafka&#x5B9E;&#x6218;&#x7F16;&#x7801;&#x6253;&#x4E0B;&#x4E00;&#x4E2A;&#x57FA;&#x7840;&#xFF0C;&#x8BA9;&#x5927;&#x5BB6;&#x5148;&#x5BF9;Kafka&#x7684;&#x6D88;&#x606F;&#x751F;&#x4EA7;&#x6709;&#x4E2A;&#x6574;&#x4F53;&#x7684;&#x8BA4;&#x8BC6;&#x3002;</p>
<h2 id="7-&#x7ED3;&#x675F;&#x8BED;">7.&#x7ED3;&#x675F;&#x8BED;</h2><p>&#x8FD9;&#x7BC7;&#x535A;&#x5BA2;&#x5C31;&#x548C;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x5927;&#x5BB6;&#x5728;&#x7814;&#x7A76;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x5F53;&#x4E2D;&#x6709;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x52A0;&#x7FA4;&#x8FDB;&#x884C;&#x8BA8;&#x8BBA;&#x6216;&#x53D1;&#x9001;&#x90AE;&#x4EF6;&#x7ED9;&#x6211;&#xFF0C;&#x6211;&#x4F1A;&#x5C3D;&#x6211;&#x6240;&#x80FD;&#x4E3A;&#x60A8;&#x89E3;&#x7B54;&#xFF0C;&#x4E0E;&#x541B;&#x5171;&#x52C9;&#xFF01;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Flume/">Flume</a><a href="/tags/Kafka/">Kafka</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/569a77e/" title="推荐几个有用的 Android Studio 插件和工具 -" itemprop="url">推荐几个有用的 Android Studio 插件和工具 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T02:40:52.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4E00;&#x6643;&#x597D;&#x4E45;&#x6CA1;&#x66F4;&#x65B0;&#x535A;&#x5BA2;&#x4E86;&#xFF0C;&#x6700;&#x8FD1;&#x4E00;&#x4E2A;&#x6708;&#x771F;&#x7684;&#x5F88;&#x5FD9;&#xFF0C;&#x56E0;&#x4E3A;&#x516C;&#x53F8;&#x5728;&#x51C6;&#x5907;C&#x8F6E;&#x878D;&#x8D44;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x53D1;&#x5C55;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x81EA;&#x5DF1;&#x5168;&#x90E8;&#x7CBE;&#x529B;&#x6295;&#x5165;&#x5728;&#x516C;&#x53F8;&#x4EA7;&#x54C1;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x53EF;&#x80FD;&#x8FD8;&#x4F1A;&#x6301;&#x7EED;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4ECA;&#x5929;&#x5FD9;&#x4E2D;&#x62BD;&#x95F2;&#x6765;&#x7ED9;&#x5927;&#x5BB6;&#x5206;&#x4EAB;&#x4E0B;&#x6211;&#x4EEC;&#x6700;&#x8FD1;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x91C7;&#x7528;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x80FD;&#x5E2E;&#x52A9;&#x56E2;&#x961F;&#x63D0;&#x5347;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x7684;&#x51E0;&#x4E2A;Android Studio&#x63D2;&#x4EF6;&#x548C;&#x5DE5;&#x5177;&#x3002;(&#x53EF;&#x76F4;&#x63A5;&#x70B9;&#x51FB;&#x6807;&#x9898;&#x8DF3;&#x8F6C;&#x5230;GitHub&#x4E3B;&#x9875;)</p>
<h2 id="1&#x3001;_ButterKnife_ZeleznyButterKnife_&#x751F;&#x6210;&#x5668;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;ButterKnife&#x7684;&#x8D76;&#x7D27;&#x53BB;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x641C;&#x4E0B;">1&#x3001; <a href="https://github.com/avast/android-butterknife-zelezny" target="_blank" rel="external">ButterKnife Zelezny</a>ButterKnife &#x751F;&#x6210;&#x5668;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;ButterKnife&#x7684;&#x8D76;&#x7D27;&#x53BB;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x641C;&#x4E0B;</h2><p><img src="http://taojinke.github.io/img/20150702/5698550.gif" alt=""></p>
<h2 id="2&#x3001;_SelectorChapek&#x8BBE;&#x8BA1;&#x5E08;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x597D;&#x4E86;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#xFF0C;&#x6BCF;&#x4E2A;&#x6309;&#x94AE;&#x90FD;&#x8981;&#x5199;&#x4E00;&#x4E2A;selector&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x9EBB;&#x70E6;&#xFF1F;&#x8FD9;&#x4E48;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x5C31;&#x4E3A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x800C;&#x751F;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#x544A;&#x8BC9;&#x8BBE;&#x8BA1;&#x5E08;&#x4EEC;&#x6309;&#x7167;&#x89C4;&#x8303;&#x547D;&#x540D;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x952E;&#x641E;&#x5B9A;&#x3002;">2&#x3001; <a href="https://github.com/inmite/android-selector-chapek" target="_blank" rel="external">SelectorChapek</a>&#x8BBE;&#x8BA1;&#x5E08;&#x7ED9;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x597D;&#x4E86;&#x5404;&#x79CD;&#x8D44;&#x6E90;&#xFF0C;&#x6BCF;&#x4E2A;&#x6309;&#x94AE;&#x90FD;&#x8981;&#x5199;&#x4E00;&#x4E2A;selector&#x662F;&#x4E0D;&#x662F;&#x5F88;&#x9EBB;&#x70E6;&#xFF1F;&#x8FD9;&#x4E48;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x5C31;&#x4E3A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x800C;&#x751F;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#x544A;&#x8BC9;&#x8BBE;&#x8BA1;&#x5E08;&#x4EEC;&#x6309;&#x7167;&#x89C4;&#x8303;&#x547D;&#x540D;&#x5C31;&#x597D;&#x4E86;&#xFF0C;&#x5176;&#x4ED6;&#x4E00;&#x952E;&#x641E;&#x5B9A;&#x3002;</h2><p><img src="http://taojinke.github.io/img/20150702/56987c1.png" alt=""></p>
<h2 id="3&#x3001;_GsonFormat&#x73B0;&#x5728;&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x7AEF;api&#x90FD;&#x4EE5;json&#x6570;&#x636E;&#x683C;&#x5F0F;&#x8FD4;&#x56DE;&#xFF0C;&#x800C;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x6839;&#x636E;api&#x63A5;&#x53E3;&#x751F;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x5B9E;&#x4F53;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x628A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x81EA;&#x52A8;&#x5316;&#x4E86;&#xFF0C;&#x8D76;&#x7D27;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x5427;&#x3002;">3&#x3001; <a href="https://github.com/zzz40500/GsonFormat" target="_blank" rel="external">GsonFormat</a>&#x73B0;&#x5728;&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x7AEF;api&#x90FD;&#x4EE5;json&#x6570;&#x636E;&#x683C;&#x5F0F;&#x8FD4;&#x56DE;&#xFF0C;&#x800C;&#x5BA2;&#x6237;&#x7AEF;&#x9700;&#x8981;&#x6839;&#x636E;api&#x63A5;&#x53E3;&#x751F;&#x6210;&#x76F8;&#x5E94;&#x7684;&#x5B9E;&#x4F53;&#x7C7B;&#xFF0C;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x628A;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x81EA;&#x52A8;&#x5316;&#x4E86;&#xFF0C;&#x8D76;&#x7D27;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x5427;&#x3002;</h2><p><img src="http://taojinke.github.io/img/20150702/56987c1.gif" alt=""></p>
<h2 id="4&#x3001;_ParcelableGeneratorAndroid&#x4E2D;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x5B9E;&#x73B0;Serializable&#x63A5;&#x53E3;&#x548C;Parcelable&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x5728;Android&#x4E2D;&#x662F;&#x63A8;&#x8350;&#x4F7F;&#x7528;Parcelable&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8981;&#x6BD4;Serializable&#x65B9;&#x5F0F;&#x8981;&#x7E41;&#x7410;&#xFF0C;&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4E00;&#x5207;&#x5C31;ok&#x4E86;&#x3002;">4&#x3001; <a href="https://github.com/mcharmas/android-parcelable-intellij-plugin" target="_blank" rel="external">ParcelableGenerator</a>Android&#x4E2D;&#x7684;&#x5E8F;&#x5217;&#x5316;&#x6709;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x5B9E;&#x73B0;Serializable&#x63A5;&#x53E3;&#x548C;Parcelable&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x5728;Android&#x4E2D;&#x662F;&#x63A8;&#x8350;&#x4F7F;&#x7528;Parcelable&#xFF0C;&#x53EA;&#x4E0D;&#x8FC7;&#x6211;&#x4EEC;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x8981;&#x6BD4;Serializable&#x65B9;&#x5F0F;&#x8981;&#x7E41;&#x7410;&#xFF0C;&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x63D2;&#x4EF6;&#x4E00;&#x5207;&#x5C31;ok&#x4E86;&#x3002;</h2><p><img src="http://taojinke.github.io/img/20150702/5698a32.png" alt=""></p>
<h2 id="5&#x3001;_LeakCanary&#x826F;&#x5FC3;&#x4F01;&#x4E1A;Square&#x6700;&#x8FD1;&#x521A;&#x5F00;&#x6E90;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#xFF0C;&#x5E2E;&#x52A9;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#x65B9;&#x4FBF;&#x7684;&#x68C0;&#x6D4B;&#x51FA;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x66F4;&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E0D;&#x5C11;&#x95EE;&#x9898;&#x3002;">5&#x3001; <a href="https://github.com/square/leakcanary" target="_blank" rel="external">LeakCanary</a>&#x826F;&#x5FC3;&#x4F01;&#x4E1A;Square&#x6700;&#x8FD1;&#x521A;&#x5F00;&#x6E90;&#x7684;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#xFF0C;&#x5E2E;&#x52A9;&#x4F60;&#x5728;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#x65B9;&#x4FBF;&#x7684;&#x68C0;&#x6D4B;&#x51FA;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x66F4;&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x56E2;&#x961F;&#x7B2C;&#x4E00;&#x65F6;&#x95F4;&#x4F7F;&#x7528;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E0D;&#x5C11;&#x95EE;&#x9898;&#x3002;</h2><p>&#x82F1;&#x6587;&#x4E0D;&#x597D;&#x7684;&#x8FD9;&#x91CC;&#x6709;&#x96F7;&#x950B;&#x540C;&#x5FD7;&#x7FFB;&#x8BD1;&#x7684;&#x4E2D;&#x6587;&#x7248; <a href="http://www.liaohuqiu.net/cn/posts/leak-canary-read-me/" target="_blank" rel="external">LeakCanary &#x4E2D;&#x6587;&#x4F7F;&#x7528;&#x8BF4;&#x660E;</a></p>
<p><img src="http://taojinke.github.io/img/20150702/5698ca3.png" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Android-Studio/">Android Studio</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/56aa566/" title="源码推荐(7.02)：LazyTableView（一个可以最大程度简化uitableview操作的第三方框架） -" itemprop="url">源码推荐(7.02)：LazyTableView（一个可以最大程度简化uitableview操作的第三方框架） -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T02:40:52.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x7B80;&#x5316;uitableview&#x64CD;&#x4F5C;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6846;&#x67B6;</p>
<p>UITableView&#x53EF;&#x8C13;&#x662F;ios&#x5F00;&#x53D1;&#x91CC;&#x7684;&#x91CD;&#x4E2D;&#x4E4B;&#x91CD;&#x4E86;&#xFF0C;&#x719F;&#x7EC3;&#x638C;&#x63E1;tableview&#x7684;&#x7A0B;&#x5EA6;&#x5F88;&#x5927;&#x610F;&#x4E49;&#x4E0A;&#x51B3;&#x5B9A;&#x7740;&#x4F60;&#x5BF9;ui&#x754C;&#x9762;&#x7684;&#x719F;&#x6089;&#x7A0B;&#x5EA6;&#xFF0C;&#x4E0D;&#x8FC7;&#x5F53;&#x903B;&#x8F91;&#x590D;&#x6742;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x64CD;&#x4F5C;uitableview&#x8FD8;&#x662F;&#x4E00;&#x4EF6;&#x633A;&#x9EBB;&#x70E6;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x6846;&#x67B6;&#x65E8;&#x5728;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x7684;&#x51CF;&#x8F7B;uitableview&#x7684;&#x7E41;&#x7410;&#xFF0C;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x4EEC;&#x53EF;&#x4EE5;&#x66F4;&#x591A;&#x7684;&#x53BB;&#x8003;&#x8651;&#x903B;&#x8F91;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x754C;&#x9762;&#x7684;&#x8C03;&#x6574;&#x3002;</p>
<h4 id="&#x5B83;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;">&#x5B83;&#x53EF;&#x4EE5;&#x505A;&#x4EC0;&#x4E48;</h4><p>1.&#x81EA;&#x52A8;&#x52A0;&#x8F7D;&#x8FDC;&#x7A0B;url&#x7684;json&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x4E8E;section&#x7684;&#x89E3;&#x6790;&#x4E5F;&#x4E0D;&#x5728;&#x8BDD;&#x4E0B;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x7528;&#x66F4;&#x5C11;&#x7684;&#x4EE3;&#x7801;&#x83B7;&#x5F97;&#x66F4;&#x9AD8;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<p>2.&#x624B;&#x5DE5;&#x521B;&#x5EFA;&#x672C;&#x5730;&#x7684;&#x9759;&#x6001;cell&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x7531;&#x7684;&#x63A7;&#x5236;section&#x548C;cell&#x7684;&#x4E00;&#x5207;&#x3002;</p>
<p>3.&#x81EA;&#x5B9A;&#x4E49;&#x7684;hud&#x52A8;&#x753B;&#x53EF;&#x4EE5;&#x5728;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#x6BEB;&#x65E0;&#x8FDD;&#x548C;&#x611F;&#x3002;</p>
<h4 id="&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x5B83;">&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x4F7F;&#x7528;&#x5B83;</h4><p>1.&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#xFF0C;&#x5C06;&#x5927;&#x91CF;&#x7E41;&#x7410;&#x7684;&#x64CD;&#x4F5C;&#x5C01;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x7528;&#x6237;&#x53EA;&#x9700;&#x51E0;&#x884C;&#x4EE3;&#x7801;&#x5373;&#x53EF;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x8FDC;&#x7A0B;&#x6570;&#x636E;&#x6293;&#x53D6;&#x7684;tableview&#x3002;</p>
<p>2.&#x4F7F;&#x7528;delegate&#x6A21;&#x5F0F;&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x5C06;cell&#xFF0C;viewcontroller&#x548C;data&#x5206;&#x79BB;&#x5F00;&#x6765;&#xFF0C;&#x4E00;&#x4E2A;cell&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;dataitem&#xFF0C;&#x4F7F;&#x7528;orm&#x5C06;&#x8FDC;&#x7A0B;&#x7684;json&#x6570;&#x636E;&#x8F6C;&#x5316;&#x4E3A;&#x672C;&#x5730;&#x7684;&#x5BF9;&#x8C61;&#x3002;</p>
<p>3.&#x672C;&#x5730;&#x9759;&#x6001;cell&#x53EF;&#x4EE5;&#x4F7F;&#x7528;block&#x521B;&#x5EFA;&#xFF0C;&#x5E76;&#x4E14;&#x8BBE;&#x7F6E;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x3002;</p>
<h4 id="&#x8026;&#x5408;&#x6027;">&#x8026;&#x5408;&#x6027;</h4><p>&#x6211;&#x4F7F;&#x7528;&#x4E86;AFNetwoking&#xFF0C;MJRefresh&#xFF0C;JsonModal&#x4E09;&#x4E2A;&#x6846;&#x67B6;&#x6765;&#x7B80;&#x5316;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x5199;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#xFFFD;&#xFFFD;&#xFFFD;&#x6709;&#x4F7F;&#x7528;cocoapods&#xFF0C;&#x65E0;&#x9700;&#x505A;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#xFF0C;&#x5C06;LazyTableView&#x6587;&#x4EF6;&#x5939;&#x62D6;&#x5165;&#x9879;&#x76EE;&#x5373;&#x53EF;&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x4F7F;&#x7528;&#x4E86;cocoapods&#xFF0C;&#x5219;&#x5728;podfile&#x91CC;&#x52A0;&#x5165;&#x4EE5;&#x4E0B;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>pod &amp;quot<span class="comment">;AFNetworking&amp;quot;</span>
pod &amp;quot<span class="comment">;JSONModel&amp;quot;</span>
pod &amp;quot<span class="comment">;MJRefresh&amp;quot;,&amp;apos;0.0.1&amp;apos;</span>
</code></pre><p>&#x5E76;&#x4E14;&#x5220;&#x9664;LazyTableView&#x91CC;&#x7684;lib&#x6587;&#x4EF6;&#x5939;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF1A;Xcode 6.2&#xFF0C;iOS 6.0&#x4EE5;&#x4E0A;</p>
<p><img src="http://taojinke.github.io/img/20150702/56a85a9.png" alt="LazyTableView&#xFF08;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x7B80;&#x5316;uitableview&#x64CD;&#x4F5C;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6846;&#x67B6;&#xFF09;"></p>
<p><a href="http://code.cocoachina.com/detail/308612/%E9%AB%98%E4%BB%BF%E5%BE%AE%E4%BF%A1%E7%9A%84ActionSheet/" target="_blank" rel="external"><strong>&#x9AD8;&#x4EFF;&#x5FAE;&#x4FE1;&#x7684;ActionSheet</strong></a><strong>(&#x4F5C;&#x8005;&#xFF1A;</strong><a href="http://www.cocoachina.com/bbs/u.php?action=show&amp;uid=393289" target="_blank" rel="external"><strong>wwdc14</strong></a><strong>)</strong></p>
<p>&#x5DF2;&#x77E5;BUG:&#x83B7;&#x53D6;&#x7CFB;&#x7EDF;&#x56FE;&#x7247;,&#x56FE;&#x7247;&#x8FC7;&#x591A;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5D29;&#x6E83;! &#x6C42;&#x5927;&#x795E;&#x652F;&#x62DB;!</p>
<pre><code>//&amp;<span class="symbol">#x663E</span>;&amp;<span class="symbol">#x793A</span>;&amp;<span class="symbol">#x56FE</span>;&amp;<span class="symbol">#x7247</span>;&amp;<span class="symbol">#x9884</span>;&amp;<span class="symbol">#x89C8</span>;:
<span class="class">HySideScrollingImagePicker</span> *hy = [[<span class="class">HySideScrollingImagePicker</span> alloc] <span class="method">initWithCancelStr:</span>@&amp;quot;&amp;<span class="symbol">#x53D6</span>;&amp;<span class="symbol">#x6D88</span>;&amp;quot; <span class="method">otherButtonTitles:</span>@[@&amp;quot;&amp;<span class="symbol">#x62CD</span>;&amp;<span class="symbol">#x6444</span>;&amp;quot;,@&amp;quot;&amp;<span class="symbol">#x4ECE</span>;&amp;<span class="symbol">#x76F8</span>;&amp;<span class="symbol">#x518C</span>;&amp;<span class="symbol">#x9009</span>;&amp;<span class="symbol">#x62E9</span>;&amp;quot;,@&amp;quot;&amp;<span class="symbol">#x66F4</span>;&amp;<span class="symbol">#x591A</span>;&amp;quot;]];
hy.isMultipleSelection = <span class="keyword">false</span>;
hy.<span class="class">SeletedImages</span> = ^(<span class="class">NSArray</span> *<span class="class">GetImages</span>, <span class="class">NSInteger</span> <span class="class">Buttonindex</span>){
    <span class="class">NSLog</span>(@&amp;quot;<span class="class">GetImages</span>-%@,<span class="class">Buttonindex</span>-%ld&amp;quot;,<span class="class">GetImages</span>,(long)<span class="class">Buttonindex</span>);
};
[<span class="keyword">self</span>.view <span class="method">insertSubview:</span>hy <span class="method">atIndex:</span>[[<span class="keyword">self</span>.view subviews] count]];

//&amp;<span class="symbol">#x663E</span>;&amp;<span class="symbol">#x793A</span>;&amp;<span class="symbol">#x81EA</span>;&amp;<span class="symbol">#x5B9A</span>;&amp;<span class="symbol">#x4E49</span>;<span class="class">ActionSheet</span>
<span class="class">HyActionSheet</span> *action = [[<span class="class">HyActionSheet</span> alloc] <span class="method">initWithCancelStr:</span>@&amp;quot;&amp;<span class="symbol">#x53D6</span>;&amp;<span class="symbol">#x6D88</span>;&amp;quot; <span class="method">otherButtonTitles:</span>@[@&amp;quot;&amp;<span class="symbol">#x9000</span>;&amp;<span class="symbol">#x51FA</span>;&amp;<span class="symbol">#x767B</span>;&amp;<span class="symbol">#x5F55</span>;&amp;quot;] <span class="class">AttachTitle</span>:@&amp;quot;&amp;<span class="symbol">#x9000</span>;&amp;<span class="symbol">#x51FA</span>;&amp;<span class="symbol">#x767B</span>;&amp;<span class="symbol">#x5F55</span>;&amp;<span class="symbol">#x540E</span>;&amp;<span class="symbol">#x4E0D</span>;&amp;<span class="symbol">#x4F1A</span>;&amp;<span class="symbol">#x5220</span>;&amp;<span class="symbol">#x9664</span>;&amp;<span class="symbol">#x4EFB</span>;&amp;<span class="symbol">#x4F55</span>;&amp;<span class="symbol">#x5386</span>;&amp;<span class="symbol">#x53F2</span>;&amp;<span class="symbol">#x6570</span>;&amp;<span class="symbol">#x636E</span>;, &amp;<span class="symbol">#x4E0B</span>;&amp;<span class="symbol">#x6B21</span>;&amp;<span class="symbol">#x767B</span>;&amp;<span class="symbol">#x5F55</span>;&amp;<span class="symbol">#x4F9D</span>;&amp;<span class="symbol">#x7136</span>;&amp;<span class="symbol">#x53EF</span>;&amp;<span class="symbol">#x4EE5</span>;&amp;<span class="symbol">#x4F7F</span>;&amp;<span class="symbol">#x7528</span>;&amp;<span class="symbol">#x672C</span>;&amp;<span class="symbol">#x8D26</span>;&amp;<span class="symbol">#x53F7</span>;&amp;quot;];
[action <span class="class">ChangeTitleColor</span>:[<span class="class">UIColor</span> redColor] <span class="class">AndIndex</span>:<span class="number">1</span>];
[<span class="keyword">self</span>.view <span class="method">addSubview:</span>action];
action.<span class="class">ButtonIndex</span> = ^(<span class="class">NSInteger</span> <span class="class">Buttonindex</span>){
    <span class="class">NSLog</span>(@&amp;quot;index--%ld&amp;quot;,<span class="class">Buttonindex</span>);
};
</code></pre><p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF1A;Xcode 6.2&#xFF0C;iOS 6.0&#x4EE5;&#x4E0A;</p>
<p><img src="http://taojinke.github.io/img/20150702/56a881a.png" alt="&#x9AD8;&#x4EFF;&#x5FAE;&#x4FE1;&#x7684;ActionSheet"></p>
<p><a href="http://code.cocoachina.com/detail/308658/%E6%89%A9%E5%B1%95%E4%BA%86UIWebView%EF%BC%8C%E4%BD%BF%E5%85%B6%E6%94%AF%E6%8C%81%E6%BB%91%E5%8A%A8%E6%89%8B%E5%8A%BF%E8%BF%94%E5%9B%9E%EF%BC%88%E7%B1%BB%E4%BC%BC%E5%BE%AE%E4%BF%A1%E7%9A%84In-App%E6%B5%8F%E8%A7%88%E5%99%A8%EF%BC%89/" target="_blank" rel="external">&#x6269;&#x5C55;&#x4E86;UIWebView&#xFF0C;&#x4F7F;&#x5176;&#x652F;&#x6301;&#x6ED1;&#x52A8;&#x624B;&#x52BF;&#x8FD4;&#x56DE;&#xFF08;&#x7C7B;&#x4F3C;&#x5FAE;&#x4FE1;&#x7684;In-App&#x6D4F;&#x89C8;&#x5668;&#xFF09;</a><strong>(&#x4F5C;&#x8005;&#xFF1A;</strong><a href="http://www.cocoachina.com/bbs/u.php?action=show&amp;uid=11143" target="_blank" rel="external"><strong>agdsdl</strong></a><strong>)</strong></p>
<p>&#x6269;&#x5C55;&#x4E86;UIWebView&#xFF0C;&#x4F7F;&#x5176;&#x652F;&#x6301;&#x6ED1;&#x52A8;&#x624B;&#x52BF;&#x8FD4;&#x56DE;&#xFF08;&#x7C7B;&#x4F3C;&#x5FAE;&#x4FE1;&#x7684;In-App&#x6D4F;&#x89C8;&#x5668;&#xFF09;&#x3002;</p>
<p>Safari&#x91CC;&#x9762;&#x9664;&#x4E86;&#x70B9;&#x51FB;&#x2018;&#x524D;&#x8FDB;&#x2019;&#xFF0C;&#x2018;&#x540E;&#x9000;&#x2019;&#x6309;&#x94AE;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6ED1;&#x52A8;&#x624B;&#x52BF;&#x6765;&#x524D;&#x8FDB;&#x548C;&#x540E;&#x9000;&#x3002;</p>
<p>&#x53EF;&#x60DC;UIWebView&#x4E0D;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x624B;&#x52BF;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x6269;&#x5C55;&#x4E86;UIWebView&#x4F7F;&#x5176;&#x652F;&#x6301;&#x6ED1;&#x52A8;&#x624B;&#x52BF;&#x8FD4;&#x56DE;&#x3002;</p>
<h4 id="&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#xFF1A;">&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#xFF1A;</h4><p>&#x6DFB;&#x52A0; pod &apos;DLPanableWebView&apos; &#x5230; Podfile</p>
<p>&#x8FD0;&#x884C; pod install</p>
<h4 id="&#x5305;&#x542B;&#x5934;&#x6587;&#x4EF6;&#xFF1A;">&#x5305;&#x542B;&#x5934;&#x6587;&#x4EF6;&#xFF1A;</h4><pre><code>#<span class="preprocessor"><span class="keyword">import</span> &amp;quot;</span>DLPanableWebView.h&amp;quot;
</code></pre><p>&#x5C06;&apos;UIWebView&apos; &#x66FF;&#x6362;&#x4E3A; &apos;DLPanableWebView&apos;.</p>
<pre><code><span class="variable">@interface</span> WebViewController ()
<span class="variable">@property</span> (weak, nonatomic) IBOutlet DLPanableWebView *webView;
<span class="variable">@end</span>
</code></pre><p>That&apos;s it!</p>
<p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF1A;Xcode 6.2&#xFF0C;iOS 6.0&#x4EE5;&#x4E0A;</p>
<p><img src="http://taojinke.github.io/img/20150702/56a8a8b.gif" alt=""></p>
<p><a href="http://code.cocoachina.com/detail/308676/JEEPageControl/" target="_blank" rel="external"><strong>JEEPageControl -&#x81EA;&#x5B9A;&#x4E49;PageControl</strong></a><strong>(&#x4F5C;&#x8005;&#xFF1A;</strong><a href="http://www.cocoachina.com/bbs/u.php?action=show&amp;uid=225601" target="_blank" rel="external"><strong>junjee</strong></a><strong>)</strong></p>
<p>&#x81EA;&#x5B9A;&#x4E49; PageControl&#xFF0C;&#x6362;&#x9875;&#x65F6;&#x6307;&#x793A;&#x70B9;&#x4F1A;&#x6839;&#x636E; scrollView &#x7684;&#x6EDA;&#x52A8;&#x7A0B;&#x5EA6;&#x53D8;&#x5927;&#x4E0E;&#x8FD8;&#x539F;&#x3002;</p>
<p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF1A;Xcode 6.2&#xFF0C;iOS 7.0&#x4EE5;&#x4E0A;</p>
<p><img src="http://taojinke.github.io/img/20150702/56a8cfc.gif" alt=""></p>
<p><a href="http://code.cocoachina.com/detail/308718/IOS%E6%89%8B%E5%8A%BF%E5%AF%86%E7%A0%81%E9%94%81/" target="_blank" rel="external"><strong>iOS&#x624B;&#x52BF;&#x5BC6;&#x7801;&#x9501;</strong></a><strong>(&#x4F5C;&#x8005;&#xFF1A;</strong><a href="http://www.cocoachina.com/bbs/u.php?action=show&amp;uid=395132" target="_blank" rel="external"><strong>&#x7535;&#x7ADE;&#x5B66;&#x9662;&#x9662;&#x957F;</strong></a><strong>)</strong></p>
<p>&#x4EFF;&#x7167;&#x652F;&#x4ED8;&#x5B9D;&#x5BC6;&#x7801;&#x9501;&#xFF0C;&#x7B80;&#x5355;&#x5B9E;&#x7528;&#xFF01;</p>
<p>&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#xFF1A;Xcode 6.2&#xFF0C;iOS 6.0&#x4EE5;&#x4E0A;</p>
<p><img src="http://taojinke.github.io/img/20150702/56a8f6d.png" alt="IOS&#x624B;&#x52BF;&#x5BC6;&#x7801;&#x9501;"></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/UITableView/">UITableView</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/46d33bc/" title="dubbo使用遇到的问题 -" itemprop="url">dubbo使用遇到的问题 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:52:48.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> &#x628A;&#x4E00;&#x4E9B;&#x518D;&#x5F00;&#x53D1;&#x4F7F;&#x7528;dubbo&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x7ED9;&#x7F57;&#x5217;&#x4E0B;&#xFF0C;&#x90FD;&#x662F;&#x5199;&#x6700;&#x57FA;&#x7840;&#x7684; &#x7ED9;&#x81EA;&#x5DF1;&#x51E0;&#x4E2A;&#x7B14;&#x8BB0;&#x300B;&#x3002;&#x3002;&#x3002;&#x3002;</p>
<p> 1:&#x670D;&#x52A1;&#x5668;&#x591A;&#x7F51;&#x5361;&#x7ED1;&#x5B9A;&#xFF0C;&#x5BFC;&#x81F4;&#x670D;&#x52A1;&#x8D77;&#x6765;&#x540E;&#x7A0B;&#x5E8F;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;ip&#x4E0D;&#x5BF9; &#xA0;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;</p>
<p>  <img src="http://taojinke.github.io/img/20150702/46d0cac.png" alt=""></p>
<p> &#x670D;&#x52A1;&#x8D77;&#x6765;&#x540E;&#x663E;&#x793A;&#x7684;&#x662F;220.250.64.21 &#x800C;&#x6211;&#x4EEC;&#x96C6;&#x7FA4;&#x5185;&#x7F51;&#x4F7F;&#x7528;&#x7684;ip&#x90FD;&#x662F;10 &#x5F00;&#x5934;&#x7684;&#xFF0C;</p>
<p> &#x8FD9;&#x79CD;&#x95EE;&#x9898;&#x53EF;&#x4EE5;&#x5728;dubbo&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x6307;&#x5B9A;&#x670D;&#x52A1;&#x542F;&#x52A8;&#x7684;&#x7ED1;&#x5B9A;Ip&#xFF0C;&#x4F46;&#x662F;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x8BF4;&#x6700;&#x597D;&#x5EFA;&#x8BAE;&#x4E0D;&#x6307;&#x5B9A;&#xFF0C;&#x771F;&#x662F;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x8981;&#x6307;&#x5B9A;&#x4E0B;&#x7684;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x6211;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<pre><code><span class="subst">&amp;</span><span class="literal">lt</span>;<span class="subst">!--</span> <span class="subst">&amp;</span><span class="variable">#x7528</span>;dubbo<span class="subst">&amp;</span><span class="variable">#x534F</span>;<span class="subst">&amp;</span><span class="variable">#x8BAE</span>;<span class="subst">&amp;</span><span class="variable">#x5728</span>;<span class="number">20880</span><span class="subst">&amp;</span><span class="variable">#x7AEF</span>;<span class="subst">&amp;</span><span class="variable">#x53E3</span>;<span class="subst">&amp;</span><span class="variable">#x66B4</span>;<span class="subst">&amp;</span><span class="variable">#x9732</span>;<span class="subst">&amp;</span><span class="variable">#x670D</span>;<span class="subst">&amp;</span><span class="variable">#x52A1</span>; <span class="subst">--&amp;</span><span class="literal">gt</span>;
    <span class="subst">&amp;</span><span class="literal">lt</span>;dubbo:protocol host<span class="subst">=&amp;</span>quot;<span class="number">10.1</span><span class="built_in">.22</span><span class="built_in">.2</span><span class="subst">&amp;</span>quot; name<span class="subst">=&amp;</span>quot;dubbo<span class="subst">&amp;</span>quot; port<span class="subst">=&amp;</span>quot;<span class="number">20881</span><span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
</code></pre><p>&#x8FD9;&#x6837;&#x670D;&#x52A1;&#x8D77;&#x6765;&#x540E;&#x5C31;&#x663E;&#x793A;&#x7684;&#x662F;10.1.22.2&#x7684;ip&#x4E86; &#xA0;&#x3002; </p>
<p> ——————————————————————————————-&#x9519;&#x8BEF;————————————————————————————————-</p>
<p> &#x4F46;&#x662F;&#x5F53;&#x65F6;&#x628A;&#x914D;&#x7F6E;&#x914D;&#x9519;&#x4E86; &#xA0;&#x6211;&#x6307;&#x5B9A;&#x4E86;&#x591A;&#x4E2A; protocol &#x591A;&#x4E2A;&#x66B4;&#x9732;&#xFF0C;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x7684;&#x60C5;&#x51B5;&#xFF0C;</p>
<p> dubbo&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x5982;&#x4E0B;&#xFF1A;&#xFF08;&#x591A;&#x914D;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x66B4;&#x9732;&#x7684;&#x914D;&#x7F6E;&#xFF09;</p>
<pre><code><span class="subst">&amp;</span><span class="literal">lt</span>;dubbo:protocol host<span class="subst">=&amp;</span>quot;<span class="number">10.1</span><span class="built_in">.22</span><span class="built_in">.2</span><span class="subst">&amp;</span>quot;<span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
    <span class="subst">&amp;</span><span class="literal">lt</span>;<span class="subst">!--</span> <span class="subst">&amp;</span><span class="variable">#x7528</span>;dubbo<span class="subst">&amp;</span><span class="variable">#x534F</span>;<span class="subst">&amp;</span><span class="variable">#x8BAE</span>;<span class="subst">&amp;</span><span class="variable">#x5728</span>;<span class="number">20880</span><span class="subst">&amp;</span><span class="variable">#x7AEF</span>;<span class="subst">&amp;</span><span class="variable">#x53E3</span>;<span class="subst">&amp;</span><span class="variable">#x66B4</span>;<span class="subst">&amp;</span><span class="variable">#x9732</span>;<span class="subst">&amp;</span><span class="variable">#x670D</span>;<span class="subst">&amp;</span><span class="variable">#x52A1</span>; <span class="subst">--&amp;</span><span class="literal">gt</span>;
    <span class="subst">&amp;</span><span class="literal">lt</span>;dubbo:protocol name<span class="subst">=&amp;</span>quot;dubbo<span class="subst">&amp;</span>quot; port<span class="subst">=&amp;</span>quot;<span class="number">20885</span><span class="subst">&amp;</span>quot; <span class="subst">/</span><span class="subst">&amp;</span><span class="literal">gt</span>;
</code></pre><p>&#x5BFC;&#x81F4;&#x663E;&#x793A;&#x7684;&#x670D;&#x52A1;&#x5982;&#x4E0B;&#xFF1A; </p>
<p> <img src="http://taojinke.github.io/img/20150702/46d1b52.png" alt=""></p>
<p> &#x4ED6;&#x4F1A;&#x81EA;&#x52A8;&#x7ED9;&#x914D;&#x7F6E;&#x7684; &#xA0;protocol &#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x7684;&#x7AEF;&#x53E3;&#x53F7; 20880&#xA0;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Dubbo/">Dubbo</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/7/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/6/">6</a><a class="page-number" href="/page/7/">7</a><span class="page-number current">8</span><a class="page-number" href="/page/9/">9</a><a class="page-number" href="/page/10/">10</a><span class="space">&hellip;</span><a class="page-number" href="/page/30/">30</a><a class="extend next" rel="next" href="/page/9/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>294</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
