
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="edwin jin dianzi blog">
<meta property="og:type" content="website">
<meta property="og:title" content="dianzi blog">
<meta property="og:url" content="http://taojinke.github.io/page/5/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="edwin jin dianzi blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="dianzi blog">
<meta name="twitter:description" content="edwin jin dianzi blog">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f944aa9/" title="“集群和负载均衡”的通俗版解释 -" itemprop="url">“集群和负载均衡”的通俗版解释 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5728;&#x201C;&#x9AD8;&#x5E76;&#x53D1;&#xFF0C;&#x6D77;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;NoSql&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;……&#x201D;&#x6982;&#x5FF5;&#x6EE1;&#x5929;&#x98DE;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x76F8;&#x4FE1;&#x4E0D;&#x5C11;&#x670B;&#x53CB;&#x90FD;&#x542C;&#x8BF4;&#x8FC7;&#x751A;&#x81F3;&#x5E38;&#x4E0E;&#x4EBA;&#x63D0;&#x8D77;&#x201C;&#x96C6;&#x7FA4;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x201D;&#x7B49;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x771F;&#x6B63;&#x63A5;&#x89E6;&#x5230;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x201C;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x725B;&#x7684;&#x201D;&#x6280;&#x672F;&#x540D;&#x8BCD;&#x3002;&#x4E0B;&#x9762;&#x7B80;&#x5355;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x5427;&#x3002;</p>
<h4 id="&#x96C6;&#x7FA4;(Cluster)">&#x96C6;&#x7FA4;(Cluster)</h4><p>&#x6240;&#x8C13;&#x96C6;&#x7FA4;&#x662F;&#x6307;&#x4E00;&#x7EC4;&#x72EC;&#x7ACB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x6784;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x677E;&#x8026;&#x5408;&#x7684;&#x591A;&#x5904;&#x7406;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x4F20;&#x9001;&#xFF0C;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x901A;&#x4FD7;&#x4E00;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x82E5;&#x5E72;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x8054;&#x5408;&#x8D77;&#x6765;&#x5DE5;&#x4F5C;(&#x670D;&#x52A1;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x505A;&#x5907;&#x4EFD;&#x3002;</p>
<h4 id="&#x8D1F;&#x8F7D;&#x5747;&#x8861;(Load_Balance)">&#x8D1F;&#x8F7D;&#x5747;&#x8861;(Load Balance)</h4><p>&#x7F51;&#x7EDC;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x662F;&#x4E00;&#x79CD;&#x52A8;&#x6001;&#x5747;&#x8861;&#x6280;&#x672F;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x5B9E;&#x65F6;&#x5730;&#x5206;&#x6790;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x638C;&#x63E1;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#x91CF;&#x72B6;&#x51B5;&#xFF0C;&#x628A;&#x4EFB;&#x52A1;&#x5408;&#x7406;&#x5747;&#x8861;&#x5730;&#x5206;&#x914D;&#x51FA;&#x53BB;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x57FA;&#x4E8E;&#x73B0;&#x6709;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6269;&#x5C55;&#x670D;&#x52A1;&#x5668;&#x5E26;&#x5BBD;&#x548C;&#x589E;&#x52A0;&#x670D;&#x52A1;&#x5668;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5EC9;&#x4EF7;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x52A0;&#x5F3A;&#x4E86;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7F51;&#x7EDC;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x3002;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x5230;&#x5904;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x201C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x201D;&#xFF0C;&#x4E00;&#x4E2A;&#x8D85;&#x5E02;&#x7684;&#x6536;&#x8425;&#x5458;&#x9AD8;&#x5CF0;&#x671F;&#x53EA;&#x80FD;&#x670D;&#x52A1;10&#x4F4D;&#x987E;&#x5BA2;&#xFF0C;&#x5F53;&#x505A;&#x6D3B;&#x52A8;&#x65F6;&#x6709;20&#x4F4D;&#x987E;&#x5BA2;&#x9700;&#x8981;&#x670D;&#x52A1;&#x7684;&#x8BDD;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x6392;&#x957F;&#x961F;&#xFF0C;&#x8FD9;&#x6837;&#x8D2D;&#x7269;&#x4F53;&#x9A8C;&#x5C06;&#x4F1A;&#x5F88;&#x5DEE;&#xFF08;&#x5C31;&#x50CF;&#x5BA2;&#x6237;&#x62B1;&#x6028;&#x7CFB;&#x7EDF;/&#x7F51;&#x7AD9;&#x8BBF;&#x95EE;&#x592A;&#x6162;&#xFF09;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x518D;&#x62DB;&#x4E2A;&#x8425;&#x4E1A;&#x5458;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x901A;&#x4E00;&#x4E2A;&#x51FA;&#x53E3;&#x3002;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x201C;&#x5206;&#x644A;&#x538B;&#x529B;&#x201D;&#x3002;</p>
<h4 id="&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF1A;">&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF1A;</h4><p>(1)&#x9AD8;&#x53EF;&#x9760;&#x6027;(HA)&#x5229;&#x7528;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x5F53;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x5907;&#x4EFD;&#x670D;&#x52A1;&#x5668;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x63A5;&#x7BA1;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x53CA;&#x65F6;&#x5207;&#x6362;&#x8FC7;&#x53BB;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x4E0D;&#x95F4;&#x65AD;&#x670D;&#x52A1;&#x3002; </p>
<p>(2)&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;(HP)&#x5373;&#x5145;&#x5206;&#x5229;&#x7528;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x8FD0;&#x7B97;&#x7684;&#x5E76;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x56E0;&#x5206;&#x6790;&#x3001;&#x5316;&#x5B66;&#x5206;&#x6790;&#x7B49;&#x3002; </p>
<p>(3)&#x8D1F;&#x8F7D;&#x5E73;&#x8861;(LB)&#x5373;&#x628A;&#x8D1F;&#x8F7D;&#x538B;&#x529B;&#x6839;&#x636E;&#x67D0;&#x79CD;&#x7B97;&#x6CD5;&#x5408;&#x7406;&#x5206;&#x914D;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x964D;&#x4F4E;&#x5BF9;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x8981;&#x6C42;&#x3002; </p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4EE5;&#x4E0A;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x9002;&#x5E94;&#x573A;&#x5408;&#x4E0B;&#x662F;&#x9700;&#x8981;&#x540C;&#x65F6;&#x5177;&#x5907;&#x7684;&#x3002;&#x5E38;&#x7528;&#x7684;&#x96C6;&#x7FA4;&#x53C8;&#x5206;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<h4 id="load_balance_cluster&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;&#xFF09;">load balance cluster&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;&#xFF09;</h4><p>&#x4E00;&#x5171;&#x6709;&#x56DB;&#x5144;&#x5F1F;&#x5F00;&#x88C1;&#x7F1D;&#x94FA;&#xFF0C;&#x751F;&#x610F;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E0D;&#x4E0B;&#x6765;&#xFF0C;&#x8001;&#x662F;&#x5EF6;&#x8BEF;&#x5DE5;&#x671F;&#xFF0C;&#x4E8E;&#x662F;&#x56DB;&#x4E2A;&#x5144;&#x5F1F;&#x5546;&#x91CF;&#xFF1A;&#x8001;&#x5927;&#x63A5;&#x8BA2;&#x5355;, &#x4E09;&#x4E2A;&#x5144;&#x5F1F;&#x6765;&#x5E72;&#x6D3B;&#x3002; &#x5BA2;&#x6237;&#x591A;&#x8D77;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x8001;&#x5927;&#x6839;&#x636E;&#x4E00;&#x5B9A;&#x7684;&#x539F;&#x5219;(policy) &#x6839;&#x636E;&#x4E09;&#x5144;&#x5F1F;&#x624B;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x6765;&#x5206;&#x6D3E;&#x65B0;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="High_availability_cluster&#xFF08;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#xFF09;">High availability cluster&#xFF08;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#xFF09;</h4><p>&#x4E24;&#x5144;&#x5F1F;&#x5F00;&#x65E9;&#x9910;&#x94FA;&#xFF0C;&#x751F;&#x610F;&#x4E0D;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;7&#x70B9;&#x5230;9&#x70B9;&#x4E4B;&#x95F4;&#x5BA2;&#x6237;&#x5F88;&#x591A;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x4E2D;&#x65AD;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;2&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x8FD9;&#x4E2A;&#x65E9;&#x9910;&#x94FA;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x6301;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x4E24;&#x5144;&#x5F1F;&#x5546;&#x91CF;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;:</p>
<p>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5728;&#x5BB6;&#x7B49;&#x5019;&#xFF0C;&#x4E00;&#x65E6;&#x8001;&#x5927;&#x65E0;&#x6CD5;&#x505A;&#x751F;&#x610F;&#x4E86;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x51FA;&#x6765;&#x9876;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A; Active/Standby.&#xFF08;&#x53CC;&#x673A;&#x70ED;&#x5907;&#xFF09;</p>
<p>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x5728;&#x65C1;&#x8FB9;&#x5E2E;&#x5DE5;&#xFF0C;&#x4E00;&#x65E6;&#x8001;&#x5927;&#x65E0;&#x6CD5;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x9A6C;&#x4E0A;&#x9876;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;Active/Passive.&#xFF08;&#x53CC;&#x673A;&#x53CC;&#x5DE5;&#xFF09;</p>
<p>&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x8001;&#x4E8C;&#x4E5F;&#x5728;&#x65C1;&#x8FB9;&#x5356;&#x8C46;&#x6D46;&#xFF0C;&#x8001;&#x5927;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x53C8;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x53C8;&#x5356;&#x8C46;&#x6D46;&#xFF0C;&#x8001;&#x4E8C;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x8001;&#x5927;&#x5C31;&#x53C8;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x53C8;&#x5356;&#x8C46;&#x6D46;.&#x8FD9;&#x4E2A;&#x53EB;&#x505A;Active/Active (dual Active)&#xFF08;&#x53CC;&#x673A;&#x4E92;&#x5907;&#xFF09;</p>
<p>(&#x5305;&#x5B50;= application package, &#x4E92;&#x76F8;&#x7167;&#x5E94;&#x53EB;&#x505A;heartbeat, &#x9876;&#x66FF;&#x5BF9;&#x65B9;&#x5DE5;&#x4F5C;&#x53EB;&#x505A; failover/takeover. &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5144;&#x5F1F;&#x7A81;&#x7136;&#x90FD;&#x778E;&#x4E86;&#x804B;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x5BF9;&#x65B9;&#x5230;&#x5E95;&#x662F;&#x5426;&#x6B63;&#x5728;&#x5E72;&#x6D3B;&#xFF0C;&#x90FD;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x8981;&#x9876;&#x5BF9;&#x65B9;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;brain-split, &#x7136;&#x540E;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x8005;&#xFF0C;&#x6BD4;&#x5982;&#x4ED6;&#x4EEC;&#x7684;&#x8001;&#x7239;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;tier-breaker, &#x6216;&#x8005;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E24;&#x4E2A;&#x7684;&#x5AB3;&#x5987;&#x8FC7;&#x6765;&#x62C9;&#x8D70;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;fency&#x3002;)</p>
<h4 id="high_computing_clustering&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#xFF09;">high computing clustering&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#xFF09;</h4><p>10&#x4E2A;&#x5144;&#x5F1F;&#x4E00;&#x8D77;&#x505A;&#x624B;&#x5DE5;&#x5BB6;&#x5177;&#x751F;&#x610F;&#xFF0C;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x6765;&#x627E;&#x4ED6;&#x4EEC;&#x7684;&#x8001;&#x7239;&#x8981;&#x6C42;&#x505A;&#x4E00;&#x5957;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x4EFF;&#x53E4;&#x5BB6;&#x5177;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x4E0D;&#x8FC7;&#x8981;&#x505A;&#x5F88;&#x4E45;&#x5F88;&#x4E45;&#xFF0C;&#x4E3A;&#x4E86;1&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x4EA4;&#x51FA;&#x8FD9;&#x4E00;&#x5957;&#x5BB6;&#x5177;&#xFF0C;10&#x4E2A;&#x5144;&#x5F1F;&#x51B3;&#x5B9A;&#x4E00;&#x8D77;&#x505A;&#x3002;</p>
<p>&#x8001;&#x7239;&#x628A;&#x8FD9;&#x5957;&#x5BB6;&#x5177;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x5206;&#x5F00;&#x4EA4;&#x7ED9;&#x513F;&#x5B50;&#x4EEC;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x4E2A;&#x513F;&#x5B50;&#x90FD;&#x5728;&#x505A;&#x6728;&#x5236;&#x5BB6;&#x5177;&#x7684;&#x52A0;&#x5DE5;&#xFF0C;&#x6700;&#x540E;&#x62FC;&#x5728;&#x4E00;&#x8D77;&#x53EB;&#x8D27;&#x3002;</p>
<p>&#x8001;&#x7239;&#x662F;scheduler&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x513F;&#x5B50;&#x4EEC;&#x662F;compute node. &#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x53EB;&#x505A;&#x4F5C;&#x4E1A;&#x3002;</p>
<p>&#xFF08;&#x5176;&#x5B9E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x76F8;&#x5173;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x5E94;&#x7528;&#x4E8E;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x7F51;&#x7AD9;&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x7B49;&#x7B49;&#x3002;&#x6D89;&#x53CA;&#x70B9;&#x5B58;&#x50A8;&#x65B9;&#x9762;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x4ECB;&#x7ECD;&#x4E86;&#xFF09;</p>
<p>&#x4E25;&#x683C;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4E86;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x77E5;&#x8BC6;&#x8303;&#x7574;&#x4E86;&#xFF0C;&#x60F3;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x771F;&#x6B63;&#x7684;&#x5B9E;&#x8DF5;&#x800C;&#x4E0D;&#x662F;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x3002;&#x4ECE;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x548C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x5177;&#x5907;&#x4E30;&#x5BCC;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x548C;&#x7BA1;&#x7406;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x66F4;&#x8981;&#x5177;&#x5907;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3001;&#x5B58;&#x50A8;&#x7B49;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#xFF08;&#x61C2;&#x7B97;&#x6CD5;&#x548C;&#x5E95;&#x5C42;&#x7684;&#x5C31;&#x66F4;&#x5B8C;&#x7F8E;&#x4E86;&#xFF09;&#x3002;&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x91CD;&#x70B9;&#x53C8;&#x4E0D;&#x540C;&#x4E86;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FDC;&#x8FDC;&#x4E0D;&#x6B62;&#x6211;&#x6240;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x3002;&#x73B0;&#x5728;&#x7684;Web&#x5E94;&#x7528;&#x4E00;&#x822C;&#x90FD;&#x6BD4;&#x8F83;&#x4F9D;&#x8D56;&#x4E8E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x8D8A;&#x6765;&#x8D8A;&#x8131;&#x79BB;&#x4E86;&#x201D;&#x7EAF;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201C;&#x7684;&#x672C;&#x8D28;&#x3002;&#x96C6;&#x7FA4;&#x4E0D;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x786E;&#x5B9E;&#x76F8;&#x5F53;&#x6709;&#x7528;&#x3002;&#x7531;&#x4E8E;&#x9879;&#x76EE;&#x548C;&#x5DE5;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x672C;&#x4EBA;&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5FAE;&#x8F6F;&#x7684;&#x6280;&#x672F;&#x4F53;&#x7CFB;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x90FD;&#x662F;&#x57FA;&#x4E8E;windows&#x5E73;&#x53F0;&#x7684;&#xFF09;&#x3002;&#x6709;&#x673A;&#x4F1A;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5B9E;&#x8DF5;&#x5206;&#x4EAB;&#x51FA;&#x6765;&#xFF0C;&#x66F4;&#x5E0C;&#x671B;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x5728;&#x4E00;&#x5757;&#x5206;&#x4EAB;&#x548C;&#x4EA4;&#x6D41;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/负载均衡/">负载均衡</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f970276/" title="svn提交时强制添加注释 -" itemprop="url">svn提交时强制添加注释 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4EBA;&#x5728;&#x5F88;&#x591A;&#x65F6;&#x5019;&#xFF0C;&#x9760;&#x81EA;&#x89C9;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x9760;&#x9053;&#x5FB7;&#xFF0C;&#x662F;&#x4E0D;&#x884C;&#x7684;&#x3002;&#x5FC5;&#x987B;&#x5236;&#x5B9A;&#x89C4;&#x5219;&#xFF0C;&#x8BA9;&#x5176;&#x5F3A;&#x5236;&#x9075;&#x5B88;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x662F;&#x4EBA;&#xFF0C;&#x4E5F;&#x9700;&#x8981;&#x89C4;&#x5219;&#x3002;</p>
<p>SVN&#x63D0;&#x4EA4;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x6CE8;&#x91CA;&#xFF0C;&#x5728;&#x67E5;&#x9605;&#x5386;&#x53F2;&#x65F6;&#xFF0C;&#x4F1A;&#x975E;&#x5E38;&#x4E0D;&#x65B9;&#x4FBF;&#x3002;&#x56E0;&#x6B64;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8BA9;&#x7A0B;&#x5E8F;&#x5458;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x65F6;&#xFF0C;&#x5F3A;&#x5236;&#x6DFB;&#x52A0;&#x6CE8;&#x91CA;&#x7684;&#x89C4;&#x5219;&#x3002;&#x4E0B;&#x9762;&#x770B;&#x770B;&#x5728;SVN&#x4E2D;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x3002;</p>
<ol>
<li>&#x63A8;&#x8350;&#x4F7F;&#x7528;VisualSVN&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#xFF08;&#x514D;&#x8D39;&#x4E0B;&#x8F7D;&#x5730;&#x5740;&#xFF1A;<a href="http://www.visualsvn.com/&#xFF09;&#x3002;&#x5B89;&#x88C5;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x6253;&#x5F00;VisualSVN" target="_blank" rel="external">http://www.visualsvn.com/&#xFF09;&#x3002;&#x5B89;&#x88C5;&#x5B8C;&#x6BD5;&#x540E;&#xFF0C;&#x6253;&#x5F00;VisualSVN</a> Server&#x7BA1;&#x7406;&#x5668;&#xFF0C;&#x5728;&#x7248;&#x672C;&#x5E93;&#x4E0A;&#x70B9;&#x51FB;&quot;&#x5C5E;&#x6027;&quot;&#xFF0C;&#x9009;&#x62E9;&quot;Hooks&quot;&#x9009;&#x9879;&#xFF0C;&#x9009;&#x4E2D;&quot;Pre-commit hook&quot;&#x540E;&#xFF0C;&#x70B9;&#x51FB;&quot;Edit&quot;.&#xFF08;&#x5982;&#x4E0B;&#x56FE;&#xFF09;</li>
</ol>
<p><img src="http://taojinke.github.io/img/20150701/f96f641.png" alt=""></p>
<pre><code>@<span class="keyword">echo</span> off
<span class="keyword">setlocal</span>
<span class="keyword">set</span> REPOS=%<span class="number">1</span>
<span class="keyword">set</span> TXN=%<span class="number">2</span>
<span class="comment">rem check that logmessage contains at least 10 characters</span>
<span class="comment">rem .....&amp;#x4EE3;&amp;#x8868;5&amp;#x4E2A;&amp;#x5B57;&amp;#x7B26;</span>
svnlook log &amp;quot;<span class="envvar">%REPOS%</span>&amp;quot; -t &amp;quot;<span class="envvar">%TXN%</span>&amp;quot; | <span class="built_in">findstr</span> &amp;quot;.....&amp;quot; &amp;gt; <span class="stream">nul</span>
<span class="flow">if</span> <span class="envvar">%errorlevel%</span> <span class="operator">gtr</span> <span class="number">0</span> <span class="flow">goto</span> err
<span class="flow">exit</span> <span class="number">0</span>
:err
<span class="keyword">echo</span> &amp;#x4E0A;&amp;#x4F20;&amp;#x5931;&amp;#x8D25;&amp;#xFF01;&amp;#x8BF7;&amp;#x6DFB;&amp;#x52A0;&amp;#x6CE8;&amp;#x91CA;. &amp;#x6CE8;&amp;#x91CA;&amp;#x957F;&amp;#x5EA6;&amp;#x81F3;&amp;#x5C11;&amp;#x4E3A;<span class="number">5</span>&amp;#x4E2A;&amp;#x5B57;&amp;#x7B26;. Commit aborted! <span class="number">1</span>&amp;gt;&amp;amp;<span class="number">2</span>
<span class="flow">exit</span> <span class="number">1</span>
</code></pre><p>&#x786E;&#x5B9A;&#x5373;&#x53EF;&#xFF01;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Linux/">Linux</a><a href="/tags/SVN/">SVN</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f94ebcb/" title="大话重构 之 防止“加个需求，到处改代码” -" itemprop="url">大话重构 之 防止“加个需求，到处改代码” -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> &#x4E0A;&#x4E00;&#x7BC7;&#x300A; <a href="http://www.cnblogs.com/yoyaprogrammer/p/srp.html" target="_blank" rel="external">&#x804C;&#x8D23;&#x5355;&#x4E00;&#x539F;&#x5219;&#x771F;&#x7684;&#x7B80;&#x5355;&#x5417;</a> &#x300B;&#x4E2D;&#x6211;&#x4EEC;&#x8BA4;&#x8BC6;&#x4E86; <strong>&#x53D1;&#x6563;&#x5F0F;&#x53D8;&#x5316;</strong> &#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7C7B;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x804C;&#x8D23;&#x4E0D;&#x5355;&#x4E00;&#x3002;&#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x7684;&#x4EE3;&#x7801;&#x574F;&#x5473;&#x9053;&#x662F; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#xFF0C;&#x4E0E; <strong>&#x53D1;&#x6563;&#x5F0F;&#x53D8;&#x5316;</strong> &#x6070;&#x597D;&#x76F8;&#x53CD;&#xFF0C;&#x4E00;&#x4E2A;&#x7EF4;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x6D89;&#x53CA;&#x5230;&#x591A;&#x4E2A;&#x7C7B;&#x3002; </p>
<p>&#x5728;&#x5546;&#x4E1A;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x78B0;&#x5230;&#x201C;&#x52A0;&#x4E2A;&#x9700;&#x6C42;&#xFF0C;&#x5230;&#x5904;&#x6539;&#x4EE3;&#x7801;&#x201D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#xFF0C;&#x5178;&#x578B;&#x540E;&#x679C;&#x662F;&#x6F0F;&#x6539;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#xFF0C;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x8868;&#x73B0;&#x4E0D;&#x4E00;&#x81F4;&#x3002; </p>
<p>&#x8981;&#x89E3;&#x51B3; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#xFF0C;&#x5BF9;&#x91CD;&#x6784;/&#x8BBE;&#x8BA1;&#x6280;&#x80FD;&#x6709;&#x8F83;&#x9AD8;&#x8981;&#x6C42;&#x3002;&#x4E00;&#x5982;&#x65E2;&#x5F80;&#xFF0C;&#x4E00;&#x7801;&#x4E0A;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0E;&#x4F60;&#x5206;&#x4EAB;&#x5176;&#x4E2D;&#x9700;&#x8981;&#x7406;&#x89E3;&#x7684;&#x70B9;&#x70B9;&#x6EF4;&#x6EF4;&#x3002; </p>
<h2 id="&#x4F8B;&#x5B50;&#x7684;&#x80CC;&#x666F;">&#x4F8B;&#x5B50;&#x7684;&#x80CC;&#x666F;</h2><p>&#x8BE5;&#x4F8B;&#x5B50;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x5173;&#x4E8E;&#x63A8;&#x8350;&#x548C;&#x8BA2;&#x5355;&#x7684;&#x62A5;&#x8868;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>&#x5C0F;&#x4F19;&#x4F34;&#x4EEC;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#xFF0C;&#x62A5;&#x8868;&#x7CFB;&#x7EDF;&#x8BF4;&#x767D;&#x4E86;&#xFF0C;&#x5C31;&#x662F;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x5C55;&#x793A;&#x5404;&#x79CD;&#x6307;&#x6807;&#x3002;&#x7B80;&#x5355;&#x70B9;&#xFF0C;&#x5047;&#x8BBE;&#x76EE;&#x524D;&#x53EA;&#x6709;&#x4E0B;&#x9762;&#x4E09;&#x4E2A;&#x6307;&#x6807;&#xFF1A;</p>
<ol>
<li>UM&#xFF08;Unique Member&#xFF09;&#xFF0C;&#x552F;&#x4E00;&#x8EAB;&#x4EFD;&#x7684;&#x7528;&#x6237;&#x6570;&#xFF0C;&#x4E0D;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x7EBF;&#x4E0B;</li>
<li>Order&#xFF0C;&#x8BA2;&#x5355;&#x6570;&#xFF0C;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;</li>
<li>Revenue&#xFF0C;&#x9500;&#x552E;&#x989D;&#xFF0C;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;</li>
</ol>
<p>&#x6BCF;&#x4E2A;&#x6307;&#x6807;&#x9700;&#x8981;&#x5230;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x4E2D;&#x53BB;&#x67E5;&#x8BE2;&#x5177;&#x4F53;&#x7684;&#x503C;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x754C;&#x9762;&#x4E0A;&#x5C55;&#x793A;&#x51FA;&#x6765;&#x3002;</p>
<h2 id="&#x539F;&#x59CB;&#x4EE3;&#x7801;">&#x539F;&#x59CB;&#x4EE3;&#x7801;</h2><pre><code>object QueryFieldBuilder {
  <span class="function"><span class="keyword">def</span> <span class="title">build</span><span class="params">(fieldName: String)</span>:</span> Array[String] = {
    <span class="keyword">if</span> (fieldName.equalsIgnoreCase(&amp;quot;order&amp;quot;)
      || fieldName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      Array(&amp;quot;online&amp;quot;, &amp;quot;instore&amp;quot;).map(_ + fieldName.toLowerCase)
    <span class="keyword">else</span>
      Array(fieldName.toLowerCase)
  }
}
</code></pre><p>&#x67E5;&#x8BE2;&#x6307;&#x6807;&#x503C;&#x65F6;&#xFF0C;&#x8981;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#x5904;&#x7406;&#x3002;&#x4E00;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x5982;UM&#xFF0C;&#x76F4;&#x63A5;&#x62FF;um&#x4F5C;&#x4E3A;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x5373;&#x53EF;&#xFF1B;&#x4E00;&#x662F;&#x9700;&#x8981;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x5982;Order&#xFF0C;&#x9700;&#x8981;&#x8F6C;&#x6362;&#x6210;onlineorder&#x548C;instoreorder&#x3002;</p>
<pre><code>object FiledValueFormatter {
  <span class="function"><span class="keyword">def</span> <span class="title">format</span><span class="params">(filedName: String, value: String)</span>:</span> String = {
    <span class="keyword">if</span> (filedName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      &amp;quot;$&amp;quot; + value
    <span class="keyword">else</span>
      value
  }
}
</code></pre><p>&#x5C55;&#x793A;&#x6307;&#x6807;&#x503C;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x94B1;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x524D;&#x9762;&#x52A0;&#x4E0A;&#x7F8E;&#x5143;&#x7B26;&#x53F7;$&#x3002;&#xFF08;&#x5982;&#x679C;&#x5DE5;&#x8D44;&#x524D;&#x9762;&#x76F4;&#x63A5;&#x52A0;$&#x3002;&#x3002;&#x3002;&#xFF09;</p>
<h2 id="&#x52A0;&#x65B0;&#x6307;&#x6807;Profit">&#x52A0;&#x65B0;&#x6307;&#x6807;Profit</h2><p>Profit&#xFF0C;&#x5229;&#x6DA6;&#x989D;&#xFF0C;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x548C;&#x7EBF;&#x4E0B;&#x3002;&#x3002;&#x3002;</p>
<p>&#x5728;&#x539F;&#x59CB;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x52A0;&#x4E0A;&#x65B0;&#x6307;&#x6807;Profit&#xFF0C;&#x9700;&#x8981;&#x5728;QueryFiledBuilder&#x548C;FiledValueFormatter&#x4E24;&#x4E2A;&#x4E3B;&#x4F53;&#x4E2D;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x989D;&#x3002;&#x3002;&#x3002;&#x5927;&#x5BB6;&#x90FD;&#x77E5;&#x9053;&#x8FD9;&#x6837;&#x4E0D;&#x597D;&#x3002;</p>
<h2 id="&#x5408;&#x5E76;">&#x5408;&#x5E76;</h2><p>&#x901A;&#x8FC7; <em>&#x79FB;&#x52A8;&#x65B9;&#x6CD5;</em> &#x7684;&#x91CD;&#x6784;&#x624B;&#x6CD5;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x53D8;&#x5316;&#x7EF4;&#x5EA6;&#x4E0A;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x79FB;&#x52A8;&#x5230;&#x4E00;&#x4E2A;&#x4E3B;&#x4F53;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5408;&#x9002;&#x7684;&#x4E3B;&#x4F53;&#x4F5C;&#x4E3A;&#x65B9;&#x6CD5;&#x7684;&#x8F7D;&#x4F53;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x4E3B;&#x4F53;&#x3002; </p>
<pre><code>object FieldContext {
  <span class="function"><span class="keyword">def</span> <span class="title">buildQueryField</span><span class="params">(fieldName: String)</span>:</span> Array[String] = {
    <span class="keyword">if</span> (fieldName.equalsIgnoreCase(&amp;quot;order&amp;quot;)
      || fieldName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      Array(&amp;quot;online&amp;quot;, &amp;quot;instore&amp;quot;).map(_ + fieldName.toLowerCase)
    <span class="keyword">else</span>
      Array(fieldName.toLowerCase)
  }

  <span class="function"><span class="keyword">def</span> <span class="title">formatValue</span><span class="params">(filedName: String, value: String)</span>:</span> String = {
    <span class="keyword">if</span> (filedName.equalsIgnoreCase(&amp;quot;revenue&amp;quot;))
      &amp;quot;$&amp;quot; + value
    <span class="keyword">else</span>
      value
  }
}
</code></pre><p>&#x65B0;&#x521B;&#x5EFA;&#x4E86;FieldContext&#x4F5C;&#x4E3A;&#x4E3B;&#x4F53;&#xFF0C;&#x627F;&#x8F7D;&#x4E24;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x4E00;&#x773C;&#x770B;&#x8FC7;&#x53BB;&#xFF0C;&#x4EE3;&#x7801;&#x7B80;&#x5355;&#x6613;&#x61C2;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#x7684;&#x574F;&#x5473;&#x9053;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x5B83;&#x804C;&#x8D23;&#x5355;&#x4E00;&#x5417;&#xFF1F;No </p>
<p>FieldContext&#x5305;&#x542B;&#x4E86;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#xFF1A;</p>
<ol>
<li>&#x6307;&#x6807;&#x5230;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x7684;&#x6620;&#x5C04;</li>
<li>&#x6307;&#x6807;&#x503C;&#x7684;&#x683C;&#x5F0F;&#x5316;</li>
<li>&#x6DFB;&#x52A0;&#x6307;&#x6807;</li>
</ol>
<p>&#x89E3;&#x51B3; <strong>&#x6563;&#x5F39;&#x5F0F;&#x4FEE;&#x6539;</strong> &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x70B9; <strong>&#x53D1;&#x6563;&#x5F0F;&#x53D8;&#x5316;</strong> &#xFF0C;&#x90A3;&#x5C31;&#x53C8;&#x62C6;&#x5F00;&#x5457;&#x3002; </p>
<h2 id="&#x5408;&#x4E45;&#x5FC5;&#x5206;">&#x5408;&#x4E45;&#x5FC5;&#x5206;</h2><p>&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x8026;&#x5408;&#x592A;&#x7D27;&#xFF0C;&#x524D;&#x4E24;&#x4E2A;&#x804C;&#x8D23;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x7B2C;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/f94bfd9.jpg" alt=""></p>
<p>&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x6307;&#x6807;&#x4E0A;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;&#x6765;&#x5012;&#x8F6C;&#x4F9D;&#x8D56;&#xFF0C;&#x4ECE;&#x800C;&#x5206;&#x79BB;&#x4E0A;&#x9762;&#x7684;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/f94bfd9.jpg" alt=""></p>
<p>&#x6307;&#x6807;&#x6709;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;FieldChannel&#x4E3A;OI&#x8868;&#x793A;&#x9700;&#x8981;&#x533A;&#x5206;&#x7EBF;&#x4E0A;&#x7EBF;&#x4E0B;&#xFF0C;&#x4E3A;Single&#x8868;&#x793A;&#x4E0D;&#x533A;&#x5206;&#x3002;ValueType&#x4E3A;Money&#x8868;&#x793A;&#x6307;&#x6807;&#x503C;&#x662F;&#x94B1;&#xFF0C;&#x4E3A;Normal&#x8868;&#x793A;&#x4E0D;&#x662F;&#x94B1;&#x3002;&#xFF08;&#x4E4B;&#x6240;&#x4EE5;&#x4E0D;&#x7528;&#x5E03;&#x5C14;&#x503C;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#x8003;&#x8651;&#x4EE5;&#x540E;&#x7684;&#x6269;&#x5C55;&#xFF09;</p>
<pre><code><span class="keyword">case</span> <span class="keyword">class</span> Field(name: <span class="keyword">String</span>, channel: FieldChannel, valueType: ValueType)
</code></pre><p>&#x6307;&#x6807;&#x6709;&#x4E86;&#x4E24;&#x4E2A;&#x5206;&#x7C7B;&#x7279;&#x6027;&#x540E;&#xFF0C;&#x4E09;&#x4E2A;&#x804C;&#x8D23;&#x90FD;&#x53EF;&#x4EE5;&#x4F9D;&#x8D56;&#x6307;&#x6807;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x8026;&#x3002;</p>
<pre><code>object QueryFieldBuilder {
  <span class="function"><span class="keyword">def</span> <span class="title">build</span><span class="params">(filedName: String)</span>:</span> Array[String] = {
    val filed = FieldContext.getByName(filedName)
    val lowerCaseFiledName = filedName.toLowerCase

    <span class="keyword">if</span> (filed.exists(_.channel.equals(OI)))
      Array(&amp;quot;online&amp;quot;, &amp;quot;instore&amp;quot;).map(_ + lowerCaseFiledName)
    <span class="keyword">else</span>
      Array(lowerCaseFiledName)
  }
}
</code></pre><p>QueryFieldBuilder&#x4F9D;&#x8D56;&#x4E8E;&#x6307;&#x6807;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;FieldChannel&#xFF0C;&#x627F;&#x62C5;&#x804C;&#x8D23;&#x201C;&#x6307;&#x6807;&#x5230;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x7684;&#x6620;&#x5C04;&#x201D;&#x3002;</p>
<pre><code>object FieldValueFormatter {
  <span class="function"><span class="keyword">def</span> <span class="title">format</span><span class="params">(filedName: String, value: String)</span>:</span> String = {
    val filed = FieldContext.getByName(filedName)

    <span class="keyword">if</span> (filed.exists(_.valueType.equals(Money)))
      &amp;quot;$&amp;quot; + value
    <span class="keyword">else</span>
      value
  }
}
</code></pre><p>FieldValueFormatter&#x4F9D;&#x8D56;&#x4E8E;&#x6307;&#x6807;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;ValueType&#xFF0C;&#x627F;&#x62C5;&#x804C;&#x8D23;&#x201C;&#x6307;&#x6807;&#x503C;&#x7684;&#x683C;&#x5F0F;&#x5316;&#x201D;&#x3002;</p>
<pre><code>object FieldContext {
  private val fields = List(
    Field(&amp;quot;UM&amp;quot;, Single, Normal),
    Field(&amp;quot;Order&amp;quot;, OI, Normal),
    Field(&amp;quot;Revenue&amp;quot;, OI, Money),
    Field(&amp;quot;Profit&amp;quot;, OI, Money)
  )

  private val filedMap = fields
    .map(field =&amp;gt; (field.name.toLowerCase, field))
    .toMap

  <span class="function"><span class="keyword">def</span> <span class="title">getByName</span><span class="params">(name: String)</span>:</span> Option[Field] = {
    filedMap.get(name)
  }
}
</code></pre><p>FieldContext&#x901A;&#x8FC7;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x6307;&#x6807;&#x914D;&#x7F6E;&#x5408;&#x9002;&#x7684;&#x5206;&#x7C7B;&#x7279;&#x6027;&#xFF0C;&#x6765;&#x63A7;&#x5236;&#x6307;&#x6807;&#x5728;&#x67E5;&#x8BE2;&#x5B57;&#x6BB5;&#x6620;&#x5C04;&#x548C;&#x503C;&#x683C;&#x5F0F;&#x5316;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x884C;&#x4E3A;&#xFF0C;&#x5B8C;&#x7F8E;&#x627F;&#x8F7D;&#x804C;&#x8D23;&#x201C;&#x65B0;&#x589E;&#x6307;&#x6807;&#x201D;&#x3002;</p>
<p>&#x65B0;&#x6307;&#x6807;Profit&#x7684;&#x52A0;&#x5165;&#xFF0C;&#x53EA;&#x662F;FieldContext&#x4E2D;&#x7684;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x4E2A;&#x914D;&#x7F6E;&#x800C;&#x5DF2;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x6709;&#x5B66;&#x540D;&#x7684;&#xFF0C; <strong>&#x8868;&#x9A71;&#x52A8;&#x6A21;&#x5F0F;</strong> &#x3002; </p>
<p>&#x5C0F;&#x4F19;&#x4F34;&#xFF0C;&#x4F60;&#x638C;&#x63E1;&#x4E86;&#x5417;&#xFF1F;</p>
<h2 id="&#x63A8;&#x8350;">&#x63A8;&#x8350;</h2><p><a href="http://www.cnblogs.com/yoyaprogrammer/p/eliminate_long_method.html" target="_blank" rel="external">&#x6D88;&#x9664;&#x8FC7;&#x957F;&#x65B9;&#x6CD5;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/eliminate_long_class.html" target="_blank" rel="external">&#x6D88;&#x9664;&#x8FC7;&#x957F;&#x7C7B;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/eliminate_duplicate_code.html" target="_blank" rel="external">&#x6D88;&#x9664;&#x91CD;&#x590D;&#x4EE3;&#x7801;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/refactor_answer.html" target="_blank" rel="external">&#x7B54;&#x7C89;&#x4E1D;&#x95EE;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/long_method_parameters.html" target="_blank" rel="external">&#x4F60;&#x7684;&#x53C2;&#x6570;&#x5217;&#x8868;&#x50CF;&#x86AF;&#x8693;&#x4E00;&#x6837;&#x8BA9;&#x4EBA;&#x538C;&#x6076;&#x5417;</a></p>
<p><a href="http://www.cnblogs.com/yoyaprogrammer/p/srp.html" target="_blank" rel="external">&#x804C;&#x8D23;&#x5355;&#x4E00;&#x539F;&#x5219;&#x771F;&#x7684;&#x7B80;&#x5355;&#x5417;</a></p>
<p>&#x67E5;&#x770B;&#x300A;&#x5927;&#x8BDD;&#x91CD;&#x6784;&#x300B;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#xFF0C;&#x8BF7;&#x8FDB;&#x5165;YoyaProgrammer&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x70B9;&#x51FB; &#x6838;&#x5FC3;&#x6280;&#x672F;&#xFF0C;&#x70B9;&#x51FB; &#x5927;&#x8BDD;&#x91CD;&#x6784;&#x3002;</p>
<p>&#x5206;&#x7C7B; &#x5927;&#x8BDD;&#x91CD;&#x6784;</p>
<p>&#x4F18;&#x96C5;&#x7A0B;&#x5E8F;&#x5458; &#x539F;&#x521B; &#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x51FA;&#x5904;</p>
<p><img src="http://taojinke.github.io/img/20150701/f94c24a.jpg" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/软件开发/">软件开发</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f95ee95/" title="Android开发周报：Android Studio取代Eclipse，MVP架构解析 -" itemprop="url">Android开发周报：Android Studio取代Eclipse，MVP架构解析 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x8C37;&#x6B4C;&#x5BA3;&#x5E03;&#x505C;&#x6B62;&#x5BF9;Eclipse ADT&#x63D2;&#x4EF6;&#x7684;&#x652F;&#x6301;&#xFF0C;&#x5C06;&#x4E13;&#x6CE8;&#x4E8E;Android Studio&#x7684;&#x5F00;&#x53D1;&#x3002;&#x672C;&#x671F;&#x5468;&#x62A5;&#x5E26;&#x6765;&#x4E86;&#x8FD1;&#x671F;&#x706B;&#x70ED;&#x7684;MVP&#x67B6;&#x6784;&#x89E3;&#x6790;&#xFF0C;&#x4ECB;&#x7ECD;&#x4E86;Android&#x52A8;&#x753B;&#x7CFB;&#x7EDF;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x540C;&#x65F6;&#x63D0;&#x4F9B;&#x4E86;&#x63D2;&#x4EF6;&#x5316;&#x65B9;&#x6848;&#x7684;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002;&#x672C;&#x671F;&#x63A8;&#x8350;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E5F;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x3002;</p>
<h4 id="&#x65B0;&#x95FB;">&#x65B0;&#x95FB;</h4><ol>
<li><a href="http://www.xycity.cn/news/56/n-1282756.html" target="_blank" rel="external">&#x300A;&#x8C37;&#x6B4C;&#x5BA3;&#x5E03;Android Studio&#x5C06;&#x53D6;&#x4EE3;Eclipse&#x7F16;&#x8BD1;&#x73AF;&#x5883;&#xFF0C;&#x4E2D;&#x6B62;&#x5BF9;&#x540E;&#x8005;&#x652F;&#x6301;&#x300B;</a> &#xFF1A;&#x4F5C;&#x4E3A;&#x8C37;&#x6B4C;&#x5728;2013&#x5E74;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x63D0;&#x4F9B;&#x7684;IDE&#x73AF;&#x5883;&#x5DE5;&#x5177;Android Studio&#xFF0C;&#x4ECE;&#x51E0;&#x6B21;&#x66F4;&#x65B0;&#x4E4B;&#x540E;Android Studio&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E86;&#x975E;&#x5E38;&#x5F3A;&#x5927;&#x7684;IDE&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x3002;&#x8C37;&#x6B4C;&#x4E5F;&#x5BA3;&#x5E03;&#x5C06;&#x5728;&#x5E74;&#x5E95;&#x524D;&#x4E2D;&#x6B62;&#x5BF9;&#x5176;&#x4ED6;IDE&#x5F00;&#x53D1;&#x73AF;&#x5883;&#x7684;&#x652F;&#x6301;&#x2014;&#x2014;&#x5F00;&#x53D1;&#x8005;&#x662F;&#x65F6;&#x5019;&#x6B63;&#x5F0F;&#x5411;Eclipse&#x8BF4;&#x518D;&#x89C1;&#x4E86;&#x3002;&#x5B89;&#x5353;&#x4EA7;&#x54C1;&#x7ECF;&#x7406;Jamal Eason&#x5728;&#x58F0;&#x660E;&#x4E2D;&#x5199;&#x9053;&#xFF1A;&#x8C37;&#x6B4C;&#x5C06;&#x4F1A;&#x5168;&#x529B;&#x4E13;&#x6CE8;&#x4E8E;Android Studio&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#x7684;&#x5F00;&#x53D1;&#x548C;&#x6280;&#x672F;&#x652F;&#x6301;&#xFF0C;&#x4E2D;&#x6B62;&#x4E3A;Eclipse&#x63D0;&#x4F9B;&#x5B98;&#x65B9;&#x652F;&#x6301;&#x3002;&#x5305;&#x62EC;&#x4E2D;&#x6B62;&#x5BF9;Eclipse ADT&#x63D2;&#x4EF6;&#x4EE5;&#x53CA;Android Ant&#x7F16;&#x8BD1;&#x7CFB;&#x7EDF;&#x7684;&#x652F;&#x6301;&#x3002;</li>
<li><a href="http://digi.it.sohu.com/20150624/n415528103.shtml" target="_blank" rel="external">&#x300A;&#x8C37;&#x6B4C;&#x63A8;&#x51FA;&#x4E86;17&#x6B3E;Android Wear&#x8868;&#x76D8;&#x8BBE;&#x8BA1;&#x300B;</a> &#xFF1A;&#x4E3A;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x7684;&#x4E2A;&#x6027;&#x5316;&#x9700;&#x6C42;&#xFF0C;Android Wear &#x65B0;&#x589E;&#x4E86; 17 &#x6B3E;&#x65B0;&#x8868;&#x76D8;&#xFF0C;&#x65E2;&#x5305;&#x62EC; Hello Kitty&#x3001;Angry Bird &#x7B49;&#x52A8;&#x6F2B;&#x3001;&#x6E38;&#x620F;&#x8868;&#x76D8;&#xFF0C;&#x53C8;&#x6709; Efva Attling&#x3001;MUJI to Relax &#x7B49;&#x8BBE;&#x8BA1;&#x5E08;&#x6B3E;&#x8868;&#x76D8;&#x3002;&#x5176;&#x5B98;&#x65B9;&#x535A;&#x5BA2;&#x79F0;&#xFF0C;&#x76EE;&#x524D;&#x5DF2;&#x7ECF;&#x5171;&#x6709;&#x8D85;&#x8FC7; 1500 &#x6B3E;&#x8868;&#x76D8;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#xFF0C;&#x53EF;&#x4EE5;&#x9002;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x573A;&#x5408;&#x3002;</li>
<li><a href="http://www.infoq.com/cn/news/2015/06/google-play-services-75" target="_blank" rel="external">&#x300A;Google Play Services 7.5&#x65B0;&#x589E;API&#x53CA;&#x591A;&#x9879;&#x7279;&#x6027;&#x300B;</a> &#xFF1A;&#x6700;&#x8FD1;&#x7684;Google I/O&#x5F00;&#x53D1;&#x8005;&#x5927;&#x4F1A;&#x4E0A;&#xFF0C;Google&#x5BA3;&#x5E03;&#x63A8;&#x51FA;7.5&#x7248;&#x7684;Google Play&#x670D;&#x52A1;&#xFF0C;&#x8BE5;&#x7248;&#x672C;&#x5728;&#x7279;&#x6027;&#x65B9;&#x9762;&#x589E;&#x52A0;&#x4E86;&#x8BF8;&#x5982;&#x667A;&#x80FD;&#x5BC6;&#x7801;&#x9501;&#x548C;&#x5B9E;&#x4F8B;ID&#x7B49;&#x529F;&#x80FD;&#x3002;&#x5728;API&#x65B9;&#x9762;&#xFF0C;&#x589E;&#x52A0;&#x4E86;Google&#x4E91;&#x63A8;&#x9001;&#x548C;Google Cast&#x76F8;&#x5173;&#x7684;API&#xFF0C;&#x540C;&#x65F6;&#x5728;Android Wear&#x8BBE;&#x5907;&#x4E0A;&#x652F;&#x6301;&#x8BBF;&#x95EE;Google&#x5730;&#x56FE;API&#x3002;</li>
</ol>
<h4 id="&#x6559;&#x7A0B;">&#x6559;&#x7A0B;</h4><ol>
<li><a href="http://blog.csdn.net/lmj623565791/article/details/46596109" target="_blank" rel="external">&#x300A; &#x6D45;&#x8C08;Android&#x4E2D;&#x7684;MVP&#x300B;</a> &#xFF1A;MVP&#x6216;MVVP&#x6A21;&#x5F0F;&#x5E94;&#x8BE5;&#x662F;&#x4ECA;&#x5E74;&#x79FB;&#x52A8;&#x5F00;&#x53D1;&#x6700;&#x706B;&#x70ED;&#x7684;&#x8BAE;&#x9898;&#x4E4B;&#x4E00;&#x3002;&#x968F;&#x7740;&#x79FB;&#x52A8;&#x9879;&#x76EE;&#x4E1A;&#x52A1;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x529F;&#x80FD;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x4E00;&#x4E2A;&#x8026;&#x5408;&#x6027;&#x4F4E;&#x3001;&#x6269;&#x5C55;&#x6027;&#x5F3A;&#x7684;&#x9879;&#x76EE;&#x7ED3;&#x6784;&#x5C31;&#x663E;&#x7684;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5C06;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x8F6C;&#x79FB;&#x5230;MVP&#x6A21;&#x5F0F;&#xFF0C;&#x90A3;&#x4E48;&#x9996;&#x5148;&#x9700;&#x8981;&#x5BF9;MVP&#x6709;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x4E0D;&#x80FD;&#x4EC5;&#x505C;&#x7559;&#x5728;&#x6982;&#x5FF5;&#x9636;&#x6BB5;&#x3002;&#x672C;&#x6587;&#x662F;&#x4E00;&#x7BC7;MVP&#x5165;&#x95E8;&#x6559;&#x7A0B;&#xFF0C;&#x901A;&#x8FC7;&#x672C;&#x6587;&#x5F00;&#x53D1;&#x8005;&#x53EF;&#x4EE5;&#x521D;&#x6B65;&#x638C;&#x63E1;MVP&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x4E0A;&#x624B;&#x5F00;&#x53D1;MVP&#x67B6;&#x6784;&#x9879;&#x76EE;&#x3002;</li>
<li><a href="http://www.zhihu.com/question/27718787" target="_blank" rel="external">&#x300A;&#x5982;&#x4F55;&#x9AD8;&#x6548;&#x5B66;&#x4E60;Android&#x52A8;&#x753B;&#xFF1F;&#x300B;</a> &#xFF1A;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x8005;&#x5BF9;Android&#x4E2D;&#x7684;&#x52A8;&#x753B;&#x4E0D;&#x662F;&#x5F88;&#x6E05;&#x695A;&#xFF0C;&#x5BF9;&#x5E27;&#xFF0C;Tween&#xFF0C;&#x5C5E;&#x6027;&#x7B49;&#x6982;&#x5FF5;&#x6BD4;&#x8F83;&#x6DF7;&#x4E71;&#xFF0C;Android&#x52A8;&#x753B;&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x6BD4;&#x8F83;&#x591A;&#xFF0C;&#x4E5F;&#x6BD4;&#x8F83;&#x7410;&#x788E;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;Android&#x7EC4;&#x4EF6;&#x5F00;&#x53D1;&#x9AD8;&#x624B;&#xFF0C;&#x90A3;&#x4E48;&#x5FC5;&#x987B;&#x5BF9;&#x52A8;&#x753B;&#x7684;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x6709;&#x6DF1;&#x5165;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x7CFB;&#x7EDF;&#x7684;&#x5B66;&#x4E60;&#x52A8;&#x753B;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x3002;&#x672C;&#x6587;&#x662F;&#x77E5;&#x4E4E;&#x4E0A;&#x5173;&#x4E8E;&#x52A8;&#x753B;&#x5B66;&#x4E60;&#x6210;&#x679C;&#x3001;&#x5FC3;&#x5F97;&#x7684;&#x5206;&#x4EAB;&#xFF0C;&#x76F8;&#x4FE1;&#x5BF9;&#x4E8E;&#x5F00;&#x53D1;&#x8005;&#x8FDB;&#x9636;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x3002;</li>
<li><a href="https://github.com/bboyfeiyu/android-tech-frontier/blob/master/issue-16/%E6%89%8B%E5%8A%A8%E5%AE%9E%E7%8E%B0%E5%B8%83%E5%B1%80Transitions%E5%8A%A8%E7%94%BB-%E7%AC%AC%E4%B8%80%E9%83%A8%E5%88%86.md" target="_blank" rel="external">&#x300A;&#x624B;&#x52A8;&#x5B9E;&#x73B0;&#x5E03;&#x5C40;Transitions&#x52A8;&#x753B;&#x7CFB;&#x5217;&#x300B;</a> &#xFF1A;&#x5E03;&#x5C40;&#x5207;&#x6362;&#x52A8;&#x753B;&#x5728;Material design&#x4E2D;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x65B9;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x6307;&#x660E;&#x5E94;&#x7528;&#x7684;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5C06;UI&#x4E0A;&#x7684;&#x53EF;&#x89C6;&#x5316;&#x5143;&#x7D20;&#x7ED1;&#x5B9A;&#x5728;&#x4E00;&#x8D77;&#x4F5C;&#x4E3A;&#x7528;&#x6237;&#x7684;&#x5BFC;&#x822A;&#x3002;Activity&#x8F6C;&#x573A;&#x52A8;&#x753B;&#x548C;&#x5E03;&#x5C40;&#x52A8;&#x753B;&#xFF08;Layout Transitions&#xFF09;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x8BE5;&#x6548;&#x679C;&#xFF0C;&#x5E03;&#x5C40;&#x52A8;&#x753B;&#x9700;&#x8981;&#x5728;API 19&#x53CA;&#x5176;&#x4E4B;&#x540E;&#x624D;&#x652F;&#x6301;&#x3002;&#x8BE5;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5B66;&#x4E60;&#x5230;&#x5728;&#x65E0;&#x6CD5;&#x8C03;&#x7528;transitions APIs&#x65F6;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5F88;&#x597D;&#x7684;&#x8F6C;&#x573A;&#x52A8;&#x753B;&#x3002;</li>
<li><a href="http://www.jianshu.com/p/03fdcfd3ae9c" target="_blank" rel="external">&#x300A;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x6559;&#x4F60;&#x5B9E;&#x73B0;Periscope&#x70B9;&#x8D5E;&#x6548;&#x679C;&#x300B;</a> &#xFF1A;Periscope&#x662F;&#x4E00;&#x6B3E;&#x6700;&#x8FD1;&#x6BD4;&#x8F83;&#x706B;&#x7684;&#x89C6;&#x9891;&#x76F4;&#x64AD;&#x5E94;&#x7528;&#xFF0C;Periscope&#x4E2D;&#x7684;&#x70B9;&#x8D5E;&#x6548;&#x679C;&#x5F88;&#x70AB;&#xFF0C;&#x672C;&#x6587;&#x4ECE;&#x6548;&#x679C;&#x5206;&#x6790;&#x5230;&#x7F16;&#x7801;&#xFF0C;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5B9E;&#x73B0;&#x4E86;&#x662F;&#x8BE5;&#x6548;&#x679C;&#x3002;&#x901A;&#x8FC7;&#x672C;&#x6587;&#xFF0C;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x4E86;&#x89E3;&#x81EA;&#x5B9A;&#x4E49;view&#x3001;&#x63D2;&#x8865;&#x5668;&#x3001;&#x5C5E;&#x6027;&#x52A8;&#x753B;&#x7684;&#x76F8;&#x5173;&#x77E5;&#x8BC6;&#x4EE5;&#x53CA;&#x8D1D;&#x585E;&#x5C14;&#x66F2;&#x7EBF;&#x5728;Android&#x4E2D;&#x7684;&#x5B9E;&#x73B0;&#x4EE5;&#x53CA;&#x5E94;&#x7528;&#x3002; <a href="https://github.com/AlanCheen/PracticeDemo" target="_blank" rel="external">&#x8FD9;&#x91CC;</a> &#x662F;&#x9879;&#x76EE;&#x6E90;&#x7801;&#x3002;</li>
<li><a href="http://tech.meituan.com/mt-android-auto-split-dex.html?utm_source=www.race604.com" target="_blank" rel="external">&#x300A;Android DEX&#x81EA;&#x52A8;&#x62C6;&#x5305;&#x53CA;&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x7B80;&#x4ECB;&#x300B;</a> &#xFF1A;&#x5728;Android&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x89C4;&#x6A21;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x52A0;&#x5165;&#x65B0;&#x529F;&#x80FD;&#x3001;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x7C7B;&#x5E93;&#xFF0C;&#x4EE3;&#x7801;&#x91CF;&#x5728;&#x6025;&#x5267;&#x7684;&#x81A8;&#x80C0;&#xFF0C;&#x76F8;&#x5E94;&#x7684;Apk&#x5305;&#x7684;&#x5927;&#x5C0F;&#x4E5F;&#x6025;&#x5267;&#x589E;&#x52A0;&#x3002;&#x5F53;&#x65B9;&#x6CD5;&#x6570;&#x8D85;&#x8FC7;Android&#x7684;&#x6700;&#x5927;&#x9650;&#x5236;&#x65F6;&#xFF0C;&#x4FBF;&#x4F1A;&#x51FA;&#x73B0;&#x65E0;&#x6CD5;&#x5B89;&#x88C5;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4FBF;&#x9700;&#x8981;&#x91C7;&#x7528;&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x6280;&#x672F;&#x3002;&#x672C;&#x6587;&#x662F;&#x5173;&#x4E8E;google MultiDex&#x65B9;&#x6848;&#x7684;&#x5B9E;&#x8DF5;&#x3002;</li>
<li><a href="http://www.race604.com/android-bluetooth-intro/" target="_blank" rel="external">&#x300A;Android &#x7684;&#x84DD;&#x7259;&#x7B80;&#x4ECB;&#x300B;</a> &#xFF1A;Android &#x63D0;&#x4F9B;&#x9ED8;&#x8BA4;&#x7684;&#x84DD;&#x7259;&#x534F;&#x8BAE;&#x6808;&#x662F; BlueDroid&#xFF0C;&#x5206;&#x4E3A;&#x4E24;&#x5C42;&#xFF1A;&#x84DD;&#x7259;&#x5D4C;&#x5165;&#x5F0F;&#x7CFB;&#x7EDF;&#xFF08;BTE&#xFF09;&#x548C;&#x84DD;&#x7259;&#x5E94;&#x7528;&#x5C42;&#xFF08;BTA&#xFF09;&#xFF0C;BTE &#x5C42;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x84DD;&#x7259;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF0C;BTA &#x5C42;&#x5219;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x548C; Anroid &#x6846;&#x67B6;&#x901A;&#x4FE1;&#x3002;&#x672C;&#x6587;&#x4ECB;&#x7ECD;&#x4E86;Android&#x84DD;&#x7259;&#x6280;&#x672F;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;</li>
<li><a href="http://2.rogerbolg.sinaapp.com/?p=92" target="_blank" rel="external">&#x300A;&#x865A;&#x5316;&#x68A6;&#x5E7B;&#x80CC;&#x666F;+&#x81EA;&#x52A8;&#x6765;&#x56DE;&#x79FB;&#x52A8;&#x52A8;&#x753B;&#x89E3;&#x6790;&#x300B;</a> &#xFF1A;&#x5BF9;&#x4E8E;&#x58C1;&#x7EB8;&#x3001;&#x9501;&#x5C4F;&#x7C7B;&#x5E94;&#x7528;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x6D4F;&#x89C8;&#x5927;&#x56FE;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x56FE;&#x7247;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x79FB;&#x52A8;&#xFF0C;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x91CD;&#x529B;&#x611F;&#x5E94;&#x53BB;&#x63A7;&#x5236;&#x56FE;&#x7247;&#x4F4D;&#x7F6E;&#x3002;&#x4F5C;&#x8005;&#x4ECE;&#x5F00;&#x6E90;&#x58C1;&#x7EB8;&#x5E94;&#x7528; <a href="https://github.com/romannurik/muzei" target="_blank" rel="external">Muzei</a> &#x4E2D;&#x5206;&#x79BB;&#x51FA;&#x4E86;&#x865A;&#x5E7B;&#x80CC;&#x666F;&#x548C;&#x81EA;&#x52A8;&#x79FB;&#x52A8;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x7136;&#x540E;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x4E86;&#x5176;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x3002;</li>
<li><a href="http://blog.csdn.net/luoshengyang/article/details/46449677" target="_blank" rel="external">&#x300A;Android&#x5E94;&#x7528;&#x7A0B;&#x5E8F;UI&#x786C;&#x4EF6;&#x52A0;&#x901F;&#x6E32;&#x67D3;&#x7684;&#x52A8;&#x753B;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5206;&#x6790;&#x300B;</a> &#xFF1A;&#x901A;&#x5E38;&#x6211;&#x4EEC;&#x8BF4;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0D;&#x5982;&#x53E6;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6D41;&#x7545;&#xFF0C;&#x8BF4;&#x7684;&#x5C31;&#x662F;&#x524D;&#x8005;&#x52A8;&#x753B;&#x663E;&#x793A;&#x4E0D;&#x5982;&#x540E;&#x8005;&#x6D41;&#x7545;&#xFF0C;&#x56E0;&#x6B64;&#x52A8;&#x753B;&#x663E;&#x793A;&#x6D41;&#x7545;&#x7A0B;&#x5EA6;&#x662F;&#x8861;&#x91CF;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x6D41;&#x7545;&#x6027;&#x7684;&#x5173;&#x952E;&#x6307;&#x6807;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x6837;&#x8BF4;&#x5462;&#xFF1F;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6D41;&#x7545;&#x7684;&#x52A8;&#x753B;&#x663E;&#x793A;&#x9700;&#x8981;60fps&#x7684;UI&#x5237;&#x65B0;&#x901F;&#x5EA6;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x5374;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x8FBE;&#x5230;&#x7684;&#x901F;&#x5EA6;&#x3002;Android 5.0&#x901A;&#x8FC7;&#x5F15;&#x5165;Render Thread&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x63D0;&#x5347;&#x52A8;&#x753B;&#x663E;&#x793A;&#x6D41;&#x7545;&#x6027;&#x3002;&#x672C;&#x6587;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x4E86;Render Thread&#x663E;&#x793A;&#x52A8;&#x753B;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</li>
</ol>
<h4 id="&#x5F00;&#x6E90;&#x9879;&#x76EE;">&#x5F00;&#x6E90;&#x9879;&#x76EE;</h4><ol>
<li><a href="https://github.com/Yalantis/GuillotineMenu-Android" target="_blank" rel="external">GuillotineMenu-Android</a> &#xFF1A; <a href="https://dribbble.com/shots/2018249-Guillotine-Menu" target="_blank" rel="external">Guillotine Menu</a> &#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x6F02;&#x4EAE;&#x7684;&#x4FA7;&#x5200;&#x83DC;&#x5355;&#x6548;&#x679C;&#xFF0C;&#x8BE5;&#x8BBE;&#x8BA1;&#x51FA;&#x81EA;&#x8457;&#x540D;&#x7684;&#x8BBE;&#x8BA1;&#x7F51;&#x7AD9;Dribbble&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x662F;&#x5BF9;Guillotine Menu&#x7684;&#x4E00;&#x4E2A;&#x7F16;&#x7801;&#x5B9E;&#x73B0;&#x3002;</li>
<li><a href="https://github.com/anton46/Android-StepsView" target="_blank" rel="external">Android-StepsView</a> &#xFF1A;&#x8BE5;&#x9879;&#x76EE;&#x5B9E;&#x73B0;&#x4E86;&#x5206;&#x6BB5;&#x8FDB;&#x5EA6;&#x6761;&#x6548;&#x679C;&#xFF0C;&#x8BE5;&#x6548;&#x679C;&#x9002;&#x5408;&#x7528;&#x4E8E;&#x5C55;&#x793A;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x6B65;&#x9AA4;&#x7684;&#x573A;&#x666F;&#x3002;</li>
<li><a href="https://github.com/PaoloRotolo/AppIntro" target="_blank" rel="external">AppIntro</a> &#xFF1A;AppIntro&#x662F;&#x4E00;&#x4E2A;&#x6548;&#x679C;&#x5F88;&#x8D5E;&#x7684;App&#x4ECB;&#x7ECD;&#x9875;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#x4E3A;&#x5F15;&#x5BFC;&#x9875;&#x4F7F;&#x7528;&#x3002;</li>
<li><a href="https://github.com/klinker24/Android-TextView-LinkBuilder" target="_blank" rel="external">Android TextView-LinkBuilder</a> :TextView&#x81EA;&#x5E26;&#x7684;autoLink&#x529F;&#x80FD;&#x5F80;&#x5F80;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x4EA7;&#x54C1;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x6709;&#x4E86; TextView-LinkBuilder&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;TextView&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x5B57;&#x7B26;&#x4E0A;&#x968F;&#x610F;&#x6DFB;&#x52A0;&#x4E0B;&#x5212;&#x7EBF;&#x6216;&#x8D85;&#x94FE;&#x63A5;&#x3002;TextView-LinkBuilder&#x652F;&#x6301;&#x81EA;&#x5B9A;&#x4E49;&#x94FE;&#x63A5;&#x989C;&#x8272;&#x3001;&#x6B63;&#x5219;&#x5339;&#x914D;&#x3001;&#x957F;&#x6309;&#x4E8B;&#x4EF6;&#x3001;&#x9AD8;&#x4EAE;&#x663E;&#x793A;&#x7B49;&#x3002;</li>
</ol>
<h4 id="&#x5DE5;&#x5177;">&#x5DE5;&#x5177;</h4><ol>
<li><a href="http://stablekernel.com/blog/level-up-with-android-studio-shortcuts-and-live-templates/" target="_blank" rel="external">&#x300A;Android Stuido&#x5FEB;&#x6377;&#x952E;&#x548C;&#x4EE3;&#x7801;&#x6A21;&#x5757;&#x300B;</a> &#xFF1A;&#x591A;&#x5E74;&#x4F7F;&#x7528;Eclipse&#x5F00;&#x53D1;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x5BF9;&#x4E8E;Android Studio&#x4E2D;&#x7684;&#x5FEB;&#x6377;&#x952E;&#x4E00;&#x5B9A;&#x4E0D;&#x4E60;&#x60EF;&#xFF0C;&#x7279;&#x522B;&#x662F;MAC&#x7528;&#x6237;&#x3002;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5217;&#x51FA;&#x4E86;&#x6700;&#x5E38;&#x7528;&#x7684;Android Studio&#x5FEB;&#x6377;&#x952E;&#xFF0C;&#x4F7F;&#x7528;&#x6587;&#x4E2D;&#x5F97;&#x5230;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x5F00;&#x53D1;&#x6548;&#x7387;&#x3002;</li>
</ol>
<p>&#x611F;&#x8C22;&#x5F90;&#x5DDD;&#x5BF9;&#x672C;&#x6587;&#x7684;&#x5BA1;&#x6821;&#x3002; </p>
<p>&#x7ED9;InfoQ&#x4E2D;&#x6587;&#x7AD9;&#x6295;&#x7A3F;&#x6216;&#x8005;&#x53C2;&#x4E0E;&#x5185;&#x5BB9;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x90AE;&#x4EF6;&#x81F3;editors@cn.infoq.com&#x3002;&#x4E5F;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#xFF08;@InfoQ&#xFF0C;@&#x4E01;&#x6653;&#x6600;&#xFF09;&#xFF0C;&#x5FAE;&#x4FE1;&#xFF08;&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; <a href="http://weixin.sogou.com/gzh?openid=oIWsFt0HnZ93MfLi3pW2ggVJFRxY" target="_blank" rel="external">InfoQChina</a> &#xFF09;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x7F16;&#x8F91;&#x548C;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#xFF08;&#x6B22;&#x8FCE;&#x52A0;&#x5165;InfoQ&#x8BFB;&#x8005;&#x4EA4;&#x6D41;&#x7FA4; </p>
<p><img src="http://taojinke.github.io/img/20150701/f95d89c.png" alt="InfoQ&#x597D;&#x8BFB;&#x8005;"></p>
<p>&#xFF09;&#x3002; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Android-Studio/">Android Studio</a><a href="/tags/Eclipse/">Eclipse</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f955737/" title="ICEfaces EE 1.8.2.GA_P08 发布 -" itemprop="url">ICEfaces EE 1.8.2.GA_P08 发布 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>ICEfaces EE 1.8.2.GA_P08 &#x53D1;&#x5E03;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x751F;&#x4EA7;&#x8BA4;&#x8BC1;&#x7684;&#x7EF4;&#x62A4;&#x7248;&#x672C;&#xFF0C;&#x66F4;&#x65B0;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;</p>
<h3 id="Notable_ICEfaces_Changes_In_This_Release_*_ICEfaces_Component_Suite_&#xA0;">Notable ICEfaces Changes In This Release * ICEfaces Component Suite  &#xA0;</h3><ul>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10492" target="_blank" rel="external">ICE-10492</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:inputRichText - IE11 Support</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10708" target="_blank" rel="external">ICE-10708</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:selectInputText arrow keys selection not working &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;(IE11)</li>
<li><p>[ <a href="http://jira.icesoft.org/browse/ICE-10355" target="_blank" rel="external">ICE-10355</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:inputFile - update commons-fileupload library to &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;v1.3.1 for security fix</p>
<ul>
<li>Note that the commons-fileUpload.jar v1.3.1 requires JDK &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;1.5+, and the commons-io.jar.&#xA0; If you are deploying &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;to a JDK 1.4 environment, you must substitute v1.2.2 of &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;the commons-fileUpload.jar (available from the <a href="http://archive.apache.org/dist/commons/fileupload/binaries/" target="_blank" rel="external">Apache &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;Commons FileUpload site</a> ).</li>
</ul>
</li>
<li><p>[ <a href="http://jira.icesoft.org/browse/ICE-9604" target="_blank" rel="external">ICE-9604</a> ]&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:inputFile fileEntryListener/rowSelectListener &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;validation fails</p>
</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-1755" target="_blank" rel="external">ICE-1755</a> ]&#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:outputLink incorrectly encodes space as &quot;+&quot; in path</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10553" target="_blank" rel="external">ICE-10553</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:panelGroup revert Draggable position when Escape key &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;is pressed while dragging</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10699" target="_blank" rel="external">ICE-10699</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:panelGroup revert feature doesn&apos;t position elements &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;correctly when using dragGhost or ghosting</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10305" target="_blank" rel="external">ICE-10305</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ice:panelCollapsible - Expanded panel sets inline padding</li>
</ul>
<ul>
<li><p>Core Framework</p>
<ul>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9583" target="_blank" rel="external">ICE-9583</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Stuck threads reported with WeakHashMap.get() on Facelets &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;classes</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9627" target="_blank" rel="external">ICE-9627</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Deadlock during session invalidation</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9804" target="_blank" rel="external">ICE-9804</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- CLONE - Deadlock on Session invalidation/logout on &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;WebSphere</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9836" target="_blank" rel="external">ICE-9836</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Classpath.getAlternativeJarFile(…) causes Bad file &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;descriptor under WebSphere 8.5</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-9842" target="_blank" rel="external">ICE-9842</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- ClassCastException thrown when loading non-ICEfaces pages</li>
</ul>
</li>
<li><p>Samples</p>
<ul>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10410" target="_blank" rel="external">ICE-10410</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Component Showcase image preloading fails on Chrome for &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;missing images</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10412" target="_blank" rel="external">ICE-10412</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- Component-showcase Google Maps missing controls</li>
<li>[ <a href="http://jira.icesoft.org/browse/ICE-10622" target="_blank" rel="external">ICE-10622</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- IE11 specific issues with samples/component-showcase</li>
</ul>
</li>
</ul>
<h3 id="Notable_ICEpack_Changes_In_This_Release">Notable ICEpack Changes In This Release</h3><ul>
<li>[ <a href="http://jira.icesoft.org/browse/IPCK-472" target="_blank" rel="external">IPCK-472</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- cc:inputFile: JS error occuring in Composite Showcase File &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;Upload Demo</li>
<li>[ <a href="http://jira.icesoft.org/browse/IPCK-474" target="_blank" rel="external">IPCK-474</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- EE Composite Showcase - File Upload cannot handle files &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;containing special characters</li>
<li>[ <a href="http://jira.icesoft.org/browse/IPCK-488" target="_blank" rel="external">IPCK-488</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- richDataGrid - Decrease button icon title references the &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;increase title</li>
<li><p>[ <a href="http://jira.icesoft.org/browse/IPCK-510" target="_blank" rel="external">IPCK-510</a> ] &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;- NPE thrown when starting EPS</p>
</li>
<li><p>Platform Support</p>
<ul>
<li>Certify ICEfaces EE 1.8.2 on Internet Explorer 11 (IE 11).</li>
</ul>
</li>
</ul>
<p>&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x8BF7;&#x67E5;&#x770B; <a href="http://res.icesoft.org/releasenotes/ICEfaces-EE-1.8.2.GA_P08-RN.html#Changes_182EEP08" target="_blank" rel="external">&#x53D1;&#x884C;&#x65E5;&#x5FD7;</a> &#x3002; </p>
<p>&#x8BE5;&#x7248;&#x672C;&#x4E0B;&#x8F7D;&#x8BF7;&#x70B9;&#xFF1A; <a href="http://www.icesoft.org/downloads/icefaces-1.8-downloads.jsf" target="_blank" rel="external">ICEfaces 1.x download page</a> . </p>
<p>ICEfaces &#x5546;&#x4E1A;&#x7248;&#x63D0;&#x4F9B;&#x989D;&#x5916;&#x7684;&#x7279;&#x6027;&#x548C;&#x9762;&#x5411;&#x53EF;&#x9760;&#x548C;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x53D1;&#x5E03;&#x3002;ICEfaces EE &#x662F;&#x5B8C;&#x5168;&#x6D4B;&#x8BD5;&#x548C;&#x8BA4;&#x8BC1;&#x7684;&#x4F01;&#x4E1A;&#x7EA7;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p>ICEfaces&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;Ajax&#x7684;JSF&#x5F00;&#x53D1;&#x6846;&#x67B6;&#x3002;ICEfaces&#x539F;&#x672C;&#x662F;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x4EA7;&#x54C1;&#xFF0C;&#x73B0;&#x5DF2;&#x57FA;&#x4E8E;Mozilla Public License&#x534F;&#x8BAE;&#x5F00;&#x6E90;&#x4E86;&#x3002;&#x5B83;&#x63D0;&#x4F9B;&#x4E00;&#x6574;&#x5957;&#x5B8C;&#x6574;&#x7684;Java EE&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x7EC4;&#x4EF6;&#xFF0C;&#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7528;&#x7EAF;Java(not JavaScript)&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x7626;&#x5BA2;&#x6237;&#x7AEF;&#x80D6;&#x4E92;&#x8054;&#x7F51;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;(Rich Internet Applications:RIA)&#x3002;&#x53E6;&#x5916;&#x53EF;&#x901A;&#x8FC7;&#x5728;&#x7EBF; <a href="http://component-showcase.icefaces.org/" target="_blank" rel="external">Demo</a> &#x4F53;&#x9A8C;&#x4E00;&#x4E0B;ICEfaces&#x7684;&#x5F3A;&#x5927;&#x529F;&#x80FD;&#x3002; </p>
<p><img src="http://taojinke.github.io/img/20150701/f954620.gif" alt=""></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/ICE/">ICE</a><a href="/tags/Java/">Java</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f95c9f6/" title="【原创】 Shuffling -" itemprop="url">【原创】 Shuffling -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#x4E2D;&#xFF0C;&#x7ECF;&#x5E38;&#x4F1A;&#x542C;&#x5230;&#x201C;shuffling&quot;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x3002;&#x90A3;&#x4E48;&#xFF0C;shuffling&#x5230;&#x5E95;&#x662F;&#x4EC0;&#x4E48;&#x610F;&#x601D;&#x5462;&#x3002;</p>
<p>&#x901A;&#x5E38;&#xFF0C;shuffling&#x6307;&#x7684;&#x662F;&#x5728;SGD&#x600E;&#x6837;&#x4F9D;&#x8D56;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x8F93;&#x5165;&#x987A;&#x5E8F;&#x7684;&#x7B97;&#x6CD5;&#x4E2D;&#xFF0C;&#x5C06;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x968F;&#x673A;&#x6253;&#x4E71;&#xFF0C;&#x8FBE;&#x5230;&#x8BA9;SGD&#x8FD9;&#x6837;&#x7684;&#x7B97;&#x6CD5;&#x5F97;&#x5230;&#x4E0E;Batch&#x7B97;&#x6CD5;&#x7C7B;&#x4F3C;&#x7ED3;&#x679C;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/f95c514.jpg" alt=""></p>
<p>&#x5982;&#x4E0A;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x5982;&#x679C;&#x8BAD;&#x7EC3;&#x6570;&#x636E;&#x6309;1&#xFF0C;2&#xFF0C;3&#xFF0C;…&#xFF0C;10&#xFF0C;11&#x7684;&#x987A;&#x5E8F;&#x8F93;&#x5165;&#xFF0C;&#x91C7;&#x7528;sgd&#x8BAD;&#x7EC3;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x6A21;&#x578B;&#x53EF;&#x80FD;&#x4E00;&#x5F00;&#x59CB;&#x662F;&#x7EFF;&#x7EBF;&#xFF0C;&#x7136;&#x540E;&#x8F6C;&#x4E3A;&#x7EA2;&#x7EBF;&#x3002;&#x800C;batch&#x7B97;&#x6CD5;&#x5F97;&#x5230;&#x7684;&#x6A21;&#x578B;&#x662F;&#x5728;&#x7EA2;&#x7EFF;&#x4E4B;&#x95F4;&#x7684;&#x4E00;&#x6761;&#x76F4;&#x7EBF;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x7B97;&#x6CD5;shuffling&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#x5462;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5426;&#x5B9A;&#x7684;&#x3002;</p>
<ol>
<li><p>&#x5BF9;&#x4E8E;batch&#x7B97;&#x6CD5;&#xFF0C;shuffling&#x65E0;&#x6548;</p>
</li>
<li><p>&#x5BF9;&#x4E8E;online&#x7B97;&#x6CD5;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x5C31;&#x662F;&#x60F3;&#x6251;&#x6349;&#x8D8B;&#x52BF;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x662F;&#xFF0C;shuffling&#x5C31;&#x662F;&#x65B9;&#x5411;&#x6548;&#x679C;&#x4E86;&#x3002;</p>
</li>
</ol>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/技术/">技术</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f9580b8/" title="利用 Buck进行高效Android编译 -" itemprop="url">利用 Buck进行高效Android编译 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><a href="http://buckbuild.com/" target="_blank" rel="external">Buck</a> &#x662F;Facebook&#x51FA;&#x54C1;&#x7684;&#x9AD8;&#x6548; <a href="https://github.com/facebook/buck" target="_blank" rel="external">&#x5F00;&#x6E90;</a> Android&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#xFF0C;&#x65E8;&#x5728;&#x9F13;&#x52B1;&#x5F00;&#x53D1;&#x8005;&#x6784;&#x5EFA;&#x5C0F;&#x89C4;&#x6A21;&#x53EF;&#x91CD;&#x7528;&#x7684;&#x7A0B;&#x5E8F;&#x6A21;&#x5757;&#xFF0C;2013&#x5E74;&#x53D1;&#x5E03;&#x65F6;&#xFF0C;InfoQ&#x5BF9;&#x6B64;&#x6709;&#x8FC7;&#x975E;&#x5E38;&#x8BE6;&#x7EC6;&#x7684;&#x62A5;&#x9053;&#x3002; &#x968F;&#x7740;&#x7248;&#x672C;&#x7684;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#x548C;&#x529F;&#x80FD;&#x7684;&#x4E0D;&#x65AD;&#x6F14;&#x8FDB;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x56E2;&#x961F;&#x5F00;&#x59CB;&#x5229;&#x7528;Buck&#x6539;&#x8FDB;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#xFF0C;Vine&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x4E4B;&#x4E00;&#xFF0C;&#x8BE5;&#x56E2;&#x961F;&#x8FD1;&#x671F;&#x5728; <a href="http://engineering.vine.co/post/117873038742/reducing-build-times-by-adopting-buck" target="_blank" rel="external">&#x535A;&#x5BA2;</a> &#x4E2D;&#x5206;&#x4EAB;&#x4E86;Buck&#x4F7F;&#x7528;&#x7684;&#x7ECF;&#x9A8C;&#x3002; </p>
<p>&#x76F8;&#x6BD4;&#x4F20;&#x7EDF;&#x7684;Android&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#xFF0C;Buck&#x51ED;&#x501F;&#x591A;&#x6838;&#x53CA;&#x5E76;&#x884C;&#x6280;&#x672F;&#xFF0C;&#x6781;&#x5927;&#x52A0;&#x901F;&#x4E86;Android&#x5DE5;&#x7A0B;&#x7684;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x591A;&#x6B21;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5B83;&#x4F1A;&#x5BF9;&#x672A;&#x53D8;&#x52A8;&#x7684;&#x6A21;&#x5757;&#x8FDB;&#x884C;&#x6807;&#x8BB0;&#xFF0C;&#x4EE5;&#x589E;&#x91CF;&#x5F0F;&#x7F16;&#x8BD1;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x901F;&#x5EA6;&#x3002;Buck&#x81EA;&#x5E26;&#x7F16;&#x8BD1;&#x811A;&#x672C;&#x751F;&#x6210;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x7684;&#x4EE3;&#x7801;&#x8986;&#x76D6;&#x7387;&#x7B49;&#x6570;&#x636E;&#x8868;&#x5355;&#xFF0C;&#x8FD8;&#x4E3A;&#x65E0;&#x6CD5;&#x7528;Ant&#x5DE5;&#x5177;&#x7F16;&#x8BD1;&#x7684;&#x6A21;&#x5757;&#x63D0;&#x4F9B;&#x4E86;&#x4FBF;&#x6377;&#x7684;&#x7F16;&#x8BD1;&#x65B9;&#x5F0F;&#x3002;Buck&#x8DDF;IntelliJ&#x7ED3;&#x5408;&#x7D27;&#x5BC6;&#xFF0C;&#x53EF;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x7F16;&#x8BD1;&#x811A;&#x672C;&#x751F;&#x6210;&#x8BE5;IDE&#x53EF;&#x7528;&#x7684;&#x5DE5;&#x7A0B;&#xFF0C;&#x6781;&#x5927;&#x964D;&#x4F4E;&#x4E86;&#x672C;&#x5730;IDE&#x5F00;&#x53D1;&#x540E;&#x5411;&#x670D;&#x52A1;&#x5668;&#x8FC1;&#x79FB;&#x7684;&#x6210;&#x672C;&#x3002;</p>
<p>Vine&#x56E2;&#x961F;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x4E86;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x5305;&#x62EC;Android Studio&#x3001;Gradle&#x7F16;&#x8BD1;&#x7CFB;&#x7EDF;&#x3001;Crashlytics&#x7B49;&#x7B2C;&#x4E09;&#x65B9;&#x63D2;&#x4EF6;&#x4EE5;&#x53CA;Jenkins&#x6301;&#x7EED;&#x96C6;&#x6210;&#x5DE5;&#x5177;&#x3002;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Vine&#x53D1;&#x73B0;&#x867D;&#x7136;Gradle&#x7F16;&#x8BD1;&#x7CFB;&#x7EDF;&#x652F;&#x6301;&#x591A;&#x5E73;&#x53F0;&#x914D;&#x7F6E;&#xFF0C;&#x4F46;&#x662F;Vine&#x7684;Android&#x7248;&#x672C;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x9047;&#x5230;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x662F;App&#x7684;&#x4F53;&#x79EF;&#x4F1A;&#x6301;&#x7EED;&#x4E0D;&#x65AD;&#x5730;&#x589E;&#x957F;&#xFF0C;&#x4E8C;&#x662F;&#x968F;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7F16;&#x8BD1;&#x6B65;&#x9AA4;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x8D8A;&#x6765;&#x8D8A;&#x957F;&#x3002;&#x5728;&#x5F15;&#x5165;Buck&#x524D;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x8D8A;&#x6765;&#x8D8A;&#x4E25;&#x91CD;&#xFF0C;&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x7F16;&#x8BD1;&#x8981;&#x82B1;&#x8D39;5&#x5206;&#x949F;&#x5DE6;&#x53F3;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x54EA;&#x6015;&#x4FEE;&#x6539;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x7684;&#x7F16;&#x8BD1;&#x90FD;&#x9700;&#x8981;1&#x5206;&#x949F;&#x3002;&#x5BF9;&#x4E8E;Vine&#x8FD9;&#x6837;&#x7684;&#x5C0F;&#x578B;&#x56E2;&#x961F;&#x6765;&#x8BB2;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x8981;&#x82B1;&#x8D39;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5728;&#x7B49;&#x5F85;&#x7F16;&#x8BD1;&#x5B8C;&#x6210;&#xFF0C;&#x8FD9;&#x8BA9;&#x4ED6;&#x4EEC;&#x975E;&#x5E38;&#x7EA0;&#x7ED3;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x8FC7;&#x7A0B;&#x7684;&#x89C2;&#x5BDF;&#xFF0C;Vine&#x53D1;&#x73B0;dex&#x6587;&#x4EF6;&#x5408;&#x5E76;&#x4EE5;&#x53CA;&#x901A;&#x8FC7;USB&#x5B89;&#x88C5;App&#x7684;&#x65F6;&#x95F4;&#x5360;&#x53BB;&#x4E86;&#x6574;&#x4E2A;&#x7684;90%&#xFF0C;&#x56E0;&#x6B64;&#x51B3;&#x5B9A;&#x4EE5;&#x6B64;&#x4F5C;&#x4E3A;&#x7A81;&#x7834;&#x53E3;&#xFF0C;&#x8FD9;&#x65F6;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x6765;&#x81EA;Facebook&#x7684;Buck&#x5F88;&#x7CBE;&#x51C6;&#x5730;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x80FD;&#x591F;&#x901A;&#x8FC7;ExoPackage&#x6A21;&#x5F0F;&#x6765;&#x7F29;&#x77ED;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#x3002;Buck&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x6709;&#x5F88;&#x591A;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x5982;&#x6700;&#x5C0F;&#x7F16;&#x8BD1;&#x4F9D;&#x8D56;&#x3001;&#x6700;&#x5C0F;dex&#x4F20;&#x8F93;&#x7B49;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BB2;&#xFF0C;Buck&#x5F15;&#x5165;&#x4E86;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x85C9;&#x6B64;&#x5B8C;&#x6210;&#x9AD8;&#x6548;&#x7F16;&#x8BD1;&#x3002;&#x7F16;&#x8BD1;&#x89C4;&#x5219;&#xFF08;rule&#xFF09;&#xFF0C;&#x89C4;&#x5B9A;Buck&#x5728;&#x7ED9;&#x5B9A;&#x8F93;&#x5165;&#x6587;&#x4EF6;&#x540E;&#x751F;&#x6210;&#x8F93;&#x51FA;&#x6587;&#x4EF6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x7F16;&#x8BD1;&#x76EE;&#x6807;&#xFF08;target&#xFF09;&#xFF0C;&#x9879;&#x76EE;&#x4E2D;&#x7528;&#x6765;&#x6307;&#x5B9A;&#x91C7;&#x7528;&#x54EA;&#x4E2A;&#x89C4;&#x5219;&#x7F16;&#x8BD1;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x7F16;&#x8BD1;&#x6587;&#x4EF6;&#xFF08;file&#xFF09;&#xFF0C;&#x53EF;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x7F16;&#x8BD1;&#x89C4;&#x5219;&#xFF0C;&#x53EF;&#x7C7B;&#x6BD4;&#x4E3A;Make&#x6280;&#x672F;&#x4E2D;&#x7684;Makefile&#x3002;&#x5728;&#x4E0A;&#x8FF0;&#x4E09;&#x4E2A;&#x6982;&#x5FF5;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;Buck&#x4F1A;&#x6839;&#x636E;file&#x4E2D;&#x7ED9;&#x5B9A;&#x7684;target&#x5BFB;&#x627E;&#x7279;&#x5B9A;&#x7F16;&#x8BD1;&#x89C4;&#x5219;&#x96C6;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x6BCF;&#x4E2A;&#x89C4;&#x5219;&#x6765;&#x5BF9;Android&#x5DE5;&#x7A0B;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x7F16;&#x8BD1;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;Buck&#x5185;&#x90E8;&#x4EE5;&#x4F9D;&#x8D56;&#x56FE;&#x7684;&#x5F62;&#x5F0F;&#x8868;&#x793A;&#xFF0C;&#x5B83;&#x80FD;&#x591F;&#x4F7F;&#x5F97;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x4F9D;&#x8D56;&#x5173;&#x7CFB;&#x7684;&#x6A21;&#x5757;&#x5E76;&#x884C;&#x7F16;&#x8BD1;&#xFF0C;&#x8282;&#x7EA6;&#x7F16;&#x8BD1;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x5BF9;&#x672A;&#x6539;&#x52A8;&#x6A21;&#x5757;&#x7684;&#x6807;&#x8BB0;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x901F;&#x3002;</p>
<p>&#x6700;&#x540E;Vine&#x56E2;&#x961F;&#x7528;&#x4E86;&#x4E09;&#x4E2A;&#x5DE5;&#x4F5C;&#x65E5;&#x6765;&#x5C06;&#x7F16;&#x8BD1;&#x73AF;&#x5883;&#x8FC1;&#x79FB;&#x81F3;Buck&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5C06;&#x8FDC;&#x7A0B;jar&#x5168;&#x90E8;&#x653E;&#x7F6E;&#x672C;&#x5730;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x4FEE;&#x6539;R&#x503C;&#xFF0C;&#x521B;&#x5EFA;&#x6DF7;&#x5408;AndroidManifest.xml&#x6587;&#x4EF6;&#x548C;&#x521B;&#x5EFA;Buck&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x7B49;&#x3002;&#x6B64;&#x65F6;&#x4E00;&#x6B21;&#x5B8C;&#x6574;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x95F4;&#x5DF2;&#x964D;&#x4F4E;&#x81F3;40&#x79D2;&#x949F;&#xFF0C;&#x800C;&#x4E14;&#x672C;&#x6B21;&#x8FC1;&#x79FB;&#x5E76;&#x672A;&#x7834;&#x574F;&#x548C;&#x5F71;&#x54CD;Gradle&#x539F;&#x672C;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x6709;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x6210;&#x529F;&#xFF0C;Vine&#x56E2;&#x961F;&#x6253;&#x7B97;&#x4E0B;&#x4E00;&#x6B65;&#x5C06;Buck&#x548C;Gradle&#x4E4B;&#x95F4;&#x7684;&#x540C;&#x6B65;&#x66F4;&#x52A0;&#x81EA;&#x52A8;&#x5316;&#x3002;</p>
<p>&#x603B;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;Buck&#x9762;&#x5411;&#x7684;&#x4F7F;&#x7528;&#x8005;&#x662F;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x4ECE;&#x5355;&#x4E00;&#x4EE3;&#x7801;&#x5E93;&#x7F16;&#x8BD1;&#x591A;&#x4E2A;&#x4E0D;&#x540C;target&#x7684;&#x4EBA;&#xFF0C;&#x9002;&#x5408;&#x8FDB;&#x884C;&#x591A;&#x5E73;&#x53F0;&#x5F00;&#x53D1;&#x7684;&#x56E2;&#x961F;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x76EE;&#x524D;Buck&#x4E0D;&#x652F;&#x6301;Window&#x5E73;&#x53F0;&#xFF0C;&#x56E0;&#x6B64;&#x53EA;&#x80FD;&#x901A;&#x8FC7;Mac&#x6216;Linux&#x5E73;&#x53F0;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x3002;&#x5BF9;Buck&#x5B89;&#x88C5;&#x3001;&#x5FEB;&#x901F;&#xFFFD;&#xFFFD;&#xFFFD;&#x95E8;&#x3001;&#x4EE5;&#x53CA;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x8BFB;&#x8005;&#x53EF;&#x53C2;&#x8003;Buck&#x5B98;&#x65B9;&#x7ED9;&#x51FA;&#x7684; <a href="http://buckbuild.com/setup/quick_start.html" target="_blank" rel="external">&#x6559;&#x7A0B;</a> &#x3002; </p>
<p>&#x611F;&#x8C22;&#x5F90;&#x5DDD;&#x5BF9;&#x672C;&#x6587;&#x7684;&#x5BA1;&#x6821;&#x3002; </p>
<p>&#x7ED9;InfoQ&#x4E2D;&#x6587;&#x7AD9;&#x6295;&#x7A3F;&#x6216;&#x8005;&#x53C2;&#x4E0E;&#x5185;&#x5BB9;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x90AE;&#x4EF6;&#x81F3;editors@cn.infoq.com&#x3002;&#x4E5F;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#xFF08;@InfoQ&#xFF0C;@&#x4E01;&#x6653;&#x6600;&#xFF09;&#xFF0C;&#x5FAE;&#x4FE1;&#xFF08;&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; <a href="http://weixin.sogou.com/gzh?openid=oIWsFt0HnZ93MfLi3pW2ggVJFRxY" target="_blank" rel="external">InfoQChina</a> &#xFF09;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x7F16;&#x8F91;&#x548C;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#xFF08;&#x6B22;&#x8FCE;&#x52A0;&#x5165;InfoQ&#x8BFB;&#x8005;&#x4EA4;&#x6D41;&#x7FA4; </p>
<p><img src="http://taojinke.github.io/img/20150701/f95684e.png" alt="InfoQ&#x597D;&#x8BFB;&#x8005;"></p>
<p>&#xFF09;&#x3002; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/安卓开发/">安卓开发</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf410ce/" title="如果算法当上总统，它会说什么？ -" itemprop="url">如果算法当上总统，它会说什么？ -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x5F53;&#x4E0A;&#x603B;&#x7EDF;&#xFF0C;&#x5B83;&#x4F1A;&#x8BF4;&#x4EC0;&#x4E48;&#xFF1F;">&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x5F53;&#x4E0A;&#x603B;&#x7EDF;&#xFF0C;&#x5B83;&#x4F1A;&#x8BF4;&#x4EC0;&#x4E48;&#xFF1F;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-08 22:36:00  <a href="/sites/vqUJRf">&#x96F7;&#x950B;&#x7F51;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.leiphone.com/news/201506/nloqbUgnwH3EwpPo.html?utm_source=tuicool" target="_blank" rel="external">http://www.leiphone.com/news/201506/nloqbUgnwH3EwpPo.html</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11000083">&#x7B97;&#x6CD5;</a></p>
<p><img src="http://taojinke.github.io/img/20150609/cf3fad5.jpg" alt=""></p>
<p>&#x4E00;&#x540D;&#x6765;&#x81EA;&#x65AF;&#x5766;&#x798F;&#x5927;&#x5B66;&#x7684;&#x5B66;&#x751F;Andrej&#xA0;Karpathy&#xFF0C;&#x53D1;&#x5E03;&#x4E86;&#x4E00;&#x9879;&#x53EB;Lua&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x80FD;&#x6A21;&#x4EFF;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x3002; <a href="http://cs.stanford.edu/people/karpathy/" target="_blank" rel="external">Karpathy&#x7684;&#x9879;&#x76EE;&#x9875;&#x9762;&#x4E2D;</a> &#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E9B;&#x70B9;&#x5B50;&#x548C;&#x4F8B;&#x5B50;&#xFF0C;&#x800C;&#x771F;&#x6B63;&#x9700;&#x8981;&#x91C7;&#x6837;&#x7684;&#x662F;&#x80FD;&#x7528;&#x6765;&#x5EFA;&#x7ACB;&#x590D;&#x53D1;&#x6027;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF08;RNN&#xFF09;&#x7684;&#x6750;&#x6599;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x4EBA;&#x7C7B;&#x8BED;&#x8A00;&#x7684;&#x6750;&#x6599;&#x3002; </p>
<p>&#x6700;&#x8FD1;&#xFF0C;&#x827A;&#x672F;&#x5BB6;&#x517C;&#x65B0;&#x5A92;&#x4F53;&#x4EBA;Samim&#x505A;&#x4E86;&#x4E00;&#x9879;&#x6D4B;&#x8BD5;&#xFF0C;&#x8BC1;&#x660E;&#x7528;&#x8BE5;&#x7B97;&#x6CD5;&#x53EF;&#x4EE5;&#x5F88;&#x597D;&#x5730;&#x6A21;&#x4EFF;&#x5965;&#x5DF4;&#x9A6C;&#x6F14;&#x8BB2;&#x3002;&#x5965;&#x5DF4;&#x9A6C;&#x7684;RNN&#x662F;&#x57FA;&#x4E8E;&#x4E00;&#x9879;Lua&#x4EE3;&#x7801;&#xFF0C;&#x9996;&#x5148;&#xFF0C;Samim&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x722C;&#x866B;&#x6765;&#x6536;&#x96C6;&#x5965;&#x5DF4;&#x9A6C;&#x6240;&#x6709;&#x7684;&#x516C;&#x5171;&#x6F14;&#x8BB2;&#xFF0C;&#x5E76;&#x5BF9;&#x8BBF;&#x8C08;&#x548C;&#x8FA9;&#x8BBA;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x5206;&#x6790;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x88AB;&#x9001;&#x5165;Karpathy&#x7684;RNN&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x7528;&#x4E00;&#x5C0F;&#x6BB5;&#x8BDD;&#x4F5C;&#x5F15;&#x5B50;&#xFF08;&#x88AB;&#x79F0;&#x4E3A;&#x79CD;&#x5B50;&#xFF09;&#xFF0C;&#x7B97;&#x6CD5;&#x5C31;&#x80FD;&#x751F;&#x6210;&#x4E00;&#x6BB5;&#x6F14;&#x8BB2;&#x3002;</p>
<p>&#x5965;&#x5DF4;&#x9A6C;&#x7684;&#x6F14;&#x8BB2;&#x5E76;&#x4E0D;&#x5C11;&#xFF0C;&#x50CF;&#x201C;&#x5E0C;&#x671B;&#x201D;&#x548C;&#x201C;Yes we can&#x201D;&#x90FD;&#x662F;&#x5F88;&#x719F;&#x6089;&#x7684;&#x4E3B;&#x9898;&#x4E86;&#x3002;&#x81EA;2007&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x5965;&#x5DF4;&#x9A6C;&#x7684;&#x6F14;&#x8BB2;&#x7A3F;&#x64B0;&#x7A3F;&#x4EBA;&#x5DF2;&#x7ECF;&#x5199;&#x4E86;730895&#x5B57;&#x7684;&#x6587;&#x672C;&#xFF0C;&#x7136;&#x800C;&#x8FD9;&#x8FD8;&#x4E0D;&#x5305;&#x62EC;&#x91C7;&#x8BBF;&#x548C;&#x8FA9;&#x8BBA;&#x3002;</p>
<p>&#x7B97;&#x6CD5;&#x751F;&#x6210;&#x7684;&#x5965;&#x5DF4;&#x9A6C;&#x8BED;&#x5F55;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x79CD;&#x5B50;&#xFF1A;&#x53CD;&#x6050;&#x6218;&#x4E89;</p>
<p>&#x5927;&#x5BB6;&#x597D;&#xFF0C;&#x975E;&#x5E38;&#x611F;&#x8C22;&#xFF0C;&#x4E0A;&#x5E1D;&#x4FDD;&#x4F51;&#x7F8E;&#x56FD;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x5728;&#x5168;&#x4E16;&#x754C;&#x6536;&#x96C6;&#x533B;&#x7597;&#x4FDD;&#x9669;&#x4FE1;&#x606F;&#x3002; &#x6211;&#x4EEC;&#x8F9B;&#x52E4;&#x4ED8;&#x51FA;&#x5374;&#x5F97;&#x4E0D;&#x5230;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x79CD;&#x5B50;&#xFF1A;&#x4E2D;&#x56FD;</p>
<p>&#x975E;&#x5E38;&#x611F;&#x8C22;&#x4F60;&#xFF0C;&#x8BF7;&#x5927;&#x5BB6;&#x5750;&#x4E0B;&#xFF1B;&#x975E;&#x5E38;&#x611F;&#x8C22;&#x4F60;&#xFF1B;&#x4F60;&#x4EEC;&#x5F88;&#x53CB;&#x5584;&#xFF1B;&#x8C22;&#x8C22;&#x3002;</p>
<p>&#x79CD;&#x5B50;&#xFF1A;&#x5DE5;&#x4F5C;</p>
<p>&#x4E0B;&#x5348;&#x597D;&#xFF0C;&#x4E0A;&#x5E1D;&#x4FDD;&#x4F51;&#xFF1B;&#x56FD;&#x5BB6;&#x589E;&#x52A0;&#x9884;&#x7B97;&#x6765;&#x9762;&#x5BF9;&#x5168;&#x65B0;&#x7684;&#x6311;&#x6218;&#x2014;&#x2014;&#x4E8B;&#x5B9E;&#x662F;&#x7531;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4EA7;&#x751F;&#x7684;&#x3002;</p>
<p>&#x4ECE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x7B97;&#x6CD5;&#x7684;&#x8868;&#x73B0;&#x5E76;&#x4E0D;&#x4EE4;&#x4EBA;&#x4E50;&#x89C2;&#x3002; &#x201C;&#x6700;&#x641E;&#x7B11;&#x7684;&#x662F;&#x5965;&#x5DF4;&#x9A6C;&#x7684;RNN&#x771F;&#x7684;&#x5F88;&#x559C;&#x6B22;&#x793C;&#x8C8C;&#x5730;&#x8BF4;&#xFF1A;&#x4E0B;&#x5348;&#x597D;&#xFF0C;&#x7F8E;&#x597D;&#x7684;&#x4E00;&#x5929;&#xFF0C;&#x4E0A;&#x5E1D;&#x4FDD;&#x4F51;&#x4F60;&#xFF0C;&#x4E0A;&#x5E1D;&#x4FDD;&#x4F51;&#x7F8E;&#x56FD;&#xFF0C;&#x8C22;&#x8C22;&#x3002;&#x201D;Samim&#x8BF4;&#x9053;&#xFF0C;&#x4E0D;&#x8FC7;&#x4ED6;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x5168;&#x5B8C;&#x6210;&#x5B9E;&#x9A8C;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x603B;&#x7EDF;&#x7684;&#x6F14;&#x8BB2;&#x5F80;&#x5F80;&#x786E;&#x5B9E;&#x5305;&#x542B;&#x4E0D;&#x5C11;&#x5957;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E5F;&#x96BE;&#x602A;&#x7B97;&#x6CD5;&#x4F1A;&#x5B66;&#x5230;&#x8FD9;&#x4E00;&#x624B;&#x3002;&#x800C;&#x4E14;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x80FD;&#x5199;&#x65B0;&#x95FB;&#x7A3F;&#x548C;&#x6B23;&#x8D4F;&#x6444;&#x5F71;&#x4F5C;&#x54C1;&#x7684;&#x673A;&#x5668;&#x4EBA;&#x4E86;&#xFF0C;&#x8BF4;&#x4E0D;&#x5B9A;&#x603B;&#x7EDF;&#x7684;&#x6F14;&#x8BB2;&#x7A3F;&#x771F;&#x7684;&#x53EF;&#x4EE5;&#x7528;&#x7B97;&#x6CD5;&#x6765;&#x5199;&#x3002; </p>
<p>via <a href="http://motherboard.vice.com/read/what-happens-when-you-ask-a-neural-network-to-write-presidential-speeches" target="_blank" rel="external">mb</a></p>
<p>&#x5173;&#x6CE8;&#x8111;&#x6D1E;&#x5FAE;&#x4FE1;&#x53F7;&#xFF08;hackmind&#xFF09;&#xFF0C;&#x5E26;&#x4F60;&#x9886;&#x7565;&#x66F4;&#x591A;&#x524D;&#x6CBF;&#x6280;&#x672F; </p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/FzeyUvq">jav—-int,float,long,double&#x53D6;&#x503C;&#x8303;&#x56F4;&#xFF0C;&#x5185;&#x5B58;&#x6CC4;&#x9732;</a></li>
<li>2.<a href="/articles/RbAJ7fI">&#x5351;&#x9119;C&#x7A0B;&#x5E8F;&#x5927;&#x8D5B;</a></li>
<li>3.<a href="/articles/IJRzEz">&#x7ECF;&#x5178;&#x8BC1;&#x660E;&#xFF1A;&#x4E0D;&#x65AD;&#x628A;&#x51F9;&#x7684;&#x90E8;&#x5206;&#x7FFB;&#x51FA;&#x6765;&#xFF0C;&#x603B;&#x80FD;&#x628A;&#x51F9;&#x591A;&#x8FB9;&#x5F62;&#x53D8;&#x51F8;&#x5417;&#xFF1F;</a></li>
<li>4.<a href="/articles/aQV7zy">&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x4E0E;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x516D;&#xFF09;</a></li>
<li>5.<a href="/articles/EvMbaa">Swift&#x8BED;&#x8A00;&#x90A3;&#x4E9B;&#x9C9C;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x7279;&#x6027;</a></li>
<li><p>6.<a href="/articles/bia6Zv2">TIOBE 2015&#x5E74;6&#x6708;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6392;&#x884C;&#x699C; Objective-C &#x8FC5;&#x901F;&#x8FC1;&#x79FB; Swift</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/rEFBzmI">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;rEFBzmI&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/算法/">算法</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf3d8a7/" title="WildFly Swarm Alpha2 发布 -" itemprop="url">WildFly Swarm Alpha2 发布 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="WildFly_Swarm_Alpha2_&#x53D1;&#x5E03;">WildFly Swarm Alpha2 &#x53D1;&#x5E03;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 07:51:55  <a href="/sites/JNzQre">&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x65B0;&#x95FB;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.oschina.net/news/63188/wildfly-swarm-alpha2?utm_source=tuicool" target="_blank" rel="external">http://www.oschina.net/news/63188/wildfly-swarm-alpha2</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11070115">WildFly</a></p>
<p><a href="http://www.oschina.net/question/1765084_236572" target="_blank" rel="external">6&#x6708;14&#x65E5;&#x4E0A;&#x6D77; OSC &#x6E90;&#x521B;&#x4F1A;&#x5F00;&#x59CB;&#x62A5;&#x540D;&#xFF0C;&#x9001;&#x673A;&#x68B0;&#x952E;&#x76D8;&#x548C;&#x5F00;&#x6E90;&#x65E0;&#x7801;&#x5185;&#x88E4;</a></p>
<p>WildFly Swarm Alpha2 &#x53D1;&#x5E03;&#xFF0C;&#x6B64;&#x7248;&#x672C;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x6539;&#x8FDB;&#x548C;&#x4FEE;&#x590D;&#x3002;&#x6B64;&#x7248;&#x672C;&#x89E3;&#x51B3;&#x4E86;&#x6240;&#x6709; Windows &#x7684; issues&#x3002;</p>
<p>&#x76F8;&#x6BD4; Alpha1 &#x4FEE;&#x6539;&#x4E86;&#x4E00;&#x4E9B;&#x63D2;&#x4EF6;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#xFF0C;&#x7528;&#x6237;&#x9700;&#x8981;&#x66F4;&#x65B0;&#x4E00;&#x4E9B;&#x5E94;&#x7528;&#xFF1A;</p>
<ul>
<li>&#x4ECE; wildfly-swarm-plugin &#x79FB;&#x9664;&#x4E86; execution phase</li>
<li>&#x628A; wildfly-swarm-plugin &#x76EE;&#x6807;&#x4ECE; create &#x4FEE;&#x6539;&#x4E3A; package</li>
<li>&#x4ECE;&#x6240;&#x6709; pom.xml &#x7684; WildFly Swarm &#x4F9D;&#x8D56;&#x4E2D;&#x79FB;&#x9664;&#x4E86; provided scope</li>
</ul>
<h3 id="Weld_&#x548C;_JAX-RS">Weld &#x548C; JAX-RS</h3><p>&#x5F53;&#x4F60;&#x4F7F;&#x7528; Weld &#x548C; JAX-RS &#x65F6;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x6A21;&#x5757;&#x4F1A;&#x5931;&#x6548;&#xFF0C;&#x6240;&#x4EE5;&#x521B;&#x5EFA;&#x4E86;&#x65B0;&#x7684; fraction &#x6765;&#x5F25;&#x8865;&#x8FD9;&#x4E2A;&#x8FDE;&#x63A5;&#x3002;&#x6DFB;&#x52A0;&#x4EE5;&#x4E0B;&#x4F9D;&#x8D56;&#xFF1B;</p>
<pre><code><span class="subst">&amp;</span><span class="literal">lt</span>;dependency<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;groupId<span class="subst">&amp;</span><span class="literal">gt</span>;org<span class="built_in">.</span>wildfly<span class="built_in">.</span>swarm<span class="subst">&amp;</span><span class="literal">lt</span>;/groupId<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;artifactId<span class="subst">&amp;</span><span class="literal">gt</span>;wildfly<span class="attribute">-swarm</span><span class="attribute">-weld</span><span class="attribute">-jaxrs</span><span class="subst">&amp;</span><span class="literal">lt</span>;/artifactId<span class="subst">&amp;</span><span class="literal">gt</span>;
  <span class="subst">&amp;</span><span class="literal">lt</span>;version<span class="subst">&amp;</span><span class="literal">gt</span>;${version<span class="built_in">.</span>wildfly<span class="attribute">-swarm</span>}<span class="subst">&amp;</span><span class="literal">lt</span>;/version<span class="subst">&amp;</span><span class="literal">gt</span>;
<span class="subst">&amp;</span><span class="literal">lt</span>;/dependency<span class="subst">&amp;</span><span class="literal">gt</span>;
</code></pre><h3 id="JPA">JPA</h3><p>&#x6B64;&#x7248;&#x672C;&#x521D;&#x6B65;&#x652F;&#x6301; JPA &#x9879;&#x76EE;&#xFF0C;Alpha3 &#x5C06;&#x4F1A;&#x7EE7;&#x7EED;&#x6539;&#x8FDB;&#x3002;</p>
<pre><code>public class Main {      
    public static void main<span class="params">(String[] args)</span> throws Exception {Container container = new Container<span class="params">()</span>;
      container.start<span class="params">()</span>;      <span class="comment">// Create a JDBC driver deployment using maven groupId:artifactId// The version is resolved from your pom.xml&amp;apos;s DriverDeployment driverDeployment = new DriverDeployment(container, &amp;quot;com.h2database:h2&amp;quot;, &amp;quot;h2&amp;quot;);</span>
      container.deploy<span class="params">(driverDeployment)</span>;      <span class="comment">// Create a DS deploymentDatasourceDeployment dsDeployment = new DatasourceDeployment(container, new Datasource(&amp;quot;ExampleDS&amp;quot;)</span>
          .connectionURL<span class="params">(&amp;quot;jdbc:h2:mem:test;DB_CLOSE_DELAY=-<span class="number">1</span>;DB_CLOSE_ON_EXIT=FALSE&amp;quot;)</span>
          .driver<span class="params">(&amp;quot;h2&amp;quot;)</span>
          .authentication<span class="params">(&amp;quot;sa&amp;quot;, &amp;quot;sa&amp;quot;)</span>
      );
      container.deploy<span class="params">(dsDeployment)</span>;      <span class="comment">// Create the WAR and bundle all the JPA Entities and persistence.xmlWarDeployment deployment = new DefaultWarDeployment(container);</span>
      deployment.getArchive<span class="params">()</span>.addClasses<span class="params">(Employee.class)</span>;
      deployment.getArchive<span class="params">()</span>.addClass<span class="params">(EmployeeServlet.class)</span>;
      deployment.getArchive<span class="params">()</span>.addAsWebInfResource<span class="params">(new ClassLoaderAsset<span class="params">(&amp;quot;META-INF/persistence.xml&amp;quot;, Main.class.getClassLoader<span class="params">()</span>)</span>, &amp;quot;classes/META-INF/persistence.xml&amp;quot;)</span>;
      deployment.getArchive<span class="params">()</span>.addAsWebInfResource<span class="params">(new ClassLoaderAsset<span class="params">(&amp;quot;META-INF/load.sql&amp;quot;, Main.class.getClassLoader<span class="params">()</span>)</span>, &amp;quot;classes/META-INF/load.sql&amp;quot;)</span>;
      container.deploy<span class="params">(deployment)</span>;
    }
}
</code></pre><p>&#x5927;&#x91CF;&#x793A;&#x4F8B;&#xFF1A;</p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/uQZ3uuv">&#x56FE;&#x7075;&#x8BBF;&#x8C08; &#xFF1A; [&#x82F1;] &#x300A;Java 8&#x51FD;&#x6570;&#x5F0F;&#x7F16;&#x7A0B;&#x300B;&#x4F5C;&#x8005;Richard Warbourton&#xFF1A;Ja..</a></li>
<li>2.<a href="/articles/MvARZbI">appium java &#x73AF;&#x5883;&#x642D;&#x5EFA;</a></li>
<li>3.<a href="/articles/YfQBbmB">jquery&#x4E2D;ajax &#x4ECE;&#x524D;&#x7AEF;&#x5230;&#x540E;&#x7AEF; &#x5B8C;&#x6574;&#x8FC7;&#x7A0B;&#x89E3;&#x6790;</a></li>
<li>4.<a href="/articles/AzeIbe7">Java&#x77E5;&#x591A;&#x5C11;&#xFF08;86&#xFF09;&#x6587;&#x672C;&#x6846;&#x548C;&#x6587;&#x672C;&#x533A;&#x7684;&#x8F93;&#x5165;&#x8F93;&#x51FA;</a></li>
<li>5.<a href="/articles/EFnIJb">spring security&#x6E90;&#x7801;&#x5206;&#x6790;&#x4E4B;core&#x5305;</a></li>
<li><p>6.<a href="/articles/jmMRzea">&#x5E38;&#x91CF;&#x3001;&#x53D8;&#x91CF;&#x4E0E;&#x8FD0;&#x7B97;&#x7B26;&#xFF08;&#x4E94;&#xFF09;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/mUbq2uE">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;mUbq2uE&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/WildFly/">WildFly</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/06/09/cf4c7e9/" title="使用 BLU Acceleration 提高 ETL 性能 -" itemprop="url">使用 BLU Acceleration 提高 ETL 性能 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-09T01:14:00.000Z" itemprop="datePublished"> 发表于 2015-06-09</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h1 id="&#x4F7F;&#x7528;_BLU_Acceleration_&#x63D0;&#x9AD8;_ETL_&#x6027;&#x80FD;">&#x4F7F;&#x7528; BLU Acceleration &#x63D0;&#x9AD8; ETL &#x6027;&#x80FD;</h1><p> &#x65F6;&#x95F4;&#xA0;2015-06-09 07:23:38  <a href="/sites/JzYZ3e">IBM developerWorks&#x4E2D;&#x56FD;</a></p>
<p><em>&#x539F;&#x6587;</em>&#xA0; <a href="http://www.ibm.com/developerworks/cn/data/library/techarticle/dm-1504etl-blu-accel/index.html?ca=drs-&amp;utm_source=tuicool" target="_blank" rel="external">http://www.ibm.com/developerworks/cn/data/library/techarticle/dm-1504etl-blu-accel/index.html?ca=drs-</a></p>
<p> &#x4E3B;&#x9898; <a href="/topics/11020034">ETL</a><a href="/topics/11000064">&#x6570;&#x636E;&#x5E93;</a></p>
<h2 id="&#x7B80;&#x4ECB;">&#x7B80;&#x4ECB;</h2><p>ETL&#xFF08;&#x63D0;&#x53D6;&#x3001;&#x8F6C;&#x6362;&#x548C;&#x52A0;&#x8F7D;&#xFF09;&#x6D41;&#x7A0B;&#x662F;&#x5546;&#x4E1A;&#x667A;&#x80FD;&#x62A5;&#x544A;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x96C6;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x8D1F;&#x8D23;&#x52A0;&#x8F7D;&#x6570;&#x636E;&#x5E76;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x5728; DW &#x8868;&#x4E2D;&#x6700;&#x65B0;&#x3002;&#x5BA2;&#x6237;&#x9700;&#x8981;&#x5F53;&#x524D;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x5BA2;&#x6237;&#x624D;&#x80FD;&#x521B;&#x5EFA;/&#x8BBF;&#x95EE;&#x62A5;&#x544A;&#x6216;&#x6307;&#x793A;&#x677F;&#xFF0C;&#x83B7;&#x5F97;&#x57FA;&#x7840;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x7684;&#x8BE6;&#x7EC6;&#x89C6;&#x56FE;&#x3002;&#x5178;&#x578B;&#x7684; ETL &#x6D41;&#x7A0B;&#x5C06;&#x4F1A;&#x6309;&#x7279;&#x5B9A;&#x7684;&#x95F4;&#x9694;&#x65F6;&#x95F4;&#xFF08;&#x6BCF;&#x9694; 30 &#x5206;&#x949F;&#xFF09;&#x52A0;&#x8F7D;&#x589E;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x9700;&#x8981;&#x9891;&#x7E41;&#x5730;&#x66F4;&#x65B0;/&#x5220;&#x9664; DW &#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3002;&#x5728;&#x5BF9;&#x6309;&#x5217;&#x7EC4;&#x7EC7;&#x7684;&#x8868;&#xFF08;BLU &#x8868;&#xFF09;&#x4F7F;&#x7528; DB2 BLU Acceleration &#x7279;&#x6027;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x6CE8;&#x610F;&#x5230;&#xFF0C;&#x63D2;&#x5165;&#x8BB0;&#x5F55;&#x6BD4;&#x66F4;&#x65B0;&#x8BB0;&#x5F55;&#x66F4;&#x6709;&#x6548;&#x3002;</p>
<p>&#x5728;&#x5BF9;&#x6309;&#x5217;&#x7EC4;&#x7EC7;&#x7684;&#x8868;&#x6267;&#x884C; ETL &#x6D41;&#x7A0B;&#x65F6;&#xFF0C;&#x5F88;&#x96BE;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;&#x8BB0;&#x5F55;&#x7684;&#x5217;&#x7684;&#x5217;&#x8868;&#xFF0C;&#x56E0;&#x800C;&#x5F88;&#x96BE;&#x53EA;&#x66F4;&#x65B0;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x7684;&#x5217;&#x3002;&#x5F88;&#x591A;&#x6B21;&#xFF0C;&#x6700;&#x7EC8;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x66F4;&#x65B0;&#x8868;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5217;&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x964D;&#x4F4E;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x9605;&#x8BFB;&#x66F4;&#x591A;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x800C;&#x6BCF;&#x4E00;&#x5217;&#x53C8;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x9875;&#x9762;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x66F4;&#x6539; Update / Delete &#x64CD;&#x4F5C;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EA;&#x5904;&#x7406;&#x5FC5;&#x8981;&#x7684;&#x5217;&#xFF0C;&#x4ECE;&#x800C;&#x5145;&#x5206;&#x5229;&#x7528; BLU Acceleration &#x7684;&#x6700;&#x5927;&#x4F18;&#x52BF;&#x3002; </p>
<p>&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x5C06;&#x89E3;&#x91CA;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x5728;&#x6309;&#x5217;&#x7EC4;&#x7EC7;&#x7684;&#x8868;&#x4E2D;&#x5C06; Update / Delete &#x8F6C;&#x6362;&#x6210; Insert single-column &#x66F4;&#x65B0;&#x3002; F_DOCUMENT &#x662F;&#x4E00;&#x4E2A;&#x6309;&#x5217;&#x7EC4;&#x7EC7;&#x7684;&#x8868;&#xFF0C;&#x6CA1;&#x6709;&#x4E3B;&#x5217;&#x3002;&#x5B83;&#x603B;&#x5171;&#x6709; 20 &#x5217;&#xFF0C;&#x5176;&#x4E2D;&#x7684; 5 &#x4E2A;&#x662F;&#x5173;&#x952E;&#x5217;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5269;&#x4E0B;&#x7684; 15 &#x4E2A;&#x5217;&#x53EF;&#x5728;&#x8FD0;&#x884C; ETL &#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x751F;&#x66F4;&#x6539;&#x3002; </p>
<pre><code><span class="operator"><span class="keyword">CREATE</span> <span class="keyword">TABLE</span> TEST.F_DOCUMENT (
    DOCUMENT_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    DIRECTION_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    COMPANY_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    DOCUMENT_TYPE_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    INTERCHANGE_STATUS_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    TP_IDENTIFIER_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    RECEIVER_IDENTIFIER_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    APPLICATION_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    APPLICATION_ACCOUNT_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    CONTROL_NUMBER_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    RETENTION_PERIOD <span class="built_in">INTEGER</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>,
    PROCESS_DATE_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    PROCESS_TIME_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    AVAILABLE_DATE_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    AVAILABLE_TIME_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    ACCEPTED_DATE_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    ACCEPTED_TIME_ID <span class="built_in">BIGINT</span> <span class="keyword">NOT</span> <span class="literal">NULL</span>, 
    DOCUMENT_CHARS <span class="built_in">BIGINT</span>, 
    DOCUMENT_BYTES <span class="built_in">BIGINT</span>, 
    DOCUMENT_SEGMENTS <span class="built_in">BIGINT</span>
)
ORGANIZE <span class="keyword">BY</span> <span class="keyword">COLUMN</span> <span class="keyword">IN</span> TEST_DATA;</span>
</code></pre><p>&#x5728; ETL &#x6D41;&#x7A0B;&#x5FC5;&#x987B;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x5728;&#x5E38;&#x89C4;&#x8FD0;&#x884C;&#x4E2D;&#x6267;&#x884C;&#x4E0B;&#x9762;&#x7684;&#x8BED;&#x53E5;&#xFF0C;&#x5C1D;&#x8BD5;&#x66F4;&#x65B0;&#x6240;&#x6709;&#x5217;&#xFF0C;&#x5305;&#x62EC;&#x672A;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x7684;&#x5217;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x9700;&#x8981;&#x9605;&#x8BFB;&#x66F4;&#x591A;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x6700;&#x7EC8;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x5B8C;&#x6210;&#x6267;&#x884C;&#x3002;</p>
<pre><code>UPDATE TEST<span class="built_in">.</span>F_DOCUMENT 
    <span class="built_in">SET</span> DOCUMENT_CHARS<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_CHARS,
    DOCUMENT_BYTES<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_BYTES,
    DOCUMENT_SEGMENTS<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_SEGMENTS,
    ACCEPTED_TIME_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>ACCEPTED_TIME_ID,
    AVAILABLE_TIME_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>AVAILABLE_TIME_ID,
    PROCESS_TIME_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>PROCESS_TIME_ID,
    ACCEPTED_DATE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>ACCEPTED_DATE_ID,
    AVAILABLE_DATE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>AVAILABLE_DATE_ID
    ,APPLICATION_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>APPLICATION_ID,
    RECEIVER_PROTOCOL_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>RECEIVER_PROTOCOL_ID,
    PROCESS_DATE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>PROCESS_DATE_ID,
    RETENTION_PERIOD<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>RETENTION_PERIOD,
    APPLICATION_ACCOUNT_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>APPLICATION_ACCOUNT_ID,
    CONTROL_NUMBER_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>CONTROL_NUMBER_ID,
    RECEIVER_IDENTIFIER_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>RECEIVER_IDENTIFIER_ID,
    TP_IDENTIFIER_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>TP_IDENTIFIER_ID 
<span class="keyword">WHERE</span>
    DOCUMENT_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_ID
    <span class="literal">AND</span> DIRECTION_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DIRECTION_ID
    <span class="literal">AND</span> COMPANY_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>COMPANY_ID
    <span class="literal">AND</span> DOCUMENT_TYPE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_TYPE_ID
    <span class="literal">AND</span> INTERCHANGE_STATUS_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>INTERCHANGE_STATUS_ID;
</code></pre><p>&#x56DE;&#x9875;&#x9996; </p>
<h2 id="&#x5C06;&#x4E00;&#x4E2A;&#x591A;&#x5217;&#x66F4;&#x65B0;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x5355;&#x5217;&#x66F4;&#x65B0;&#x548C;&#x63D2;&#x5165;&#x7684;&#x6B65;&#x9AA4;">&#x5C06;&#x4E00;&#x4E2A;&#x591A;&#x5217;&#x66F4;&#x65B0;&#x8F6C;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x5355;&#x5217;&#x66F4;&#x65B0;&#x548C;&#x63D2;&#x5165;&#x7684;&#x6B65;&#x9AA4;</h2><ol>
<li>&#x5C06;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x5217; ACTIVE SMALLINT &#x6DFB;&#x52A0;&#x5230;&#x8868; F_DOCUMENT &#x4E2D;&#x3002;</li>
<li>&#x5BF9;&#x4E8E;&#x8BE5;&#x8868;&#x7684;&#x6BCF;&#x4E00;&#x4E2A; Insert &#x64CD;&#x4F5C;&#xFF0C;&#x786E;&#x4FDD; ACTIVE &#x5217;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; 1&#x3002;</li>
<li><p>&#x5BF9;&#x4E8E;&#x8BE5;&#x8868;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A; Update / Delete &#x64CD;&#x4F5C;&#xFF0C;&#x786E;&#x4FDD; ACTIVE &#x7C7B;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; 0&#x3002;</p>
<p> CREATE TABLE TEST.F_DOCUMENT (</p>
<pre><code>DOCUMENT_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
DIRECTION_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
COMPANY_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
DOCUMENT_TYPE_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
INTERCHANGE_STATUS_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
TP_IDENTIFIER_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
RECEIVER_IDENTIFIER_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
APPLICATION_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
APPLICATION_ACCOUNT_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
CONTROL_NUMBER_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
RETENTION_PERIOD <span class="built_in">INTEGER</span> <span class="literal">NOT</span> <span class="built_in">NULL</span>,
PROCESS_DATE_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
PROCESS_TIME_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
AVAILABLE_DATE_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
AVAILABLE_TIME_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
ACCEPTED_DATE_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
ACCEPTED_TIME_ID BIGINT <span class="literal">NOT</span> <span class="built_in">NULL</span>, 
DOCUMENT_CHARS BIGINT, 
DOCUMENT_BYTES BIGINT, 
DOCUMENT_SEGMENTS BIGINT,
ACTIVE SMALLINT
</code></pre><p> )<br> ORGANIZE BY COLUMN IN TEST_DATA;</p>
</li>
</ol>
<p>&#x5728;&#x5411;&#x8BE5;&#x8868;&#x6DFB;&#x52A0;&#x4E86; ACTIVE &#x5217;&#x4E4B;&#x540E;&#xFF0C;ETL &#x6D41;&#x7A0B;&#x5FC5;&#x987B;&#x5BF9;&#x6BCF;&#x4E2A;&#x66F4;&#x65B0;&#x6267;&#x884C;&#x4E24;&#x4E2A;&#x8BED;&#x53E5;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#x4F1A;&#x662F;&#x4E00;&#x4E2A; update &#x8BED;&#x53E5;&#xFF0C;&#x7528;&#x4E8E;&#x5C06; ACTIVE &#x5217;&#x8BBE;&#x7F6E;&#x4E3A; 0&#xFF0C;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x63D0;&#x5347;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x6D41;&#x7A0B;&#x8BFB;&#x53D6;&#x4E86;&#x66F4;&#x5C11;&#x7684;&#x9875;&#x9762;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x8BED;&#x53E5;&#x5C06;&#x4F1A;&#x63D2;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x8BB0;&#x5F55;&#xFF0C;&#x7528;&#x4E8E;&#x5C06; ACTIVE &#x5217;&#x8BBE;&#x7F6E;&#x4E3A; 1&#x3002;</p>
<pre><code>UPDATE TEST<span class="built_in">.</span>F_DOCUMENT
    <span class="built_in">SET</span> ACTIVE <span class="subst">=</span> <span class="number">0</span>
<span class="keyword">WHERE</span>
    DOCUMENT_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_ID
    <span class="literal">AND</span> DIRECTION_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DIRECTION_ID
    <span class="literal">AND</span> COMPANY_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>COMPANY_ID
    <span class="literal">AND</span> DOCUMENT_TYPE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_TYPE_ID
    <span class="literal">AND</span> INTERCHANGE_STATUS_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>INTERCHANGE_STATUS_ID;


INSERT <span class="keyword">INTO</span> TEST<span class="built_in">.</span>F_DOCUMENT
    (DOCUMENT_ID,
    DIRECTION_ID,
    COMPANY_ID,
    DOCUMENT_TYPE_ID,
    INTERCHANGE_STATUS_ID,
    TP_IDENTIFIER_ID,
    RECEIVER_IDENTIFIER_ID,
    APPLICATION_ID,
    APPLICATION_ACCOUNT_ID,
    CONTROL_NUMBER_ID,
    RETENTION_PERIOD,
    PROCESS_DATE_ID,
    PROCESS_TIME_ID,
    AVAILABLE_DATE_ID,
    AVAILABLE_TIME_ID,
    ACCEPTED_DATE_ID,
    ACCEPTED_TIME_ID,
    DOCUMENT_CHARS,
    DOCUMENT_BYTES,
    DOCUMENT_SEGMENTS,ACTIVE)
VALUES
    (<span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DIRECTION_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>COMPANY_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_TYPE_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>INTERCHANGE_STATUS_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>TP_IDENTIFIER_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>RECEIVER_IDENTIFIER_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>APPLICATION_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>APPLICATION_ACCOUNT_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>CONTROL_NUMBER_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>RETENTION_PERIOD,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>PROCESS_DATE_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>PROCESS_TIME_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>AVAILABLE_DATE_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>AVAILABLE_TIME_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>ACCEPTED_DATE_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>ACCEPTED_TIME_ID,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_CHARS,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_BYTES,
    <span class="subst">&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_SEGMENTS,<span class="number">1</span>);
</code></pre><p>&#x540C;&#x6837;&#x7684;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x60A8;&#x7684; ETL &#x6D41;&#x7A0B;&#x66F4;&#x6539;&#x4E3A;&#x5BF9;&#x6BCF;&#x4E2A;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x6267;&#x884C;&#x5355;&#x5217;&#x66F4;&#x65B0;&#x3002;</p>
<pre><code>UPDATE TEST<span class="built_in">.</span>F_DOCUMENT 
    <span class="built_in">SET</span> ACTIVE <span class="subst">=</span> <span class="number">0</span>
<span class="keyword">WHERE</span>
    DOCUMENT_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_ID
    <span class="literal">AND</span> DIRECTION_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DIRECTION_ID
    <span class="literal">AND</span> COMPANY_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>COMPANY_ID
    <span class="literal">AND</span> DOCUMENT_TYPE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_TYPE_ID
    <span class="literal">AND</span> INTERCHANGE_STATUS_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>INTERCHANGE_STATUS_ID;
</code></pre><p>&#x786E;&#x4FDD;&#x60A8;&#x7684; F_DOCUMENT &#x7684;&#x6240;&#x6709; SELECT &#x67E5;&#x8BE2;&#x90FD;&#x5728; WHERE &#x5B50;&#x53E5;&#x4E2D;&#x63D0;&#x4F9B;&#x4E86; ACTIVE=&apos;1&apos; &#x8BBE;&#x7F6E;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x4F5C;&#x4E3A;&#x7EF4;&#x62A4;&#x6D3B;&#x52A8;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x5220;&#x9664; ACTIVE=&apos;0&apos; &#x7684;&#x6240;&#x6709;&#x8BB0;&#x5F55;&#x3002; </p>
<pre><code><span class="keyword">SELECT</span>
       DOCUMENT_ID,
       DIRECTION_ID,
       COMPANY_ID,
       DOCUMENT_TYPE_ID,
       DOCUMENT_CHARS,
       DOCUMENT_BYTES,
       DOCUMENT_SEGMENTS,
   FROM
       TEST<span class="built_in">.</span>F_DOCUMENT
   <span class="keyword">WHERE</span>
       DOCUMENT_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_ID
       <span class="literal">AND</span> DIRECTION_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DIRECTION_ID
       <span class="literal">AND</span> COMPANY_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>COMPANY_ID
       <span class="literal">AND</span> DOCUMENT_TYPE_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>DOCUMENT_TYPE_ID
       <span class="literal">AND</span> INTERCHANGE_STATUS_ID<span class="subst">=&amp;</span><span class="literal">lt</span>;SOURCE<span class="subst">&amp;</span><span class="literal">gt</span>;<span class="built_in">.</span>INTERCHANGE_STATUS_ID
               <span class="literal">AND</span> ACTIVE <span class="subst">=</span> <span class="number">1</span>;
</code></pre><p>&#x56DE;&#x9875;&#x9996; </p>
<h2 id="&#x9700;&#x8981;&#x7262;&#x8BB0;&#x7684;&#x4E8B;&#x9879;">&#x9700;&#x8981;&#x7262;&#x8BB0;&#x7684;&#x4E8B;&#x9879;</h2><ol>
<li>&#x4EE5;&#x4E0B;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4F1A;&#x589E;&#x52A0;&#x8868;&#x4E2D;&#x8BB0;&#x5F55;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5728; ACTIVE &#x5217;&#x88AB;&#x8BBE;&#x7F6E;&#x4E3A; 1 &#x65F6;&#x4E3A;&#x6BCF;&#x4E2A;&#x66F4;&#x65B0;&#x63D2;&#x5165;&#x4E86;&#x65B0;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x66F4;&#x6539;&#x4E86; ACTIVE=&apos;0&apos; &#x7684;&#x73B0;&#x6709;&#x8BB0;&#x5F55;&#x3002;&#x6211;&#x4EEC;&#x65E0;&#x9700;&#x8981;&#x62C5;&#x5FC3;&#x989D;&#x5916;&#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x56E0;&#x4E3A; BLU Acceleration &#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x5B58;&#x50A8;&#x7BA1;&#x7406;&#x3002;</li>
<li>&#x60A8;&#x5E94;&#x8BE5;&#x6BCF;&#x5468;/&#x6BCF;&#x6708;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x7EF4;&#x62A4;&#x6D3B;&#x52A8;&#xFF0C;&#x5220;&#x9664; ACTIVE=&apos;0&apos; &#x7684;&#x8BB0;&#x5F55;&#xFF0C;&#x4EE5;&#x4FBF;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x56DE;&#x6536;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x548C;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002;</li>
<li>&#x91CD;&#x8981;&#x63D0;&#x793A;&#xFF1A;&#x6240;&#x6709; SELECT &#x8BED;&#x53E5;&#x90FD;&#x5E94;&#x8BE5;&#x603B;&#x662F;&#x5728; WHERE &#x5B50;&#x53E5;&#x4E2D;&#x63D0;&#x4F9B; &quot;ACTIVE=1&quot; &#x8BBE;&#x7F6E;&#x3002;</li>
</ol>
<p>&#x56DE;&#x9875;&#x9996; </p>
<h2 id="&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;">&#x8868;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x8868;&#x793A;</h2><p>&#x4E0B;&#x56FE;&#x5C55;&#x793A;&#x4E86;&#x5728;&#x5C06; Update &#x6216; Delete &#x8BED;&#x53E5;&#x66F4;&#x6539;&#x4E3A; Insert /&#x5355;&#x5217;&#x66F4;&#x65B0;&#x8BED;&#x53E5;&#x65F6;&#xFF0C;&#x6570;&#x636E;&#x5728;&#x60A8;&#x7684;&#x8868;&#x4E2D;&#x770B;&#x8D77;&#x6765;&#x7684;&#x6837;&#x5B50;&#x3002; </p>
<p>&#x56FE; 1. &#x5728; WHERE &#x5B50;&#x53E5;&#x4E2D;&#x5177;&#x6709; ACTIVE=&apos;1&apos; &#x8BBE;&#x7F6E;&#x7684;&#x9009;&#x62E9;&#x8BED;&#x53E5; </p>
<p><img src="http://taojinke.github.io/img/20150609/cf4af7f.png" alt=""></p>
<p>&#x56DE;&#x9875;&#x9996; </p>
<h2 id="&#x7ED3;&#x675F;&#x8BED;">&#x7ED3;&#x675F;&#x8BED;</h2><p>&#x5728; DB2 BLU Acceleration &#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x90FD;&#x88AB;&#x5185;&#x90E8;&#x8F6C;&#x5316;&#x4E3A;&#x4E00;&#x4E2A; Delete &#x548C;&#x4E00;&#x4E2A; Insert &#x64CD;&#x4F5C;&#x3002;&#x65E7;&#x7684;&#x884C;&#x88AB;&#x5220;&#x9664;&#xFF0C;&#x5E26;&#x6709;&#x66F4;&#x65B0;&#x503C;&#x7684;&#x65B0;&#x884C;&#x88AB;&#x63D2;&#x5165;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x5C06;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#x5EF6;&#x8FDF;&#x5230;&#x4E86;&#x4EE5;&#x540E;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x95F4;&#x70B9;&#xFF1B;&#x6240;&#x4EE5;&#xFF0C;&#x5728;&#x7EF4;&#x62A4;&#x671F;&#x95F4;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x3002; </p>
<p>&#x5728; ETL &#x6D41;&#x7A0B;&#x7684; Update &#x64CD;&#x4F5C;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x663E;&#x8457;&#x63D0;&#x5347;&#x3002;&#x53EA;&#x7528;&#x51E0;&#x79D2;&#x949F;&#x65F6;&#x95F4;&#x5C31;&#x66F4;&#x65B0;&#x4E86; 100000 &#x6761;&#x8BB0;&#x5F55;&#xFF0C;&#x800C;&#x5148;&#x524D;&#x7684;&#x64CD;&#x4F5C;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x51E0;&#x5206;&#x949F;&#x7684;&#x65F6;&#x95F4;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#x3002; </p>
<p>&#x8981;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x9700;&#x8981;&#x7262;&#x8BB0;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x8981;&#x70B9;&#x662F;&#xFF1A;&#x5982;&#x679C;&#x8868;&#x4E2D;&#x5B58;&#x5728;&#x4E3B;&#x952E;&#xFF0C;&#x90A3;&#x4E48; ETL &#x64CD;&#x4F5C;&#x5728; BLU Acceleration &#x4E2D;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x5FEB;&#x3002;</p>
<p>&#x8D5E;&#x4E00;&#x4E2A; &#x6536; &#x85CF; </p>
<p> &#x63A8;&#x8350;&#x6587;&#x7AE0;</p>
<ul>
<li>1.<a href="/articles/m6VvYf">Greenplum &#x6570;&#x636E;&#x5E93;&#x5B89;&#x88C5;&#x90E8;&#x7F72;&#xFF08;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#xFF09;</a></li>
<li>2.<a href="/articles/N3a6jaU">&#x8FD0;&#x7EF4;&#x89D2;&#x5EA6;&#x6D45;&#x8C08;MySQL&#x6570;&#x636E;&#x5E93;&#x4F18;&#x5316;</a></li>
<li>3.<a href="/articles/mqa6zar">&#x5806;&#x8868;&#x4E0A;&#x7684;&#x552F;&#x4E00;&#x4E0E;&#x975E;&#x552F;&#x4E00;&#x975E;&#x805A;&#x96C6;&#x7D22;&#x5F15;&#x7684;&#x533A;&#x522B;</a></li>
<li>4.<a href="/articles/IV73uyn">DMSFrame &#x4E4B;SqlCacheDependency&#xFF08;&#x4E00;&#xFF09;</a></li>
<li>5.<a href="/articles/qQbmIvz">SSAS&#x52A8;&#x6001;&#x6DFB;&#x52A0;&#x5206;&#x533A;&#xFF08;&#x4E00;&#xFF09;</a></li>
<li><p>6.<a href="/articles/YRZ7NzM">&#xFF08;&#x6E90;&#x7801;&#x4E0B;&#x8F7D;&#xFF09;&#x9AD8;&#x7075;&#x6D3B;&#x5EA6;&#xFF0C;&#x9AD8;&#x9002;&#x7528;&#x6027;&#xFF0C;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x8F7B;&#x91CF;&#x7EA7;&#x7684; ORM &#x5B9E;&#x73B0;</a></p>
<p>&#x76F8;&#x5173;&#x5FAE;&#x535A; <a href="/articles/weibo_list/j6Fvau">()</a></p>
</li>
</ul>
<h5 id="&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;">&#x6211;&#x6765;&#x8BC4;&#x51E0;&#x53E5;</h5><p>&#x9519;&#x8BEF; </p>
<p> &#x767B;&#x5F55;&#x540E;&#x8BC4;&#x8BBA; &#x5DF2;&#x53D1;&#x8868;&#x8BC4;&#x8BBA;&#x6570;( ) </p>
<p>&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x8BC4;&#x8BBA;&#x4E86;^^ </p>
<p>&#x66F4;&#x591A;&#x8BC4;&#x8BBA;</p>
<p>&#x8BC4;&#x8BBA;&#x52A0;&#x8F7D;&#x5931;&#x8D25;&#xFF0C;<a href="javascript:reload_comments(&apos;j6Fvau&apos;,1,0,-1);" target="_blank" rel="external">&#x91CD;&#x65B0;&#x52A0;&#x8F7D;</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/ETL/">ETL</a><a href="/tags/数据库/">数据库</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/4/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/3/">3</a><a class="page-number" href="/page/4/">4</a><span class="page-number current">5</span><a class="page-number" href="/page/6/">6</a><a class="page-number" href="/page/7/">7</a><span class="space">&hellip;</span><a class="page-number" href="/page/10/">10</a><a class="extend next" rel="next" href="/page/6/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>97</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/IT/" title="IT">IT<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Debian/" title="Debian">Debian<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/WildFly/" title="WildFly">WildFly<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/ETL/" title="ETL">ETL<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/算法/" title="算法">算法<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/Twitter/" title="Twitter">Twitter<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/ECMAScript/" title="ECMAScript">ECMAScript<sup>2</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>2</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
