
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>不同的垃圾回收器的比较 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="(&amp;#x70B9;&amp;#x51FB;&amp;#x4E0A;&amp;#x65B9;  &amp;#x516C;&amp;#x4F17;&amp;#x53F7;  &amp;#xFF0C;&amp;#x53EF;&amp;#x5FEB;&amp;#x901F;&amp;#x5173;&amp;#x6CE8;)
4&amp;#x6B3E;Java&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x5668;&amp;#x2014;&amp;#x2014;&amp;#x9519;&amp;#x8BEF;&amp;#x7">
<meta property="og:type" content="article">
<meta property="og:title" content="不同的垃圾回收器的比较 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/02/f436181/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="(&amp;#x70B9;&amp;#x51FB;&amp;#x4E0A;&amp;#x65B9;  &amp;#x516C;&amp;#x4F17;&amp;#x53F7;  &amp;#xFF0C;&amp;#x53EF;&amp;#x5FEB;&amp;#x901F;&amp;#x5173;&amp;#x6CE8;)
4&amp;#x6B3E;Java&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x5668;&amp;#x2014;&amp;#x2014;&amp;#x9519;&amp;#x8BEF;&amp;#x7">
<meta property="og:image" content="http://taojinke.github.io/img/20150702/f43506a.png">
<meta property="og:updated_time" content="2015-07-01T23:50:29.654Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="不同的垃圾回收器的比较 -">
<meta name="twitter:description" content="(&amp;#x70B9;&amp;#x51FB;&amp;#x4E0A;&amp;#x65B9;  &amp;#x516C;&amp;#x4F17;&amp;#x53F7;  &amp;#xFF0C;&amp;#x53EF;&amp;#x5FEB;&amp;#x901F;&amp;#x5173;&amp;#x6CE8;)
4&amp;#x6B3E;Java&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x5668;&amp;#x2014;&amp;#x2014;&amp;#x9519;&amp;#x8BEF;&amp;#x7">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/f436181/" title="不同的垃圾回收器的比较 -" itemprop="url">不同的垃圾回收器的比较 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:29.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#4款Java垃圾回收器——错误的选择导致糟糕的性能"><span class="toc-number">1.</span> <span class="toc-text">4款Java垃圾回收器——错误的选择导致糟糕的性能</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-串行回收器"><span class="toc-number">2.</span> <span class="toc-text">1.串行回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-并行/吞吐量回收器"><span class="toc-number">3.</span> <span class="toc-text">2.并行/吞吐量回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#3-CMS回收器"><span class="toc-number">4.</span> <span class="toc-text">3.CMS回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#4-G1回收器"><span class="toc-number">5.</span> <span class="toc-text">4.G1回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#Java_8及G1回收器"><span class="toc-number">6.</span> <span class="toc-text">Java 8及G1回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#Java_8及持久代"><span class="toc-number">7.</span> <span class="toc-text">Java 8及持久代</span></a></li></ol>
		
		</div>
		
		<p> (&#x70B9;&#x51FB;&#x4E0A;&#x65B9;  &#x516C;&#x4F17;&#x53F7;  &#xFF0C;&#x53EF;&#x5FEB;&#x901F;&#x5173;&#x6CE8;)</p>
<h4 id="4&#x6B3E;Java&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x2014;&#x2014;&#x9519;&#x8BEF;&#x7684;&#x9009;&#x62E9;&#x5BFC;&#x81F4;&#x7CDF;&#x7CD5;&#x7684;&#x6027;&#x80FD;">4&#x6B3E;Java&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x2014;&#x2014;&#x9519;&#x8BEF;&#x7684;&#x9009;&#x62E9;&#x5BFC;&#x81F4;&#x7CDF;&#x7CD5;&#x7684;&#x6027;&#x80FD;</h4><p>&#x8BF4;&#x8D77;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x8BB8;&#x591A;&#x4EBA;&#x90FD;&#x4E86;&#x89E3;&#x5B83;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x4E5F;&#x5728;&#x65E5;&#x5E38;&#x7684;&#x7F16;&#x7A0B;&#x4E2D;&#x6709;&#x6240;&#x5E94;&#x7528;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x4ECD;&#x6709;&#x8BB8;&#x591A;&#x6211;&#x4EEC;&#x4E0D;&#x592A;&#x4E86;&#x89E3;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x800C;&#x8FD9;&#x6B63;&#x662F;&#x75DB;&#x82E6;&#x7684;&#x6839;&#x6E90;&#x3002;&#x5173;&#x4E8E;JVM&#x6700;&#x5927;&#x7684;&#x8BEF;&#x89E3;&#x5C31;&#x662F;&#x8BA4;&#x4E3A;&#x5B83;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x800C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5B83;&#x6709;&#x56DB;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x5668;&#xFF0C;&#x6BCF;&#x4E2A;&#x90FD;&#x5404;&#x6709;&#x5176;&#x957F;&#x77ED;&#x3002;JVM&#x5E76;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x5730;&#x9009;&#x62E9;&#x67D0;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E8B;&#x8FD8;&#x5F97;&#x843D;&#x5728;&#x4F60;&#x6211;&#x7684;&#x80A9;&#x4E0A;&#xFF0C;&#x56E0;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x5E26;&#x6765;&#x541E;&#x5410;&#x91CF;&#x53CA;&#x5E94;&#x7528;&#x7684;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x7684;&#x663E;&#x8457;&#x7684;&#x5DEE;&#x5F02;&#x3002;</p>
<p>&#x8FD9;&#x56DB;&#x79CD;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x7684;&#x5171;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x5B83;&#x4EEC;&#x90FD;&#x662F;&#x5206;&#x4EE3;&#x7684;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x5B83;&#x4EEC;&#x5C06;&#x6258;&#x7BA1;&#x7684;&#x5806;&#x5206;&#x6210;&#x4E86;&#x597D;&#x51E0;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x5B83;&#x5047;&#x8BBE;&#x5806;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x90FD;&#x5F88;&#x77ED;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x5FEB;&#x88AB;&#x56DE;&#x6536;&#x6389;&#x3002;&#x4ECB;&#x7ECD;&#x8FD9;&#x5757;&#x5185;&#x5BB9;&#x7684;&#x5DF2;&#x7ECF;&#x5F88;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x6B64;&#x8FD9;&#x91CC;&#x6211;&#x6253;&#x7B97;&#x76F4;&#x63A5;&#x8BB2;&#x4E00;&#x4E0B;&#x8FD9;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x7684;&#x957F;&#x5904;&#x53CA;&#x77ED;&#x5904;&#x3002;</p>
<h4 id="1-&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;">1.&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;</h4><p>&#x4E32;&#x884C;&#x56DE;&#x6536;&#x5668;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#xFF0C;&#x4F60;&#x90FD;&#x4E0D;&#x4F1A;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E3B;&#x8981;&#x662F;&#x9762;&#x5411;&#x5355;&#x7EBF;&#x7A0B;&#x73AF;&#x5883;&#x7684;&#xFF08;&#x6BD4;&#x5982;&#x8BF4;32&#x4F4D;&#x7684;&#x6216;&#x8005;Windows&#xFF09;&#x4EE5;&#x53CA;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x5806;&#x3002;&#x8FD9;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x5168;&#x90E8;&#x51BB;&#x7ED3;&#xFF0C;&#x5C31;&#x8FD9;&#x4E00;&#x70B9;&#x800C;&#x8A00;&#x5C31;&#x4F7F;&#x5F97;&#x5B83;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x670D;&#x52A1;&#x7AEF;&#x5E94;&#x7528;&#x6240;&#x91C7;&#x7528;&#x3002;</p>
<p>&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#xFF1A;&#x4F60;&#x53EF;&#x4EE5;&#x6253;&#x5F00;-XX:+UseSerialGC&#x8FD9;&#x4E2A;JVM&#x53C2;&#x6570;&#x6765;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<h4 id="2-&#x5E76;&#x884C;/&#x541E;&#x5410;&#x91CF;&#x56DE;&#x6536;&#x5668;">2.&#x5E76;&#x884C;/&#x541E;&#x5410;&#x91CF;&#x56DE;&#x6536;&#x5668;</h4><p>&#x4E0B;&#x4E00;&#x4E2A;&#x662F;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#xFF08; Parallel collector&#xFF09;&#x3002;&#x8FD9;&#x662F;JVM&#x7684;&#x9ED8;&#x8BA4;&#x56DE;&#x6536;&#x5668;&#x3002;&#x6B63;&#x5982;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x6240;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x5B83;&#x7684;&#x6700;&#x5927;&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x662F;&#x5B83;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6765;&#x626B;&#x63CF;&#x53CA;&#x538B;&#x7F29;&#x5806;&#x3002;&#x5B83;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x4E0D;&#x7BA1;&#x6267;&#x884C;&#x7684;&#x662F;minor GC&#x8FD8;&#x662F;full GC&#x5B83;&#x90FD;&#x4F1A;&#x6682;&#x505C;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x3002;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x6700;&#x9002;&#x5408;&#x90A3;&#x4E9B;&#x53EF;&#x4EE5;&#x5BB9;&#x8BB8;&#x6682;&#x505C;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5B83;&#x8BD5;&#x56FE;&#x51CF;&#x5C11;&#x7531;&#x56DE;&#x6536;&#x5668;&#x6240;&#x5F15;&#x8D77;&#x7684;CPU&#x5F00;&#x9500;&#x3002;</p>
<h4 id="3-CMS&#x56DE;&#x6536;&#x5668;">3.CMS&#x56DE;&#x6536;&#x5668;</h4><p>&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x4E4B;&#x540E;&#x5C31;&#x662F;CMS&#x56DE;&#x6536;&#x5668;&#x4E86;&#xFF08;concurrent-mark-sweep&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#xFF08;concurrent&#xFF09;&#x6765;&#x626B;&#x63CF;&#x5806;&#x5E76;&#x6807;&#x8BB0;&#xFF08;mark&#xFF09;&#x90A3;&#x4E9B;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x53EF;&#x4EE5;&#x56DE;&#x6536;(sweep)&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#x4F1A;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x201D;stop the world&#x201D;&#x7684;&#x6A21;&#x5F0F;&#xFF1A;&#x5F53;&#x8FDB;&#x884C;&#x6839;&#x5BF9;&#x8C61;&#x7684;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x7684;&#x65F6;&#x5019; &#xFF08;&#x8001;&#x751F;&#x4EE3;&#x4E2D;&#x7EBF;&#x7A0B;&#x5165;&#x53E3;&#x70B9;&#x6216;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x53EF;&#x8FBE;&#x7684;&#x90A3;&#x4E9B;&#x5BF9;&#x8C61;&#xFF09;&#x4EE5;&#x53CA;&#x5F53;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x5728;&#x5E76;&#x53D1;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6539;&#x53D8;&#x4E86;&#x5806;&#x7684;&#x72B6;&#x6001;&#x4F7F;&#x5F97;&#x5B83;&#x4E0D;&#x5F97;&#x4E0D;&#x56DE;&#x53BB;&#x518D;&#x6B21;&#x786E;&#x8BA4;&#x81EA;&#x5DF1;&#x6807;&#x8BB0;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x6B63;&#x786E;&#x7684;&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x5C31;&#x662F;&#x4F1A;&#x78B0;&#x5230;promotion failure&#xFF0C;&#x8FD9;&#x662F;&#x6307;&#x5728;&#x56DE;&#x6536;&#x65B0;&#x751F;&#x4EE3;&#x53CA;&#x5E74;&#x8001;&#x4EE3;&#x65F6;&#x51FA;&#x73B0;&#x4E86;&#x7ADE;&#x4E89;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x5982;&#x679C;&#x56DE;&#x6536;&#x5668;&#x9700;&#x8981;&#x5C06;&#x5E74;&#x8F7B;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x5E74;&#x8001;&#x4EE3;&#x4E2D;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5E74;&#x8001;&#x4EE3;&#x6CA1;&#x6709;&#x591A;&#x4F59;&#x7684;&#x7A7A;&#x95F4;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x53EA;&#x80FD;&#x5148;&#x8FDB;&#x884C;&#x4E00;&#x6B21;STW(Stop The World)&#x7684;full GC&#x4E86;&#x2014;&#x2014;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x6B63;&#x662F;CMS&#x6240;&#x5E0C;&#x671B;&#x907F;&#x514D;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x4F60;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x589E;&#x52A0;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x6216;&#x8005;&#x589E;&#x52A0;&#x6574;&#x4E2A;&#x5806;&#x7684;&#x5927;&#x5C0F;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x5C31;&#x662F;&#x7ED9;&#x56DE;&#x6536;&#x5668;&#x5206;&#x914D;&#x4E00;&#x4E9B;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x4EE5;&#x4FBF;&#x4E0E;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7684;&#x901F;&#x5EA6;&#x8FDB;&#x884C;&#x8D5B;&#x8DD1;&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x548C;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5668;&#x76F8;&#x6BD4;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x7684;CPU&#x8D44;&#x6E90;&#x4F1A;&#x66F4;&#x591A;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x591A;&#x4E2A;&#x7EBF;&#x7A0B;&#x6765;&#x6267;&#x884C;&#x626B;&#x63CF;&#x548C;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x8BA9;&#x5E94;&#x7528;&#x6301;&#x7EED;&#x63D0;&#x4F9B;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x800C;&#x8A00;&#xFF0C;&#x5E94;&#x7528;&#x7684;&#x6682;&#x505C;&#x5BF9;&#x5B83;&#x4EEC;&#x662F;&#x5F88;&#x4E0D;&#x5229;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;CMS&#x56DE;&#x6536;&#x5668;&#x3002;&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B97;&#x6CD5;&#x4E5F;&#x4E0D;&#x662F;&#x9ED8;&#x8BA4;&#x5F00;&#x542F;&#x7684;&#x3002;&#x4F60;&#x5F97;&#x6307;&#x5B9A;XX:+UseConcMarkSweepGC&#x6765;&#x542F;&#x7528;&#x5B83;&#x3002;&#x5047;&#x8BBE;&#x4F60;&#x7684;&#x5806;&#x5C0F;&#x4E8E;4G&#xFF0C;&#x800C;&#x4F60;&#x53C8;&#x5E0C;&#x671B;&#x5206;&#x914D;&#x66F4;&#x591A;&#x7684;CPU&#x8D44;&#x6E90;&#x4EE5;&#x907F;&#x514D;&#x5E94;&#x7528;&#x6682;&#x505C;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x5C31;&#x662F;&#x4F60;&#x8981;&#x9009;&#x62E9;&#x7684;&#x56DE;&#x6536;&#x5668;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x5806;&#x5927;&#x4E8E;4G&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x66F4;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x6700;&#x540E;&#x7684;&#x8FD9;&#x4E2A;&#x2014;&#x2014;G1&#x56DE;&#x6536;&#x5668;&#x3002;</p>
<h4 id="4-G1&#x56DE;&#x6536;&#x5668;">4.G1&#x56DE;&#x6536;&#x5668;</h4><p>G1&#xFF08; Garbage first&#xFF09;&#x56DE;&#x6536;&#x5668;&#x5728;JDK 7update 4&#x4E2D;&#x9996;&#x6B21;&#x5F15;&#x5165;&#xFF0C;&#x5B83;&#x7684;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x662F;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x652F;&#x6301;&#x5927;&#x4E8E;4GB&#x7684;&#x5806;&#x3002;G1&#x56DE;&#x6536;&#x5668;&#x5C06;&#x5806;&#x5206;&#x4E3A;&#x591A;&#x4E2A;&#x533A;&#x57DF;&#xFF0C;&#x5927;&#x5C0F;&#x4ECE;1MB&#x5230;32MB&#x4E0D;&#x7B49;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x591A;&#x4E2A;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x6765;&#x626B;&#x63CF;&#x5B83;&#x4EEC;&#x3002;G1&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x4F18;&#x5148;&#x626B;&#x63CF;&#x90A3;&#x4E9B;&#x5305;&#x542B;&#x5783;&#x573E;&#x6700;&#x591A;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x8FD9;&#x6B63;&#x662F;&#x5B83;&#x7684;&#x540D;&#x5B57;&#x7684;&#x7531;&#x6765;&#xFF08;Garbage first&#xFF09;&#x3002;&#x8FD9;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;-XX:UseG1GC&#x6807;&#x8BB0;&#x6765;&#x542F;&#x7528;&#x3002;</p>
<p>&#x8FD9;&#x4E00;&#x7B56;&#x7565;&#x51CF;&#x5C11;&#x4E86;&#x540E;&#x53F0;&#x7EBF;&#x7A0B;&#x8FD8;&#x672A;&#x626B;&#x63CF;&#x5B8C;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#x524D;&#x5806;&#x5C31;&#x5DF2;&#x7ECF;&#x7528;&#x5149;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x800C;&#x90A3;&#x79CD;&#x60C5;&#x51B5;&#x56DE;&#x6536;&#x5668;&#x5C31;&#x5FC5;&#x987B;&#x5F97;&#x6682;&#x505C;&#x5E94;&#x7528;&#xFF0C;&#x8FD9;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;STW&#x56DE;&#x6536;&#x3002;G1&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x597D;&#x5904;&#x5C31;&#x662F;&#x5B83;&#x603B;&#x662F;&#x4F1A;&#x8FDB;&#x884C;&#x5806;&#x7684;&#x538B;&#x7F29;&#xFF0C;&#x800C;CMS&#x56DE;&#x6536;&#x5668;&#x53EA;&#x6709;&#x5728;full GC&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x5E72;&#x8FD9;&#x4E8B;&#x3002;</p>
<p>&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x91CC;&#xFF0C;&#x5927;&#x5806;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x4E89;&#x8BAE;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x5F88;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4ECE;&#x5355;&#x673A;&#x5668;&#x5355;JVM&#x6A21;&#x578B;&#x8F6C;&#x5411;&#x4E86;&#x5355;&#x673A;&#x5668;&#x591A;JVM&#x7684;&#x5FAE;&#x670D;&#x52A1;&#xFF0C;&#x7EC4;&#x4EF6;&#x5316;&#x7684;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x662F;&#x8BB8;&#x591A;&#x56E0;&#x7D20;&#x6240;&#x9A71;&#x52A8;&#x7684;&#xFF0C;&#x5305;&#x62EC;&#x9694;&#x79BB;&#x7A0B;&#x5E8F;&#x7684;&#x7EC4;&#x4EF6;&#xFF0C;&#x7B80;&#x5316;&#x90E8;&#x7F72;&#xFF0C;&#x907F;&#x514D;&#x91CD;&#x65B0;&#x52A0;&#x8F7D;&#x5E94;&#x7528;&#x7C7B;&#x5230;&#x5185;&#x5B58;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x5F00;&#x9500;&#xFF08;Java 8&#x4E2D;&#x8FD9;&#x70B9;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x4E86;&#x6539;&#x5584;&#xFF09;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E48;&#x505A;&#x6700;&#x4E3B;&#x8981;&#x8FD8;&#x662F;&#x5E0C;&#x671B;&#x80FD;&#x907F;&#x514D;&#x5927;&#x5806;&#x7684;GC&#x4E2D;&#x957F;&#x65F6;&#x671F;&#x7684;&#x201D;stop the world&#x201D;&#x7684;&#x6682;&#x505C;&#xFF08;&#x5728;&#x4E00;&#x6B21;&#x5927;&#x7684;&#x56DE;&#x6536;&#x4E2D;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x6570;&#x79D2;&#x624D;&#x80FD;&#x5B8C;&#x6210;&#xFF09;&#x3002;&#x50CF;Docker&#x8FD9;&#x6837;&#x7684;&#x5BB9;&#x5668;&#x6280;&#x672F;&#x4E5F;&#x52A0;&#x901F;&#x4E86;&#x8FD9;&#x4E00;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B83;&#x4EEC;&#x4F7F;&#x5F97;&#x4F60;&#x53EF;&#x4EE5;&#x5F88;&#x8F7B;&#x677E;&#x5730;&#x5728;&#x540C;&#x4E00;&#x53F0;&#x7269;&#x7406;&#x673A;&#x4E0A;&#x90E8;&#x7F72;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x3002;</p>
<h4 id="Java_8&#x53CA;G1&#x56DE;&#x6536;&#x5668;">Java 8&#x53CA;G1&#x56DE;&#x6536;&#x5668;</h4><p>Java 8 update 20&#x6240;&#x5F15;&#x5165;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x68D2;&#x7684;&#x4F18;&#x5316;&#x5C31;&#x662F;G1&#x56DE;&#x6536;&#x5668;&#x4E2D;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x53BB;&#x91CD;&#xFF08;String deduplication&#xFF09;&#x3002;&#x7531;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;(&#x5305;&#x62EC;&#x5B83;&#x4EEC;&#x5185;&#x90E8;&#x7684;char[]&#x6570;&#x7EC4;&#xFF09;&#x5360;&#x7528;&#x4E86;&#x5927;&#x591A;&#x6570;&#x7684;&#x5806;&#x7A7A;&#x95F4;&#xFF0C;&#x8FD9;&#x9879;&#x65B0;&#x7684;&#x4F18;&#x5316;&#x65E8;&#x5728;&#x4F7F;&#x5F97;G1&#x56DE;&#x6536;&#x5668;&#x80FD;&#x8BC6;&#x522B;&#x51FA;&#x5806;&#x4E2D;&#x90A3;&#x4E9B;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x6307;&#x5411;&#x540C;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x7684;char[]&#x6570;&#x7EC4;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x540C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x591A;&#x4EFD;&#x62F7;&#x8D1D;&#xFF0C;&#x90A3;&#x6837;&#x5806;&#x7684;&#x4F7F;&#x7528;&#x6548;&#x7387;&#x4F1A;&#x53D8;&#x5F97;&#x5F88;&#x4F4E;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;-XX:+UseStringDeduplication&#x8FD9;&#x4E2A;JVM&#x53C2;&#x6570;&#x6765;&#x8BD5;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x3002;</p>
<h4 id="Java_8&#x53CA;&#x6301;&#x4E45;&#x4EE3;">Java 8&#x53CA;&#x6301;&#x4E45;&#x4EE3;</h4><p>Java 8&#x4E2D;&#x6700;&#x5927;&#x7684;&#x6539;&#x53D8;&#x5C31;&#x662F;&#x6301;&#x4E45;&#x4EE3;&#x7684;&#x79FB;&#x9664;&#xFF0C;&#x5B83;&#x539F;&#x672C;&#x662F;&#x7528;&#x6765;&#x7ED9;&#x7C7B;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x9A7B;&#x7559;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x9759;&#x6001;&#x53D8;&#x91CF;&#x6765;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#x7684;&#x3002;&#x8FD9;&#x5728;&#x4EE5;&#x524D;&#x90FD;&#x662F;&#x9700;&#x8981;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x9488;&#x5BF9;&#x90A3;&#x4E9B;&#x4F1A;&#x52A0;&#x8F7D;&#x5927;&#x91CF;&#x7C7B;&#x7684;&#x5E94;&#x7528;&#x6765;&#x4E13;&#x95E8;&#x8FDB;&#x884C;&#x5806;&#x6BD4;&#x4F8B;&#x7684;&#x4F18;&#x5316;&#x53CA;&#x8C03;&#x6574;&#x3002;&#x8BB8;&#x591A;&#x5E74;&#x6765;&#x90FD;&#x662F;&#x5982;&#x6B64;&#xFF0C;&#x8FD9;&#x4E5F;&#x6B63;&#x662F;&#x8BB8;&#x591A;OutOfMemory&#x5F02;&#x5E38;&#x7684;&#x6839;&#x6E90;&#xFF0C;&#x56E0;&#x6B64;&#x7531;JVM&#x6765;&#x63A5;&#x7BA1;&#x5B83;&#x771F;&#x662F;&#x518D;&#x597D;&#x4E0D;&#x8FC7;&#x4E86;&#x3002;&#x5373;&#x4FBF;&#x5982;&#x6B64;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x4F1A;&#x51CF;&#x5C11;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x5E94;&#x7528;&#x89E3;&#x8026;&#x5230;&#x4E0D;&#x540C;&#x7684;JVM&#x4E2D;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x56DE;&#x6536;&#x5668;&#x90FD;&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x5173;&#x548C;&#x9009;&#x9879;&#x6765;&#x8FDB;&#x884C;&#x8C03;&#x4F18;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x4F1A;&#x589E;&#x52A0;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x51CF;&#x5C11;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7684;&#x5177;&#x4F53;&#x7684;&#x884C;&#x4E3A;&#x4E86;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x6DF1;&#x5165;&#x8BB2;&#x89E3;&#x914D;&#x7F6E;&#x8FD9;&#x4E9B;&#x7B97;&#x6CD5;&#x7684;&#x5173;&#x952E;&#x7B56;&#x7565;&#x3002;</p>
<p>&#x51FA;&#x5904;&#xFF1A;&#x82B1;&#x540D;&#x6709;&#x5B5A;</p>
<p>&#x94FE;&#x63A5;&#xFF1A;<a href="http://it.deepinmind.com/gc/2014/09/12/garbage-collectors-serial-vs-parallel-vs-cms-vs-the-g1-and-whats-new-in-java-8.html" target="_blank" rel="external">http://it.deepinmind.com/gc/2014/09/12/garbage-collectors-serial-vs-parallel-vs-cms-vs-the-g1-and-whats-new-in-java-8.html</a></p>
<p> <strong>ImportNew &#x4E13;&#x6CE8; Java &#x6280;&#x672F;&#x5206;&#x4EAB;&#xFF0C;&#x6B22;&#x8FCE;&#x5173;&#x6CE8;&#x3002;</strong></p>
<p>&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; ImportNew</p>
<p> <img src="http://taojinke.github.io/img/20150702/f43506a.png" alt=""></p>
<p>&#xFF08;&#x957F;&#x6309;&#x4E0A;&#x56FE; &#x2191;&#x2191;&#x2191; &#x53EF;&#x81EA;&#x52A8;&#x8BC6;&#x522B;&#x4E8C;&#x7EF4;&#x7801;&#xFF09;</p>
<p>&#x70B9;&#x51FB;&#x201C;&#x9605;&#x8BFB;&#x539F;&#x6587;&#x201D;&#xFF0C;&#x67E5;&#x770B;&#x66F4;&#x591A; Java &#x6587;&#x7AE0;&#x3002;</p>
<p>&#x2193;&#x2193;&#x2193;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a><a href="/tags/Java8/">Java8</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/02/f46628c/" title="JVM学习笔记 -">
  <strong>上一篇：</strong><br/>
  <span>
  JVM学习笔记 -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/02/f42cc94/"  title="【Java】实战Java虚拟机之五“开启JIT编译” -">
 <strong>下一篇：</strong><br/> 
 <span>【Java】实战Java虚拟机之五“开启JIT编译” -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#4款Java垃圾回收器——错误的选择导致糟糕的性能"><span class="toc-number">1.</span> <span class="toc-text">4款Java垃圾回收器——错误的选择导致糟糕的性能</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#1-串行回收器"><span class="toc-number">2.</span> <span class="toc-text">1.串行回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#2-并行/吞吐量回收器"><span class="toc-number">3.</span> <span class="toc-text">2.并行/吞吐量回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#3-CMS回收器"><span class="toc-number">4.</span> <span class="toc-text">3.CMS回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#4-G1回收器"><span class="toc-number">5.</span> <span class="toc-text">4.G1回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#Java_8及G1回收器"><span class="toc-number">6.</span> <span class="toc-text">Java 8及G1回收器</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#Java_8及持久代"><span class="toc-number">7.</span> <span class="toc-text">Java 8及持久代</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>215</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/IT/" title="IT">IT<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Debian/" title="Debian">Debian<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/WildFly/" title="WildFly">WildFly<sup>3</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
