
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>Java垃圾回收机制详解 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x7684;&amp;#x610F;&amp;#x4E49;

&amp;#x5728;C++&amp;#x4E2D;&amp;#xFF0C;&amp;#x5BF9;&amp;#x8C61;&amp;#x6240;&amp;#x5360;&amp;#x7684;&amp;#x5185;&amp;#x5B58;&amp;#x5728;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7ED3;&amp;#x675F;&amp;#x8FD0;&amp;#x884C;&amp;#x">
<meta property="og:type" content="article">
<meta property="og:title" content="Java垃圾回收机制详解 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/02/e4ede4a/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x7684;&amp;#x610F;&amp;#x4E49;

&amp;#x5728;C++&amp;#x4E2D;&amp;#xFF0C;&amp;#x5BF9;&amp;#x8C61;&amp;#x6240;&amp;#x5360;&amp;#x7684;&amp;#x5185;&amp;#x5B58;&amp;#x5728;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7ED3;&amp;#x675F;&amp;#x8FD0;&amp;#x884C;&amp;#x">
<meta property="og:updated_time" content="2015-07-01T23:50:04.090Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="Java垃圾回收机制详解 -">
<meta name="twitter:description" content="&amp;#x5783;&amp;#x573E;&amp;#x56DE;&amp;#x6536;&amp;#x7684;&amp;#x610F;&amp;#x4E49;

&amp;#x5728;C++&amp;#x4E2D;&amp;#xFF0C;&amp;#x5BF9;&amp;#x8C61;&amp;#x6240;&amp;#x5360;&amp;#x7684;&amp;#x5185;&amp;#x5B58;&amp;#x5728;&amp;#x7A0B;&amp;#x5E8F;&amp;#x7ED3;&amp;#x675F;&amp;#x8FD0;&amp;#x884C;&amp;#x">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/e4ede4a/" title="Java垃圾回收机制详解 -" itemprop="url">Java垃圾回收机制详解 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:50:03.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#3-_System-gc()方法"><span class="toc-number">1.</span> <span class="toc-text">3. System.gc()方法</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#4-_finalize()方法"><span class="toc-number">2.</span> <span class="toc-text">4. finalize()方法</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#5-_触发主GC（Garbage_Collector）的条件"><span class="toc-number">3.</span> <span class="toc-text">5. 触发主GC（Garbage Collector）的条件</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#6-_减少GC开销的措施"><span class="toc-number">4.</span> <span class="toc-text">6. 减少GC开销的措施</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(1)不要显式调用System-gc()"><span class="toc-number">5.</span> <span class="toc-text">(1)不要显式调用System.gc()</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(2)尽量减少临时对象的使用"><span class="toc-number">6.</span> <span class="toc-text">(2)尽量减少临时对象的使用</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(3)对象不用时最好显式置为Null"><span class="toc-number">7.</span> <span class="toc-text">(3)对象不用时最好显式置为Null</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(4)尽量使用StringBuffer,而不用String来累加字符串"><span class="toc-number">8.</span> <span class="toc-text">(4)尽量使用StringBuffer,而不用String来累加字符串</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(5)能用基本类型如Int,Long,就不用Integer,Long对象"><span class="toc-number">9.</span> <span class="toc-text">(5)能用基本类型如Int,Long,就不用Integer,Long对象</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(6)尽量少用静态对象变量"><span class="toc-number">10.</span> <span class="toc-text">(6)尽量少用静态对象变量</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(7)分散对象创建或删除的时间"><span class="toc-number">11.</span> <span class="toc-text">(7)分散对象创建或删除的时间</span></a></li></ol>
		
		</div>
		
		<ol>
<li>&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x610F;&#x4E49;</li>
</ol>
<p>&#x5728;C++&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7684;&#x5185;&#x5B58;&#x5728;&#x7A0B;&#x5E8F;&#x7ED3;&#x675F;&#x8FD0;&#x884C;&#x4E4B;&#x524D;&#x4E00;&#x76F4;&#x88AB;&#x5360;&#x7528;&#xFF0C;&#x5728;&#x660E;&#x786E;&#x91CA;&#x653E;&#x4E4B;&#x524D;&#x4E0D;&#x80FD;&#x5206;&#x914D;&#x7ED9;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#xFF1B;&#x800C;&#x5728;Java&#x4E2D;&#xFF0C;&#x5F53;&#x6CA1;&#x6709;&#x5BF9;&#x8C61;&#x5F15;&#x7528;&#x6307;&#x5411;&#x539F;&#x5148;&#x5206;&#x914D;&#x7ED9;&#x67D0;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x65F6;&#xFF0C;&#x8BE5;&#x5185;&#x5B58;&#x4FBF;&#x6210;&#x4E3A;&#x5783;&#x573E;&#x3002;JVM&#x7684;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7EA7;&#x7EBF;&#x7A0B;&#x4F1A;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x8BE5;&#x5185;&#x5B58;&#x5757;&#x3002;&#x5783;&#x573E;&#x56DE;&#x6536;&#x610F;&#x5473;&#x7740;&#x7A0B;&#x5E8F;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x7684;&#x5BF9;&#x8C61;&#x662F;&quot;&#x65E0;&#x7528;&#x4FE1;&#x606F;&quot;&#xFF0C;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5C06;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0D;&#x518D;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5185;&#x5B58;&#x56DE;&#x6536;&#x5B83;&#x5360;&#x9886;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x4FBF;&#x7A7A;&#x95F4;&#x88AB;&#x540E;&#x6765;&#x7684;&#x65B0;&#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x9664;&#x4E86;&#x91CA;&#x653E;&#x6CA1;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x4E5F;&#x53EF;&#x4EE5;&#x6E05;&#x9664;&#x5185;&#x5B58;&#x8BB0;&#x5F55;&#x788E;&#x7247;&#x3002;&#x7531;&#x4E8E;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x548C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x91CA;&#x653E;&#x4E22;&#x5F03;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x5185;&#x5B58;&#x4F1A;&#x51FA;&#x73B0;&#x788E;&#x7247;&#x3002;&#x788E;&#x7247;&#x662F;&#x5206;&#x914D;&#x7ED9;&#x5BF9;&#x8C61;&#x7684;&#x5185;&#x5B58;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x6D1E;&#x3002;&#x788E;&#x7247;&#x6574;&#x7406;&#x5C06;&#x6240;&#x5360;&#x7528;&#x7684;&#x5806;&#x5185;&#x5B58;&#x79FB;&#x5230;&#x5806;&#x7684;&#x4E00;&#x7AEF;&#xFF0C;JVM&#x5C06;&#x6574;&#x7406;&#x51FA;&#x7684;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7ED9;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x3002; </p>
<p>&#x5783;&#x573E;&#x56DE;&#x6536;&#x80FD;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x51CF;&#x8F7B;&#x7F16;&#x7A0B;&#x7684;&#x8D1F;&#x62C5;&#x3002;&#x8FD9;&#x4F7F;Java &#x865A;&#x62DF;&#x673A;&#x5177;&#x6709;&#x4E00;&#x4E9B;&#x4F18;&#x70B9;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x5B83;&#x80FD;&#x4F7F;&#x7F16;&#x7A0B;&#x6548;&#x7387;&#x63D0;&#x9AD8;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x53EF;&#x80FD;&#x8981;&#x82B1;&#x8BB8;&#x591A;&#x65F6;&#x95F4;&#x6765;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x96BE;&#x61C2;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x95EE;&#x9898;&#x3002;&#x5728;&#x7528;Java&#x8BED;&#x8A00;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9760;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#x53EF;&#x5927;&#x5927;&#x7F29;&#x77ED;&#x65F6;&#x95F4;&#x3002;&#x5176;&#x6B21;&#x662F;&#x5B83;&#x4FDD;&#x62A4;&#x7A0B;&#x5E8F;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF0C; &#x5783;&#x573E;&#x56DE;&#x6536;&#x662F;Java&#x8BED;&#x8A00;&#x5B89;&#x5168;&#x6027;&#x7B56;&#x7565;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x90E8;&#x4EFD;&#x3002;</p>
<p>&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7684;&#x7F3A;&#x70B9;&#x662F;&#x5B83;&#x7684;&#x5F00;&#x9500;&#x5F71;&#x54CD;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x3002;Java&#x865A;&#x62DF;&#x673A;&#x5FC5;&#x987B;&#x8FFD;&#x8E2A;&#x8FD0;&#x884C;&#x7A0B;&#x5E8F;&#x4E2D;&#x6709;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x6700;&#x7EC8;&#x91CA;&#x653E;&#x6CA1;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x8FD9;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x5904;&#x7406;&#x5668;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5176;&#x6B21;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x5B8C;&#x5907;&#x6027;&#xFF0C;&#x65E9;&#x5148;&#x91C7;&#x7528;&#x7684;&#x67D0;&#x4E9B;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x5C31;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;100%&#x6536;&#x96C6;&#x5230;&#x6240;&#x6709;&#x7684;&#x5E9F;&#x5F03;&#x5185;&#x5B58;&#x3002;&#x5F53;&#x7136;&#x968F;&#x7740;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x7684;&#x4E0D;&#x65AD;&#x6539;&#x8FDB;&#x4EE5;&#x53CA;&#x8F6F;&#x786C;&#x4EF6;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x7684;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#xFF0C;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x8FCE;&#x5203;&#x800C;&#x89E3;&#x3002;</p>
<ol>
<li>&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x7B97;&#x6CD5;&#x5206;&#x6790; </li>
</ol>
<p>Java&#x8BED;&#x8A00;&#x89C4;&#x8303;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x5730;&#x8BF4;&#x660E;JVM&#x4F7F;&#x7528;&#x54EA;&#x79CD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4EFB;&#x4F55;&#x4E00;&#x79CD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x4E00;&#x822C;&#x8981;&#x505A;2&#x4EF6;&#x57FA;&#x672C;&#x7684;&#x4E8B;&#x60C5;&#xFF1A;&#xFF08;1&#xFF09;&#x53D1;&#x73B0;&#x65E0;&#x7528;&#x4FE1;&#x606F;&#x5BF9;&#x8C61;&#xFF1B;&#xFF08;2&#xFF09;&#x56DE;&#x6536;&#x88AB;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4F7F;&#x8BE5;&#x7A7A;&#x95F4;&#x53EF;&#x88AB;&#x7A0B;&#x5E8F;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x4E86;&#x6839;&#x96C6;(root set)&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF1B;&#x6240;&#x8C13;&#x6839;&#x96C6;&#x5C31;&#x662F;&#x6B63;&#x5728;&#x6267;&#x884C;&#x7684;Java&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x7684;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x7684;&#x96C6;&#x5408;(&#x5305;&#x62EC;&#x5C40;&#x90E8;&#x53D8;&#x91CF;&#x3001;&#x53C2;&#x6570;&#x3001;&#x7C7B;&#x53D8;&#x91CF;)&#xFF0C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x8BBF;&#x95EE;&#x5BF9;&#x8C61;&#x7684;&#x5C5E;&#x6027;&#x548C;&#x8C03;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5783;&#x573E;&#x56DE;&#x6536;&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x4ECE;&#x6839;&#x5F00;&#x59CB;&#x54EA;&#x4E9B;&#x662F;&#x53EF;&#x8FBE;&#x7684;&#x548C;&#x54EA;&#x4E9B;&#x662F;&#x4E0D;&#x53EF;&#x8FBE;&#x7684;&#xFF0C;&#x4ECE;&#x6839;&#x96C6;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#xFF0C;&#x5B83;&#x4EEC;&#x4E0D;&#x80FD;&#x4F5C;&#x4E3A;&#x5783;&#x573E;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x8FD9;&#x4E5F;&#x5305;&#x62EC;&#x4ECE;&#x6839;&#x96C6;&#x95F4;&#x63A5;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x800C;&#x6839;&#x96C6;&#x901A;&#x8FC7;&#x4EFB;&#x610F;&#x8DEF;&#x5F84;&#x4E0D;&#x53EF;&#x8FBE;&#x7684;&#x5BF9;&#x8C61;&#x7B26;&#x5408;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x5E94;&#x8BE5;&#x88AB;&#x56DE;&#x6536;&#x3002;&#x4E0B;&#x9762;&#x4ECB;&#x7ECD;&#x51E0;&#x4E2A;&#x5E38;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x3002;</p>
<p>2.1. &#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;(Reference Counting Collector)</p>
<p>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#x662F;&#x552F;&#x4E00;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x6839;&#x96C6;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x6CD5;&#xFF0C;&#x8BE5;&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x6765;&#x533A;&#x5206;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x548C;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5806;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x3002;&#x5F53;&#x6BCF;&#x4E00;&#x6B21;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5E76;&#x8D4B;&#x7ED9;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x7F6E;&#x4E3A;1&#x3002;&#x5F53;&#x5BF9;&#x8C61;&#x88AB;&#x8D4B;&#x7ED9;&#x4EFB;&#x610F;&#x53D8;&#x91CF;&#x65F6;&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x6BCF;&#x6B21;&#x52A0;1&#x5F53;&#x5BF9;&#x8C61;&#x51FA;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#x540E;(&#x8BE5;&#x5BF9;&#x8C61;&#x4E22;&#x5F03;&#x4E0D;&#x518D;&#x4F7F;&#x7528;)&#xFF0C;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x51CF;1&#xFF0C;&#x4E00;&#x65E6;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x4E3A;0&#xFF0C;&#x5BF9;&#x8C61;&#x5C31;&#x6EE1;&#x8DB3;&#x4E86;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6761;&#x4EF6;&#x3002; </p>
<p>&#x57FA;&#x4E8E;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8FD0;&#x884C;&#x8F83;&#x5FEB;&#xFF0C;&#x4E0D;&#x4F1A;&#x957F;&#x65F6;&#x95F4;&#x4E2D;&#x65AD;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#xFF0C;&#x9002;&#x5B9C;&#x5730;&#x5FC5;&#x987B;&#x5B9E;&#x65F6;&#x8FD0;&#x884C;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x4F46;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#x589E;&#x52A0;&#x4E86;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x7684;&#x5F00;&#x9500;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x5BF9;&#x8C61;&#x8D4B;&#x7ED9;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#xFF0C;&#x8BA1;&#x6570;&#x5668;&#x52A0;1&#xFF0C;&#x800C;&#x6BCF;&#x6B21;&#x73B0;&#x6709;&#x5BF9;&#x8C61;&#x51FA;&#x4E86;&#x4F5C;&#x7528;&#x57DF;&#x751F;&#xFF0C;&#x8BA1;&#x6570;&#x5668;&#x51CF;1&#x3002;</p>
<p>2.2. tracing&#x7B97;&#x6CD5;(Tracing Collector) </p>
<p>tracing&#x7B97;&#x6CD5;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x6CD5;&#x7684;&#x95EE;&#x9898;&#x800C;&#x63D0;&#x51FA;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;&#x6839;&#x96C6;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x57FA;&#x4E8E;tracing&#x7B97;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4ECE;&#x6839;&#x96C6;&#x5F00;&#x59CB;&#x626B;&#x63CF;&#xFF0C;&#x8BC6;&#x522B;&#x51FA;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x53EF;&#x8FBE;&#xFF0C;&#x54EA;&#x4E9B;&#x5BF9;&#x8C61;&#x4E0D;&#x53EF;&#x8FBE;&#xFF0C;&#x5E76;&#x7528;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x6807;&#x8BB0;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x6BCF;&#x4E2A;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x4F4D;&#x3002;&#x5728;&#x626B;&#x63CF;&#x8BC6;&#x522B;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x57FA;&#x4E8E;tracing&#x7B97;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E5F;&#x79F0;&#x4E3A;&#x6807;&#x8BB0;&#x548C;&#x6E05;&#x9664;(mark-and-sweep)&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;.</p>
<p>2.3. compacting&#x7B97;&#x6CD5;(Compacting Collector) </p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5806;&#x788E;&#x7247;&#x95EE;&#x9898;&#xFF0C;&#x57FA;&#x4E8E;tracing&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5438;&#x6536;&#x4E86;Compacting&#x7B97;&#x6CD5;&#x7684;&#x601D;&#x60F3;&#xFF0C;&#x5728;&#x6E05;&#x9664;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7B97;&#x6CD5;&#x5C06;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x79FB;&#x5230;&#x5806;&#x7684;&#x4E00;&#x7AEF;&#xFF0C;&#x5806;&#x7684;&#x53E6;&#x4E00;&#x7AEF;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x7A7A;&#x95F2;&#x5185;&#x5B58;&#x533A;&#xFF0C;&#x6536;&#x96C6;&#x5668;&#x4F1A;&#x5BF9;&#x5B83;&#x79FB;&#x52A8;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x7684;&#x6240;&#x6709;&#x5F15;&#x7528;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x5F15;&#x7528;&#x5728;&#x65B0;&#x7684;&#x4F4D;&#x7F6E;&#x80FD;&#x8BC6;&#x522B;&#x539F;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x57FA;&#x4E8E;Compacting&#x7B97;&#x6CD5;&#x7684;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x4E00;&#x822C;&#x589E;&#x52A0;&#x53E5;&#x67C4;&#x548C;&#x53E5;&#x67C4;&#x8868;&#x3002;</p>
<p>2.4. copying&#x7B97;&#x6CD5;(Coping Collector)</p>
<p>&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x63D0;&#x51FA;&#x662F;&#x4E3A;&#x4E86;&#x514B;&#x670D;&#x53E5;&#x67C4;&#x7684;&#x5F00;&#x9500;&#x548C;&#x89E3;&#x51B3;&#x5806;&#x788E;&#x7247;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x5B83;&#x5F00;&#x59CB;&#x65F6;&#x628A;&#x5806;&#x5206;&#x6210;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x533A;&#x548C;&#x591A;&#x4E2A;&#x7A7A;&#x95F2;&#x533A;&#xFF0C;&#x7A0B;&#x5E8F;&#x4ECE;&#x5BF9;&#x8C61;&#x533A;&#x4E3A;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x7A7A;&#x95F4;&#xFF0C;&#x5F53;&#x5BF9;&#x8C61;&#x6EE1;&#x4E86;&#xFF0C;&#x57FA;&#x4E8E;coping&#x7B97;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5C31;&#x4ECE;&#x6839;&#x96C6;&#x4E2D;&#x626B;&#x63CF;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x5C06;&#x6BCF;&#x4E2A;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x590D;&#x5236;&#x5230;&#x7A7A;&#x95F2;&#x533A;(&#x4F7F;&#x5F97;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7684;&#x5185;&#x5B58;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x7A7A;&#x95F2;&#x95F4;&#x9694;)&#xFF0C;&#x8FD9;&#x6837;&#x7A7A;&#x95F2;&#x533A;&#x53D8;&#x6210;&#x4E86;&#x5BF9;&#x8C61;&#x533A;&#xFF0C;&#x539F;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x533A;&#x53D8;&#x6210;&#x4E86;&#x7A7A;&#x95F2;&#x533A;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x5728;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x533A;&#x4E2D;&#x5206;&#x914D;&#x5185;&#x5B58;&#x3002; </p>
<p>&#x4E00;&#x79CD;&#x5178;&#x578B;&#x7684;&#x57FA;&#x4E8E;coping&#x7B97;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x662F;stop-and-copy&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x5C06;&#x5806;&#x5206;&#x6210;&#x5BF9;&#x8C61;&#x533A;&#x548C;&#x7A7A;&#x95F2;&#x533A;&#x57DF;&#x533A;&#xFF0C;&#x5728;&#x5BF9;&#x8C61;&#x533A;&#x4E0E;&#x7A7A;&#x95F2;&#x533A;&#x57DF;&#x7684;&#x5207;&#x6362;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x6682;&#x505C;&#x6267;&#x884C;&#x3002;</p>
<p>2.5. <strong>generation&#x7B97;&#x6CD5;(Generational Collector)</strong></p>
<p>stop-and-copy&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x662F;&#x6536;&#x96C6;&#x5668;&#x5FC5;&#x987B;&#x590D;&#x5236;&#x6240;&#x6709;&#x7684;&#x6D3B;&#x52A8;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x589E;&#x52A0;&#x4E86;&#x7A0B;&#x5E8F;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x662F;coping&#x7B97;&#x6CD5;&#x4F4E;&#x6548;&#x7684;&#x539F;&#x56E0;&#x3002;&#x5728;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x4E2D;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x89C4;&#x5F8B;&#xFF1A;&#x591A;&#x6570;&#x5BF9;&#x8C61;&#x5B58;&#x5728;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x77ED;&#xFF0C;&#x5C11;&#x6570;&#x7684;&#x5B58;&#x5728;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x957F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;generation&#x7B97;&#x6CD5;&#x5C06;&#x5806;&#x5206;&#x6210;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x5806;&#x4F5C;&#x4E3A;&#x5BF9;&#x8C61;&#x7684;&#x4E00;&#x4EE3; (generation)&#x3002;&#x7531;&#x4E8E;&#x591A;&#x6570;&#x5BF9;&#x8C61;&#x5B58;&#x5728;&#x7684;&#x65F6;&#x95F4;&#x6BD4;&#x8F83;&#x77ED;&#xFF0C;&#x968F;&#x7740;&#x7A0B;&#x5E8F;&#x4E22;&#x5F03;&#x4E0D;&#x4F7F;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5C06;&#x4ECE;&#x6700;&#x5E74;&#x8F7B;&#x7684;&#x5B50;&#x5806;&#x4E2D;&#x6536;&#x96C6;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x3002;&#x5728;&#x5206;&#x4EE3;&#x5F0F;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8FD0;&#x884C;&#x540E;&#xFF0C;&#x4E0A;&#x6B21;&#x8FD0;&#x884C;&#x5B58;&#x6D3B;&#x4E0B;&#x6765;&#x7684;&#x5BF9;&#x8C61;&#x79FB;&#x5230;&#x4E0B;&#x4E00;&#x6700;&#x9AD8;&#x4EE3;&#x7684;&#x5B50;&#x5806;&#x4E2D;&#xFF0C;&#x7531;&#x4E8E;&#x8001;&#x4E00;&#x4EE3;&#x7684;&#x5B50;&#x5806;&#x4E0D;&#x4F1A;&#x7ECF;&#x5E38;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x56E0;&#x800C;&#x8282;&#x7701;&#x4E86;&#x65F6;&#x95F4;&#x3002;</p>
<p>2.6. adaptive&#x7B97;&#x6CD5;(Adaptive Collector) </p>
<p>&#x5728;&#x7279;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E00;&#x4E9B;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x4F1A;&#x4F18;&#x4E8E;&#x5176;&#x5B83;&#x7B97;&#x6CD5;&#x3002;&#x57FA;&#x4E8E;Adaptive&#x7B97;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5C31;&#x662F;&#x76D1;&#x63A7;&#x5F53;&#x524D;&#x5806;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x5C06;&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7B97;&#x6CD5;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<h4 id="3-_System-gc()&#x65B9;&#x6CD5;">3. System.gc()&#x65B9;&#x6CD5;</h4><p>&#x547D;&#x4EE4;&#x884C;&#x53C2;&#x6570;&#x900F;&#x89C6;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x8FD0;&#x884C;</p>
<p>&#x4F7F;&#x7528;System.gc()&#x53EF;&#x4EE5;&#x4E0D;&#x7BA1;JVM&#x4F7F;&#x7528;&#x7684;&#x662F;&#x54EA;&#x4E00;&#x79CD;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8BF7;&#x6C42;Java&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x3002;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x53C2;&#x6570;-verbosegc&#x53EF;&#x4EE5;&#x67E5;&#x770B;Java&#x4F7F;&#x7528;&#x7684;&#x5806;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5B83;&#x7684;&#x683C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>java -verbosegc classfile</p>
<p>&#x53EF;&#x4EE5;&#x770B;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p><strong>[java]</strong> &#xA0; view plaincopy</p>
<ol>
<li>class&#xA0;TestGC&#xA0;&#xA0;</li>
<li>{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0; public&#xA0; static&#xA0; void&#xA0;main(String[]&#xA0;args)&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0; new&#xA0;TestGC();&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;System.gc();&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;System.runFinalization();&#xA0;&#xA0;</li>
<li>&#xA0;}&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
</ol>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x521B;&#x5EFA;&#xFF0C;&#x7531;&#x4E8E;&#x5B83;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x8BE5;&#x5BF9;&#x8C61;&#x8FC5;&#x901F;&#x5730;&#x53D8;&#x4E3A;&#x4E0D;&#x53EF;&#x8FBE;&#xFF0C;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x540E;&#xFF0C;&#x6267;&#x884C;&#x547D;&#x4EE4;&#xFF1A; java -verbosegc TestGC &#x540E;&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;</p>
<p>[Full GC 168K-&gt;97K(1984K)&#xFF0C; 0.0253873 secs]</p>
<p>&#x673A;&#x5668;&#x7684;&#x73AF;&#x5883;&#x4E3A;&#xFF0C;Windows 2000 + JDK1.3.1&#xFF0C;&#x7BAD;&#x5934;&#x524D;&#x540E;&#x7684;&#x6570;&#x636E;168K&#x548C;97K&#x5206;&#x522B;&#x8868;&#x793A;&#x5783;&#x573E;&#x6536;&#x96C6;GC&#x524D;&#x540E;&#x6240;&#x6709;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x5BB9;&#x91CF;&#xFF0C;&#x8BF4;&#x660E;&#x6709;168K-97K=71K&#x7684;&#x5BF9;&#x8C61;&#x5BB9;&#x91CF;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x62EC;&#x53F7;&#x5185;&#x7684;&#x6570;&#x636E;1984K&#x4E3A;&#x5806;&#x5185;&#x5B58;&#x7684;&#x603B;&#x5BB9;&#x91CF;&#xFF0C;&#x6536;&#x96C6;&#x6240;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x662F;0.0253873&#x79D2;&#xFF08;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x5728;&#x6BCF;&#x6B21;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x4F1A;&#x6709;&#x6240;&#x4E0D;&#x540C;&#xFF09;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8C03;&#x7528;System.gc()&#x4E5F;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x8BF7;&#x6C42;(&#x5EFA;&#x8BAE;)&#x3002;JVM&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x6D88;&#x606F;&#x540E;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x505A;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x800C;&#x53EA;&#x662F;&#x5BF9;&#x51E0;&#x4E2A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x505A;&#x4E86;&#x52A0;&#x6743;&#xFF0C;&#x4F7F;&#x5783;&#x573E;&#x56DE;&#x6536;&#x64CD;&#x4F5C;&#x5BB9;&#x6613;&#x53D1;&#x751F;&#xFF0C;&#x6216;&#x63D0;&#x65E9;&#x53D1;&#x751F;&#xFF0C;&#x6216;&#x56DE;&#x6536;&#x8F83;&#x591A;&#x800C;&#x5DF2;&#x3002;</p>
<h4 id="4-_finalize()&#x65B9;&#x6CD5;">4. finalize()&#x65B9;&#x6CD5;</h4><p>&#x5728;JVM&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x6536;&#x96C6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x822C;&#x8981;&#x6C42;&#x7A0B;&#x5E8F;&#x8C03;&#x7528;&#x9002;&#x5F53;&#x7684;&#x65B9;&#x6CD5;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#xFF0C;&#x4F46;&#x5728;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Java&#x63D0;&#x4F9B;&#x4E86;&#x7F3A;&#x7701;&#x673A;&#x5236;&#x6765;&#x7EC8;&#x6B62;&#x8BE5;&#x5BF9;&#x8C61;&#x5FC3;&#x91CA;&#x653E;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x5C31;&#x662F;finalize&#xFF08;&#xFF09;&#x3002;&#x5B83;&#x7684;&#x539F;&#x578B;&#x4E3A;&#xFF1A;</p>
<p>protected void finalize() throws Throwable</p>
<p>&#x5728;finalize()&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x4E4B;&#x540E;&#xFF0C;&#x5BF9;&#x8C61;&#x6D88;&#x5931;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F00;&#x59CB;&#x6267;&#x884C;&#x3002;&#x539F;&#x578B;&#x4E2D;&#x7684;throws Throwable&#x8868;&#x793A;&#x5B83;&#x53EF;&#x4EE5;&#x629B;&#x51FA;&#x4EFB;&#x4F55;&#x7C7B;&#x578B;&#x7684;&#x5F02;&#x5E38;&#x3002;</p>
<p>&#x4E4B;&#x6240;&#x4EE5;&#x8981;&#x4F7F;&#x7528;finalize()&#xFF0C;&#x662F;&#x5B58;&#x5728;&#x7740;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002;&#x5047;&#x5B9A;&#x4F60;&#x7684;&#x5BF9;&#x8C61;&#xFF08;&#x5E76;&#x975E;&#x4F7F;&#x7528;new&#x65B9;&#x6CD5;&#xFF09;&#x83B7;&#x5F97;&#x4E86;&#x4E00;&#x5757;&#x201C;&#x7279;&#x6B8A;&#x201D;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x7531;&#x4E8E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x53EA;&#x77E5;&#x9053;&#x90A3;&#x4E9B;&#x663E;&#x793A;&#x5730;&#x7ECF;&#x7531;new&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4E0D;&#x77E5;&#x9053;&#x8BE5;&#x5982;&#x4F55;&#x91CA;&#x653E;&#x8FD9;&#x5757;&#x201C;&#x7279;&#x6B8A;&#x201D;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;java&#x5141;&#x8BB8;&#x5728;&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7531;finalize()&#x65B9;&#x6CD5;&#x3002;</p>
<p>&#x7279;&#x6B8A;&#x7684;&#x533A;&#x57DF;&#x4F8B;&#x5982;&#xFF1A;1&#xFF09;&#x7531;&#x4E8E;&#x5728;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x80FD;&#x91C7;&#x7528;&#x4E86;&#x7C7B;&#x4F3C; C&#x8BED;&#x8A00;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x800C;&#x975E;JAVA&#x7684;&#x901A;&#x5E38;new&#x505A;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E3B;&#x8981;&#x53D1;&#x751F;&#x5728;native method&#x4E2D;&#xFF0C;&#x6BD4;&#x5982;native method&#x8C03;&#x7528;&#x4E86;C/C++&#x65B9;&#x6CD5;malloc()&#x51FD;&#x6570;&#x7CFB;&#x5217;&#x6765;&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x4F46;&#x662F;&#x9664;&#x975E;&#x8C03;&#x7528;free()&#x51FD;&#x6570;&#xFF0C;&#x5426;&#x5219;&#x8FD9;&#x4E9B;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x5C06;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x91CA;&#x653E;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;free()&#x65B9;&#x6CD5;&#x662F;&#x5728;C/C++&#x4E2D;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x6240;&#x4EE5;finalize()&#x4E2D;&#x53EF;&#x4EE5;&#x7528;&#x672C;&#x5730;&#x65B9;&#x6CD5;&#x6765;&#x8C03;&#x7528;&#x5B83;&#x3002;&#x4EE5;&#x91CA;&#x653E;&#x8FD9;&#x4E9B;&#x201C;&#x7279;&#x6B8A;&#x201D;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;2&#xFF09;&#x53C8;&#x6216;&#x8005;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x8D44;&#x6E90;&#xFF0C;&#x8FD9;&#x4E9B;&#x8D44;&#x6E90;&#x4E0D;&#x5C5E;&#x4E8E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x7684;&#x56DE;&#x6536;&#x8303;&#x56F4;&#x3002;&#x6362;&#x8A00;&#x4E4B;&#xFF0C;finalize()&#x7684;&#x4E3B;&#x8981;&#x7528;&#x9014;&#x662F;&#x91CA;&#x653E;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x505A;&#x6CD5;&#x5F00;&#x8F9F;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#xFF0C;&#x4EE5;&#x53CA;&#x505A;&#x4E00;&#x4E9B;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x3002;&#x56E0;&#x4E3A;&#x5728;JAVA&#x4E2D;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x591F;&#x50CF;&#x201C;&#x6790;&#x6784;&#x201D;&#x51FD;&#x6570;&#x6216;&#x8005;&#x7C7B;&#x4F3C;&#x6982;&#x5FF5;&#x7684;&#x51FD;&#x6570;&#xFF0C;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x7C7B;&#x4F3C;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6267;&#x884C;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x7684;&#x666E;&#x901A;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;override Object&#x8FD9;&#x4E2A;&#x7C7B;&#x4E2D;&#x7684;finalize()&#x65B9;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x67D0;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5728;&#x521B;&#x5EFA;&#x8FC7;&#xFFFD;&#xFFFD;&#xFFFD;&#x4E2D;&#x4F1A;&#x5C06;&#x81EA;&#x5DF1;&#x7ED8;&#x5236;&#x5230;&#x5C4F;&#x5E55;&#x4E0A;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x660E;&#x786E;&#x5730;&#x4ECE;&#x5C4F;&#x5E55;&#x4E0A;&#x5C06;&#x5176;&#x64E6;&#x51FA;&#xFF0C;&#x5B83;&#x53EF;&#x80FD;&#x6C38;&#x8FDC;&#x90FD;&#x4E0D;&#x4F1A;&#x88AB;&#x6E05;&#x7406;&#x3002;&#x5982;&#x679C;&#x5728;finalize()&#x52A0;&#x5165;&#x67D0;&#x4E00;&#x79CD;&#x64E6;&#x9664;&#x529F;&#x80FD;&#xFF0C;&#x5F53;GC&#x5DE5;&#x4F5C;&#x65F6;&#xFF0C;finalize()&#x5F97;&#x5230;&#x4E86;&#x8C03;&#x7528;&#xFF0C;&#x56FE;&#x50CF;&#x5C31;&#x4F1A;&#x88AB;&#x64E6;&#x9664;&#x3002;&#x8981;&#x662F;GC&#x6CA1;&#x6709;&#x53D1;&#x751F;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x56FE;&#x50CF;&#x5C31;&#x4F1A; </p>
<p>&#x88AB;&#x4E00;&#x76F4;&#x4FDD;&#x5B58;&#x4E0B;&#x6765;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x51C6;&#x5907;&#x597D;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x9996;&#x5148;&#x4F1A;&#x53BB;&#x8C03;&#x7528;finalize()&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x5FC5;&#x8981;&#x7684;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x3002;&#x53EA;&#x6709;&#x5230;&#x4E0B;&#x4E00;&#x6B21;&#x518D;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x52A8;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x624D;&#x4F1A;&#x771F;&#x6B63;&#x91CA;&#x653E;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x5728;&#x666E;&#x901A;&#x7684;&#x6E05;&#x9664;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x4E3A;&#x6E05;&#x9664;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x5728;&#x5E0C;&#x671B;&#x8FDB;&#x884C;&#x6E05;&#x9664;&#x7684;&#x5730;&#x70B9;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x6E05;&#x9664;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E0E;C++&quot;&#x6790;&#x6784;&#x51FD;&#x6570;&quot;&#x7684;&#x6982;&#x5FF5;&#x7A0D;&#x6709;&#x62B5;&#x89E6;&#x3002;&#x5728;C++&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x4F1A;&#x7834;&#x574F;&#xFF08;&#x6E05;&#x9664;&#xFF09;&#x3002;&#x6216;&#x8005;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&quot;&#x5E94;&#x8BE5;&quot;&#x7834;&#x574F;&#x3002;&#x82E5;&#x5C06;C++&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x6210;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x5BF9;&#x8C61;&#xFF0C;&#x6BD4;&#x5982;&#x5728;&#x5806;&#x6808;&#x4E2D;&#x521B;&#x5EFA;&#xFF08;&#x5728;Java&#x4E2D;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;Java&#x90FD;&#x5728;&#x5806;&#x4E2D;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x6E05;&#x9664;&#x6216;&#x7834;&#x574F;&#x5DE5;&#x4F5C;&#x5C31;&#x4F1A;&#x5728;&quot;&#x7ED3;&#x675F;&#x82B1;&#x62EC;&#x53F7;&quot;&#x6240;&#x4EE3;&#x8868;&#x7684;&#x3001;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x4F5C;&#x7528;&#x57DF;&#x7684;&#x672B;&#x5C3E;&#x8FDB;&#x884C;&#x3002;&#x82E5;&#x5BF9;&#x8C61;&#x662F;&#x7528;new&#x521B;&#x5EFA;&#x7684;&#xFF08;&#x7C7B;&#x4F3C;&#x4E8E;Java&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x7A0B;&#x5E8F;&#x5458;&#x8C03;&#x7528;C++&#x7684; delete&#x547D;&#x4EE4;&#x65F6;&#xFF08;Java&#x6CA1;&#x6709;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#xFF09;&#xFF0C;&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x76F8;&#x5E94;&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x82E5;&#x7A0B;&#x5E8F;&#x5458;&#x5FD8;&#x8BB0;&#x4E86;&#xFF0C;&#x90A3;&#x4E48;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8C03;&#x7528;&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF0C;&#x6211;&#x4EEC;&#x6700;&#x7EC8;&#x5F97;&#x5230;&#x7684;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x5185;&#x5B58;&quot;&#x6F0F;&#x6D1E;&quot;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x5305;&#x62EC;&#x5BF9;&#x8C61;&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5F97;&#x5230;&#x6E05;&#x9664;&#x3002;</p>
<p>&#x76F8;&#x53CD;&#xFF0C;Java&#x4E0D;&#x5141;&#x8BB8;&#x6211;&#x4EEC;&#x521B;&#x5EFA;&#x672C;&#x5730;&#xFF08;&#x5C40;&#x90E8;&#xFF09;&#x5BF9;&#x8C61;—&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x90FD;&#x8981;&#x4F7F;&#x7528;new&#x3002;&#x4F46;&#x5728;Java&#x4E2D;&#xFF0C;&#x6CA1;&#x6709;&quot;delete&quot;&#x547D;&#x4EE4;&#x6765;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x4E3A;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x4F1A;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x6240;&#x4EE5;&#x5982;&#x679C;&#x7AD9;&#x5728;&#x6BD4;&#x8F83;&#x7B80;&#x5316;&#x7684;&#x7ACB;&#x573A;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x6B63;&#x662F;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x673A;&#x5236;&#xFF0C;&#x6240;&#x4EE5;Java&#x6CA1;&#x6709;&#x6790;&#x6784;&#x51FD;&#x6570;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x968F;&#x7740;&#x4EE5;&#x540E;&#x5B66;&#x4E60;&#x7684;&#x6DF1;&#x5165;&#xFF0C;&#x5C31;&#x4F1A;&#x77E5;&#x9053;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5B58;&#x5728;&#x5E76;&#x4E0D;&#x80FD;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x5BF9;&#x6790;&#x6784;&#x51FD;&#x6570;&#x7684;&#x9700;&#x8981;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x4E0D;&#x80FD;&#x6D88;&#x9664;&#x5BF9;&#x6790;&#x6784;&#x51FD;&#x6570;&#x4EE3;&#x8868;&#x7684;&#x90A3;&#x79CD;&#x673A;&#x5236;&#x7684;&#x9700;&#x8981;&#xFF08;&#x539F;&#x56E0;&#x89C1;&#x4E0B;&#x4E00;&#x6BB5;&#x3002;&#x53E6;&#x5916;finalize()&#x51FD;&#x6570;&#x662F;&#x5728;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x51C6;&#x5907;&#x91CA;&#x653E;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x8C03;&#x7528;&#x7684;&#xFF0C;&#x7EDD;&#x5BF9;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x8C03;&#x7528;finalize()&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x7528;&#x5B83;&#xFF09;&#x3002;&#x82E5;&#x5E0C;&#x671B;&#x6267;&#x884C;&#x9664;&#x91CA;&#x653E;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4E4B;&#x5916;&#x7684;&#x5176;&#x4ED6;&#x67D0;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6E05;&#x9664;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECD;&#x7136;&#x5FC5;&#x987B;&#x8C03;&#x7528;Java&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x5B83;&#x7B49;&#x4EF7;&#x4E8E;C++&#x7684;&#x6790;&#x6784;&#x51FD;&#x6570;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x540E;&#x8005;&#x65B9;&#x4FBF;&#x3002;</p>
<p>&#x5728;C++&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x8C61;&#x8FD0;&#x7528;delete()&#x4E00;&#x5B9A;&#x4F1A;&#x88AB;&#x9500;&#x6BC1;&#xFF0C;&#x800C;JAVA&#x91CC;&#x7684;&#x5BF9;&#x8C61;&#x5E76;&#x975E;&#x603B;&#x4F1A;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x56DE;&#x6536;&#x3002;In another word, 1 &#x5BF9;&#x8C61;&#x53EF;&#x80FD;&#x4E0D;&#x88AB;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;2 &#x5783;&#x573E;&#x56DE;&#x6536;&#x5E76;&#x4E0D;&#x7B49;&#x4E8E;&#x201C;&#x6790;&#x6784;&#x201D;&#xFF0C;3 &#x5783;&#x573E;&#x56DE;&#x6536;&#x53EA;&#x4E0E;&#x5185;&#x5B58;&#x6709;&#x5173;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0D;&#x518D;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x662F;&#x4E0D;&#x662F;&#x8981;&#x5728;finalize()&#x4E2D;&#x91CA;&#x653E;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x4E2D;&#x542B;&#x6709;&#x7684;&#x5176;&#x5B83;&#x5BF9;&#x8C61;&#x5462;&#xFF1F;&#x4E0D;&#x662F;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x65E0;&#x8BBA;&#x5BF9;&#x8C61;&#x662F;&#x5982;&#x4F55;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;&#x90FD;&#x4F1A;&#x8D1F;&#x8D23;&#x91CA;&#x653E;&#x90A3;&#x4E9B;&#x5BF9;&#x8C61;&#x5360;&#x6709;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<h4 id="5-_&#x89E6;&#x53D1;&#x4E3B;GC&#xFF08;Garbage_Collector&#xFF09;&#x7684;&#x6761;&#x4EF6;">5. &#x89E6;&#x53D1;&#x4E3B;GC&#xFF08;Garbage Collector&#xFF09;&#x7684;&#x6761;&#x4EF6;</h4><p>JVM&#x8FDB;&#x884C;&#x6B21;GC&#x7684;&#x9891;&#x7387;&#x5F88;&#x9AD8;,&#x4F46;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;GC&#x5360;&#x7528;&#x65F6;&#x95F4;&#x6781;&#x77ED;,&#x6240;&#x4EE5;&#x5BF9;&#x7CFB;&#x7EDF;&#x4EA7;&#x751F;&#x7684;&#x5F71;&#x54CD;&#x4E0D;&#x5927;&#x3002;&#x66F4;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x4E3B;GC&#x7684;&#x89E6;&#x53D1;&#x6761;&#x4EF6;,&#x56E0;&#x4E3A;&#x5B83;&#x5BF9;&#x7CFB;&#x7EDF;&#x5F71;&#x54CD;&#x5F88;&#x660E;&#x663E;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;,&#x6709;&#x4E24;&#x4E2A;&#x6761;&#x4EF6;&#x4F1A;&#x89E6;&#x53D1;&#x4E3B;GC:</p>
<p>1)&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7A7A;&#x95F2;&#x65F6;,&#x5373;&#x6CA1;&#x6709;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x65F6;,GC&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x56E0;&#x4E3A;GC&#x5728;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x4F4E;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#x8FDB;&#x884C;,&#x6240;&#x4EE5;&#x5F53;&#x5E94;&#x7528;&#x5FD9;&#x65F6;,GC&#x7EBF;&#x7A0B;&#x5C31;&#x4E0D;&#x4F1A;&#x88AB;&#x8C03;&#x7528;,&#x4F46;&#x4EE5;&#x4E0B;&#x6761;&#x4EF6;&#x9664;&#x5916;&#x3002;</p>
<p>2)Java&#x5806;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x65F6;,GC&#x4F1A;&#x88AB;&#x8C03;&#x7528;&#x3002;&#x5F53;&#x5E94;&#x7528;&#x7EBF;&#x7A0B;&#x5728;&#x8FD0;&#x884C;,&#x5E76;&#x5728;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;,&#x82E5;&#x8FD9;&#x65F6;&#x5185;&#x5B58;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;,JVM&#x5C31;&#x4F1A;&#x5F3A;&#x5236;&#x5730;&#x8C03;&#x7528;GC&#x7EBF;&#x7A0B;,&#x4EE5;&#x4FBF;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x7528;&#x4E8E;&#x65B0;&#x7684;&#x5206;&#x914D;&#x3002;&#x82E5;GC&#x4E00;&#x6B21;&#x4E4B;&#x540E;&#x4ECD;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x8981;&#x6C42;,JVM&#x4F1A;&#x518D;&#x8FDB;&#x884C;&#x4E24;&#x6B21;GC&#x4F5C;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x5C1D;&#x8BD5;,&#x82E5;&#x4ECD;&#x65E0;&#x6CD5;&#x6EE1;&#x8DB3;&#x8981;&#x6C42;,&#x5219; JVM&#x5C06;&#x62A5;&#x201C;out of memory&#x201D;&#x7684;&#x9519;&#x8BEF;,Java&#x5E94;&#x7528;&#x5C06;&#x505C;&#x6B62;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x662F;&#x5426;&#x8FDB;&#x884C;&#x4E3B;GC&#x7531;JVM&#x6839;&#x636E;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x51B3;&#x5B9A;,&#x800C;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x5728;&#x4E0D;&#x65AD;&#x7684;&#x53D8;&#x5316;&#x5F53;&#x4E2D;,&#x6240;&#x4EE5;&#x4E3B;GC&#x7684;&#x8FD0;&#x884C;&#x5177;&#x6709;&#x4E0D;&#x786E;&#x5B9A;&#x6027;,&#x65E0;&#x6CD5;&#x9884;&#x8BA1;&#x5B83;&#x4F55;&#x65F6;&#x5FC5;&#x7136;&#x51FA;&#x73B0;,&#x4F46;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x7684;&#x662F;&#x5BF9;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x6765;&#x8BF4;,&#x5176;&#x4E3B;GC&#x662F;&#x53CD;&#x590D;&#x8FDB;&#x884C;&#x7684;&#x3002;</p>
<h4 id="6-_&#x51CF;&#x5C11;GC&#x5F00;&#x9500;&#x7684;&#x63AA;&#x65BD;">6. &#x51CF;&#x5C11;GC&#x5F00;&#x9500;&#x7684;&#x63AA;&#x65BD;</h4><p>&#x6839;&#x636E;&#x4E0A;&#x8FF0;GC&#x7684;&#x673A;&#x5236;,&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#x4F1A;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#x7684;&#x53D8;&#x5316;,&#x4ECE;&#x800C;&#x5F71;&#x54CD;GC&#x7684;&#x89E6;&#x53D1;&#x3002;&#x82E5;&#x4E0D;&#x9488;&#x5BF9;GC&#x7684;&#x7279;&#x70B9;&#x8FDB;&#x884C;&#x8BBE;&#x8BA1;&#x548C;&#x7F16;&#x7801;,&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x9A7B;&#x7559;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x4E9B;&#x5F71;&#x54CD;,&#x57FA;&#x672C;&#x7684;&#x539F;&#x5219;&#x5C31;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x51CF;&#x5C11;&#x5783;&#x573E;&#x548C;&#x51CF;&#x5C11;GC&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x5F00;&#x9500;&#x3002;&#x5177;&#x4F53;&#x63AA;&#x65BD;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x65B9;&#x9762;:</p>
<h4 id="(1)&#x4E0D;&#x8981;&#x663E;&#x5F0F;&#x8C03;&#x7528;System-gc()">(1)&#x4E0D;&#x8981;&#x663E;&#x5F0F;&#x8C03;&#x7528;System.gc()</h4><p>&#x6B64;&#x51FD;&#x6570;&#x5EFA;&#x8BAE;JVM&#x8FDB;&#x884C;&#x4E3B;GC,&#x867D;&#x7136;&#x53EA;&#x662F;&#x5EFA;&#x8BAE;&#x800C;&#x975E;&#x4E00;&#x5B9A;,&#x4F46;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x5B83;&#x4F1A;&#x89E6;&#x53D1;&#x4E3B;GC,&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E3B;GC&#x7684;&#x9891;&#x7387;,&#x4E5F;&#x5373;&#x589E;&#x52A0;&#x4E86;&#x95F4;&#x6B47;&#x6027;&#x505C;&#x987F;&#x7684;&#x6B21;&#x6570;&#x3002;</p>
<h4 id="(2)&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x4E34;&#x65F6;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;">(2)&#x5C3D;&#x91CF;&#x51CF;&#x5C11;&#x4E34;&#x65F6;&#x5BF9;&#x8C61;&#x7684;&#x4F7F;&#x7528;</h4><p>&#x4E34;&#x65F6;&#x5BF9;&#x8C61;&#x5728;&#x8DF3;&#x51FA;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x540E;,&#x4F1A;&#x6210;&#x4E3A;&#x5783;&#x573E;,&#x5C11;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x51CF;&#x5C11;&#x4E86;&#x5783;&#x573E;&#x7684;&#x4EA7;&#x751F;,&#x4ECE;&#x800C;&#x5EF6;&#x957F;&#x4E86;&#x51FA;&#x73B0;&#x4E0A;&#x8FF0;&#x7B2C;&#x4E8C;&#x4E2A;&#x89E6;&#x53D1;&#x6761;&#x4EF6;&#x51FA;&#x73B0;&#x7684;&#x65F6;&#x95F4;,&#x51CF;&#x5C11;&#x4E86;&#x4E3B;GC&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<h4 id="(3)&#x5BF9;&#x8C61;&#x4E0D;&#x7528;&#x65F6;&#x6700;&#x597D;&#x663E;&#x5F0F;&#x7F6E;&#x4E3A;Null">(3)&#x5BF9;&#x8C61;&#x4E0D;&#x7528;&#x65F6;&#x6700;&#x597D;&#x663E;&#x5F0F;&#x7F6E;&#x4E3A;Null</h4><p>&#x4E00;&#x822C;&#x800C;&#x8A00;,&#x4E3A;Null&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4F1A;&#x88AB;&#x4F5C;&#x4E3A;&#x5783;&#x573E;&#x5904;&#x7406;,&#x6240;&#x4EE5;&#x5C06;&#x4E0D;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x663E;&#x5F0F;&#x5730;&#x8BBE;&#x4E3A;Null,&#x6709;&#x5229;&#x4E8E;GC&#x6536;&#x96C6;&#x5668;&#x5224;&#x5B9A;&#x5783;&#x573E;,&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x4E86;GC&#x7684;&#x6548;&#x7387;&#x3002;</p>
<h4 id="(4)&#x5C3D;&#x91CF;&#x4F7F;&#x7528;StringBuffer,&#x800C;&#x4E0D;&#x7528;String&#x6765;&#x7D2F;&#x52A0;&#x5B57;&#x7B26;&#x4E32;">(4)&#x5C3D;&#x91CF;&#x4F7F;&#x7528;StringBuffer,&#x800C;&#x4E0D;&#x7528;String&#x6765;&#x7D2F;&#x52A0;&#x5B57;&#x7B26;&#x4E32;</h4><p>&#x7531;&#x4E8E;String&#x662F;&#x56FA;&#x5B9A;&#x957F;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x5BF9;&#x8C61;,&#x7D2F;&#x52A0;String&#x5BF9;&#x8C61;&#x65F6;,&#x5E76;&#x975E;&#x5728;&#x4E00;&#x4E2A;String&#x5BF9;&#x8C61;&#x4E2D;&#x6269;&#x589E;,&#x800C;&#x662F;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x65B0;&#x7684;String&#x5BF9;&#x8C61;,&#x5982;Str5=Str1+Str2+Str3+Str4,&#x8FD9;&#x6761;&#x8BED;&#x53E5;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x4EA7;&#x751F;&#x591A;&#x4E2A;&#x5783;&#x573E;&#x5BF9;&#x8C61;,&#x56E0;&#x4E3A;&#x5BF9;&#x6B21;&#x4F5C;&#x201C;+&#x201D;&#x64CD;&#x4F5C;&#x65F6;&#x90FD;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x65B0;&#x7684;String&#x5BF9;&#x8C61;,&#x4F46;&#x8FD9;&#x4E9B;&#x8FC7;&#x6E21;&#x5BF9;&#x8C61;&#x5BF9;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x662F;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x610F;&#x4E49;&#x7684;,&#x53EA;&#x4F1A;&#x589E;&#x52A0;&#x66F4;&#x591A;&#x7684;&#x5783;&#x573E;&#x3002;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x6539;&#x7528;StringBuffer&#x6765;&#x7D2F;&#x52A0;&#x5B57;&#x7B26;&#x4E32;,&#x56E0;StringBuffer&#x662F;&#x53EF;&#x53D8;&#x957F;&#x7684;,&#x5B83;&#x5728;&#x539F;&#x6709;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x6269;&#x589E;,&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x4E2D;&#x95F4;&#x5BF9;&#x8C61;&#x3002;</p>
<h4 id="(5)&#x80FD;&#x7528;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x5982;Int,Long,&#x5C31;&#x4E0D;&#x7528;Integer,Long&#x5BF9;&#x8C61;">(5)&#x80FD;&#x7528;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x5982;Int,Long,&#x5C31;&#x4E0D;&#x7528;Integer,Long&#x5BF9;&#x8C61;</h4><p>&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#x6BD4;&#x76F8;&#x5E94;&#x5BF9;&#x8C61;&#x5360;&#x7528;&#x7684;&#x5C11;&#x5F97;&#x591A;,&#x5982;&#x679C;&#x6CA1;&#x6709;&#x5FC5;&#x8981;,&#x6700;&#x597D;&#x4F7F;&#x7528;&#x57FA;&#x672C;&#x53D8;&#x91CF;&#x3002;</p>
<h4 id="(6)&#x5C3D;&#x91CF;&#x5C11;&#x7528;&#x9759;&#x6001;&#x5BF9;&#x8C61;&#x53D8;&#x91CF;">(6)&#x5C3D;&#x91CF;&#x5C11;&#x7528;&#x9759;&#x6001;&#x5BF9;&#x8C61;&#x53D8;&#x91CF;</h4><p>&#x9759;&#x6001;&#x53D8;&#x91CF;&#x5C5E;&#x4E8E;&#x5168;&#x5C40;&#x53D8;&#x91CF;,&#x4E0D;&#x4F1A;&#x88AB;GC&#x56DE;&#x6536;,&#x5B83;&#x4EEC;&#x4F1A;&#x4E00;&#x76F4;&#x5360;&#x7528;&#x5185;&#x5B58;&#x3002;</p>
<h4 id="(7)&#x5206;&#x6563;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x6216;&#x5220;&#x9664;&#x7684;&#x65F6;&#x95F4;">(7)&#x5206;&#x6563;&#x5BF9;&#x8C61;&#x521B;&#x5EFA;&#x6216;&#x5220;&#x9664;&#x7684;&#x65F6;&#x95F4;</h4><p>&#x96C6;&#x4E2D;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x5927;&#x91CF;&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;,&#x7279;&#x522B;&#x662F;&#x5927;&#x5BF9;&#x8C61;,&#x4F1A;&#x5BFC;&#x81F4;&#x7A81;&#x7136;&#x9700;&#x8981;&#x5927;&#x91CF;&#x5185;&#x5B58;,JVM&#x5728;&#x9762;&#x4E34;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x65F6;,&#x53EA;&#x80FD;&#x8FDB;&#x884C;&#x4E3B;GC,&#x4EE5;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x6216;&#x6574;&#x5408;&#x5185;&#x5B58;&#x788E;&#x7247;,&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E3B;GC&#x7684;&#x9891;&#x7387;&#x3002;&#x96C6;&#x4E2D;&#x5220;&#x9664;&#x5BF9;&#x8C61;,&#x9053;&#x7406;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;&#x5B83;&#x4F7F;&#x5F97;&#x7A81;&#x7136;&#x51FA;&#x73B0;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x5783;&#x573E;&#x5BF9;&#x8C61;,&#x7A7A;&#x95F2;&#x7A7A;&#x95F4;&#x5FC5;&#x7136;&#x51CF;&#x5C11;,&#x4ECE;&#x800C;&#x5927;&#x5927;&#x589E;&#x52A0;&#x4E86;&#x4E0B;&#x4E00;&#x6B21;&#x521B;&#x5EFA;&#x65B0;&#x5BF9;&#x8C61;&#x65F6;&#x5F3A;&#x5236;&#x4E3B;GC&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x5411;&#x5927;&#x5BB6;&#x5C55;&#x793A;&#x4E86;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6240;&#x7ECF;&#x5386;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x5BF9;&#x524D;&#x9762;&#x7684;&#x9648;&#x8FF0;&#x8FDB;&#x884C;&#x4E86;&#x603B;&#x7ED3;&#x3002;</p>
<p><strong>[java]</strong> &#xA0; view plaincopy</p>
<ol>
<li>class&#xA0;Chair&#xA0;{&#xA0;&#xA0;</li>
<li>static&#xA0; boolean&#xA0;gcrun&#xA0;=&#xA0; false;&#xA0;&#xA0;</li>
<li>static&#xA0; boolean&#xA0;f&#xA0;=&#xA0; false;&#xA0;&#xA0;</li>
<li>static&#xA0; int&#xA0;created&#xA0;=&#xA0; 0;&#xA0;&#xA0;</li>
<li>static&#xA0; int&#xA0;finalized&#xA0;=&#xA0; 0;&#xA0;&#xA0;</li>
<li>int&#xA0;i;&#xA0;&#xA0;</li>
<li>Chair()&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;i&#xA0;=&#xA0;++created;&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0; if(created&#xA0;==&#xA0; 47)&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;System.out.println( &quot;Created&#xA0;47&quot;);&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>protected&#xA0; void&#xA0;finalize()&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0; if(!gcrun)&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;gcrun&#xA0;=&#xA0; true;&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;System.out.println( &quot;Beginning&#xA0;to&#xA0;finalize&#xA0;after&#xA0;&quot;&#xA0;+&#xA0;created&#xA0;+&#xA0; &quot;&#xA0;Chairs&#xA0;have&#xA0;been&#xA0;created&quot;);&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;}&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0; if(i&#xA0;==&#xA0; 47)&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;System.out.println( &quot;Finalizing&#xA0;Chair&#xA0;#47&#xFF0C;&#xA0;&quot;&#xA0;+ &quot;Setting&#xA0;flag&#xA0;to&#xA0;stop&#xA0;Chair&#xA0;creation&quot;);&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;f&#xA0;=&#xA0; true;&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;}&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;finalized++;&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0; if(finalized&#xA0;&gt;=&#xA0;created)&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;System.out.println( &quot;All&#xA0;&quot;&#xA0;+&#xA0;finalized&#xA0;+&#xA0; &quot;&#xA0;finalized&quot;);&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;</li>
<li>public&#xA0; class&#xA0;Garbage&#xA0;{&#xA0;&#xA0;</li>
<li>public&#xA0; static&#xA0; void&#xA0;main(String[]&#xA0;args)&#xA0;{&#xA0;&#xA0;</li>
<li>if(args.length&#xA0;==&#xA0; 0)&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;System.err.println( &quot;Usage:&#xA0;/n&quot;&#xA0;+&#xA0; &quot;java&#xA0;Garbage&#xA0;before/n&#xA0;or:/n&quot;&#xA0;+&#xA0; &quot;java&#xA0;Garbage&#xA0;after&quot;);&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0; return;&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>while(!Chair.f)&#xA0;{&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0; new&#xA0;Chair();&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0; new&#xA0;String( &quot;To&#xA0;take&#xA0;up&#xA0;space&quot;);&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>System.out.println( &quot;After&#xA0;all&#xA0;Chairs&#xA0;have&#xA0;been&#xA0;created:/n&quot;&#xA0;+&#xA0; &quot;total&#xA0;created&#xA0;=&#xA0;&quot;&#xA0;+&#xA0;Chair.created&#xA0;+&#xA0;&#xA0;</li>
<li>&quot;&#xFF0C;&#xA0;total&#xA0;finalized&#xA0;=&#xA0;&quot;&#xA0;+&#xA0;Chair.finalized);&#xA0;&#xA0;</li>
<li>if(args[ 0].equals( &quot;before&quot;))&#xA0;{&#xA0;&#xA0;</li>
<li>System.out.println( &quot;gc():&quot;);&#xA0;&#xA0;</li>
<li>System.gc();&#xA0;&#xA0;</li>
<li>System.out.println( &quot;runFinalization():&quot;);&#xA0;&#xA0;</li>
<li>System.runFinalization();&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>System.out.println( &quot;bye!&quot;);&#xA0;&#xA0;</li>
<li>if(args[ 0].equals( &quot;after&quot;))&#xA0;&#xA0;</li>
<li>&#xA0;&#xA0;System.runFinalizersOnExit( true);&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
<li>}&#xA0;&#xA0;</li>
</ol>
<p>&#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x521B;&#x5EFA;&#x4E86;&#x8BB8;&#x591A;Chair&#x5BF9;&#x8C61;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x540E;&#x7684;&#x67D0;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x7A0B;&#x5E8F;&#x4F1A;&#x505C;&#x6B62;&#x521B;&#x5EFA;Chair&#x3002;&#x7531;&#x4E8E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x53EF;&#x80FD;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x51C6;&#x786E;&#x77E5;&#x9053;&#x5B83;&#x5728;&#x4F55;&#x65F6;&#x542F;&#x52A8;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7A0B;&#x5E8F;&#x7528;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;gcrun&#x7684;&#x6807;&#x8BB0;&#x6765;&#x6307;&#x51FA;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x3002;&#x5229;&#x7528;&#x7B2C;&#x4E8C;&#x4E2A;&#x6807;&#x8BB0;f&#xFF0C;Chair&#x53EF;&#x544A;&#x8BC9;main()&#x5B83;&#x5E94;&#x505C;&#x6B62;&#x5BF9;&#x8C61;&#x7684;&#x751F;&#x6210;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x6807;&#x8BB0;&#x90FD;&#x662F;&#x5728;finalize()&#x5185;&#x90E8;&#x8BBE;&#x7F6E;&#x7684;&#xFF0C;&#x5B83;&#x8C03;&#x7528;&#x4E8E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x671F;&#x95F4;&#x3002;&#x53E6;&#x4E24;&#x4E2A;static&#x53D8;&#x91CF;—created&#x4EE5;&#x53CA; finalized—&#x5206;&#x522B;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x5DF2;&#x521B;&#x5EFA;&#x7684;&#x5BF9;&#x8C61;&#x6570;&#x91CF;&#x4EE5;&#x53CA;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5DF2;&#x8FDB;&#x884C;&#x5B8C;&#x6536;&#x5C3E;&#x5DE5;&#x4F5C;&#x7684;&#x5BF9;&#x8C61;&#x6570;&#x91CF;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6BCF;&#x4E2A;Chair&#x90FD;&#x6709;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#xFF08;&#x975E; static&#xFF09;int i&#xFF0C;&#x6240;&#x4EE5;&#x80FD;&#x8DDF;&#x8E2A;&#x4E86;&#x89E3;&#x5B83;&#x5177;&#x4F53;&#x7684;&#x7F16;&#x53F7;&#x662F;&#x591A;&#x5C11;&#x3002;&#x7F16;&#x53F7;&#x4E3A;47&#x7684;Chair&#x8FDB;&#x884C;&#x5B8C;&#x6536;&#x5C3E;&#x5DE5;&#x4F5C;&#x540E;&#xFF0C;&#x6807;&#x8BB0;&#x4F1A;&#x8BBE;&#x4E3A;true&#xFF0C;&#x6700;&#x7EC8;&#x7ED3;&#x675F;Chair&#x5BF9;&#x8C61;&#x7684;&#x521B;&#x5EFA;&#x8FC7;&#x7A0B;&#x3002;</p>
<ol>
<li>&#x5173;&#x4E8E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7684;&#x51E0;&#x70B9;&#x8865;&#x5145; </li>
</ol>
<p>&#x7ECF;&#x8FC7;&#x4E0A;&#x8FF0;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x5783;&#x573E;&#x56DE;&#x6536;&#x6709;&#x4EE5;&#x4E0B;&#x7684;&#x51E0;&#x4E2A;&#x7279;&#x70B9;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x5783;&#x573E;&#x6536;&#x96C6;&#x53D1;&#x751F;&#x7684;&#x4E0D;&#x53EF;&#x9884;&#x77E5;&#x6027;&#xFF1A;&#x7531;&#x4E8E;&#x5B9E;&#x73B0;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B97;&#x6CD5;&#x548C;&#x91C7;&#x7528;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x6536;&#x96C6;&#x673A;&#x5236;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5B9A;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x5F53;&#x51FA;&#x73B0;&#x7CFB;&#x7EDF;&#x7A7A;&#x95F2;CPU&#x8D44;&#x6E90;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x548C;&#x539F;&#x59CB;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E00;&#x6837;&#xFF0C;&#x7B49;&#x5230;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x51FA;&#x73B0;&#x6781;&#x9650;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x8FD9;&#x4E0E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x9009;&#x62E9;&#x548C;&#x5177;&#x4F53;&#x7684;&#x8BBE;&#x7F6E;&#x90FD;&#x6709;&#x5173;&#x7CFB;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x7CBE;&#x786E;&#x6027;&#xFF1A;&#x4E3B;&#x8981;&#x5305;&#x62EC;2 &#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#xFF08;a&#xFF09;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x80FD;&#x591F;&#x7CBE;&#x786E;&#x6807;&#x8BB0;&#x6D3B;&#x7740;&#x7684;&#x5BF9;&#x8C61;&#xFF1B;&#xFF08;b&#xFF09;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x80FD;&#x591F;&#x7CBE;&#x786E;&#x5730;&#x5B9A;&#x4F4D;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x5F15;&#x7528;&#x5173;&#x7CFB;&#x3002;&#x524D;&#x8005;&#x662F;&#x5B8C;&#x5168;&#x5730;&#x56DE;&#x6536;&#x6240;&#x6709;&#x5E9F;&#x5F03;&#x5BF9;&#x8C61;&#x7684;&#x524D;&#x63D0;&#xFF0C;&#x5426;&#x5219;&#x5C31;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;&#x800C;&#x540E;&#x8005;&#x5219;&#x662F;&#x5B9E;&#x73B0;&#x5F52;&#x5E76;&#x548C;&#x590D;&#x5236;&#x7B49;&#x7B97;&#x6CD5;&#x7684;&#x5FC5;&#x8981;&#x6761;&#x4EF6;&#x3002;&#x6240;&#x6709;&#x4E0D;&#x53EF;&#x8FBE;&#x5BF9;&#x8C61;&#x90FD;&#x80FD;&#x591F;&#x53EF;&#x9760;&#x5730;&#x5F97;&#x5230;&#x56DE;&#x6536;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x90FD;&#x80FD;&#x591F;&#x91CD;&#x65B0;&#x5206;&#x914D;&#xFF0C;&#x5141;&#x8BB8;&#x5BF9;&#x8C61;&#x7684;&#x590D;&#x5236;&#x548C;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x7684;&#x7F29;&#x5E76;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x6709;&#x6548;&#x5730;&#x9632;&#x6B62;&#x5185;&#x5B58;&#x7684;&#x652F;&#x79BB;&#x7834;&#x788E;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x73B0;&#x5728;&#x6709;&#x8BB8;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x6BCF;&#x79CD;&#x6709;&#x5176;&#x7B97;&#x6CD5;&#x4E14;&#x5176;&#x8868;&#x73B0;&#x5404;&#x5F02;&#xFF0C;&#x65E2;&#x6709;&#x5F53;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F00;&#x59CB;&#x65F6;&#x5C31;&#x505C;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8FD0;&#x884C;&#xFF0C;&#x53C8;&#x6709;&#x5F53;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F00;&#x59CB;&#x65F6;&#x4E5F;&#x5141;&#x8BB8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#xFF0C;&#x8FD8;&#x6709;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x5783;&#x573E;&#x6536;&#x96C6;&#x591A;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x5B9E;&#x73B0;&#x548C;&#x5177;&#x4F53;&#x7684;JVM &#x4EE5;&#x53CA;JVM&#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x6709;&#x975E;&#x5E38;&#x7D27;&#x5BC6;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4E0D;&#x540C;&#x7684;JVM &#x53EF;&#x80FD;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x800C;JVM &#x7684;&#x5185;&#x5B58;&#x6A21;&#x578B;&#x51B3;&#x5B9A;&#x7740;&#x8BE5;JVM&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x54EA;&#x4E9B;&#x7C7B;&#x578B;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;&#x73B0;&#x5728;&#xFF0C;HotSpot &#x7CFB;&#x5217;JVM&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x90FD;&#x91C7;&#x7528;&#x5148;&#x8FDB;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x6846;&#x67B6;&#x8BBE;&#x8BA1;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8BE5;&#x7CFB;&#x5217;JVM&#x90FD;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;</p>
<p>&#xFF08;5&#xFF09;&#x968F;&#x7740;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x73B0;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6280;&#x672F;&#x63D0;&#x4F9B;&#x8BB8;&#x591A;&#x53EF;&#x9009;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x800C;&#x4E14;&#x5728;&#x914D;&#x7F6E;&#x6BCF;&#x79CD;&#x6536;&#x96C6;&#x5668;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5C31;&#x4F7F;&#x5F97;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x5E94;&#x7528;&#x73AF;&#x5883;&#x83B7;&#x5F97;&#x6700;&#x4F18;&#x7684;&#x5E94;&#x7528;&#x6027;&#x80FD;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;</p>
<p>&#x9488;&#x5BF9;&#x4EE5;&#x4E0A;&#x7279;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x4F7F;&#x7528;&#x7684;&#x65F6;&#x5019;&#x8981;&#x6CE8;&#x610F;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x4E0D;&#x8981;&#x8BD5;&#x56FE;&#x53BB;&#x5047;&#x5B9A;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFFFD;&#xFFFD;&#xFFFD;&#x751F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x672A;&#x77E5;&#x7684;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4E34;&#x65F6;&#x5BF9;&#x8C61;&#x5728;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x5B8C;&#x6BD5;&#x540E;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5B83;&#x7684;&#x5185;&#x5B58;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x91CA;&#x653E;&#x3002;</p>
<p>&#xFF08;2&#xFF09;Java&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E9B;&#x548C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6253;&#x4EA4;&#x9053;&#x7684;&#x7C7B;&#xFF0C;&#x800C;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5F3A;&#x884C;&#x6267;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x65B9;&#x6CD5;—&#x8C03;&#x7528;System.gc()&#xFF0C;&#x4F46;&#x8FD9;&#x540C;&#x6837;&#x662F;&#x4E2A;&#x4E0D;&#x786E;&#x5B9A;&#x7684;&#x65B9;&#x6CD5;&#x3002;Java &#x4E2D;&#x5E76;&#x4E0D;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21;&#x8C03;&#x7528;&#x8BE5;&#x65B9;&#x6CD5;&#x5C31;&#x4E00;&#x5B9A;&#x80FD;&#x591F;&#x542F;&#x52A8;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x5B83;&#x53EA;&#x4E0D;&#x8FC7;&#x4F1A;&#x5411;JVM&#x53D1;&#x51FA;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7533;&#x8BF7;&#xFF0C;&#x5230;&#x5E95;&#x662F;&#x5426;&#x771F;&#x6B63;&#x6267;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4E2A;&#x672A;&#x77E5;&#x6570;&#x3002;</p>
<p>&#xFF08;3&#xFF09;&#x6311;&#x9009;&#x9002;&#x5408;&#x81EA;&#x5DF1;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x3002;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x7CFB;&#x7EDF;&#x6CA1;&#x6709;&#x7279;&#x6B8A;&#x548C;&#x82DB;&#x523B;&#x7684;&#x6027;&#x80FD;&#x8981;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x91C7;&#x7528;JVM&#x7684;&#x7F3A;&#x7701;&#x9009;&#x9879;&#x3002;&#x5426;&#x5219;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x6BD4;&#x5982;&#x589E;&#x91CF;&#x6536;&#x96C6;&#x5668;&#x5C31;&#x6BD4;&#x8F83;&#x9002;&#x5408;&#x5B9E;&#x65F6;&#x6027;&#x8981;&#x6C42;&#x8F83;&#x9AD8;&#x7684;&#x7CFB;&#x7EDF;&#x4E4B;&#x4E2D;&#x3002;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x8F83;&#x9AD8;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x6709;&#x6BD4;&#x8F83;&#x591A;&#x7684;&#x95F2;&#x7F6E;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x4F7F;&#x7528;&#x5E76;&#x884C;&#x6807;&#x8BB0;/&#x6E05;&#x9664;&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<p>&#xFF08;4&#xFF09;&#x5173;&#x952E;&#x7684;&#x4E5F;&#x662F;&#x96BE;&#x628A;&#x63E1;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3002;&#x826F;&#x597D;&#x7684;&#x7F16;&#x7A0B;&#x4E60;&#x60EF;&#x548C;&#x4E25;&#x8C28;&#x7684;&#x7F16;&#x7A0B;&#x6001;&#x5EA6;&#x6C38;&#x8FDC;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4E0D;&#x8981;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x9519;&#x8BEF;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x51FA;&#x73B0;&#x5927;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#xFF08;5&#xFF09;&#x5C3D;&#x65E9;&#x91CA;&#x653E;&#x65E0;&#x7528;&#x5BF9;&#x8C61;&#x7684;&#x5F15;&#x7528;&#x3002;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x4F7F;&#x7528;&#x4E34;&#x65F6;&#x53D8;&#x91CF;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x662F;&#x8BA9;&#x5F15;&#x7528;&#x53D8;&#x91CF;&#x5728;&#x9000;&#x51FA;&#x6D3B;&#x52A8;&#x57DF;(scope)&#x540E;&#xFF0C;&#x81EA;&#x52A8;&#x8BBE;&#x7F6E;&#x4E3A;null&#xFF0C;&#x6697;&#x793A;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x6765;&#x6536;&#x96C6;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD8;&#x5FC5;&#x987B;&#x6CE8;&#x610F;&#x8BE5;&#x5F15;&#x7528;&#x7684;&#x5BF9;&#x8C61;&#x662F;&#x5426;&#x88AB;&#x76D1;&#x542C;&#xFF0C;&#x5982;&#x679C;&#x6709;&#xFF0C;&#x5219;&#x8981;&#x53BB;&#x6389;&#x76D1;&#x542C;&#x5668;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8D4B;&#x7A7A;&#x503C;&#x3002;</p>
<p>&#x53C2;&#x8003;:<a href="http://blog.csdn.net/zsuguangh/article/details/6429592" target="_blank" rel="external">http://blog.csdn.net/zsuguangh/article/details/6429592</a></p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/JVM/">JVM</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/02/e4b3e8e/" title="Hotspot 2.0：为公共WiFi插上飞翔的翅膀 -">
  <strong>上一篇：</strong><br/>
  <span>
  Hotspot 2.0：为公共WiFi插上飞翔的翅膀 -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/02/e4daaac/"  title="Kotlin M12 发布，基于 JVM 的编程语言 -">
 <strong>下一篇：</strong><br/> 
 <span>Kotlin M12 发布，基于 JVM 的编程语言 -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#3-_System-gc()方法"><span class="toc-number">1.</span> <span class="toc-text">3. System.gc()方法</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#4-_finalize()方法"><span class="toc-number">2.</span> <span class="toc-text">4. finalize()方法</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#5-_触发主GC（Garbage_Collector）的条件"><span class="toc-number">3.</span> <span class="toc-text">5. 触发主GC（Garbage Collector）的条件</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#6-_减少GC开销的措施"><span class="toc-number">4.</span> <span class="toc-text">6. 减少GC开销的措施</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(1)不要显式调用System-gc()"><span class="toc-number">5.</span> <span class="toc-text">(1)不要显式调用System.gc()</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(2)尽量减少临时对象的使用"><span class="toc-number">6.</span> <span class="toc-text">(2)尽量减少临时对象的使用</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(3)对象不用时最好显式置为Null"><span class="toc-number">7.</span> <span class="toc-text">(3)对象不用时最好显式置为Null</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(4)尽量使用StringBuffer,而不用String来累加字符串"><span class="toc-number">8.</span> <span class="toc-text">(4)尽量使用StringBuffer,而不用String来累加字符串</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(5)能用基本类型如Int,Long,就不用Integer,Long对象"><span class="toc-number">9.</span> <span class="toc-text">(5)能用基本类型如Int,Long,就不用Integer,Long对象</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(6)尽量少用静态对象变量"><span class="toc-number">10.</span> <span class="toc-text">(6)尽量少用静态对象变量</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#(7)分散对象创建或删除的时间"><span class="toc-number">11.</span> <span class="toc-text">(7)分散对象创建或删除的时间</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>221</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/IT/" title="IT">IT<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/Debian/" title="Debian">Debian<sup>4</sup></a></li>
			
		
			
				<li><a href="/tags/JavaScript/" title="JavaScript">JavaScript<sup>3</sup></a></li>
			
		
			
				<li><a href="/tags/Eclipse/" title="Eclipse">Eclipse<sup>3</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
