
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>MySQL Cluster 与 MongoDB 复制及分片设计及原理 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x8BA1;&amp;#x7B97;&amp;#x6D89;&amp;#x53CA;&amp;#x5230;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x4E8B;&amp;#x52A1;&amp;#x3001;&amp;#x6570;&amp;#x636E;&amp;#x5206;&amp;#x5E03;&amp;#x3001;&amp;#x6570;&amp;#x636E;&amp;#x6536;">
<meta property="og:type" content="article">
<meta property="og:title" content="MySQL Cluster 与 MongoDB 复制及分片设计及原理 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/08/4d5e709/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x8BA1;&amp;#x7B97;&amp;#x6D89;&amp;#x53CA;&amp;#x5230;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x4E8B;&amp;#x52A1;&amp;#x3001;&amp;#x6570;&amp;#x636E;&amp;#x5206;&amp;#x5E03;&amp;#x3001;&amp;#x6570;&amp;#x636E;&amp;#x6536;">
<meta property="og:updated_time" content="2015-07-08T14:33:29.929Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="MySQL Cluster 与 MongoDB 复制及分片设计及原理 -">
<meta name="twitter:description" content="&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x6570;&amp;#x636E;&amp;#x5E93;&amp;#x8BA1;&amp;#x7B97;&amp;#x6D89;&amp;#x53CA;&amp;#x5230;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#x4E8B;&amp;#x52A1;&amp;#x3001;&amp;#x6570;&amp;#x636E;&amp;#x5206;&amp;#x5E03;&amp;#x3001;&amp;#x6570;&amp;#x636E;&amp;#x6536;">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/08/4d5e709/" title="MySQL Cluster 与 MongoDB 复制及分片设计及原理 -" itemprop="url">MySQL Cluster 与 MongoDB 复制及分片设计及原理 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-08T02:33:29.000Z" itemprop="datePublished"> 发表于 2015-07-08</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			
		
		</div>
		
		<p>&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x8BA1;&#x7B97;&#x6D89;&#x53CA;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x4E8B;&#x52A1;&#x3001;&#x6570;&#x636E;&#x5206;&#x5E03;&#x3001;&#x6570;&#x636E;&#x6536;&#x655B;&#x8BA1;&#x7B97;&#x7B49;&#x7B49;&#x8981;&#x6C42;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x80FD;&#x5B9E;&#x73B0;&#x9AD8;&#x5B89;&#x5168;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x7B49;&#x7279;&#x5F81;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x5E26;&#x6765;&#x4E86;&#x9AD8;&#x6210;&#x672C;(&#x56FA;&#x5B9A;&#x6210;&#x672C;&#x53CA;&#x8FD0;&#x8425;&#x6210;&#x672C;)&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;MongoDB&#x53CA;MySQL Cluster&#x4ECE;&#x5B9E;&#x73B0;&#x4E0A;&#x6765;&#x5206;&#x6790;&#x5176;&#x4E2D;&#x7684;&#x8BBE;&#x8BA1;&#x601D;&#x8DEF;&#xFF0C;&#x7528;&#x4EE5;&#x62BD;&#x8C61;&#x6211;&#x4EEC;&#x5728;&#x8BBE;&#x8BA1;&#x6570;&#x636E;&#x5E93;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x7684;&#x90E8;&#x5206;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#xFF0C;&#x5E94;&#x7528;&#x4E8E;&#x6211;&#x4EEC;&#x7684;&#x751F;&#x4EA7;&#x7CFB;&#x7EDF;</p>
<p>&#x9996;&#x5148;&#x8BF4;&#x8BF4;&#x5173;&#x7CFB;&#x53CA;&#x975E;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7279;&#x5F81;</p>
<p>MySQL&#x7684;Innodb&#x53CA;Cluster&#x62E5;&#x6709;&#x5B8C;&#x6574;&#x7684;ACID&#x5C5E;&#x6027;</p>
<p>A&#xA0;&#x539F;&#x5B50;&#x6027; &#xA0;&#x6574;&#x4E2A;&#x4E8B;&#x52A1;&#x5C06;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6574;&#x4F53;&#xFF0C;&#x8981;&#x4E48;&#x5B8C;&#x6210;&#xFF0C;&#x8981;&#x4E48;&#x56DE;&#x6EDA;</p>
<p>C&#xA0;&#x4E00;&#x81F4;&#x6027;&#xA0;&#x4E8B;&#x52A1;&#x5F00;&#x59CB;&#x4E4B;&#x524D;&#x548C;&#x4E8B;&#x52A1;&#x7ED3;&#x675F;&#x4EE5;&#x540E;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x9650;&#x5236;&#x6CA1;&#x6709;&#x88AB;&#x7834;&#x574F;</p>
<p>I &#x9694;&#x79BB;&#x6027;&#xA0;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x7684;&#x6267;&#x884C;&#x662F;&#x4E92;&#x4E0D;&#x5E72;&#x6270;&#x7684;&#xFF0C;&#x4E24;&#x4E2A;&#x4E8B;&#x52A1;&#x65F6;&#x95F4;&#x4E0D;&#x4F1A;&#x4E92;&#x76F8;&#x5F71;&#x54CD;</p>
<p>D&#xA0;&#x6301;&#x4E45;&#x6027; &#x5728;&#x4E8B;&#x52A1;&#x5B8C;&#x6210;&#x4EE5;&#x540E;&#xFF0C;&#x8BE5;&#x4E8B;&#x52A1;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6240;&#x4F5C;&#x7684;&#x66F4;&#x6539;&#x4FBF;&#x6301;&#x4E45;&#x5730;&#x4FDD;&#x5B58;&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x662F;&#x5B8C;&#x5168;&#x7684;</p>
<p>&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;ACID&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x8BF8;&#x5982;Undo&#x3001;Redo&#x3001;MVCC&#x3001;TAS&#x3001;&#x4FE1;&#x53F7;&#x3001;&#x4E24;&#x9636;&#x6BB5;&#x5C01;&#x9501;&#x3001;&#x4E24;&#x9636;&#x6BB5;&#x63D0;&#x4EA4;&#x3001;&#x5C01;&#x9501;&#x7B49;&#x5B9E;&#x73B0;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x6570;&#x636E;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#xFF0C;&#x6574;&#x4E2A;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x5C06;&#x6781;&#x5176;&#x590D;&#x6742;</p>
<p>MySQL&#x9075;&#x5FAA;SQL&#x6807;&#x51C6;&#x3001;&#x4F7F;&#x7528;SQL&#x6807;&#x51C6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x5230;RDBMS&#x4E4B;&#x95F4;&#x7684;&#x65E0;&#x7F1D;&#x8FC1;&#x79FB;</p>
<p>&#x5176;&#x4E30;&#x5BCC;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x5B8C;&#x6574;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x63A7;&#x5236;&#x53CA;&#x8868;&#x8FBE;&#x80FD;&#x529B;&#x4E00;&#x76F4;&#x4F5C;&#x4E3A;&#x5546;&#x4E1A;&#x5E94;&#x7528;&#x7684;&#x9996;&#x9009;</p>
<p>MongoDB&#x4F7F;&#x7528;&#x96C6;&#x5408;&#x8868;&#x793A;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x62E5;&#x6709;ACID&#x5C5E;&#x6027;&#xFF0C;&#x4F46;&#x5176;&#x65E0;&#x7C7B;&#x578B;&#x3001;&#x5FEB;&#x901F;&#x90E8;&#x7F72;&#x53CA;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x5F97;&#x5230;&#x4E86;&#x666E;&#x904D;&#x7684;&#x8BA4;&#x53EF;</p>
<p>&#x4E0D;&#x7BA1;&#x662F;RDBMS&#x8FD8;&#x662F;MongoDB&#xFF0C;&#x65E0;&#x4E00;&#x90FD;&#x4F7F;&#x7528;&#x4E86;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#xFF0C;MongoDB&#x652F;&#x6301;B&#x6811;&#x7D22;&#x5F15;&#xFF0C;&#x7D22;&#x5F15;&#x6839;&#x636E;&#x7528;&#x6237;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x5EFA;&#x7ACB;&#xFF0C;&#x53EF;&#x4EE5;&#x5D4C;&#x5957;&#x5728;&#x5404;&#x4E2A;&#x5C42;&#x6B21;&#x7684;&#x5404;&#x4E2A;&#x5BB9;&#x5668;&#x4E4B;&#x95F4;&#x6784;&#x5EFA;</p>
<p>&#x5728;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x6570;&#x636E;&#x6709;&#x4E24;&#x79CD;&#x5B58;&#x653E;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p>1&#x3001;&#x5806;&#x8868;&#xFF1A;&#x6570;&#x636E;&#x6309;&#x7167;&#x5411;&#x540E;&#x63D2;&#x5165;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x76F4;&#x5806;&#x79EF;&#x5728;&#x6587;&#x4EF6;&#x672B;&#x5C3E;&#xFF0C;&#x4F7F;&#x7528;&#x7D22;&#x5F15;&#x7ED3;&#x6784;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5C06;&#x5728;&#x7D22;&#x5F15;&#x4E2D;&#x5F97;&#x5230;&#x6570;&#x636E;&#x6307;&#x9488;&#xFF0C;&#x7136;&#x540E;&#x83B7;&#x53D6;&#x6570;&#x636E;&#xFF0C;&#x5F53;&#x6709;&#x6570;&#x636E;&#x5220;&#x9664;&#x65F6;&#xFF0C;&#x5C06;&#x5176;&#x4ECE;&#x5BF9;&#x5E94;&#x4F4D;&#x7F6E;&#x5220;&#x9664;&#xFF0C;&#x5BF9;&#x4E8E;&#x9891;&#x7E41;&#x66F4;&#x65B0;&#x7684;&#x5806;&#x8868;&#xFF0C;&#x9700;&#x8981;&#x5B9A;&#x671F;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF0C;&#x4F7F;&#x7528;&#x5806;&#x8868;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x987A;&#x5E8F;&#x8BBF;&#x95EE;&#x539F;&#x5219;&#x88AB;&#x6253;&#x7834;(&#x5728;DBMS&#x4E2D;&#x505A;&#x4E86;&#x8BBF;&#x95EE;&#x4F18;&#x5316;&#xFF0C;&#x5F97;&#x5230;&#x90E8;&#x5206;&#x4F53;&#x80FD;&#x63D0;&#x5347;)&#xFF0C;&#x7531;&#x4E8E;&#x6CA1;&#x6709;&#x586B;&#x5145;&#x56E0;&#x5B50;&#xFF0C;&#x5728;&#x76F8;&#x540C;&#x538B;&#x7F29;&#x7B97;&#x6CD5;&#x4E0B;&#xFF0C;&#x7A7A;&#x95F4;&#x80FD;&#x5F97;&#x5230;&#x5F88;&#x5927;&#x7684;&#x8282;&#x7701;&#xFF0C;&#x5806;&#x8868;&#x5F88;&#x9002;&#x5408;&#x4E8E;&#x987A;&#x5E8F;&#x8303;&#x56F4;&#x8BBF;&#x95EE;&#xFF0C;&#x5982;&#x6570;&#x636E;&#x4ED3;&#x5E93;&#x7B49;&#x4E1A;&#x52A1;&#x573A;&#x666F;</p>
<p>2&#x3001;&#x7D22;&#x5F15;&#x7EC4;&#x7EC7;&#x8868;&#xFF1A;&#x4E00;&#x822C;&#x7D22;&#x5F15;&#x7EC4;&#x7EC7;&#x8868;&#x4F7F;&#x7528;B+&#x4F5C;&#x4E3A;&#x6784;&#x9020;&#x65B9;&#x6CD5;&#xFF0C;&#x6574;&#x4E2A;&#x7ED3;&#x6784;&#x5982;&#x540C;&#x4E00;&#x4E2A;&#x5012;&#x6302;&#x7684;&#x6811;(&#x4ECE;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6D41;&#x6765;&#x770B;)&#xFF0C;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x5B58;&#x653E;&#x5728;&#x6811;&#x679D;&#x4E0A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5B58;&#x653E;&#x5728;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x901A;&#x8FC7;&#x53CC;&#x5411;&#x6307;&#x9488;&#x5C06;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x6839;&#x636E;&#x987A;&#x5E8F;&#x65B9;&#x5F0F;&#x4E32;&#x8054;&#x8D77;&#x6765;&#xFF0C;&#x7531;&#x4E8E;&#x65F6;&#x7A7A;&#x8BBF;&#x95EE;&#x5C40;&#x9650;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x80FD;&#x5F88;&#x5927;&#x63D0;&#x5347;&#x6570;&#x636E;&#x6027;&#x80FD;&#xFF0C;DBMS&#x6839;&#x636E;&#x8BBF;&#x95EE;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#x8BBF;&#x95EE;&#x53CA;&#x6784;&#x9020;&#x6570;&#x636E;&#xFF0C;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x6DF1;&#x5EA6;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x4E86;&#x6027;&#x80FD;&#xFF0C;&#x4E00;&#x822C;&#x5EFA;&#x8BAE;&#x8BBF;&#x95EE;&#x8DEF;&#x5F84;&#x63A7;&#x5236;&#x5728;4&#x4EE5;&#x5185;(&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;3)&#xFF0C;&#x539F;&#x56E0;&#x7531;&#x4E8E;&#x8BBF;&#x95EE;&#x591A;&#x5C42;&#x8DEF;&#x5F84;&#x9700;&#x8981;&#x6D88;&#x8017;&#x66F4;&#x9AD8;&#x7684;&#x4EE3;&#x4EF7;&#x53CA;&#x7EF4;&#x62A4;&#x7D22;&#x5F15;&#x6811;&#x4EE3;&#x4EF7;&#x8D8A;&#x6765;&#x8D8A;&#x6602;&#x8D35;</p>
<p>&#x6211;&#x4EEC;&#x5E38;&#x89C1;&#x7684;Innodb&#x3001;MySQL Cluster&#x7B49;&#x90FD;&#x662F;&#x7D22;&#x5F15;&#x7EC4;&#x7EC7;&#x8868;&#x3001;MyISAM&#x4E3A;&#x5806;&#x8868;&#xFF0C;MongoDB&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x4E3A;&#x5806;&#x8868;</p>
<p>&#x62E5;&#x6709;AICD&#x5C5E;&#x6027;&#x7684;&#x6570;&#x636E;&#x5E93;&#x62E5;&#x6709;&#x7D22;&#x5F15;&#x7EF4;&#x62A4;&#x529F;&#x80FD;&#xFF0C;MyISAM&#x53CA;MongoDB&#x7531;&#x4E8E;&#x662F;&#x5806;&#x8868;&#xFF0C;&#x4E14;&#x6CA1;&#x6709;ACID&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x5143;&#x6570;&#x636E;&#x4E0E;&#x7D22;&#x5F15;&#x4E0D;&#x4E00;&#x81F4;&#x95EE;&#x9898;&#xFF0C;&#x76F4;&#x63A5;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6DF7;&#x4E71;&#xFF0C;&#x6570;&#x636E;&#x4E0D;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x6CA1;&#x6709;ACID&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x66F4;&#x65B0;(&#x672C;&#x6587;&#x6240;&#x9610;&#x8FF0;&#x7684;&#x66F4;&#x65B0;&#x5305;&#x62EC;&#x5305;&#x62EC;&#x6240;&#x6709;&#x7684;&#x5199;&#x5165;&#x64CD;&#x4F5C;)&#x901F;&#x5EA6;&#x5C06;&#x5F97;&#x5230;&#x5F88;&#x5927;&#x7684;&#x63D0;&#x5347;&#xFF0C;MyISAM&#x9700;&#x8981;&#x5B9A;&#x671F;&#x8FDB;&#x884C;&#x4E00;&#x81F4;&#x6027;check</p>
<p>MySQL Cluster &#x67B6;&#x6784;</p>
<p>Cluster&#x5206;&#x4E3A;SQL&#x8282;&#x70B9;&#x3001;&#x6570;&#x636E;&#x8282;&#x70B9;&#x3001;&#x7BA1;&#x7406;&#x8282;&#x70B9;(MySQL Cluster&#x63D0;&#x4F9B;&#x4E86;API&#x4F9B;&#x5185;&#x90E8;&#x8C03;&#x7528;&#xFF0C;&#x5916;&#x90E8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;API&#x501F;&#x53E3;&#x8BBF;&#x95EE;&#x4EFB;&#x610F;&#x5C42;&#x65B9;&#x6CD5;)</p>
<p>SQL&#x8282;&#x70B9;&#x63D0;&#x4F9B;&#x7528;&#x6237;SQL&#x6307;&#x4EE4;&#x8BF7;&#x6C42;&#xFF0C;&#x89E3;&#x6790;&#x3001;&#x7EF4;&#x62A4;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x5217;&#x8868;&#x3001;&#x5411;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x53D1;&#x8D77;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#x8BF7;&#x6C42;&#x3001;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x3001;&#x6570;&#x636E;merge&#x3001;sort&#xFF0C;&#x88C1;&#x526A;&#x7B49;&#x529F;&#x80FD;</p>
<p>&#x6570;&#x636E;&#x8282;&#x70B9;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5B58;&#x53D6;&#xFF0C;&#x6301;&#x4E45;&#x5316;&#x3001;API&#x6570;&#x636E;&#x5B58;&#x53D6;&#x8BBF;&#x95EE;&#x7B49;&#x529F;&#x80FD;</p>
<p>&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x7EF4;&#x62A4;&#x7740;&#x8FD9;&#x4E2A;Cluster&#x4E2D;&#x6240;&#x6709;&#x6570;&#x636E;&#x8282;&#x70B9;&#x7684;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#x89C4;&#x5219;&#x3001;&#x5907;&#x4EFD;&#x8C03;&#x5EA6;&#x7B49;&#x529F;&#x80FD;</p>
<p>&#x6570;&#x636E;&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x5206;&#x7247;&#x53CA;&#x591A;&#x4EFD;&#x6570;&#x636E;&#x5B58;&#x50A8;&#xFF0C;&#x81F3;&#x5C11;&#x5B58;&#x653E;2&#x4EFD;&#xFF0C;&#x6570;&#x636E;&#x5B58;&#x653E;&#x4E8E;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x7684;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x6301;&#x4E45;&#x5316;&#xFF0C;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x5B58;&#x53D6;&#x5730;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x5185;&#x5B58;&#x652F;&#x6301;</p>
<p>SQL&#x8282;&#x70B9;&#x4F5C;&#x4E3A;&#x67E5;&#x8BE2;&#x5165;&#x53E3;&#xFF0C;&#x9700;&#x8981;&#x6D88;&#x8017;&#x5927;&#x91CF;cpu&#x53CA;&#x5185;&#x5B58;&#x8D44;&#x6E90;&#xFF0C;&#x53EF;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#xFF0C;&#x5E76;&#x5728;SQL&#x8282;&#x70B9;&#x5916;&#x5C01;&#x88C5;&#x4E00;&#x5C42;&#x8BF7;&#x6C42;&#x5206;&#x53D1;&#x53CA;HA&#x63A7;&#x5236;&#x673A;&#x5236;&#x53EF;&#x89E3;&#x51B3;&#x5355;&#x70B9;&#x53CA;&#x6027;&#x80FD;&#x95EE;&#x9898;&#xFF0C;&#x5176;&#x63D0;&#x4F9B;&#x4E86;&#x7EBF;&#x6027;&#x6269;&#x5C55;&#x529F;&#x80FD;</p>
<p>&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x7EF4;&#x62A4;&#x7740;&#x5168;&#x5C40;&#x8DEF;&#x7531;&#x53CA;&#x89C4;&#x5219;&#x4FE1;&#x606F;&#xFF0C;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x5185;&#x5B58;&#x6765;&#x652F;&#x6491;&#xFF0C;&#x53EF;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x6765;&#x89E3;&#x51B3;</p>
<p>&#x518D;&#x6574;&#x4E2A;Cluster&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x7EC4;&#x5EFA;&#x90FD;&#x652F;&#x6301;&#x52A8;&#x6001;&#x6269;&#x5C55;&#xFF0C;&#x7EBF;&#x6027;&#x6269;&#x5C55;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x9AD8;&#x53EF;&#x7528;&#xFF0C;&#x9AD8;&#x6027;&#x80FD;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;</p>
<p>&#x95EE;&#x9898;&#xFF1A;</p>
<p>&#x5F53;&#x65B0;&#x589E;&#x6570;&#x636E;&#x8282;&#x70B9;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x91CD;&#x6784;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#x4FE1;&#x606F;&#xFF0C;&#x5BF9;&#x7BA1;&#x7406;&#x8282;&#x70B9;&#x5C06;&#x9020;&#x6210;&#x6570;&#x636E;&#x91CD;&#x6784;&#x538B;&#x529B;&#xFF0C;&#x8BE5;&#x64CD;&#x4F5C;&#x53EA;&#x80FD;&#x5728;&#x975E;&#x4E1A;&#x52A1;&#x9AD8;&#x5CF0;&#x65F6;&#x8FDB;&#x884C;</p>
<p>Cluster&#x4F7F;&#x7528;&#x81EA;&#x52A8;&#x952E;&#x503C;&#x8BC6;&#x522B;&#x6570;&#x636E;&#x5206;&#x5E03;&#x65B9;&#x6848;&#xFF0C;&#x5982;&#x679C;&#x6570;&#x636E;&#x6709;&#x4E3B;&#x952E;&#xFF0C;&#x5219;&#x6839;&#x636E;(1&#x3001;&#x4E3B;&#x952E;&#x3001;2&#x552F;&#x4E00;&#x7D22;&#x5F15;&#x3001;3&#x81EA;&#x52A8;&#x884C;&#x6807;&#x8BC6;rowid)&#x96C6;&#x7FA4;&#x4E2A;&#x6570;&#x8FDB;&#x884C;&#x53D6;&#x6A21;&#x5206;&#x5E03;&#xFF0C;&#x5F53;&#x4F7F;&#x7528;&#x975E;&#x4E3B;&#x952E;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x5C06;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x7C07;&#x8282;&#x70B9;&#x626B;&#x63CF;&#xFF0C;&#x5F71;&#x54CD;&#x6027;&#x80FD;(&#x8FD9;&#x662F;Cluster&#x9762;&#x5BF9;&#x7684;&#x6838;&#x5FC3;&#x6311;&#x6218;)</p>
<p>MongoDB &#x590D;&#x5236;&#x96C6;&#xFF0C;&#x57FA;&#x4E8E;MongoDB&#x590D;&#x5236;&#xFF0C;&#x6784;&#x9020;&#x51FA;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;</p>
<p>MongoDB&#x63D0;&#x4F9B;&#x4E86;&#x548C;MySQL Cluster&#x7C7B;&#x4F3C;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x5728;mongod&#x3001;mongos&#x3001;mongo&#x4E2D;&#xFF0C;&#x5305;&#x542B;&#xFF1A;</p>
<p>Mongod&#xFF1A; &#x6570;&#x636E;&#x8BBF;&#x95EE;&#x501F;&#x53E3;&#xFF0C;&#x5C06;&#x8BF7;&#x6C42;&#x5206;&#x53D1;&#x7ED9;Mongos&#x8282;&#x70B9;</p>
<p>Mongs&#xFF1A; &#x6570;&#x636E;&#x8BBF;&#x95EE;&#x8DEF;&#x7531;&#x3001;&#x67E5;&#x8BE2;&#x4F18;&#x5316;&#x3001;&#x6570;&#x636E;merge&#x3001;sort&#xFF0C;&#x88C1;&#x526A;&#x7B49;&#x529F;&#x80FD;</p>
<p>mongo&#xFF1A;&#x6570;&#x636E;&#x5B58;&#x53D6;(&#x4F7F;&#x7528;mongo&#x534F;&#x8BAE;&#x8FD8;&#x63D0;&#x4F9B;&#x76F4;&#x63A5;&#x6570;&#x636E;&#x8BBF;&#x95EE;)</p>
<p>MongoDB&#x5728;&#x6784;&#x5EFA;&#x96C6;&#x5408;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5206;&#x7247;&#x89C4;&#x5219;&#xFF0C;&#x8BE5;&#x89C4;&#x5219;&#x5C06;&#x88AB;&#x8BB0;&#x5F55;&#x518D;mongos&#x4E2D;&#xFF0C;&#x67E5;&#x8BE2;&#x8BF7;&#x6C42;mongod&#x5C06;&#x5411;mongos&#x53D1;&#x8D77;&#x8BF7;&#x6C42;&#xFF0C;mongos&#x6839;&#x636E;&#x5B58;&#x53D6;&#x8DEF;&#x5F84;&#x5728;mongo&#x4E2D;&#x8BBF;&#x95EE;&#x6570;&#x636E;</p>
<p>&#x7531;&#x4E8E;MongoDB&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#x6027;&#xFF0C;&#x5C06;&#x6570;&#x636E;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x5207;&#x7247;&#xFF0C;&#x5728;&#x5BF9;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x900F;&#x660E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5FEB;&#x901F;&#x5B58;&#x53D6;&#x6570;&#x636E;</p>
<p>MongoDB&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#xFF1A;</p>
<p>&#x4EE5;&#x975E;&#x5206;&#x7247;&#x89C4;&#x5219;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x65F6;(&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5EFA;&#x7ACB;&#x5728;&#x5404;&#x4E2A;&#x5206;&#x7247;)&#xFF0C;&#x5C06;&#x5BFC;&#x81F4;&#x6240;&#x6709;Mongo&#x7C07;&#x8282;&#x70B9;&#x5168;&#x626B;&#x63CF;(&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x4EFD;&#x5197;&#x4F59;&#x62F7;&#x8D1D;&#x5E76;&#x8FDB;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x7247;&#x89C4;&#x5219;&#x5B9E;&#x73B0;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5F53;&#x524D;&#x6570;&#x636E;&#x5206;&#x7247;&#x5E94;&#x7528;&#x5E38;&#x7528;&#x7684;&#x624B;&#x6BB5;)</p>
<p>&#x5F53;&#x65B0;&#x589E;&#x6570;&#x636E;&#x7C07;&#x65F6;&#xFF0C;&#x5C06;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x6570;&#x636E;&#x8282;&#x70B9;&#x91CD;&#x6784;&#xFF0C;&#x76F4;&#x63A5;&#x5F71;&#x54CD;&#x6027;&#x80FD;</p>
<p>&#x603B;&#x7ED3;&#xFF1A;</p>
<p>MongoDB&#x4F7F;&#x7528;&#x5806;&#x8868;&#x65B9;&#x6CD5;&#x7EC4;&#x7EC7;&#x6570;&#x636E;&#x3001;&#x4E0D;&#x5305;&#x542B;ACID&#x7279;&#x6027;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x5927;&#x91CF;&#x6570;&#x636E;&#x66F4;&#x65B0;&#x53CA;&#x67E5;&#x8BE2;(&#x5BF9;&#x4E8E;&#x62E5;&#x6709;MVCC&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x5C06;&#x964D;&#x4F4E;&#x5728;&#x9AD8;&#x5E76;&#x53D1;&#x3001;&#x5927;&#x6570;&#x636E;&#x96C6;&#x7684;&#x54CD;&#x5E94;&#x901F;&#x5EA6;)&#x6709;&#x5F88;&#x5927;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;ACID&#x4FDD;&#x8BC1;&#x5173;&#x952E;&#x6570;&#x636E;&#x7684;&#x7A33;&#x5B9A;&#x3001;&#x5B89;&#x5168;</p>
<p>MongoDB&#x89E3;&#x51B3;&#x4E86;MySQL Cluster&#x7684;&#x81EA;&#x52A8;&#x5206;&#x7247;&#x89C4;&#x5219;&#xFF0C;&#x5C06;MySQL Cluster&#x7684;SQL&#x8282;&#x70B9;&#x6570;&#x636E;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x79FB;&#x4EA4;&#x7ED9;mongos&#xFF0C;&#x80FD;&#x964D;&#x4F4E;MySQL Cluster SQL&#x8282;&#x70B9;&#x4E0E;Cluster&#x76F8;&#x4E92;&#x901A;&#x4FE1;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x63D0;&#x5347;&#x4F53;&#x7EDF;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x8DE8;&#x5206;&#x7247;&#x67E5;&#x8BE2;&#x95EE;&#x9898;&#x53CA;&#x6570;&#x636E;&#x8282;&#x70B9;&#x6DFB;&#x52A0;&#x7684;&#x7A33;&#x5B9A;&#x53CA;&#x6027;&#x80FD;&#x95EE;&#x9898;</p>
<p>MySQL Cluster&#x62E5;&#x6709;&#x5B8C;&#x6574;&#x7684;&#x5546;&#x4E1A;&#x652F;&#x6301;&#x53CA;&#x901A;&#x7528;&#x6807;&#x51C6;&#x652F;&#x6301;&#xFF0C;&#x76F8;&#x5BF9;&#x4E30;&#x5BCC;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;MongoDB&#x62E5;&#x6709;&#x76F8;&#x5BF9;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x7F3A;&#x5C11;&#x5F3A;&#x5927;&#x7684;&#x7A33;&#x5B9A;&#x53CA;&#x5B89;&#x5168;&#x652F;&#x6491;&#xFF0C;&#x4E30;&#x5BCC;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x4E24;&#x8005;&#x6709;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x52BF;&#xFF0C;&#x4F46;&#x6709;&#x5DEE;&#x4E0D;&#x591A;&#x76F8;&#x540C;&#x7684;&#x81F4;&#x547D;&#x5F31;&#x70B9;&#x3002;</p>
<p>&#x4ECE;&#x5546;&#x4E1A;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;MySQL Cluster&#x62E5;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x5546;&#x4E1A;&#x4F7F;&#x7528;&#x4EF7;&#x503C;&#xFF0C;&#x4F46;&#x7F3A;&#x9677;&#x4E5F;&#x5F88;&#x660E;&#x663E;&#xFF0C;MongoDB&#x5BF9;MySQL Cluster&#x7684;&#x6539;&#x8FDB;&#x5F88;&#x503C;&#x5F97;&#x601D;&#x8003;&#x53CA;&#x5728;&#x65E5;&#x5E38;&#x6570;&#x636E;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#xFF0C;&#x6A21;&#x5F0F;&#x8BBE;&#x8BA1;&#x4E2D;&#x5F15;&#x5165;&#xFF0C;&#x4F46;&#x4F5C;&#x4E3A;&#x5927;&#x9762;&#x79EF;&#x5546;&#x4E1A;&#x5E94;&#x7528;&#xFF0C;MySQL Cluster&#x548C;MongoDB&#x90FD;&#x8FD8;&#x6709;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x8DEF;&#x8981;&#x8D70;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x56FA;&#x6709;&#x7684;&#x7F3A;&#x9677;&#x8FD8;&#x662F;&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#x4E0A;&#x3002;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/MongoDB/">MongoDB</a><a href="/tags/MySQL-Cluster/">MySQL Cluster</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/08/4da9835/" title="MongoDb gridfs-ngnix文件存储方案 -">
  <strong>上一篇：</strong><br/>
  <span>
  MongoDb gridfs-ngnix文件存储方案 -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/08/4d5cc2e/"  title="Mongodb和Hbase的对比 -">
 <strong>下一篇：</strong><br/> 
 <span>Mongodb和Hbase的对比 -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>606</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>17</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>15</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/MySQL/" title="MySQL">MySQL<sup>10</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
