
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>“集群和负载均衡”的通俗版解释 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x5728;&amp;#x201C;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#xFF0C;&amp;#x6D77;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#xFF0C;NoSql&amp;#xFF0C;&amp;#x4E91;&amp;#x8BA1;&amp;#x7B97;……&amp;#x201D;&amp;#x6982;&amp;#x5FF5;&amp;#x6EE1;&amp;#x5929;&amp;">
<meta property="og:type" content="article">
<meta property="og:title" content="“集群和负载均衡”的通俗版解释 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/01/f944aa9/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x5728;&amp;#x201C;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#xFF0C;&amp;#x6D77;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#xFF0C;NoSql&amp;#xFF0C;&amp;#x4E91;&amp;#x8BA1;&amp;#x7B97;……&amp;#x201D;&amp;#x6982;&amp;#x5FF5;&amp;#x6EE1;&amp;#x5929;&amp;">
<meta property="og:updated_time" content="2015-06-30T23:37:30.429Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="“集群和负载均衡”的通俗版解释 -">
<meta name="twitter:description" content="&amp;#x5728;&amp;#x201C;&amp;#x9AD8;&amp;#x5E76;&amp;#x53D1;&amp;#xFF0C;&amp;#x6D77;&amp;#x91CF;&amp;#x6570;&amp;#x636E;&amp;#xFF0C;&amp;#x5206;&amp;#x5E03;&amp;#x5F0F;&amp;#xFF0C;NoSql&amp;#xFF0C;&amp;#x4E91;&amp;#x8BA1;&amp;#x7B97;……&amp;#x201D;&amp;#x6982;&amp;#x5FF5;&amp;#x6EE1;&amp;#x5929;&amp;">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f944aa9/" title="“集群和负载均衡”的通俗版解释 -" itemprop="url">“集群和负载均衡”的通俗版解释 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#集群(Cluster)"><span class="toc-number">1.</span> <span class="toc-text">集群(Cluster)</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#负载均衡(Load_Balance)"><span class="toc-number">2.</span> <span class="toc-text">负载均衡(Load Balance)</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#大规模集群，通常具备以下一些特点："><span class="toc-number">3.</span> <span class="toc-text">大规模集群，通常具备以下一些特点：</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#load_balance_cluster（负载均衡集群）"><span class="toc-number">4.</span> <span class="toc-text">load balance cluster（负载均衡集群）</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#High_availability_cluster（高可用集群）"><span class="toc-number">5.</span> <span class="toc-text">High availability cluster（高可用集群）</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#high_computing_clustering（高性能计算集群）"><span class="toc-number">6.</span> <span class="toc-text">high computing clustering（高性能计算集群）</span></a></li></ol>
		
		</div>
		
		<p>&#x5728;&#x201C;&#x9AD8;&#x5E76;&#x53D1;&#xFF0C;&#x6D77;&#x91CF;&#x6570;&#x636E;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;NoSql&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;……&#x201D;&#x6982;&#x5FF5;&#x6EE1;&#x5929;&#x98DE;&#x7684;&#x5E74;&#x4EE3;&#xFF0C;&#x76F8;&#x4FE1;&#x4E0D;&#x5C11;&#x670B;&#x53CB;&#x90FD;&#x542C;&#x8BF4;&#x8FC7;&#x751A;&#x81F3;&#x5E38;&#x4E0E;&#x4EBA;&#x63D0;&#x8D77;&#x201C;&#x96C6;&#x7FA4;&#xFF0C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x201D;&#x7B49;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6709;&#x673A;&#x4F1A;&#x771F;&#x6B63;&#x63A5;&#x89E6;&#x5230;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x4E86;&#x8FD9;&#x4E9B;&#x201C;&#x542C;&#x8D77;&#x6765;&#x5F88;&#x725B;&#x7684;&#x201D;&#x6280;&#x672F;&#x540D;&#x8BCD;&#x3002;&#x4E0B;&#x9762;&#x7B80;&#x5355;&#x89E3;&#x91CA;&#x4E00;&#x4E0B;&#x5427;&#x3002;</p>
<h4 id="&#x96C6;&#x7FA4;(Cluster)">&#x96C6;&#x7FA4;(Cluster)</h4><p>&#x6240;&#x8C13;&#x96C6;&#x7FA4;&#x662F;&#x6307;&#x4E00;&#x7EC4;&#x72EC;&#x7ACB;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x6784;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x677E;&#x8026;&#x5408;&#x7684;&#x591A;&#x5904;&#x7406;&#x5668;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x8FDB;&#x7A0B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x3002;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x5171;&#x4EAB;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x6D88;&#x606F;&#x4F20;&#x9001;&#xFF0C;&#x5B9E;&#x73B0;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x673A;&#x3002;&#x901A;&#x4FD7;&#x4E00;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x5C31;&#x662F;&#x8BA9;&#x82E5;&#x5E72;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x8054;&#x5408;&#x8D77;&#x6765;&#x5DE5;&#x4F5C;(&#x670D;&#x52A1;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x5E76;&#x884C;&#x7684;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x505A;&#x5907;&#x4EFD;&#x3002;</p>
<h4 id="&#x8D1F;&#x8F7D;&#x5747;&#x8861;(Load_Balance)">&#x8D1F;&#x8F7D;&#x5747;&#x8861;(Load Balance)</h4><p>&#x7F51;&#x7EDC;&#x7684;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x662F;&#x4E00;&#x79CD;&#x52A8;&#x6001;&#x5747;&#x8861;&#x6280;&#x672F;&#xFF0C;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x5DE5;&#x5177;&#x5B9E;&#x65F6;&#x5730;&#x5206;&#x6790;&#x6570;&#x636E;&#x5305;&#xFF0C;&#x638C;&#x63E1;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x6D41;&#x91CF;&#x72B6;&#x51B5;&#xFF0C;&#x628A;&#x4EFB;&#x52A1;&#x5408;&#x7406;&#x5747;&#x8861;&#x5730;&#x5206;&#x914D;&#x51FA;&#x53BB;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x57FA;&#x4E8E;&#x73B0;&#x6709;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6269;&#x5C55;&#x670D;&#x52A1;&#x5668;&#x5E26;&#x5BBD;&#x548C;&#x589E;&#x52A0;&#x670D;&#x52A1;&#x5668;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5EC9;&#x4EF7;&#x6709;&#x6548;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x52A0;&#x5F3A;&#x4E86;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7F51;&#x7EDC;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x548C;&#x53EF;&#x7528;&#x6027;&#x3002;&#x65E5;&#x5E38;&#x751F;&#x6D3B;&#x4E2D;&#x5230;&#x5904;&#x90FD;&#x80FD;&#x770B;&#x5230;&#x201C;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x201D;&#xFF0C;&#x4E00;&#x4E2A;&#x8D85;&#x5E02;&#x7684;&#x6536;&#x8425;&#x5458;&#x9AD8;&#x5CF0;&#x671F;&#x53EA;&#x80FD;&#x670D;&#x52A1;10&#x4F4D;&#x987E;&#x5BA2;&#xFF0C;&#x5F53;&#x505A;&#x6D3B;&#x52A8;&#x65F6;&#x6709;20&#x4F4D;&#x987E;&#x5BA2;&#x9700;&#x8981;&#x670D;&#x52A1;&#x7684;&#x8BDD;&#x53EF;&#x80FD;&#x5C31;&#x4F1A;&#x6392;&#x957F;&#x961F;&#xFF0C;&#x8FD9;&#x6837;&#x8D2D;&#x7269;&#x4F53;&#x9A8C;&#x5C06;&#x4F1A;&#x5F88;&#x5DEE;&#xFF08;&#x5C31;&#x50CF;&#x5BA2;&#x6237;&#x62B1;&#x6028;&#x7CFB;&#x7EDF;/&#x7F51;&#x7AD9;&#x8BBF;&#x95EE;&#x592A;&#x6162;&#xFF09;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x529E;&#x6CD5;&#x5C31;&#x662F;&#x518D;&#x62DB;&#x4E2A;&#x8425;&#x4E1A;&#x5458;&#xFF0C;&#x91CD;&#x65B0;&#x5F00;&#x901A;&#x4E00;&#x4E2A;&#x51FA;&#x53E3;&#x3002;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x7684;&#x6838;&#x5FC3;&#x5C31;&#x662F;&#x201C;&#x5206;&#x644A;&#x538B;&#x529B;&#x201D;&#x3002;</p>
<h4 id="&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF1A;">&#x5927;&#x89C4;&#x6A21;&#x96C6;&#x7FA4;&#xFF0C;&#x901A;&#x5E38;&#x5177;&#x5907;&#x4EE5;&#x4E0B;&#x4E00;&#x4E9B;&#x7279;&#x70B9;&#xFF1A;</h4><p>(1)&#x9AD8;&#x53EF;&#x9760;&#x6027;(HA)&#x5229;&#x7528;&#x96C6;&#x7FA4;&#x7BA1;&#x7406;&#x8F6F;&#x4EF6;&#xFF0C;&#x5F53;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x6545;&#x969C;&#x65F6;&#xFF0C;&#x5907;&#x4EFD;&#x670D;&#x52A1;&#x5668;&#x80FD;&#x591F;&#x81EA;&#x52A8;&#x63A5;&#x7BA1;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x53CA;&#x65F6;&#x5207;&#x6362;&#x8FC7;&#x53BB;&#xFF0C;&#x4EE5;&#x5B9E;&#x73B0;&#x5BF9;&#x7528;&#x6237;&#x7684;&#x4E0D;&#x95F4;&#x65AD;&#x670D;&#x52A1;&#x3002; </p>
<p>(2)&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;(HP)&#x5373;&#x5145;&#x5206;&#x5229;&#x7528;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x8D44;&#x6E90;&#xFF0C;&#x5B9E;&#x73B0;&#x590D;&#x6742;&#x8FD0;&#x7B97;&#x7684;&#x5E76;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x79D1;&#x5B66;&#x8BA1;&#x7B97;&#x9886;&#x57DF;&#xFF0C;&#x6BD4;&#x5982;&#x57FA;&#x56E0;&#x5206;&#x6790;&#x3001;&#x5316;&#x5B66;&#x5206;&#x6790;&#x7B49;&#x3002; </p>
<p>(3)&#x8D1F;&#x8F7D;&#x5E73;&#x8861;(LB)&#x5373;&#x628A;&#x8D1F;&#x8F7D;&#x538B;&#x529B;&#x6839;&#x636E;&#x67D0;&#x79CD;&#x7B97;&#x6CD5;&#x5408;&#x7406;&#x5206;&#x914D;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53F0;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#xFF0C;&#x4EE5;&#x51CF;&#x8F7B;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x538B;&#x529B;&#xFF0C;&#x964D;&#x4F4E;&#x5BF9;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x548C;&#x8F6F;&#x4EF6;&#x8981;&#x6C42;&#x3002; </p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x4EE5;&#x4E0A;&#x7684;&#x8FD9;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x5728;&#x67D0;&#x4E9B;&#x9002;&#x5E94;&#x573A;&#x5408;&#x4E0B;&#x662F;&#x9700;&#x8981;&#x540C;&#x65F6;&#x5177;&#x5907;&#x7684;&#x3002;&#x5E38;&#x7528;&#x7684;&#x96C6;&#x7FA4;&#x53C8;&#x5206;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<h4 id="load_balance_cluster&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;&#xFF09;">load balance cluster&#xFF08;&#x8D1F;&#x8F7D;&#x5747;&#x8861;&#x96C6;&#x7FA4;&#xFF09;</h4><p>&#x4E00;&#x5171;&#x6709;&#x56DB;&#x5144;&#x5F1F;&#x5F00;&#x88C1;&#x7F1D;&#x94FA;&#xFF0C;&#x751F;&#x610F;&#x7279;&#x522B;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E0D;&#x4E0B;&#x6765;&#xFF0C;&#x8001;&#x662F;&#x5EF6;&#x8BEF;&#x5DE5;&#x671F;&#xFF0C;&#x4E8E;&#x662F;&#x56DB;&#x4E2A;&#x5144;&#x5F1F;&#x5546;&#x91CF;&#xFF1A;&#x8001;&#x5927;&#x63A5;&#x8BA2;&#x5355;, &#x4E09;&#x4E2A;&#x5144;&#x5F1F;&#x6765;&#x5E72;&#x6D3B;&#x3002; &#x5BA2;&#x6237;&#x591A;&#x8D77;&#x6765;&#x4E4B;&#x540E;&#xFF0C;&#x8001;&#x5927;&#x6839;&#x636E;&#x4E00;&#x5B9A;&#x7684;&#x539F;&#x5219;(policy) &#x6839;&#x636E;&#x4E09;&#x5144;&#x5F1F;&#x624B;&#x4E0A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x6765;&#x5206;&#x6D3E;&#x65B0;&#x4EFB;&#x52A1;&#x3002;</p>
<h4 id="High_availability_cluster&#xFF08;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#xFF09;">High availability cluster&#xFF08;&#x9AD8;&#x53EF;&#x7528;&#x96C6;&#x7FA4;&#xFF09;</h4><p>&#x4E24;&#x5144;&#x5F1F;&#x5F00;&#x65E9;&#x9910;&#x94FA;&#xFF0C;&#x751F;&#x610F;&#x4E0D;&#x5927;&#xFF0C;&#x4F46;&#x662F;&#x6BCF;&#x5929;&#x65E9;&#x4E0A;7&#x70B9;&#x5230;9&#x70B9;&#x4E4B;&#x95F4;&#x5BA2;&#x6237;&#x5F88;&#x591A;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x4E2D;&#x65AD;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;2&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x8FD9;&#x4E2A;&#x65E9;&#x9910;&#x94FA;&#x80FD;&#x591F;&#x4FDD;&#x8BC1;&#x6301;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x4E24;&#x5144;&#x5F1F;&#x5546;&#x91CF;&#x51E0;&#x4E2A;&#x65B9;&#x6CD5;:</p>
<p>&#x65B9;&#x6CD5;&#x4E00;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5728;&#x5BB6;&#x7B49;&#x5019;&#xFF0C;&#x4E00;&#x65E6;&#x8001;&#x5927;&#x65E0;&#x6CD5;&#x505A;&#x751F;&#x610F;&#x4E86;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x51FA;&#x6765;&#x9876;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A; Active/Standby.&#xFF08;&#x53CC;&#x673A;&#x70ED;&#x5907;&#xFF09;</p>
<p>&#x65B9;&#x6CD5;&#x4E8C;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x5728;&#x65C1;&#x8FB9;&#x5E2E;&#x5DE5;&#xFF0C;&#x4E00;&#x65E6;&#x8001;&#x5927;&#x65E0;&#x6CD5;&#x505A;&#x751F;&#x610F;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x9A6C;&#x4E0A;&#x9876;&#x4E0A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;Active/Passive.&#xFF08;&#x53CC;&#x673A;&#x53CC;&#x5DE5;&#xFF09;</p>
<p>&#x65B9;&#x6CD5;&#x4E09;&#xFF1A;&#x5E73;&#x65F6;&#x8001;&#x5927;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x8001;&#x4E8C;&#x4E5F;&#x5728;&#x65C1;&#x8FB9;&#x5356;&#x8C46;&#x6D46;&#xFF0C;&#x8001;&#x5927;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x8001;&#x4E8C;&#x5C31;&#x53C8;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x53C8;&#x5356;&#x8C46;&#x6D46;&#xFF0C;&#x8001;&#x4E8C;&#x4E0D;&#x884C;&#x4E86;&#xFF0C;&#x8001;&#x5927;&#x5C31;&#x53C8;&#x5356;&#x5305;&#x5B50;&#xFF0C;&#x53C8;&#x5356;&#x8C46;&#x6D46;.&#x8FD9;&#x4E2A;&#x53EB;&#x505A;Active/Active (dual Active)&#xFF08;&#x53CC;&#x673A;&#x4E92;&#x5907;&#xFF09;</p>
<p>(&#x5305;&#x5B50;= application package, &#x4E92;&#x76F8;&#x7167;&#x5E94;&#x53EB;&#x505A;heartbeat, &#x9876;&#x66FF;&#x5BF9;&#x65B9;&#x5DE5;&#x4F5C;&#x53EB;&#x505A; failover/takeover. &#x5982;&#x679C;&#x4E24;&#x4E2A;&#x5144;&#x5F1F;&#x7A81;&#x7136;&#x90FD;&#x778E;&#x4E86;&#x804B;&#x4E86;&#xFF0C;&#x4E0D;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x5BF9;&#x65B9;&#x5230;&#x5E95;&#x662F;&#x5426;&#x6B63;&#x5728;&#x5E72;&#x6D3B;&#xFF0C;&#x90FD;&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x8981;&#x9876;&#x5BF9;&#x65B9;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;brain-split, &#x7136;&#x540E;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x8005;&#xFF0C;&#x6BD4;&#x5982;&#x4ED6;&#x4EEC;&#x7684;&#x8001;&#x7239;&#x6765;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;tier-breaker, &#x6216;&#x8005;&#x8BA9;&#x4ED6;&#x4EEC;&#x4E24;&#x4E2A;&#x7684;&#x5AB3;&#x5987;&#x8FC7;&#x6765;&#x62C9;&#x8D70;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EB;&#x505A;fency&#x3002;)</p>
<h4 id="high_computing_clustering&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#xFF09;">high computing clustering&#xFF08;&#x9AD8;&#x6027;&#x80FD;&#x8BA1;&#x7B97;&#x96C6;&#x7FA4;&#xFF09;</h4><p>10&#x4E2A;&#x5144;&#x5F1F;&#x4E00;&#x8D77;&#x505A;&#x624B;&#x5DE5;&#x5BB6;&#x5177;&#x751F;&#x610F;&#xFF0C;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x6765;&#x627E;&#x4ED6;&#x4EEC;&#x7684;&#x8001;&#x7239;&#x8981;&#x6C42;&#x505A;&#x4E00;&#x5957;&#x975E;&#x5E38;&#x590D;&#x6742;&#x7684;&#x4EFF;&#x53E4;&#x5BB6;&#x5177;&#xFF0C;&#x4E00;&#x4E2A;&#x4EBA;&#x505A;&#x4E5F;&#x53EF;&#x4EE5;&#x505A;&#xFF0C;&#x4E0D;&#x8FC7;&#x8981;&#x505A;&#x5F88;&#x4E45;&#x5F88;&#x4E45;&#xFF0C;&#x4E3A;&#x4E86;1&#x4E2A;&#x661F;&#x671F;&#x5C31;&#x4EA4;&#x51FA;&#x8FD9;&#x4E00;&#x5957;&#x5BB6;&#x5177;&#xFF0C;10&#x4E2A;&#x5144;&#x5F1F;&#x51B3;&#x5B9A;&#x4E00;&#x8D77;&#x505A;&#x3002;</p>
<p>&#x8001;&#x7239;&#x628A;&#x8FD9;&#x5957;&#x5BB6;&#x5177;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x5206;&#x5F00;&#x4EA4;&#x7ED9;&#x513F;&#x5B50;&#x4EEC;&#x4F5C;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x4E2A;&#x513F;&#x5B50;&#x90FD;&#x5728;&#x505A;&#x6728;&#x5236;&#x5BB6;&#x5177;&#x7684;&#x52A0;&#x5DE5;&#xFF0C;&#x6700;&#x540E;&#x62FC;&#x5728;&#x4E00;&#x8D77;&#x53EB;&#x8D27;&#x3002;</p>
<p>&#x8001;&#x7239;&#x662F;scheduler&#x4EFB;&#x52A1;&#x8C03;&#x5EA6;&#x5668;&#xFF0C;&#x513F;&#x5B50;&#x4EEC;&#x662F;compute node. &#x4ED6;&#x4EEC;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#x53EB;&#x505A;&#x4F5C;&#x4E1A;&#x3002;</p>
<p>&#xFF08;&#x5176;&#x5B9E;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#xFF0C;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x76F8;&#x5173;&#x7684;&#x96C6;&#x7FA4;&#xFF0C;&#x5E94;&#x7528;&#x4E8E;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x7F51;&#x7AD9;&#xFF0C;&#x4E91;&#x8BA1;&#x7B97;&#x5E73;&#x53F0;&#x7B49;&#x7B49;&#x3002;&#x6D89;&#x53CA;&#x70B9;&#x5B58;&#x50A8;&#x65B9;&#x9762;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x4ECB;&#x7ECD;&#x4E86;&#xFF09;</p>
<p>&#x4E25;&#x683C;&#x6765;&#x8BB2;&#xFF0C;&#x8FD9;&#x4E9B;&#x5DF2;&#x7ECF;&#x8D85;&#x8FC7;&#x4E86;&#x4E00;&#x822C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x77E5;&#x8BC6;&#x8303;&#x7574;&#x4E86;&#xFF0C;&#x60F3;&#x771F;&#x6B63;&#x7406;&#x89E3;&#x548C;&#x638C;&#x63E1;&#x8FD9;&#x4E9B;&#x5E76;&#x4E0D;&#x592A;&#x5BB9;&#x6613;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x9700;&#x8981;&#x771F;&#x6B63;&#x7684;&#x5B9E;&#x8DF5;&#x800C;&#x4E0D;&#x662F;&#x95ED;&#x95E8;&#x9020;&#x8F66;&#x3002;&#x4ECE;&#x8FD0;&#x7EF4;&#x4EBA;&#x5458;&#x548C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x5177;&#x5907;&#x4E30;&#x5BCC;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x914D;&#x7F6E;&#x548C;&#x7BA1;&#x7406;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x66F4;&#x8981;&#x5177;&#x5907;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x3001;&#x5B58;&#x50A8;&#x7B49;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#xFF08;&#x61C2;&#x7B97;&#x6CD5;&#x548C;&#x5E95;&#x5C42;&#x7684;&#x5C31;&#x66F4;&#x5B8C;&#x7F8E;&#x4E86;&#xFF09;&#x3002;&#x4ECE;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x548C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5E08;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x9700;&#x8981;&#x8003;&#x8651;&#x7684;&#x91CD;&#x70B9;&#x53C8;&#x4E0D;&#x540C;&#x4E86;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x8FDC;&#x8FDC;&#x4E0D;&#x6B62;&#x6211;&#x6240;&#x63D0;&#x5230;&#x7684;&#x8FD9;&#x4E9B;&#x3002;&#x73B0;&#x5728;&#x7684;Web&#x5E94;&#x7528;&#x4E00;&#x822C;&#x90FD;&#x6BD4;&#x8F83;&#x4F9D;&#x8D56;&#x4E8E;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x800C;&#x8D8A;&#x6765;&#x8D8A;&#x8131;&#x79BB;&#x4E86;&#x201D;&#x7EAF;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x201C;&#x7684;&#x672C;&#x8D28;&#x3002;&#x96C6;&#x7FA4;&#x4E0D;&#x662F;&#x4E07;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x786E;&#x5B9E;&#x76F8;&#x5F53;&#x6709;&#x7528;&#x3002;&#x7531;&#x4E8E;&#x9879;&#x76EE;&#x548C;&#x5DE5;&#x4F5C;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x672C;&#x4EBA;&#x76EE;&#x524D;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5FAE;&#x8F6F;&#x7684;&#x6280;&#x672F;&#x4F53;&#x7CFB;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x76EE;&#x524D;&#x5927;&#x90FD;&#x662F;&#x57FA;&#x4E8E;windows&#x5E73;&#x53F0;&#x7684;&#xFF09;&#x3002;&#x6709;&#x673A;&#x4F1A;&#x7684;&#x8BDD;&#xFF0C;&#x6211;&#x53EF;&#x4EE5;&#x5C06;&#x81EA;&#x5DF1;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5B9E;&#x8DF5;&#x5206;&#x4EAB;&#x51FA;&#x6765;&#xFF0C;&#x66F4;&#x5E0C;&#x671B;&#x6709;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x5728;&#x4E00;&#x5757;&#x5206;&#x4EAB;&#x548C;&#x4EA4;&#x6D41;&#x3002;</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/负载均衡/">负载均衡</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/01/f94ebcb/" title="大话重构 之 防止“加个需求，到处改代码” -">
  <strong>上一篇：</strong><br/>
  <span>
  大话重构 之 防止“加个需求，到处改代码” -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/01/f994031/"  title="ES6 的功能侦测库 ES-Checker -">
 <strong>下一篇：</strong><br/> 
 <span>ES6 的功能侦测库 ES-Checker -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-4"><a class="toc-link" href="#集群(Cluster)"><span class="toc-number">1.</span> <span class="toc-text">集群(Cluster)</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#负载均衡(Load_Balance)"><span class="toc-number">2.</span> <span class="toc-text">负载均衡(Load Balance)</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#大规模集群，通常具备以下一些特点："><span class="toc-number">3.</span> <span class="toc-text">大规模集群，通常具备以下一些特点：</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#load_balance_cluster（负载均衡集群）"><span class="toc-number">4.</span> <span class="toc-text">load balance cluster（负载均衡集群）</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#High_availability_cluster（高可用集群）"><span class="toc-number">5.</span> <span class="toc-text">High availability cluster（高可用集群）</span></a></li><li class="toc-item toc-level-4"><a class="toc-link" href="#high_computing_clustering（高性能计算集群）"><span class="toc-number">6.</span> <span class="toc-text">high computing clustering（高性能计算集群）</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>294</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
