
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="edwin jin dianzi blog">
<meta property="og:type" content="website">
<meta property="og:title" content="dianzi blog">
<meta property="og:url" content="http://taojinke.github.io/page/49/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="edwin jin dianzi blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="dianzi blog">
<meta name="twitter:description" content="edwin jin dianzi blog">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ae23aaf/" title="Qt 5.5 正式发布，完全支持 Windows 10 -" itemprop="url">Qt 5.5 正式发布，完全支持 Windows 10 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>Qt 5.5 &#x6B63;&#x5F0F;&#x53D1;&#x5E03;&#xFF01;&#x8FC7;&#x53BB;&#x7684; 6 &#x4E2A;&#x6708;&#x65F6;&#x95F4;&#xFF0C;&#x4FEE;&#x590D;&#x4E86; 1500 &#x4E2A;&#x62A5;&#x544A;&#x7684; Bug&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6027;&#x80FD;&#x6539;&#x8FDB;&#x3002;&#x540C;&#x65F6;&#x8FD8;&#x5B8C;&#x5584;&#x4E86;&#x8DE8;&#x5E73;&#x53F0;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x4E14;&#x4F18;&#x5316;&#x4E86;&#x591A;&#x5A92;&#x4F53;&#x548C;&#x84DD;&#x7259;&#x65B9;&#x9762;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="&#x5B8C;&#x5584;&#x8DE8;&#x5E73;&#x53F0;&#x529F;&#x80FD;">&#x5B8C;&#x5584;&#x8DE8;&#x5E73;&#x53F0;&#x529F;&#x80FD;</h3><ul>
<li>Windows&#xFF1A;Qt 5.5 &#x505A;&#x4E86;&#x5F88;&#x591A;&#x52AA;&#x529B;&#x6765;&#x652F;&#x6301; <a href="http://blog.qt.io/blog/2015/04/29/windows-10-support-in-qt/" target="_blank" rel="external">Windows 10</a> &#x3002;&#x4ECE; Qt 5.3 &#x5F00;&#x59CB;&#x5C31;&#x80FD;&#x5728; Windows 8 &#x65B0; WinRT APIs &#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x76F8;&#x4FE1;&#x6B64;&#x7248;&#x672C;&#x80FD;&#x5B8C;&#x5168;&#x652F;&#x6301; Windows 10&#x3002;</li>
<li>Linux&#xFF1A;Linux &#x5305;&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x80FD;&#x5728; <a href="http://blog.qt.io/blog/2015/06/24/qt-is-coming-to-red-hat-enterprise-linux/" target="_blank" rel="external">RedHat Enterprise Linux</a> &#x4E0A;&#x6784;&#x5EFA;&#xFF0C;&#x652F;&#x6301;&#x66F4;&#x591A;&#x7684; Linux &#x53D1;&#x884C;&#x7248; (&#x4ECE; RHEL 6.6 &#x5230; Ubuntu 15.04)&#x3002;</li>
<li>Mac OS X&#xFF1A;&#x540C;&#x65F6;&#x4E5F;&#x5BF9; Mac OS X &#x5E73;&#x53F0;&#x65B9;&#x9762;&#x505A;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6539;&#x8FDB;&#xFF0C;&#x5F53;&#x524D;&#x4F7F;&#x7528;&#x82F9;&#x679C;&#x7684;&#x5B89;&#x5168;&#x4F20;&#x8F93;&#x5C42;&#x6765;&#x5141;&#x8BB8; SSL &#x529F;&#x80FD;&#xFF0C;&#x652F;&#x6301;&#x84DD;&#x7259;&#x548C; Bluetooth LE&#xFF1B;&#x652F;&#x6301; Qt WebView&#xFF1B;&#x4FEE;&#x590D;&#x4E86; Qt Multimedia &#x7684;&#x5927;&#x91CF;&#x95EE;&#x9898;&#x3002;</li>
</ul>
<h3 id="Qt_5-5_&#x4E3B;&#x8981;&#x6539;&#x8FDB;">Qt 5.5 &#x4E3B;&#x8981;&#x6539;&#x8FDB;</h3><ol>
<li>&#x7B80;&#x5316;&#x4EA7;&#x54C1;&#x67B6;&#x6784;&#xFF0C;&#x63D0;&#x4F9B; 3 &#x4E2A;&#x7248;&#x672C;&#x7684; Qt&#xFF1A; </li>
</ol>
<ul>
<li><a href="http://www.qt.io/application-development/" target="_blank" rel="external">Qt &#x5E94;&#x7528;&#x5F00;&#x53D1;&#x7248;</a> &#x662F;&#x5546;&#x4E1A;&#x7248;&#x672C;&#xFF0C;&#x652F;&#x6301;&#x5728;&#x6240;&#x6709;&#x684C;&#x9762;&#x548C;&#x79FB;&#x52A8;&#x5E73;&#x53F0;&#x521B;&#x5EFA;&#x5E94;&#x7528;&#x3002;</li>
<li><a href="http://www.qt.io/qt-for-device-creation/" target="_blank" rel="external">Qt &#x8BBE;&#x5907;&#x521B;&#x5EFA;&#x7248;</a> &#x662F;&#x662F;&#x7B2C;&#x4E8C;&#x4E2A;&#x5546;&#x4E1A;&#x7248;&#x672C;&#xFF0C;&#x76EE;&#x6807;&#x662F;&#x5D4C;&#x5165;&#x5F0F;&#x8BBE;&#x5907;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x63D0;&#x4F9B;&#x5927;&#x91CF;&#x5DE5;&#x5177;&#x94FE;&#x3002;</li>
<li><a href="http://www.qt.io/qt-licensing-terms/" target="_blank" rel="external">Qt &#x5F00;&#x6E90;&#x7248;&#x672C;</a> &#x662F;&#x9075;&#x5FAA; LGPL 2.1/3 &#x6216;&#x8005; GPL &#x7684;&#x5F00;&#x6E90;&#x7248;&#x672C;</li>
</ul>
<h4 id="2-_&#x65B0;&#x529F;&#x80FD;">2. &#x65B0;&#x529F;&#x80FD;</h4><ul>
<li>&#x8DDF;&#x5F80;&#x5E38;&#x4E00;&#x6837;&#xFF0C;Qt 5.5 &#x7ED1;&#x5B9A;&#x4E86;&#x6700;&#x65B0;&#x7684; Qt Creator &#x7248;&#x672C;&#xFF0C;&#x8FD8;&#x6709;&#x5927;&#x91CF;&#x7684;&#x65B0;&#x529F;&#x80FD;&#xFF1A;</li>
<li>&#x5DF2;&#x7ECF;&#x652F;&#x6301; Bluetooth LE API&#xFF0C;&#x63D0;&#x4F9B;&#x5728; Android&#xFF0C;Mac OS X &#x548C; iOS &#x6216;&#x8005;&#x662F; Linux &#x73B0;&#x6709;&#x7684;&#x540E;&#x7AEF;&#x4E0A;&#xFF1B;</li>
<li>&#x6DFB;&#x52A0;&#x4E86; 2 &#x4E2A;&#x6A21;&#x5757;&#xFF08; <a href="http://doc.qt.io/qt-5/qtcanvas3d-index.html" target="_blank" rel="external">Qt Canva 3D</a> &#x548C; <a href="http://doc.qt.io/qt-5/qt3d-index.html" target="_blank" rel="external">Qt 3D</a> &#xFF09;&#x6765;&#x6269;&#x5C55; 3D APIs&#xFF0C;&#x5B8C;&#x5584;&#x56FE;&#x5F62;&#x5DE5;&#x5177;&#x5305;</li>
<li>&#x65B0;&#x589E;&#x6A21;&#x5757; Qt Location&#xFF08;&#x6280;&#x672F;&#x9884;&#x89C8;&#xFF09;</li>
<li>&#x6539;&#x8FDB; Qt Quick</li>
<li>&#x6539;&#x8FDB; Qt Multimedia</li>
<li>Qt WebEngine &#x66F4;&#x65B0;&#x81F3; Chromium 40 &#x7248;&#x672C;&#xFF0C;&#x6DFB;&#x52A0;&#x4E86;&#x65B0; API &#x6765;&#x7BA1;&#x7406;&#x4E0B;&#x8F7D;&#x6587;&#x4EF6;&#xFF0C;&#x7F13;&#x5B58;&#x63A7;&#x5236;&#xFF0C;cookies &#x548C;&#x8BBE;&#x7F6E;</li>
</ul>
<h4 id="3-_&#x5E9F;&#x5F03;&#x6A21;&#x5757;">3. &#x5E9F;&#x5F03;&#x6A21;&#x5757;</h4><ul>
<li>Qt WebKit, Qt Quick 1 &#x548C; Qt Script&#xFF1B;Qt 5.5 &#x8FD8;&#x4F1A;&#x7EE7;&#x7EED;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x6A21;&#x5757;&#xFF0C;&#x4F46;&#x662F;&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x7684;&#x66FF;&#x4EE3;&#x54C1;&#xFF1A;Qt WebEngine, Qt Quick &#x548C; Qt QML&#xFF0C;&#x8FD9;&#x4E9B;&#x80FD;&#x5B8C;&#x5168;&#x517C;&#x5BB9; JavaScript &#x5F15;&#x64CE;&#x3002;</li>
</ul>
<h4 id="4-_Qt_5-5_&#x5728;&#x7EBF;&#x7814;&#x8BA8;&#x4F1A;">4. Qt 5.5 &#x5728;&#x7EBF;&#x7814;&#x8BA8;&#x4F1A;</h4><p>&#x4E3A;&#x4E86;&#x8BA9;&#x5927;&#x5BB6;&#x66F4;&#x597D;&#x7684;&#x4E86;&#x89E3; Qt 5.5&#xFF0C;Qt &#x56E2;&#x961F;&#x8BA1;&#x5212;&#x5728; 7 &#x6708; 2 &#x65E5;&#x548C; 7 &#x6708; 3 &#x65E5;&#x4E3E;&#x884C;&#x4E24;&#x573A;&#x5728;&#x7EBF;&#x7814;&#x8BA8;&#x4F1A;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x53EF;&#x4EE5;&#x83B7;&#x53D6; Qt 5.5 &#x6700;&#x65B0;&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x8981;&#x786E;&#x4FDD;&#x5DF2;&#x7ECF;&#x6CE8;&#x518C;&#xFF1A; <a href="http://www.qt.io/webinar-qt5-5/" target="_blank" rel="external">http://www.qt.io/webinar-qt5-5/</a> &#x3002; </p>
<p>&#x66F4;&#x591A;&#x5185;&#x5BB9;&#x8BF7;&#x770B; <a href="http://blog.qt.io/blog/2015/07/01/qt-5-5-released/" target="_blank" rel="external"><strong>&#x53D1;&#x884C;&#x8BF4;&#x660E;</strong></a><strong>&#x3002;</strong></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Qt/">Qt</a><a href="/tags/Win10/">Win10</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ae36e4d/" title="Facebook人工智能负责人Yann LeCun谈深度学习的局限性 -" itemprop="url">Facebook人工智能负责人Yann LeCun谈深度学习的局限性 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> 6&#x6708;7&#x65E5;&#x5230;12&#x65E5;&#xFF0C;&#x4E16;&#x754C;&#x9876;&#x7EA7;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x4F1A;&#x8BAE;CVPR&#x5728;&#x7F8E;&#x56FD;&#x6CE2;&#x58EB;&#x987F;&#x53EC;&#x5F00;&#xFF0C;&#x4F1A;&#x8BAE;&#x9080;&#x8BF7;&#x4E86;Facebook&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B9E;&#x9A8C;&#x5BA4;&#x4E3B;&#x4EFB;&#x3001;NYU&#x6570;&#x636E;&#x79D1;&#x5B66;&#x4E2D;&#x5FC3;&#x521B;&#x59CB;&#x4EBA;&#x3001;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x754C;&#x7684;&#x6CF0;&#x6597; <a href="http://yann.lecun.com/" target="_blank" rel="external">Yann LeCun</a> &#x505A;&#x4E86;&#x9898;&#x4E3A;&#x201C;What&apos;s Wrong with Deep Learning?&#x201D;&#x7684;&#x4E3B;&#x9898;&#x62A5;&#x544A;&#x3002;&#x65E9;&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x672B;&#xFF0C;Yann LeCun&#x5C31;&#x4F5C;&#x4E3A;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x7684;&#x7814;&#x7A76;&#x5458;&#x5F00;&#x53D1;&#x51FA;&#x4E86;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x5927;&#x5E45;&#x5EA6;&#x63D0;&#x9AD8;&#x4E86;&#x624B;&#x5199;&#x5B57;&#x7B26;&#x7684;&#x8BC6;&#x522B;&#x80FD;&#x529B;&#xFF0C;&#x76EE;&#x524D;&#x7F8E;&#x56FD;&#x8BB8;&#x591A;&#x624B;&#x5199;&#x652F;&#x7968;&#x4F9D;&#x7136;&#x662F;&#x91C7;&#x7528;&#x4ED6;&#x7684;&#x65B9;&#x6CD5;&#x5728;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;&#x4E0A;&#x4E16;&#x7EAA;&#x672B;&#x5230;&#x672C;&#x4E16;&#x7EAA;&#x521D;&#xFF0C;&#x5F53;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5931;&#x5BA0;&#xFF0C;Yann LeCun&#x662F;&#x5C11;&#x6570;&#x51E0;&#x540D;&#x4E00;&#x76F4;&#x575A;&#x6301;&#x7814;&#x7A76;&#x7684;&#x79D1;&#x5B66;&#x5BB6;&#x4E4B;&#x4E00;&#x3002;&#x4ED6;&#x4E8E;2003&#x5E74;&#x6210;&#x4E3A;&#x7EBD;&#x7EA6;&#x5927;&#x5B66;&#x6559;&#x6388;&#xFF0C;&#x5728;2013&#x5E74;&#x5E95;&#x52A0;&#x5165;Facebook&#x8D1F;&#x8D23;&#x65B0;&#x6210;&#x7ACB;&#x7684;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF0C;&#x5E76;&#x4E00;&#x76F4;&#x5F15;&#x9886;&#x7740;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x53D1;&#x5C55;&#x3002; </p>
<p>&#x6700;&#x8FD1;&#x51E0;&#x5E74;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x81EA;&#x7136;&#x56FE;&#x50CF;&#x7406;&#x89E3;&#x548C;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x7B49;&#x591A;&#x4E2A;&#x9886;&#x57DF;&#x4EA7;&#x751F;&#x4E86;&#x6DF1;&#x8FDC;&#x7684;&#x5F71;&#x54CD;&#x3002;2006 &#x5E74;&#xFF0C;Geoffrey Hinton &#x63D0;&#x51FA;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x3002;&#x53D7;&#x76CA;&#x4E8E;&#x5927;&#x6570;&#x636E;&#x7684;&#x51FA;&#x73B0;&#x548C;&#x5927;&#x89C4;&#x6A21;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x63D0;&#x5347;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5DF2;&#x7136;&#x6210;&#x4E3A;&#x6700;&#x6D3B;&#x8DC3;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7814;&#x7A76;&#x9886;&#x57DF;&#x4E4B;&#x4E00;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x6982;&#x5FF5;&#x6E90;&#x4E8E; <a href="http://baike.baidu.com/view/19743.htm" target="_blank" rel="external">&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;</a> &#x7684;&#x7814;&#x7A76;&#x3002;&#x5728;Yann LeCun&#x7684;&#x62A5;&#x544A;&#x4E2D;&#xFF0C; <a href="http://en.wikipedia.org/wiki/Yann_LeCun" target="_blank" rel="external">&#x4ED6;</a> &#x9996;&#x5148;&#x56DE;&#x987E;&#x4E86;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E5F;&#x4ECB;&#x7ECD;&#x4E86;&#x4EBA;&#x5DE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x65B9;&#x6CD5;&#x5728;&#x5B57;&#x7B26;&#x8BC6;&#x522B;&#x3001;&#x76EE;&#x6807;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x3001;&#x8BED;&#x4E49;&#x5206;&#x5272;&#x7B49;&#x9886;&#x57DF;&#x6240;&#x53D6;&#x5F97;&#x7684;&#x6210;&#x529F;&#x5E94;&#x7528;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#xFF0C;&#x4ED6;&#x66F4;&#x591A;&#x7684;&#x6307;&#x51FA;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6240;&#x9762;&#x4E34;&#x7684;&#x8BF8;&#x591A;&#x7684;&#x5C40;&#x9650;&#x6027;&#x3002; </p>
<p>&#x9996;&#x5148;&#xFF0C;&#x7F3A;&#x4E4F;&#x7406;&#x8BBA;&#x652F;&#x6301;&#x3002;&#x5BF9;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x67B6;&#x6784;&#xFF0C;&#x5B58;&#x5728;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x7591;&#x95EE;&#xFF0C;&#x5377;&#x79EF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E3A;&#x4EC0;&#x4E48;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x67B6;&#x6784;&#xFF08;&#x4E8B;&#x5B9E;&#x4E0A;&#x5176;&#x5B58;&#x5728;&#x68AF;&#x5EA6;&#x6563;&#x5C04;&#x7B49;&#x7F3A;&#x70B9;&#xFF09;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x7ED3;&#x6784;&#x9700;&#x8981;&#x591A;&#x5C11;&#x9690;&#x5C42;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5377;&#x79EF;&#x7F51;&#x7EDC;&#x4E2D;&#x5230;&#x5E95;&#x9700;&#x8981;&#x591A;&#x5C11;&#x6709;&#x6548;&#x7684;&#x53C2;&#x6570;&#xFF08;&#x5F88;&#x591A;&#x6743;&#x91CD;&#x76F8;&#x4E92;&#x4E4B;&#x95F4;&#x4F3C;&#x4E4E;&#x90FD;&#x5B58;&#x5728;&#x5197;&#x4F59;&#xFF09;&#xFF0C;&#x968F;&#x673A;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x65B9;&#x6CD5;&#x4F18;&#x5316;&#x6743;&#x91CD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x503C;&#x3002;&#x867D;&#x7136;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x5F88;&#x591A;&#x5B9E;&#x9645;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x53D6;&#x5F97;&#x4E86;&#x7A81;&#x51FA;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E00;&#x76F4;&#x56F0;&#x6270;&#x7740;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5E38;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x9ED1;&#x76D2;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7684;&#x7ED3;&#x8BBA;&#x786E;&#x8BA4;&#x90FD;&#x7531;&#x7ECF;&#x9A8C;&#x800C;&#x975E;&#x7406;&#x8BBA;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x4E0D;&#x7BA1;&#x662F;&#x4E3A;&#x4E86;&#x6784;&#x5EFA;&#x66F4;&#x597D;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD8;&#x662F;&#x4E3A;&#x4E86;&#x63D0;&#x4F9B;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x90FD;&#x8FD8;&#x9700;&#x8981;&#x66F4;&#x5B8C;&#x5584;&#x7684;&#x7406;&#x8BBA;&#x652F;&#x6491;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x7F3A;&#x4E4F;&#x63A8;&#x7406;&#x80FD;&#x529B;&#x3002;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7F3A;&#x4E4F;&#x8868;&#x8FBE; <a href="https://zh.wikipedia.org/wiki/%25E5%259B%25A0%25E6%259E%259C%25E5%2585%25B3%25E7%25B3%25BB" target="_blank" rel="external">&#x56E0;&#x679C;&#x5173;&#x7CFB;</a> &#x7684;&#x624B;&#x6BB5;&#xFF0C;&#x7F3A;&#x4E4F;&#x8FDB;&#x884C; <a href="https://zh.wikipedia.org/wiki/%25E9%2580%25BB%25E8%25BE%2591%25E6%258E%25A8%25E7%2590%2586" target="_blank" rel="external">&#x903B;&#x8F91;&#x63A8;&#x7406;</a> &#x7684;&#x65B9;&#x6CD5;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x79CD;&#x5178;&#x578B;&#x65B9;&#x6CD5;&#x662F;&#x5C06; &#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E0E;&#x7ED3;&#x6784;&#x5316;&#x9884;&#x6D4B; &#x76F8;&#x7ED3;&#x5408;&#x3002;&#x76EE;&#x524D;&#x51E0;&#x4E2A;&#x5E26;&#x6709;&#x7ED3;&#x6784;&#x5316;&#x9884;&#x6D4B;&#x6A21;&#x5757;&#x7684;&#x589E;&#x5F3A;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#x5DF2;&#x7ECF;&#x88AB;&#x63D0;&#x51FA;&#x6765;&#x7528;&#x4E8E;OCR&#xFF0C;&#x8EAB;&#x4F53;&#x59FF;&#x6001;&#x68C0;&#x6D4B;&#xFF0C;&#x548C;&#x8BED;&#x4E49;&#x5206;&#x5272;&#x7B49;&#x4EFB;&#x52A1;&#x4E2D;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x66F4;&#x591A;&#x65B0;&#x7684;&#x601D;&#x8DEF;&#x5E94;&#x8BE5;&#x88AB;&#x63D0;&#x51FA;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x9700;&#x8981;&#x590D;&#x6742;&#x63A8;&#x7406;&#x7684;&#x4EFB;&#x52A1;&#x4E2D;&#x3002;&#x5C3D;&#x7BA1;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x548C;&#x7B80;&#x5355;&#x63A8;&#x7406;&#x5DF2;&#x7ECF;&#x5E94;&#x7528;&#x4E8E;&#x8BED;&#x97F3;&#x548C;&#x624B;&#x5199;&#x5B57;&#x8BC6;&#x522B;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x4ECD;&#x9700;&#x8981;&#x5728;&#x5927;&#x7684;&#x5411;&#x91CF;&#x4E0A;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x8303;&#x5F0F;&#x6765;&#x4EE3;&#x66FF;&#x57FA;&#x4E8E;&#x89C4;&#x5219;&#x7684;&#x5B57;&#x7B26;&#x8868;&#x8FBE;&#x5F0F;&#x64CD;&#x4F5C;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x90A3;&#x4E9B;&#x7ED3;&#x5408;&#x4E86;&#x590D;&#x6742;&#x63A8;&#x7406;&#x548C;&#x8868;&#x793A;&#x5B66;&#x4E60;&#x7684;&#x7CFB;&#x7EDF;&#x5C06;&#x4E3A;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5E26;&#x6765;&#x5DE8;&#x5927;&#x7684;&#x8FDB;&#x6B65;&#x3002; </p>
<p>&#x7B2C;&#x4E09;&#xFF0C;&#x7F3A;&#x4E4F;&#x77ED;&#x65F6;&#x8BB0;&#x5FC6;&#x80FD;&#x529B;&#x3002;&#x4EBA;&#x7C7B;&#x7684;&#x5927;&#x8111;&#x6709;&#x7740;&#x60CA;&#x4EBA;&#x7684;&#x8BB0;&#x5FC6;&#x529F;&#x80FD;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x4EC5;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x4E2A;&#x4F53;&#x6848;&#x4F8B;&#xFF0C;&#x66F4;&#x80FD;&#x5206;&#x6790;&#x8F93;&#x5165;&#x4FE1;&#x606F;&#x4E4B;&#x95F4;&#x7684;&#x6574;&#x4F53;&#x903B;&#x8F91;&#x5E8F;&#x5217;&#x3002;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x5E8F;&#x5217;&#x5BCC;&#x542B;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4FE1;&#x606F;&#x5F7C;&#x6B64;&#x95F4;&#x6709;&#x7740;&#x590D;&#x6742;&#x7684;&#x65F6;&#x95F4;&#x5173;&#x8054;&#x6027;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x7684;&#x8BB8;&#x591A;&#x4EFB;&#x52A1;&#xFF08;&#x4F8B;&#x5982;&#x95EE;&#x7B54;&#x7CFB;&#x7EDF;&#xFF09;&#x4E2D;&#x9700;&#x8981;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x6765;&#x4E34;&#x65F6;&#x5B58;&#x50A8;&#x5206;&#x9694;&#x7684;&#x7247;&#x6BB5;&#xFF0C;&#x6B63;&#x786E;&#x89E3;&#x91CA;&#x89C6;&#x9891;&#x4E2D;&#x7684; &#x4E8B;&#x4EF6; &#x5E76;&#x80FD;&#x591F;&#x56DE;&#x7B54;&#x6709;&#x5173;&#x5B83;&#x7684;&#x95EE;&#x9898;&#x9700;&#x8981;&#x8BB0;&#x4F4F;&#x7684;&#x89C6;&#x9891;&#x4E2D;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x7684;&#x62BD;&#x8C61;&#x8868;&#x793A;&#x3002;&#x5305;&#x62EC;&#x9012;&#x5F52;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5728;&#x5185;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7CFB;&#x7EDF;&#xFF0C;&#x90FD;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x5730;&#x5B58;&#x50A8;&#x591A;&#x4E2A;&#x65F6;&#x95F4;&#x5E8F;&#x5217;&#x4E0A;&#x7684;&#x8BB0;&#x5FC6;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x63D0;&#x51FA;&#x5728;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x4E2D;&#x589E;&#x52A0;&#x72EC;&#x7ACB;&#x7684;&#x8BB0;&#x5FC6;&#x6A21;&#x5757;&#xFF0C;&#x5982;LSTM&#xFF0C;&#x8BB0;&#x5FC6;&#x7F51;&#x7EDC;&#xFF08;Memory Networks&#xFF09;&#xFF0C;&#x795E;&#x7ECF;&#x56FE;&#x7075;&#x673A;&#xFF08;Neural Turing Machines&#xFF09;&#xFF0C;&#x548C;Stack&#x589E;&#x5F3A;RNN&#xFF08;stack-Augmented RNN&#xFF09;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5F88;&#x6709;&#x610F;&#x601D;&#xFF0C;&#x4E5F;&#x53D6;&#x5F97;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x6210;&#x679C;&#xFF0C;&#x4F46;&#x5728;&#x672A;&#x6765;&#x4ECD;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x65B0;&#x7684;&#x601D;&#x8DEF;&#x3002; </p>
<p>&#x6700;&#x540E;&#xFF0C;&#x7F3A;&#x4E4F;&#x6267;&#x884C;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7684;&#x80FD;&#x529B;&#x3002;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x5728;&#x4EBA;&#x7C7B;&#x548C;&#x52A8;&#x7269;&#x7684;&#x5B66;&#x4E60;&#x4E2D;&#x5360;&#x636E;&#x4E3B;&#x5BFC;&#x5730;&#x4F4D;&#xFF0C;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x89C2;&#x5BDF;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x4E16;&#x754C;&#x7684;&#x5185;&#x5728;&#x7ED3;&#x6784;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x88AB;&#x544A;&#x77E5;&#x6BCF;&#x4E00;&#x4E2A;&#x5BA2;&#x89C2;&#x4E8B;&#x7269;&#x7684;&#x540D;&#x79F0;&#x3002;&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x9886;&#x57DF;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x590D;&#x5174;&#x6070;&#x6070;&#x662F;&#x5728;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x53D6;&#x5F97;&#x4E0D;&#x65AD;&#x8FDB;&#x5EA6;&#x7684;2000s&#x4E2D;&#x671F;&#xFF0C;&#x867D;&#x7136;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x7279;&#x5B9A;&#x7684;&#x6DF1;&#x5EA6;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x201C;&#x9884;&#x8BAD;&#x7EC3;&#x201D;&#xFF0C;&#x4F46;&#x6700;&#x7EC8;&#x7EDD;&#x5927;&#x90E8;&#x5206;&#x80FD;&#x591F;&#x5E94;&#x7528;&#x4E8E;&#x5B9E;&#x8DF5;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x90FD;&#x662F;&#x4F7F;&#x7528;&#x7EAF;&#x7CB9;&#x7684;&#x6709;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x3002;&#x8FD9;&#x5E76;&#x4E0D;&#x80FD;&#x4EE3;&#x8868;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x5728;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E2D;&#x6CA1;&#x6709;&#x4F5C;&#x7528;&#xFF0C;&#x53CD;&#x800C;&#x5177;&#x6709;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6F5C;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x62E5;&#x6709;&#x7684;&#x975E;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x6BD4;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x591A;&#x5F97;&#x591A;&#xFF0C;&#x53EA;&#x662F;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x627E;&#x5230;&#x5F88;&#x5408;&#x9002;&#x7684;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x5728;&#x672A;&#x6765;&#x5B58;&#x5728;&#x5DE8;&#x5927;&#x7684;&#x7814;&#x7A76;&#x7A7A;&#x95F4;&#x3002;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x4ECA;&#x540E;&#x8BA1;&#x7B97;&#x673A;&#x89C6;&#x89C9;&#x7684;&#x8FDB;&#x6B65;&#x6709;&#x8D56;&#x4E8E;&#x5728;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x4E0A;&#x53D6;&#x5F97;&#x7A81;&#x7834;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5BF9;&#x4E8E;&#x89C6;&#x9891;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x8BA9;&#x90A3;&#x4E9B;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x5904;&#x7406;&#x5C42;&#x7684;&#x8BA1;&#x7B97;&#x6A21;&#x578B;&#x6765;&#x5B66;&#x4E60;&#x5177;&#x6709;&#x591A;&#x5C42;&#x6B21;&#x62BD;&#x8C61;&#x7684;&#x6570;&#x636E;&#x7684;&#x8868;&#x793A;&#x3002;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#x5728;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#x90FD;&#x5E26;&#x6765;&#x4E86;&#x663E;&#x8457;&#x7684;&#x6539;&#x5584;&#xFF0C;&#x5305;&#x62EC;&#x6700;&#x5148;&#x8FDB;&#x7684;&#x8BED;&#x97F3;&#x8BC6;&#x522B;&#x3001;&#x89C6;&#x89C9;&#x5BF9;&#x8C61;&#x8BC6;&#x522B;&#x3001;&#x5BF9;&#x8C61;&#x68C0;&#x6D4B;&#x4EE5;&#x53CA;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x9886;&#x57DF;&#xFF0C;&#x4F8B;&#x5982;&#x836F;&#x7269;&#x53D1;&#x73B0;&#x548C;&#x57FA;&#x56E0;&#x7EC4;&#x5B66;&#x7B49;&#x3002;&#x5F53;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x4E1A;&#x754C;&#x6380;&#x8D77;&#x4E00;&#x7247;&#x7E41;&#x8363;&#x666F;&#x8C61;&#x7684;&#x65F6;&#x5019;&#xFF0C; <a href="http://en.wikipedia.org/wiki/Yann_LeCun" target="_blank" rel="external">Yann LeCun</a> &#x7684;&#x62A5;&#x544A;&#x5728;&#x6700;&#x6070;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x4E3A;&#x6211;&#x4EEC;&#x6307;&#x51FA;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5F53;&#x524D;&#x6240;&#x9762;&#x4E34;&#x7684;&#x5C40;&#x9650;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4E3A;&#x5927;&#x91CF;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x6307;&#x660E;&#x4E86;&#x672A;&#x6765;&#x9700;&#x8981;&#x653B;&#x514B;&#x7684;&#x65B9;&#x5411;&#x3002; </p>
<p>&#x503C;&#x5F97;&#x8865;&#x5145;&#x7684;&#x662F;&#xFF0C;&#x4E3A;&#x7EAA;&#x5FF5;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x63D0;&#x51FA;60&#x5468;&#x5E74;&#xFF0C;&#x300A;Nature&#x300B;&#x6742;&#x5FD7;&#x5728;2015&#x5E74;5&#x6708;28&#x65E5;&#x4E13;&#x95E8;&#x5F00;&#x8F9F;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD; + &#x673A;&#x5668;&#x4EBA;&#x201D;&#x4E13;&#x9898;&#xFF0C;&#x53D1;&#x8868;&#x591A;&#x7BC7;&#x76F8;&#x5173;&#x8BBA;&#x6587;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x62EC;&#x4E86;Yann LeCun&#x3001;Yoshua Bengio&#x548C;Geoffrey Hinton&#x9996;&#x6B21;&#x5408;&#x4F5C;&#x7684;&#x7EFC;&#x8FF0;&#x6027;&#x6587;&#x7AE0; &#x201C; <a href="http://www.nature.com/nature/journal/v521/n7553/full/nature14539.html" target="_blank" rel="external">Deep Learning</a> &#x201D;&#x3002;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x4E86;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x57FA;&#x672C;&#x539F;&#x7406;&#x548C;&#x6838;&#x5FC3;&#x4F18;&#x52BF;&#xFF0C;&#x6700;&#x540E;&#x8C08;&#x5230;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x7684;&#x672A;&#x6765;&#x65B9;&#x5411;&#xFF1A;1&#xFF09;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF1B;2&#xFF09;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5728;&#x673A;&#x5668;&#x89C6;&#x89C9;&#x548C;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#x7406;&#x89E3;&#x4E0A;&#x7684;&#x7A81;&#x7834;&#xFF1B;3&#xFF09;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E0E;&#x590D;&#x6742;&#x63A8;&#x7406;&#x7684;&#x7ED3;&#x5408;&#x3002;&#x8FD9;&#x4E5F;&#x6B63;&#x597D;&#x5951;&#x5408;&#x4E86;Yann LeCun&#x5728;&#x62A5;&#x544A;&#x4E2D;&#x6240;&#x8C08;&#x5230;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6240;&#x9762;&#x4E34;&#x7684;&#x5C40;&#x9650;&#x6027;&#x3002; </p>
<p>Yann LeCun&#x5728;CVPR 2015&#x4E0A;&#x5173;&#x4E8E;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5C40;&#x9650;&#x6027;&#x7684;&#x62A5;&#x544A;&#x89C1; <a href="http://download.csdn.net/detail/hhlw1000/8836557" target="_blank" rel="external">&#x8FD9;&#x91CC;</a> &#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x5728; <a href="https://news.ycombinator.com/item?id=9714199" target="_blank" rel="external">Hacker News</a> &#x4E0A;&#x53C2;&#x4E0E;&#x76F8;&#x5173;&#x7684;&#x8BA8;&#x8BBA;&#x3002; </p>
<p>&#x611F;&#x8C22;&#x5F90;&#x5DDD;&#x5BF9;&#x672C;&#x6587;&#x7684;&#x5BA1;&#x6821;&#x3002; </p>
<p>&#x7ED9;InfoQ&#x4E2D;&#x6587;&#x7AD9;&#x6295;&#x7A3F;&#x6216;&#x8005;&#x53C2;&#x4E0E;&#x5185;&#x5BB9;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x90AE;&#x4EF6;&#x81F3;editors@cn.infoq.com&#x3002;&#x4E5F;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#xFF08;@InfoQ&#xFF0C;@&#x4E01;&#x6653;&#x6600;&#xFF09;&#xFF0C;&#x5FAE;&#x4FE1;&#xFF08;&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; <a href="http://weixin.sogou.com/gzh?openid=oIWsFt0HnZ93MfLi3pW2ggVJFRxY" target="_blank" rel="external">InfoQChina</a> &#xFF09;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x7F16;&#x8F91;&#x548C;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#xFF08;&#x6B22;&#x8FCE;&#x52A0;&#x5165;InfoQ&#x8BFB;&#x8005;&#x4EA4;&#x6D41;&#x7FA4; </p>
<p><img src="http://taojinke.github.io/img/20150702/ae35d36.png" alt="InfoQ&#x597D;&#x8BFB;&#x8005;"></p>
<p>&#xFF09;&#x3002; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Deep-Learning/">Deep Learning</a><a href="/tags/人工智能/">人工智能</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ae1b6d9/" title="苹果发布iOS和OS X新版本，近百个漏洞打了安全补丁 -" itemprop="url">苹果发布iOS和OS X新版本，近百个漏洞打了安全补丁 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><img src="http://taojinke.github.io/img/20150702/ae1aaa4.jpg" alt=""></p>
<p>&#x82F9;&#x679C;&#x53D1;&#x5E03;&#x4E86;iOS&#x548C;OS&#xA0;X&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x66F4;&#x65B0;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5B89;&#x5168;&#x8865;&#x4E01;&#xFF0C;&#x6765;&#x4FEE;&#x8865;&#x4E00;&#x4E9B;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#xFF0C;&#x6BD4;&#x5982;&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x8FDC;&#x7A0B;&#x5BC6;&#x5319;&#x64CD;&#x63A7;&#x7684;&#x8865;&#x4E01;&#x3002;</p>
<p>iOS&#xA0;8.4&#x4FEE;&#x8865;&#x4E86;&#x8D85;&#x8FC7;30&#x4E2A;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#xFF0C;&#x5305;&#x62EC;iOS&#x7684;&#x5185;&#x6838;&#xFF0C;&#x5F00;&#x53D1;&#x5305;&#x548C;&#x5176;&#x6838;&#x5FC3;&#x6587;&#x672C;&#x4E0A;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x6F0F;&#x6D1E;&#x4FEE;&#x8865;&#x8FD8;&#x63D0;&#x9AD8;&#x4E86;&#x5176;&#x9632;&#x5FA1;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7CFB;&#x7EDF;&#x7684;&#x5BC6;&#x5319;&#x906D;&#x5230;&#x653B;&#x51FB;&#x548C;&#x7A83;&#x53D6;&#x3002;&#x4E3A;&#x4E86;&#x4FEE;&#x8865;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#xFF0C;&#x82F9;&#x679C;&#x8FD8;&#x53D1;&#x5E03;&#x4E86;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;TLS&#x7EC4;&#x4EF6;&#x7684;&#x8865;&#x4E01;&#x3002;</p>
<p>&#x6838;&#x5FC3;TLS&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x77ED;&#x7684;DH&#x5BC6;&#x5319;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BC6;&#x5319;&#x7528;&#x4E8E;DH&#x5BC6;&#x5319;&#x5957;&#x95F4;&#x91CC;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x652F;&#x6301;DH&#x5BC6;&#x5319;&#x5957;&#x4EF6;&#x7684;&#x8BDD;&#xFF0C;&#x80FD;&#x52A0;&#x5BC6;&#x81EA;&#x8EAB;&#x7F51;&#x7EDC;&#x4F4D;&#x7F6E;&#x7684;&#x9ED1;&#x5BA2;&#x4FBF;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5C06;&#x5B89;&#x5168;&#x9632;&#x5FA1;&#x964D;&#x4E3A;512-bit&#xA0;DH&#x3002;&#x82F9;&#x679C;&#x7684;&#x62A5;&#x544A;&#x663E;&#x793A;&#xFF0C;&#x8FD9;&#x4E00;&#x8865;&#x4E01;&#x53EF;&#x4EE5;&#x4F7F;DH&#x5BC6;&#x5319;&#x5957;&#x4EF6;&#x5347;&#x7EA7;&#x5230;768&#xA0;bits&#x3002;</p>
<p>&#x82F9;&#x679C;&#x8FD8;&#x4FEE;&#x590D;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x90A3;&#x5C31;&#x662F;iOS&#x5904;&#x7406;&#x6765;&#x81EA;SIM&#x5361;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x8BA9;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x7279;&#x5236;&#x4E00;&#x5F20;&#x6076;&#x610F;&#x7684;SIM&#x5E76;&#x5BF9;&#x76EE;&#x6807;&#x8BBE;&#x5907;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x64CD;&#x63A7;&#x3002;</p>
<p>iOS&#xA0;8.4&#x4FEE;&#x8865;&#x7684;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#x4E2D;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x662F;&#x5F00;&#x53D1;&#x5305;&#x4E2D;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x6076;&#x610F;&#x7684;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x4E24;&#x4F8B;&#x4E3A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x5D29;&#x6E83;&#x7684;&#x6F0F;&#x6D1E;&#x548C;&#x5904;&#x7406;&#x4E00;&#x4E9B;SQL&#x529F;&#x80FD;&#x65F6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x201C;SQLite&#x6388;&#x6743;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4E0D;&#x8DB3;&#x5BFC;&#x81F4;SQL&#x529F;&#x80FD;&#x88AB;&#x968F;&#x610F;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x901A;&#x8FC7;&#x65B0;&#x7684;&#x6388;&#x6743;&#x68C0;&#x67E5;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x201D;&#x82F9;&#x679C;&#x7684;&#x62A5;&#x544A;&#x4E2D;&#x8BF4;&#x9053;&#x3002;</p>
<p>&#x5728;&#x6700;&#x65B0;&#x7684;iOS&#x7248;&#x672C;&#x4E2D;&#x8FD8;&#x4FEE;&#x8865;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x8BA9;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x7528;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x6765;&#x66FF;&#x6362;&#x5408;&#x6CD5;&#x8F6F;&#x4EF6;&#x3002;&#x5B83;&#x662F;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5168;&#x5C40;&#x6982;&#x8981;&#x6587;&#x4EF6;&#x914D;&#x7F6E;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6B64;&#x6F0F;&#x6D1E;&#x5BF9;Apple&#xA0;Pay&#x8FDB;&#x884C;&#x66FF;&#x6362;&#x3002;FireEye&#x7684;&#x7814;&#x7A76;&#x8005;&#x5728;&#x4E00;&#x5E74;&#x524D;&#x5C31;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5E76;&#x4E0A;&#x62A5;&#x7ED9;&#x4E86;&#x82F9;&#x679C;&#x3002;</p>
<p>&#x201C;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;Manifest&#xA0;Masque&#xA0;Attack&#x7684;&#x6076;&#x610F;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;CVE-2015-3722/3725&#x6F0F;&#x6D1E;&#x6765;&#x7834;&#x574F;iOS&#x4E0A;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5F53;&#x4F60;&#x901A;&#x8FC7;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x5B89;&#x88C5;&#x6765;&#x81EA;&#x7F51;&#x7AD9;&#x7684;&#x4F01;&#x4E1A;&#x670D;&#x52A1;&#x7684;&#x5185;&#x90E8;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x5C31;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x653B;&#x51FB;&#x3002;&#x5BB9;&#x6613;&#x88AB;&#x7834;&#x574F;&#x7684;&#x8F6F;&#x4EF6;&#x4E0D;&#x4F46;&#x5305;&#x62EC;&#x4F60;&#x5728;&#x5B98;&#x65B9;&#x7684;App&#xA0;Store&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x666E;&#x901A;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x82F9;&#x679C;&#x81EA;&#x5BB6;&#x7684;&#x91CD;&#x8981;&#x7CFB;&#x7EDF;&#x81EA;&#x5E26;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;Apple&#xA0;Watch&#xFF0C;Apple&#xA0;Pay&#xFF0C;App&#xA0;Store&#xFF0C;Safari&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x8BBE;&#x7F6E;&#x7B49;&#x3002;&#x53D7;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5F71;&#x54CD;&#x7684;&#x662F;&#x642D;&#x8F7D;iOS&#xA0;7&#x5230;iOS8.4&#x4E4B;&#x95F4;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x5907;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x6B21;&#x53D1;&#x73B0;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5E76;&#x544A;&#x77E5;&#x82F9;&#x679C;&#x5B9E;&#x5728;2014&#x5E74;&#x516B;&#x6708;&#x3002;&#x201D;FireEye&#x7684;&#x7814;&#x7A76;&#x8005;&#x5728;&#x4E00;&#x4EFD;&#x62A5;&#x544A;&#x4E2D;&#x5199;&#x9053;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;OS&#xA0;X&#x6765;&#x8BF4;&#xFF0C;&#x82F9;&#x679C;&#x4FEE;&#x8865;&#x7684;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#x540C;&#x6837;&#x4E5F;&#x5B58;&#x5728;&#x4E8E;iOS&#x4E0A;&#xFF0C;&#x6F0F;&#x6D1E;&#x603B;&#x6570;&#x91CF;&#x8FBE;&#x5230;&#x4E86;75&#x4E2A;&#x3002;OS&#xA0;X10.10.4&#x4FEE;&#x8865;&#x4E86;&#x82F1;&#x7279;&#x5C14;&#x56FE;&#x5F62;&#x9A71;&#x52A8;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x7F13;&#x5B58;&#x533A;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x53EF;&#x80FD;&#x4F1A;&#x906D;&#x5230;&#x8FDC;&#x7A0B;&#x4EE3;&#x7801;&#x64CD;&#x63A7;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FDC;&#x7A0B;&#x4EE3;&#x7801;&#x64CD;&#x63A7;&#xFF0C;&#x82F9;&#x679C;&#x8FD8;&#x4FEE;&#x8865;&#x4E86;QuickTime&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x5D29;&#x6E83;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x82F9;&#x679C;&#x8FD8;&#x540C;&#x65F6;&#x5BF9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8BC1;&#x4E66;&#x4FE1;&#x4EFB;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x4E86;&#x5347;&#x7EA7;&#xFF0C;&#x7528;&#x4EE5;&#x89E3;&#x51B3;CNNIC&#x8BA4;&#x8BC1;&#x95EE;&#x9898;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Apple/">Apple</a><a href="/tags/Mac-OS-X/">Mac OS X</a><a href="/tags/iOS/">iOS</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ae13574/" title="devexpress表格控件gridcontrol特殊应用（一）——实现禁用特定行（附源代码） -" itemprop="url">devexpress表格控件gridcontrol特殊应用（一）——实现禁用特定行（附源代码） -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x9700;&#x8981;&#x7981;&#x7528;&#x7279;&#x5B9A;&#x884C;&#x3002;&#x8FD9;&#x65F6;&#x5019;gridcontrol&#x7684;&#x4E00;&#x822C;&#x5C5E;&#x6027;&#x662F;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#x7684;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x66F4;&#x6539;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x53BB;devexpress&#x5B98;&#x7F51;&#x4E2D;&#x627E;&#x5BFB;&#x4E9B;&#x8D44;&#x6599;&#xFF08;&#x5B98;&#x7F51;<a href="https://www.devexpress.com&#xFF09;&#xFF0C;&#x672C;&#x6587;&#x6848;&#x4F8B;&#x6E90;&#x81EA;&#x5B98;&#x7F51;&#x53C2;&#x8003;&amp;#x3002" target="_blank" rel="external">https://www.devexpress.com&#xFF09;&#xFF0C;&#x672C;&#x6587;&#x6848;&#x4F8B;&#x6E90;&#x81EA;&#x5B98;&#x7F51;&#x53C2;&#x8003;&amp;#x3002</a>;</p>
<p>1&#x3001;&#x7981;&#x7528;&#x7279;&#x5B9A;&#x884C;&#x7684;&#x6548;&#x679C;&#x56FE;:</p>
<p><img src="http://taojinke.github.io/img/20150702/ae115b7.png" alt=""></p>
<p>&#x8FD0;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x5212;&#x5220;&#x9664;&#x7EBF;&#x7684;&#x884C;&#x4E3A;&#x7981;&#x7528;&#x884C;&#xFF0C;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x7B49;&#x64CD;&#x4F5C;&#x3002;</p>
<p>2&#x3001;&#x7ED1;&#x5B9A;&#x6570;&#x636E;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>DataTable tbl = new DataTable<span class="params">()</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;Name&amp;quot;, typeof<span class="params">(string)</span>)</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;ID&amp;quot;, typeof<span class="params">(int)</span>)</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;Number&amp;quot;, typeof<span class="params">(int)</span>)</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;Date&amp;quot;, typeof<span class="params">(DateTime)</span>)</span>;
            <span class="keyword">for</span> <span class="params">(int i = <span class="number">0</span>; i &amp;lt; RowCount; i++)</span>
                tbl.Rows.Add<span class="params">(new object[] { String.Format<span class="params">(&amp;quot;Name{<span class="number">0</span>}&amp;quot;, i)</span>, i, <span class="number">3</span> - i, DateTime.Now.AddDays<span class="params">(i)</span> })</span>;
            return tbl;
</code></pre><p>3&#x3001;&#x6E90;&#x4EE3;&#x7801;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#xFF1A;<a href="http://download.csdn.net/detail/kehaigang29/8859781" target="_blank" rel="external">http://download.csdn.net/detail/kehaigang29/8859781</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/DevExpress/">DevExpress</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ae30a34/" title="Rust编程语言发布1.1稳定版 -" itemprop="url">Rust编程语言发布1.1稳定版 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> Rust&#x662F;&#x4E00;&#x4E2A;&#x7531;Mozilla&#x4E3B;&#x5BFC;&#x5F00;&#x53D1;&#x7684;&#x5B9E;&#x9A8C;&#x6027;&#x8DE8;&#x5E73;&#x53F0;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x3002;&#x5B83;&#x7684;&#x8BBE;&#x8BA1;&#x51C6;&#x5219;&#x4E3A;&#x201C;&#x5B89;&#x5168;&#x3001;&#x5E76;&#x53D1;&#x3001;&#x5B9E;&#x7528;&#x201D;&#xFF0C;&#x652F;&#x6301;&#x51FD;&#x6570;&#x5F0F;&#x3001;&#x5E76;&#x53D1;&#x5F0F;&#x3001;&#x8FC7;&#x7A0B;&#x5F0F;&#x4EE5;&#x53CA;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x7F16;&#x7A0B;&#x98CE;&#x683C;&#x3002;Rust&#x4E8E;2015&#x5E74;5&#x6708;15&#x65E5;&#xFF0C;&#x6B63;&#x5F0F;&#x53D1;&#x5E03;1.0&#x7248;&#xFF0C;1.1beta&#x7248;&#xFF0C;&#x57FA;&#x672C;&#x7A33;&#x5B9A;&#x5728;&#x516D;&#x5468;&#x53D1;&#x5E03;&#x4E00;&#x7248;&#x7684;&#x9891;&#x7387;&#x3002;6&#x6708;26&#x65E5;&#xFF0C; <a href="http://blog.rust-lang.org/" target="_blank" rel="external">Rust&#x5B98;&#x65B9;&#x535A;&#x5BA2;</a> &#x6B63;&#x5F0F;&#x53D1;&#x5E03;1.1&#x7A33;&#x5B9A;&#x7248;&#xFF0C;1.2beta&#x7248;&#x3002; </p>
<p>Rust 1.1&#x7A33;&#x5B9A;&#x7248;&#x4E3B;&#x8981;&#x7279;&#x6027;&#xFF1A;</p>
<ol>
<li>&#x63D0;&#x5347;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x3002;Rust 1.1&#x7A33;&#x5B9A;&#x7248;&#x76F8;&#x6BD4;1.0&#x7248;&#xFF0C;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x63D0;&#x5347;&#x4E86;32%&#x3002;</li>
<li>&#x5B8C;&#x5584;&#x7F16;&#x8BD1;&#x5668;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x663E;&#x793A;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;—explain&#x53C2;&#x6570;&#xFF0C;&#x80FD;&#x591F;&#x663E;&#x793A;&#x66F4;&#x591A;&#x7F16;&#x8BD1;&#x7684;&#x9519;&#x8BEF;&#x4FE1;&#x606F;&#x3002;</li>
<li>std::fs&#x6A21;&#x5757;&#x7684;&#x65B0;API&#x3002;Rust 1.1&#x7A33;&#x5B9A;&#x7248;&#x53D1;&#x5E03;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;API&#xFF0C;&#x4F7F;&#x5305;&#x7BA1;&#x7406;&#x5668;Cargo&#x7F16;&#x8BD1;&#x66F4;&#x4E3A;&#x7A33;&#x5B9A;&#x3002;</li>
<li>&#x652F;&#x6301;musl&#x3002;musl&#x662F;&#x4E00;&#x4E2A;&#x4E3A;Linux&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x7684;&#x6807;&#x51C6;&#x5E93;&#xFF0C;&#x80FD;&#x591F;&#x4EE3;&#x66FF;&#x7CFB;&#x7EDF;&#x6807;&#x51C6;&#x5E93;&#x7684;&#x6253;&#x5305;&#x5668;&#xFF08;&#x5982;glibc&#xFF09;&#xFF0C;&#x7279;&#x70B9;&#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x3001;&#x5FEB;&#x901F;&#x3001;&#x7B80;&#x5355;&#x3001;&#x514D;&#x8D39;&#x548C;&#x5B89;&#x5168;&#x3002;&#x5728;Linux&#x7CFB;&#x7EDF;&#x4E0B;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x53EF;&#x5B9E;&#x73B0;&#x96F6;&#x4F9D;&#x8D56;&#x3002;</li>
<li>Cargo Rustc&#x3002;Cargo&#x662F;Rust&#x7684;&#x5305;&#x7BA1;&#x7406;&#x5668;&#xFF0C;Rust 1.1&#x7A33;&#x5B9A;&#x7248;&#x652F;&#x6301;&#x5411;Rustc&#x4F20;&#x9012;&#x4EFB;&#x610F;&#x53C2;&#x6570;&#x3002;</li>
</ol>
<p>&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x53EF;&#x53C2;&#x89C1; <a href="https://github.com/rust-lang/rust/blob/master/releases.md#version-110-june-2015" target="_blank" rel="external">&#x8BF4;&#x660E;</a> &#x3002; </p>
<p>Rust 1.2beta&#x7248;&#x4E3B;&#x8981;&#x7279;&#x6027;&#xFF1A;</p>
<ol>
<li>&#x6027;&#x80FD;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x3002;Rust 1.2Beta&#x7248;&#x76F8;&#x6BD4;1.1&#x7A33;&#x5B9A;&#x7248;&#xFF0C;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x63D0;&#x5347;30%&#xFF1B;Cargo&#x547D;&#x4EE4;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x63D0;&#x5347;18%&#x3002;</li>
<li>&#x91CD;&#x65B0;&#x542F;&#x7528;&#x5E76;&#x884C;&#x6A21;&#x5F0F;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x5347;&#x7F16;&#x8BD1;&#x901F;&#x5EA6;&#x3002;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#xFF0C;&#x5728;4&#x6838;&#x673A;&#x5668;&#x4E0A;&#xFF0C;&#x80FD;&#x989D;&#x5916;&#x63D0;&#x5347;33%&#x7684;&#x901F;&#x5EA6;&#x3002;</li>
<li>&#x5305;&#x7BA1;&#x7406;&#x5668;Cargo&#x6027;&#x80FD;&#x63D0;&#x5347;&#x3002;&#x751F;&#x6210;&#x901F;&#x5EA6;&#x63D0;&#x5347;10&#x500D;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5728;&#x591A;&#x4E2A;&#x5305;&#x4E4B;&#x95F4;&#x5171;&#x4EAB;&#x4F9D;&#x8D56;&#x5305;&#x7F13;&#x5B58;&#x3002;</li>
<li>&#x9996;&#x6B21;&#x652F;&#x6301;MSVC&#xFF08;Microsoft Visual C&#xFF09;&#x3002;&#x8FD9;&#x6781;&#x5927;&#x63D0;&#x5347;&#x4E86;&#x5BF9;Windows&#x7684;&#x652F;&#x6301;&#xFF0C;&#x4F7F;&#x5F97;Rust&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x81EA;&#x8EAB;&#x7684;&#x7F16;&#x8BD1;&#x5DE5;&#x5177;&#x6267;&#x884C;&#xFF0C;&#xFF08;&#x4E0D;&#x4F9D;&#x8D56;MinGW/MySYS/GCC&#x7B49;&#xFF09;&#x3002;&#x76EE;&#x524D;&#x5DF2;&#x5F00;&#x53D1;&#x5B8C;&#x6210;&#xFF0C;&#x5E76;&#x4E14;&#x6240;&#x6709;&#x7684;Rust&#x8BED;&#x8A00;&#x5305;&#x9996;&#x5148;&#x8981;&#x901A;&#x8FC7;MSVC&#x5E73;&#x53F0;&#x7684;&#x6D4B;&#x8BD5;&#x3002;</li>
</ol>
<p>Rust 1.2&#x7A33;&#x5B9A;&#x7248;&#x5C06;&#x4E8E;6&#x5468;&#x540E;&#xFF0C;&#x4E0E;1.3beta&#x7248;&#x540C;&#x65F6;&#x53D1;&#x5E03;&#x3002;</p>
<p>&#x793E;&#x533A;&#x65B0;&#x95FB;&#xFF1A;</p>
<p>&#x51E0;&#x5468;&#x524D;&#xFF0C;&#x4E3A;&#x652F;&#x6301;Rust&#x793E;&#x533A;&#x7684;&#x53D1;&#x5C55;&#xFF0C;Rust&#x4E13;&#x95E8;&#x6210;&#x7ACB;&#x4E86;&#x65B0;&#x7684; <a href="https://internals.rust-lang.org/t/announcing-the-community-subteam/2248" target="_blank" rel="external">&#x793E;&#x533A;&#x9886;&#x5BFC;&#x5C0F;&#x7EC4;</a> &#x3002;&#x8BE5;&#x5C0F;&#x7EC4;&#x7684;&#x4E3B;&#x8981;&#x804C;&#x8D23;&#x5305;&#x62EC;&#x6574;&#x5408;&#x8D44;&#x6E90;&#x3001;&#x652F;&#x6301;&#x793E;&#x533A;&#x591A;&#x6837;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x3001;&#x65E9;&#x671F;&#x7528;&#x6237;&#x4E00;&#x8D77;&#x5F15;&#x5BFC;&#x793E;&#x533A;&#x53D1;&#x5C55;&#x3002; </p>
<p>&#x7B2C;&#x4E00;&#x6B21; <a href="http://rustcamp.com/" target="_blank" rel="external">Rust&#x5B98;&#x65B9;&#x4F1A;&#x8BAE;</a> &#x5C06;&#x4E8E;2015&#x5E74;8&#x6708;1&#x65E5;&#xFF0C;&#x5728;&#x7F8E;&#x56FD;&#x52A0;&#x5DDE;&#x4F2F;&#x514B;&#x5229;&#x4E3E;&#x529E;&#xFF0C;&#x4F1A;&#x4E0A;&#x5C06;&#x6709;&#x8BB8;&#x591A;&#x4F18;&#x79C0;&#x7684;&#x7A0B;&#x5E8F;&#x6837;&#x4F8B;&#x548C;&#x6F14;&#x8BB2;&#xFF0C;&#x5C4A;&#x65F6;Rust&#x7684;&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x548C;&#x4E3B;&#x8981;&#x8D21;&#x732E;&#x8005;&#x90FD;&#x5C06;&#x51FA;&#x5E2D;&#x6B64;&#x6B21;&#x76DB;&#x4F1A;&#x3002; </p>
<p>&#x611F;&#x8C22;&#x5F90;&#x5DDD;&#x5BF9;&#x672C;&#x6587;&#x7684;&#x5BA1;&#x6821;&#x3002; </p>
<p>&#x7ED9;InfoQ&#x4E2D;&#x6587;&#x7AD9;&#x6295;&#x7A3F;&#x6216;&#x8005;&#x53C2;&#x4E0E;&#x5185;&#x5BB9;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x90AE;&#x4EF6;&#x81F3;editors@cn.infoq.com&#x3002;&#x4E5F;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x901A;&#x8FC7;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#xFF08;@InfoQ&#xFF0C;@&#x4E01;&#x6653;&#x6600;&#xFF09;&#xFF0C;&#x5FAE;&#x4FE1;&#xFF08;&#x5FAE;&#x4FE1;&#x53F7;&#xFF1A; <a href="http://weixin.sogou.com/gzh?openid=oIWsFt0HnZ93MfLi3pW2ggVJFRxY" target="_blank" rel="external">InfoQChina</a> &#xFF09;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#xFF0C;&#x5E76;&#x4E0E;&#x6211;&#x4EEC;&#x7684;&#x7F16;&#x8F91;&#x548C;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x670B;&#x53CB;&#x4EA4;&#x6D41;&#xFF08;&#x6B22;&#x8FCE;&#x52A0;&#x5165;InfoQ&#x8BFB;&#x8005;&#x4EA4;&#x6D41;&#x7FA4; </p>
<p><img src="http://taojinke.github.io/img/20150702/ae2d6ef.png" alt="InfoQ&#x597D;&#x8BFB;&#x8005;"></p>
<p>&#xFF09;&#x3002; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Linux/">Linux</a><a href="/tags/Rust/">Rust</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/ae16648/" title="每日文章精选 2015 07 01 -" itemprop="url">每日文章精选 2015 07 01 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:22.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.jpg" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161628.html" target="_blank" rel="external">MIT &#x51FA;&#x795E;&#x5668;: &#x81EA;&#x884C;&#x4FEE;&#x590D;&#x7A0B;&#x5E8F; BUG</a></td><tr><td>&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF08;CSAIL&#xFF09;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x6B3E;&#x795E;&#x5668;CodePhage&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x4FEE;&#x590D;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;BUG&#xFF01; &#x5BF9;&#x4E8E;&#x4EE3;&#x7801;&#x7334;&#x6765;&#x8BF4;&#xFF0C;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;BUG&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x6025;&#x4E8E;&#x5BFB;&#x627E;&#x4E0E;&#x4FEE;&#x590D;</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.png" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161636.html" target="_blank" rel="external">&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x79C1;&#x6709;&#x516C;&#x94A5;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</a></td><tr><td>&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x73B0;&#x4EE3;Web&#x670D;&#x52A1;&#x5927;&#x591A;&#x6570;&#x90FD;&#x4E0D;&#x662F;&#x7531;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x3002;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x590D;&#x5236;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x88AB;&#x5206;&#x89E3;&#x6210;&#x8BB8;&#x591A;&#x670D;&#x52A1;&#xFF0C;&#x5206;&#x522B;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x6216;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x90E8;&#x7F72;&#x5728;&#x4E0D;&#x540C;</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.png" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/itnews/20150701/161630.html" target="_blank" rel="external">&#x601D;&#x79D1;&#x540C;&#x610F;&#x4EE5; 6.35 &#x4EBF;&#x7F8E;&#x5143;&#x6536;&#x8D2D; OpenDNS</a></td><tr><td>&#x7F51;&#x7EDC;&#x5DE8;&#x5934;&#x601D;&#x79D1;&#x4ECA;&#x5929; &#x5BA3;&#x5E03; &#x540C;&#x610F;&#x4EE5;6.35&#x4EBF;&#x7F8E;&#x5143;&#x6536;&#x8D2D;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x516C;&#x53F8;&#x3001;&#x514D;&#x8D39;&#x57DF;&#x540D;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;OpenDNS&#xFF0C;&#x540E;&#x8005;&#x5C06;&#x5E76;&#x5165;&#x601D;&#x79D1;&#x7684;&#x5B89;&#x5168;&#x4E1A;&#x52A1;&#x90E8;&#x95E8;&#xFF0C;&#x9884;&#x8BA1;&#x4EA4;&#x6613;&#x5C06;&#x4E8E;2016&#x5E74;&#x4E00;&#x5B63;&#x5EA6;&#x5B8C;&#x6210;&#x3002; &#x6210;&#x7ACB;&#x4E8E;2006&#x5E74;&#x7684;Op</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.gif" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/versionupdate/2015/07/161632.html" target="_blank" rel="external">antiX 15 &#x53D1;&#x5E03;&#xFF0C;Linux &#x53D1;&#x884C;&#x7248;</a></td><tr><td>antiX 15 &#x53D1;&#x5E03;&#xFF0C;&#x66F4;&#x65B0;&#x5185;&#x5BB9;&#x5982;&#x4E0B; Features: Based on Debian Jessie, but without systemd nor systemd-shim. Customised 4.0.5 kernel with fbcondecor splash libreoffice 4</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.gif" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/versionupdate/2015/07/161629.html" target="_blank" rel="external">KDE Plasma 5.3.2 &#x53D1;&#x5E03;&#xFF0C;&#x91CD;&#x5927; bug &#x4FEE;&#x590D;</a></td><tr><td>KDE Plasma 5.3.2 &#x53D1;&#x5E03;&#xFF0C;&#x6539;&#x7248;&#x672C;&#x4FEE;&#x590D;&#x4E86;&#x51E0;&#x4E2A;&#x91CD;&#x5927;&#x7684; bug&#xFF1A; KWin: &apos;Defaults&apos; should set the title bar double-click action to &apos;Maximize.&apos;. Commit. Improve Applet Alterna</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.jpg" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161641.html" target="_blank" rel="external">&#x867D;&#x7269;&#x8054;&#x7F51;&#x5DF2;&#x7ED9;&#x82F1;&#x7279;&#x5C14;&#x8D5A;&#x4E86;21&#x4EBF;&#xFF0C;&#x4F46;Edison…</a></td><tr><td>0 &#x6211;&#x4EEC;&#x76EE;&#x524D;&#x8FD8;&#x751F;&#x6D3B;&#x5728;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x5C4F;&#x5E55;&#x5316;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x4F46;&#x968F;&#x7740; 2015 &#x5E74;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FCE;&#x6765;&#x8BA1;&#x7B97;&#x65B0;&#x65F6;&#x4EE3;&#xFF0C;&#x5373;&#x65E0;&#x5C4F;&#x8BA1;&#x7B97;&#x65F6;&#x4EE3;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x8EAB;&#x8FB9;&#x7684;&#x65E5;&#x5E38;&#x7528;&#x54C1;&#x90FD;&#x5C06;&#x5177;&#x5907;&#x51FA;&#x8272;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#xFF0C;&#x5982; GPS &#x8155;</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/ae13f38.gif" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161640.html" target="_blank" rel="external">&#x8C37;&#x6B4C;&#x4E3A;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x5C06;&#x9ED1;&#x4EBA;&#x6807;&#x8BB0;&#x4E3A;&#x9ED1;&#x7329;&#x7329;&#x9053;&#x6B49;</a></td><tr><td>Google&#x4ECA;&#x5E74;5&#x6708;&#x66F4;&#x65B0;&#x4E86;&#x5B83;&#x7684;&#x7167;&#x7247;&#x5E94;&#x7528;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x81EA;&#x52A8;&#x6807;&#x8BB0;&#x529F;&#x80FD;&#xFF0C;&#x901A;&#x8FC7;&#x8BC6;&#x522B;&#x7167;&#x7247;&#x4E2D;&#x5185;&#x5BB9;&#x81EA;&#x52A8;&#x5206;&#x7C7B;&#x548C;&#x6253;&#x4E0A;&#x6807;&#x7B7E;&#x3002;&#x9ED1;&#x4EBA;&#x7A0B;&#x5E8F;&#x5458;Jacky Alcin&#x53D1;&#x73B0;&#xFF0C; Google&#x7684;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x5C06;&#x4ED6;&#x53CA;&#x5176;&#x9ED1;&#x4EBA;&#x670B;&#x53CB;&#x7684;&#x7167;</td></tr>&#x65F6;&#x95F4;: 2015-07-01 22:13 &#x6765;&#x6E90; :Linuxeden &#x4F5C;&#x8005; :zhangkai &#x539F;&#x6587;&#x94FE;&#x63A5; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/KDE/">KDE</a><a href="/tags/思科/">思科</a><a href="/tags/谷歌/">谷歌</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/a67592a/" title="苹果发布iOS和OS X新版本，近百个漏洞打了安全补丁 -" itemprop="url">苹果发布iOS和OS X新版本，近百个漏洞打了安全补丁 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:09.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><img src="http://taojinke.github.io/img/20150702/a674cf5.jpg" alt=""></p>
<p>&#x82F9;&#x679C;&#x53D1;&#x5E03;&#x4E86;iOS&#x548C;OS&#xA0;X&#x7684;&#x6700;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x66F4;&#x65B0;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x91CD;&#x8981;&#x7684;&#x5B89;&#x5168;&#x8865;&#x4E01;&#xFF0C;&#x6765;&#x4FEE;&#x8865;&#x4E00;&#x4E9B;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#xFF0C;&#x6BD4;&#x5982;&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x8FDC;&#x7A0B;&#x5BC6;&#x5319;&#x64CD;&#x63A7;&#x7684;&#x8865;&#x4E01;&#x3002;</p>
<p>iOS&#xA0;8.4&#x4FEE;&#x8865;&#x4E86;&#x8D85;&#x8FC7;30&#x4E2A;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#xFF0C;&#x5305;&#x62EC;iOS&#x7684;&#x5185;&#x6838;&#xFF0C;&#x5F00;&#x53D1;&#x5305;&#x548C;&#x5176;&#x6838;&#x5FC3;&#x6587;&#x672C;&#x4E0A;&#x7684;&#x6F0F;&#x6D1E;&#x3002;&#x6F0F;&#x6D1E;&#x4FEE;&#x8865;&#x8FD8;&#x63D0;&#x9AD8;&#x4E86;&#x5176;&#x9632;&#x5FA1;&#x80FD;&#x529B;&#xFF0C;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7CFB;&#x7EDF;&#x7684;&#x5BC6;&#x5319;&#x906D;&#x5230;&#x653B;&#x51FB;&#x548C;&#x7A83;&#x53D6;&#x3002;&#x4E3A;&#x4E86;&#x4FEE;&#x8865;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#xFF0C;&#x82F9;&#x679C;&#x8FD8;&#x53D1;&#x5E03;&#x4E86;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x6838;&#x5FC3;TLS&#x7EC4;&#x4EF6;&#x7684;&#x8865;&#x4E01;&#x3002;</p>
<p>&#x6838;&#x5FC3;TLS&#x53EF;&#x4EE5;&#x63A5;&#x6536;&#x77ED;&#x7684;DH&#x5BC6;&#x5319;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BC6;&#x5319;&#x7528;&#x4E8E;DH&#x5BC6;&#x5319;&#x5957;&#x95F4;&#x91CC;&#x3002;&#x5982;&#x679C;&#x670D;&#x52A1;&#x5668;&#x652F;&#x6301;DH&#x5BC6;&#x5319;&#x5957;&#x4EF6;&#x7684;&#x8BDD;&#xFF0C;&#x80FD;&#x52A0;&#x5BC6;&#x81EA;&#x8EAB;&#x7F51;&#x7EDC;&#x4F4D;&#x7F6E;&#x7684;&#x9ED1;&#x5BA2;&#x4FBF;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5C06;&#x5B89;&#x5168;&#x9632;&#x5FA1;&#x964D;&#x4E3A;512-bit&#xA0;DH&#x3002;&#x82F9;&#x679C;&#x7684;&#x62A5;&#x544A;&#x663E;&#x793A;&#xFF0C;&#x8FD9;&#x4E00;&#x8865;&#x4E01;&#x53EF;&#x4EE5;&#x4F7F;DH&#x5BC6;&#x5319;&#x5957;&#x4EF6;&#x5347;&#x7EA7;&#x5230;768&#xA0;bits&#x3002;</p>
<p>&#x82F9;&#x679C;&#x8FD8;&#x4FEE;&#x590D;&#x4E86;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x6F0F;&#x6D1E;&#xFF0C;&#x90A3;&#x5C31;&#x662F;iOS&#x5904;&#x7406;&#x6765;&#x81EA;SIM&#x5361;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x8BA9;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x7279;&#x5236;&#x4E00;&#x5F20;&#x6076;&#x610F;&#x7684;SIM&#x5E76;&#x5BF9;&#x76EE;&#x6807;&#x8BBE;&#x5907;&#x8FDB;&#x884C;&#x8FDC;&#x7A0B;&#x64CD;&#x63A7;&#x3002;</p>
<p>iOS&#xA0;8.4&#x4FEE;&#x8865;&#x7684;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#x4E2D;&#x8FD8;&#x6709;&#x8BB8;&#x591A;&#x662F;&#x5F00;&#x53D1;&#x5305;&#x4E2D;&#x7684;&#xFF0C;&#x6709;&#x4E9B;&#x53EF;&#x80FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x6076;&#x610F;&#x7684;&#x4EE3;&#x7801;&#x6267;&#x884C;&#x3002;&#x5176;&#x4E2D;&#x7684;&#x4E24;&#x4F8B;&#x4E3A;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x5D29;&#x6E83;&#x7684;&#x6F0F;&#x6D1E;&#x548C;&#x5904;&#x7406;&#x4E00;&#x4E9B;SQL&#x529F;&#x80FD;&#x65F6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x201C;SQLite&#x6388;&#x6743;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x4E0D;&#x8DB3;&#x5BFC;&#x81F4;SQL&#x529F;&#x80FD;&#x88AB;&#x968F;&#x610F;&#x8C03;&#x7528;&#x3002;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x901A;&#x8FC7;&#x65B0;&#x7684;&#x6388;&#x6743;&#x68C0;&#x67E5;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x201D;&#x82F9;&#x679C;&#x7684;&#x62A5;&#x544A;&#x4E2D;&#x8BF4;&#x9053;&#x3002;</p>
<p>&#x5728;&#x6700;&#x65B0;&#x7684;iOS&#x7248;&#x672C;&#x4E2D;&#x8FD8;&#x4FEE;&#x8865;&#x4E86;&#x4E00;&#x4E2A;&#x91CD;&#x5927;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x8BA9;&#x9ED1;&#x5BA2;&#x53EF;&#x4EE5;&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x7528;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#x6765;&#x66FF;&#x6362;&#x5408;&#x6CD5;&#x8F6F;&#x4EF6;&#x3002;&#x5B83;&#x662F;&#x5728;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5168;&#x5C40;&#x6982;&#x8981;&#x6587;&#x4EF6;&#x914D;&#x7F6E;&#x65F6;&#x5019;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6B64;&#x6F0F;&#x6D1E;&#x5BF9;Apple&#xA0;Pay&#x8FDB;&#x884C;&#x66FF;&#x6362;&#x3002;FireEye&#x7684;&#x7814;&#x7A76;&#x8005;&#x5728;&#x4E00;&#x5E74;&#x524D;&#x5C31;&#x53D1;&#x73B0;&#x4E86;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5E76;&#x4E0A;&#x62A5;&#x7ED9;&#x4E86;&#x82F9;&#x679C;&#x3002;</p>
<p>&#x201C;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;Manifest&#xA0;Masque&#xA0;Attack&#x7684;&#x6076;&#x610F;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;CVE-2015-3722/3725&#x6F0F;&#x6D1E;&#x6765;&#x7834;&#x574F;iOS&#x4E0A;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x5F53;&#x4F60;&#x901A;&#x8FC7;&#x65E0;&#x7EBF;&#x7F51;&#x7EDC;&#x5B89;&#x88C5;&#x6765;&#x81EA;&#x7F51;&#x7AD9;&#x7684;&#x4F01;&#x4E1A;&#x670D;&#x52A1;&#x7684;&#x5185;&#x90E8;&#x8F6F;&#x4EF6;&#x65F6;&#xFF0C;&#x5C31;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x653B;&#x51FB;&#x3002;&#x5BB9;&#x6613;&#x88AB;&#x7834;&#x574F;&#x7684;&#x8F6F;&#x4EF6;&#x4E0D;&#x4F46;&#x5305;&#x62EC;&#x4F60;&#x5728;&#x5B98;&#x65B9;&#x7684;App&#xA0;Store&#x4E0A;&#x4E0B;&#x8F7D;&#x7684;&#x666E;&#x901A;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x82F9;&#x679C;&#x81EA;&#x5BB6;&#x7684;&#x91CD;&#x8981;&#x7CFB;&#x7EDF;&#x81EA;&#x5E26;&#x8F6F;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;Apple&#xA0;Watch&#xFF0C;Apple&#xA0;Pay&#xFF0C;App&#xA0;Store&#xFF0C;Safari&#x6D4F;&#x89C8;&#x5668;&#x548C;&#x8BBE;&#x7F6E;&#x7B49;&#x3002;&#x53D7;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5F71;&#x54CD;&#x7684;&#x662F;&#x642D;&#x8F7D;iOS&#xA0;7&#x5230;iOS8.4&#x4E4B;&#x95F4;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x5907;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x6B21;&#x53D1;&#x73B0;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x5E76;&#x544A;&#x77E5;&#x82F9;&#x679C;&#x5B9E;&#x5728;2014&#x5E74;&#x516B;&#x6708;&#x3002;&#x201D;FireEye&#x7684;&#x7814;&#x7A76;&#x8005;&#x5728;&#x4E00;&#x4EFD;&#x62A5;&#x544A;&#x4E2D;&#x5199;&#x9053;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;OS&#xA0;X&#x6765;&#x8BF4;&#xFF0C;&#x82F9;&#x679C;&#x4FEE;&#x8865;&#x7684;&#x4E00;&#x4E9B;&#x6F0F;&#x6D1E;&#x540C;&#x6837;&#x4E5F;&#x5B58;&#x5728;&#x4E8E;iOS&#x4E0A;&#xFF0C;&#x6F0F;&#x6D1E;&#x603B;&#x6570;&#x91CF;&#x8FBE;&#x5230;&#x4E86;75&#x4E2A;&#x3002;OS&#xA0;X10.10.4&#x4FEE;&#x8865;&#x4E86;&#x82F1;&#x7279;&#x5C14;&#x56FE;&#x5F62;&#x9A71;&#x52A8;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x7F13;&#x5B58;&#x533A;&#x6EA2;&#x51FA;&#x6F0F;&#x6D1E;&#xFF0C;&#x8FD9;&#x4E00;&#x6F0F;&#x6D1E;&#x53EF;&#x80FD;&#x4F1A;&#x906D;&#x5230;&#x8FDC;&#x7A0B;&#x4EE3;&#x7801;&#x64CD;&#x63A7;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FDC;&#x7A0B;&#x4EE3;&#x7801;&#x64CD;&#x63A7;&#xFF0C;&#x82F9;&#x679C;&#x8FD8;&#x4FEE;&#x8865;&#x4E86;QuickTime&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x5D29;&#x6E83;&#x6F0F;&#x6D1E;&#x3002;</p>
<p>&#x82F9;&#x679C;&#x8FD8;&#x540C;&#x65F6;&#x5BF9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8BC1;&#x4E66;&#x4FE1;&#x4EFB;&#x7B56;&#x7565;&#x8FDB;&#x884C;&#x4E86;&#x5347;&#x7EA7;&#xFF0C;&#x7528;&#x4EE5;&#x89E3;&#x51B3;CNNIC&#x8BA4;&#x8BC1;&#x95EE;&#x9898;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Apple/">Apple</a><a href="/tags/Mac-OS-X/">Mac OS X</a><a href="/tags/iOS/">iOS</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/a66a20f/" title="devexpress表格控件gridcontrol特殊应用（一）——实现禁用特定行（附源代码） -" itemprop="url">devexpress表格控件gridcontrol特殊应用（一）——实现禁用特定行（附源代码） -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:09.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x4F1A;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x9700;&#x8981;&#x7981;&#x7528;&#x7279;&#x5B9A;&#x884C;&#x3002;&#x8FD9;&#x65F6;&#x5019;gridcontrol&#x7684;&#x4E00;&#x822C;&#x5C5E;&#x6027;&#x662F;&#x5B9E;&#x73B0;&#x4E0D;&#x4E86;&#x7684;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x505A;&#x4E00;&#x4E9B;&#x66F4;&#x6539;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x4F60;&#x5C31;&#x9700;&#x8981;&#x53BB;devexpress&#x5B98;&#x7F51;&#x4E2D;&#x627E;&#x5BFB;&#x4E9B;&#x8D44;&#x6599;&#xFF08;&#x5B98;&#x7F51;<a href="https://www.devexpress.com&#xFF09;&#xFF0C;&#x672C;&#x6587;&#x6848;&#x4F8B;&#x6E90;&#x81EA;&#x5B98;&#x7F51;&#x53C2;&#x8003;&amp;#x3002" target="_blank" rel="external">https://www.devexpress.com&#xFF09;&#xFF0C;&#x672C;&#x6587;&#x6848;&#x4F8B;&#x6E90;&#x81EA;&#x5B98;&#x7F51;&#x53C2;&#x8003;&amp;#x3002</a>;</p>
<p>1&#x3001;&#x7981;&#x7528;&#x7279;&#x5B9A;&#x884C;&#x7684;&#x6548;&#x679C;&#x56FE;:</p>
<p><img src="http://taojinke.github.io/img/20150702/a666295.png" alt=""></p>
<p>&#x8FD0;&#x884C;&#x4E4B;&#x540E;&#xFF0C;&#x5212;&#x5220;&#x9664;&#x7EBF;&#x7684;&#x884C;&#x4E3A;&#x7981;&#x7528;&#x884C;&#xFF0C;&#x65E0;&#x6CD5;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#x7B49;&#x64CD;&#x4F5C;&#x3002;</p>
<p>2&#x3001;&#x7ED1;&#x5B9A;&#x6570;&#x636E;&#x4EE3;&#x7801;&#xFF1A;</p>
<pre><code>DataTable tbl = new DataTable<span class="params">()</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;Name&amp;quot;, typeof<span class="params">(string)</span>)</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;ID&amp;quot;, typeof<span class="params">(int)</span>)</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;Number&amp;quot;, typeof<span class="params">(int)</span>)</span>;
            tbl.Columns.Add<span class="params">(&amp;quot;Date&amp;quot;, typeof<span class="params">(DateTime)</span>)</span>;
            <span class="keyword">for</span> <span class="params">(int i = <span class="number">0</span>; i &amp;lt; RowCount; i++)</span>
                tbl.Rows.Add<span class="params">(new object[] { String.Format<span class="params">(&amp;quot;Name{<span class="number">0</span>}&amp;quot;, i)</span>, i, <span class="number">3</span> - i, DateTime.Now.AddDays<span class="params">(i)</span> })</span>;
            return tbl;
</code></pre><p>3&#x3001;&#x6E90;&#x4EE3;&#x7801;&#x4E0B;&#x8F7D;&#x94FE;&#x63A5;&#xFF1A;<a href="http://download.csdn.net/detail/kehaigang29/8859781" target="_blank" rel="external">http://download.csdn.net/detail/kehaigang29/8859781</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/DevExpress/">DevExpress</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/a6789fe/" title="每日文章精选 2015 07 01 -" itemprop="url">每日文章精选 2015 07 01 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:09.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a676f23.jpg" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161628.html" target="_blank" rel="external">MIT &#x51FA;&#x795E;&#x5668;: &#x81EA;&#x884C;&#x4FEE;&#x590D;&#x7A0B;&#x5E8F; BUG</a></td><tr><td>&#x9EBB;&#x7701;&#x7406;&#x5DE5;&#x5B66;&#x9662;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF08;CSAIL&#xFF09;&#x5F00;&#x53D1;&#x4E86;&#x4E00;&#x6B3E;&#x795E;&#x5668;CodePhage&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x884C;&#x4FEE;&#x590D;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;BUG&#xFF01; &#x5BF9;&#x4E8E;&#x4EE3;&#x7801;&#x7334;&#x6765;&#x8BF4;&#xFF0C;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#x4E2D;&#x51FA;&#x73B0;&#x4E86;BUG&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x6025;&#x4E8E;&#x5BFB;&#x627E;&#x4E0E;&#x4FEE;&#x590D;</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a677194.png" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161636.html" target="_blank" rel="external">&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x79C1;&#x6709;&#x516C;&#x94A5;&#x57FA;&#x7840;&#x8BBE;&#x65BD;</a></td><tr><td>&#x76F8;&#x5F53;&#x590D;&#x6742;&#x7684;&#x73B0;&#x4EE3;Web&#x670D;&#x52A1;&#x5927;&#x591A;&#x6570;&#x90FD;&#x4E0D;&#x662F;&#x7531;&#x5355;&#x4F53;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x3002;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x590D;&#x5236;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x88AB;&#x5206;&#x89E3;&#x6210;&#x8BB8;&#x591A;&#x670D;&#x52A1;&#xFF0C;&#x5206;&#x522B;&#x5904;&#x7406;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x6216;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x53EF;&#x80FD;&#x90E8;&#x7F72;&#x5728;&#x4E0D;&#x540C;</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a677194.png" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/itnews/20150701/161630.html" target="_blank" rel="external">&#x601D;&#x79D1;&#x540C;&#x610F;&#x4EE5; 6.35 &#x4EBF;&#x7F8E;&#x5143;&#x6536;&#x8D2D; OpenDNS</a></td><tr><td>&#x7F51;&#x7EDC;&#x5DE8;&#x5934;&#x601D;&#x79D1;&#x4ECA;&#x5929; &#x5BA3;&#x5E03; &#x540C;&#x610F;&#x4EE5;6.35&#x4EBF;&#x7F8E;&#x5143;&#x6536;&#x8D2D;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x516C;&#x53F8;&#x3001;&#x514D;&#x8D39;&#x57DF;&#x540D;&#x670D;&#x52A1;&#x63D0;&#x4F9B;&#x5546;OpenDNS&#xFF0C;&#x540E;&#x8005;&#x5C06;&#x5E76;&#x5165;&#x601D;&#x79D1;&#x7684;&#x5B89;&#x5168;&#x4E1A;&#x52A1;&#x90E8;&#x95E8;&#xFF0C;&#x9884;&#x8BA1;&#x4EA4;&#x6613;&#x5C06;&#x4E8E;2016&#x5E74;&#x4E00;&#x5B63;&#x5EA6;&#x5B8C;&#x6210;&#x3002; &#x6210;&#x7ACB;&#x4E8E;2006&#x5E74;&#x7684;Op</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a677194.gif" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/versionupdate/2015/07/161632.html" target="_blank" rel="external">antiX 15 &#x53D1;&#x5E03;&#xFF0C;Linux &#x53D1;&#x884C;&#x7248;</a></td><tr><td>antiX 15 &#x53D1;&#x5E03;&#xFF0C;&#x66F4;&#x65B0;&#x5185;&#x5BB9;&#x5982;&#x4E0B; Features: Based on Debian Jessie, but without systemd nor systemd-shim. Customised 4.0.5 kernel with fbcondecor splash libreoffice 4</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a677405.gif" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/versionupdate/2015/07/161629.html" target="_blank" rel="external">KDE Plasma 5.3.2 &#x53D1;&#x5E03;&#xFF0C;&#x91CD;&#x5927; bug &#x4FEE;&#x590D;</a></td><tr><td>KDE Plasma 5.3.2 &#x53D1;&#x5E03;&#xFF0C;&#x6539;&#x7248;&#x672C;&#x4FEE;&#x590D;&#x4E86;&#x51E0;&#x4E2A;&#x91CD;&#x5927;&#x7684; bug&#xFF1A; KWin: &apos;Defaults&apos; should set the title bar double-click action to &apos;Maximize.&apos;. Commit. Improve Applet Alterna</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a6778e7.jpg" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161641.html" target="_blank" rel="external">&#x867D;&#x7269;&#x8054;&#x7F51;&#x5DF2;&#x7ED9;&#x82F1;&#x7279;&#x5C14;&#x8D5A;&#x4E86;21&#x4EBF;&#xFF0C;&#x4F46;Edison…</a></td><tr><td>0 &#x6211;&#x4EEC;&#x76EE;&#x524D;&#x8FD8;&#x751F;&#x6D3B;&#x5728;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x5C4F;&#x5E55;&#x5316;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x4F46;&#x968F;&#x7740; 2015 &#x5E74;&#x7684;&#x5230;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8FCE;&#x6765;&#x8BA1;&#x7B97;&#x65B0;&#x65F6;&#x4EE3;&#xFF0C;&#x5373;&#x65E0;&#x5C4F;&#x8BA1;&#x7B97;&#x65F6;&#x4EE3;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x8EAB;&#x8FB9;&#x7684;&#x65E5;&#x5E38;&#x7528;&#x54C1;&#x90FD;&#x5C06;&#x5177;&#x5907;&#x51FA;&#x8272;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#xFF0C;&#x5982; GPS &#x8155;</td></tr><table><tbody><tr><td><img src="http://taojinke.github.io/img/20150702/a6778e7.gif" alt=""></td></tr></tbody></table></p>
<p><td><a href="http://www.linuxeden.com/html/news/20150701/161640.html" target="_blank" rel="external">&#x8C37;&#x6B4C;&#x4E3A;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x5C06;&#x9ED1;&#x4EBA;&#x6807;&#x8BB0;&#x4E3A;&#x9ED1;&#x7329;&#x7329;&#x9053;&#x6B49;</a></td><tr><td>Google&#x4ECA;&#x5E74;5&#x6708;&#x66F4;&#x65B0;&#x4E86;&#x5B83;&#x7684;&#x7167;&#x7247;&#x5E94;&#x7528;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x81EA;&#x52A8;&#x6807;&#x8BB0;&#x529F;&#x80FD;&#xFF0C;&#x901A;&#x8FC7;&#x8BC6;&#x522B;&#x7167;&#x7247;&#x4E2D;&#x5185;&#x5BB9;&#x81EA;&#x52A8;&#x5206;&#x7C7B;&#x548C;&#x6253;&#x4E0A;&#x6807;&#x7B7E;&#x3002;&#x9ED1;&#x4EBA;&#x7A0B;&#x5E8F;&#x5458;Jacky Alcin&#x53D1;&#x73B0;&#xFF0C; Google&#x7684;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x7B97;&#x6CD5;&#x5C06;&#x4ED6;&#x53CA;&#x5176;&#x9ED1;&#x4EBA;&#x670B;&#x53CB;&#x7684;&#x7167;</td></tr>&#x65F6;&#x95F4;: 2015-07-01 22:13 &#x6765;&#x6E90; :Linuxeden &#x4F5C;&#x8005; :zhangkai &#x539F;&#x6587;&#x94FE;&#x63A5; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/KDE/">KDE</a><a href="/tags/思科/">思科</a><a href="/tags/谷歌/">谷歌</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/a6725e5/" title="nginx+lua+memcache实现灰度发布 -" itemprop="url">nginx+lua+memcache实现灰度发布 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T23:41:09.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h4 id="&#x4E00;&#x3001;&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#x539F;&#x7406;&#x8BF4;&#x660E;">&#x4E00;&#x3001;&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#x539F;&#x7406;&#x8BF4;&#x660E;</h4><p>&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#x5728;&#x767E;&#x5EA6;&#x767E;&#x79D1;&#x4E2D;&#x89E3;&#x91CA;&#xFF1A;</p>
<p>&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#x662F;&#x6307;&#x5728;&#x9ED1;&#x4E0E;&#x767D;&#x4E4B;&#x95F4;&#xFF0C;&#x80FD;&#x591F;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#x7684;&#x4E00;&#x79CD;&#x53D1;&#x5E03;&#x65B9;&#x5F0F;&#x3002;AB test&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#x65B9;&#x5F0F;&#xFF0C;&#x8BA9;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x6237;&#x7EE7;&#x7EED;&#x7528;A&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x6237;&#x5F00;&#x59CB;&#x7528;B&#xFF0C;&#x5982;&#x679C;&#x7528;&#x6237;&#x5BF9;B&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x53CD;&#x5BF9;&#x610F;&#x89C1;&#xFF0C;&#x90A3;&#x4E48;&#x9010;&#x6B65;&#x6269;&#x5927;&#x8303;&#x56F4;&#xFF0C;&#x628A;&#x6240;&#x6709;&#x7528;&#x6237;&#x90FD;&#x8FC1;&#x79FB;&#x5230;B&#x4E0A;&#x9762; &#x6765;&#x3002;&#x7070;&#x5EA6;&#x53D1;&#x5E03;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x6574;&#x4F53;&#x7CFB;&#x7EDF;&#x7684;&#x7A33;&#x5B9A;&#xFF0C;&#x5728;&#x521D;&#x59CB;&#x7070;&#x5EA6;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x3001;&#x8C03;&#x6574;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x4FDD;&#x8BC1;&#x5176;&#x5F71;&#x54CD;&#x5EA6;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x7684;&#x7528;&#x4E8E;WEB&#x7CFB;&#x7EDF;&#x65B0;&#x4EE3;&#x7801;&#x7684;&#x6D4B;&#x8BD5;&#x53D1;&#x5E03;&#xFF0C;&#x8BA9;&#x4E00;&#x90E8;&#x5206;&#xFF08;IP&#xFF09;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x65B0;&#x7248;&#x672C;&#xFF0C;&#x4E00;&#x90E8;&#x5206;&#x7528;&#x6237;&#x4ECD;&#x7136;&#x8BBF;&#x95EE;&#x6B63;&#x5E38;&#x7248;&#x672C;&#xFF0C;&#x5176;&#x539F;&#x7406;&#x5982;&#x56FE;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150702/a66fc64.jpg" alt=""></p>
<p>&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#xFF1A;</p>
<p>1&#x3001;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; &#x5F53;&#x7528;&#x6237;&#x8BF7;&#x6C42;&#x5230;&#x8FBE;&#x524D;&#x7AEF;&#x4EE3;&#x7406;&#x670D;&#x52A1;Nginx&#xFF0C;&#x5185;&#x5D4C;&#x7684;lua&#x6A21;&#x5757;&#x89E3;&#x6790;Nginx&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x7684;lua&#x811A;&#x672C;&#x4EE3;&#x7801;&#xFF1B;</p>
<p>2&#x3001;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Lua&#x53D8;&#x91CF;&#x83B7;&#x5F97;&#x5BA2;&#x6237;&#x7AEF;IP&#x5730;&#x5740;&#xFF0C;&#x53BB;&#x67E5;&#x8BE2;memcached&#x7F13;&#x5B58;&#x5185;&#x662F;&#x5426;&#x6709;&#x8BE5;&#x952E;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8FD4;&#x56DE;&#x503C;&#x6267;&#x884C;@client_test&#xFF0C;&#x5426;&#x5219;&#x6267;&#x884C;@client&#x3002;</p>
<p>3&#x3001;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; Location @client_test&#x628A;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x7ED9;&#x90E8;&#x7F72;&#x4E86;new&#x7248;&#x4EE3;&#x7801;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;location @client&#x628A;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x7ED9;&#x90E8;&#x7F72;&#x4E86;normal&#x7248;&#x4EE3;&#x7801;&#x7684;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x8FD4;&#x56DE;&#x7ED3;&#x679C;&#x3002;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x628A;&#x5B89;&#x88C5;&#x914D;&#x7F6E;&#x8FC7;&#x7A0B;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x3002;</p>
<h4 id="&#x4E8C;&#x3001;&#x5B89;&#x88C5;&#x914D;&#x7F6E;&#x8FC7;&#x7A0B;&#x8BE6;&#x89E3;">&#x4E8C;&#x3001;&#x5B89;&#x88C5;&#x914D;&#x7F6E;&#x8FC7;&#x7A0B;&#x8BE6;&#x89E3;</h4><p>1&#x3001;&#x5B89;&#x88C5;nginx</p>
<p>&#x5B89;&#x88C5;&#x4F9D;&#x8D56;&#x5305;</p>
<p><img src="http://taojinke.github.io/img/20150702/a66fed5.gif" alt=""></p>
<pre><code>yum -y <span class="operator"><span class="keyword">install</span> gcc gcc-c++ autoconf libjpeg libjpeg-devel libpng libpng-devel freetype freetype-devel libxml2 libxml2-devel zlib zlib-devel glibc glibc-devel glib2 glib2-devel bzip2 bzip2-devel ncurses ncurses-devel curl curl-devel e2fsprogs e2fsprogs-devel krb5 krb5-devel libidn libidn-devel openssl openssl-devel openldap openldap-devel nss_ldap openldap-clients openldap-servers make pcre-devel

yum -y <span class="keyword">install</span> gd gd2 gd-devel gd2-devel lua lua-devel

yum &amp;#x2013;</span>y <span class="operator"><span class="keyword">install</span> memcached</span>
</code></pre><p><img src="http://taojinke.github.io/img/20150702/a670146.gif" alt=""></p>
<p>&#x4E0B;&#x8F7D;lua&#x6A21;&#x5757;&#x3001;lua-memcache&#x64CD;&#x4F5C;&#x5E93;&#x6587;&#x4EF6;&#x548C;nginx&#x5305;</p>
<p><img src="http://taojinke.github.io/img/20150702/a670146.gif" alt=""></p>
<pre><code>wget <span class="string">https:</span><span class="comment">//github.com/simpl/ngx_devel_kit/archive/v0.2.18.tar.gz</span>

wget <span class="string">https:</span><span class="comment">//github.com/chaoslawful/lua-nginx-module/archive/v0.8.5.tar.gz</span>

wget <span class="string">https:</span><span class="comment">//github.com/agentzh/lua-resty-memcached/archive/v0.11.tar.gz</span>

wget <span class="string">http:</span><span class="comment">//nginx.org/download/nginx-1.4.2.tar.gz</span>

tar xvf nginx-<span class="number">1.4</span>.2.tar.gz

cd nginx-<span class="number">1.4</span>.2/

.<span class="regexp">/configure --prefix=/</span>soft<span class="regexp">/nginx/</span> --with-http_gzip_static_module --add-module=<span class="regexp">/root/</span>ngx_devel_kit-<span class="number">0.2</span>.18<span class="regexp">/  --add-module=/</span>root<span class="regexp">/lua-nginx-module-0.8.5/</span>

make

make install
</code></pre><p><img src="http://taojinke.github.io/img/20150702/a6703b7.gif" alt=""></p>
<p>&#x62F7;&#x8D1D;lua&#x7684;memcached&#x64CD;&#x4F5C;&#x5E93;&#x6587;&#x4EF6;</p>
<pre><code>tar xvf v0.<span class="number">11</span>.tar.gz

cp -r lua-resty-memcached-<span class="number">0.11</span><span class="regexp">/lib/</span>resty<span class="regexp">/ /u</span>sr<span class="regexp">/lib64/</span>lua<span class="regexp">/5.1/</span>
</code></pre><p>&#x914D;&#x7F6E;nginx</p>
<p><img src="http://taojinke.github.io/img/20150702/a670628.gif" alt=""></p>
<pre><code>#vim /soft/nginx/conf/nginx.conf
worker_processes  1<span class="comment">;</span>
events {
    worker_connections  1024<span class="comment">;</span>
}
http {
    include       mime.types<span class="comment">;</span>
    default_type  application/octet-stream<span class="comment">;</span>
    sendfile        on<span class="comment">;</span>
    keepalive_timeout  65<span class="comment">;</span>
    proxy_next_upstream     error timeout<span class="comment">;</span>
    proxy_redirect          off<span class="comment">;</span>
    proxy_set_header        Host $host<span class="comment">;</span>
    proxy_set_header        X-Real-IP $http_x_forwarded_for<span class="comment">;</span>
    proxy_set_header        X-Forwarded-For $proxy_add_x_forwarded_for<span class="comment">;</span>
    client_max_body_size    100m<span class="comment">;</span>
    client_body_buffer_size 256k<span class="comment">;</span>
    proxy_connect_timeout   180<span class="comment">;</span>
    proxy_send_timeout      180<span class="comment">;</span>
    proxy_read_timeout      180<span class="comment">;</span>
    proxy_buffer_size       8k<span class="comment">;</span>
    proxy_buffers           8 64k<span class="comment">;</span>
    proxy_busy_buffers_size 128k<span class="comment">;</span>
    proxy_temp_file_write_size 128k<span class="comment">;</span>
     upstream client {
        server   <span class="number">192.168.200.29</span>:80<span class="comment">;</span>
    }
    upstream client_test {
        server   <span class="number">192.168.200.29</span>:81<span class="comment">;</span>
    }
    server {
        listen       80<span class="comment">;</span>
        server_name  localhost<span class="comment">;</span>
       location / {
       content_by_lua &amp;apos<span class="comment">;</span>
            clientIP = ngx.req.get_headers()[&amp;quot<span class="comment">;X-Real-IP&amp;quot;]</span>
            if clientIP == nil then
                clientIP = ngx.req.get_headers()[&amp;quot<span class="comment">;x_forwarded_for&amp;quot;]</span>
            end
            if clientIP == nil then
                clientIP = ngx.var.remote_addr
            end
                local memcached = require &amp;quot<span class="comment">;resty.memcached&amp;quot;</span>
                local memc, err = memcached:new()
                if not memc then
                    ngx.say(&amp;quot<span class="comment">;failed to instantiate memc: &amp;quot;, err)</span>
                    return
                end
                local ok, err = memc:connect(&amp;quot<span class="comment">;127.0.0.1&amp;quot;, 11211)</span>
                if not ok then
                    ngx.say(&amp;quot<span class="comment">;failed to connect: &amp;quot;, err)</span>
                    return
                end
                local res, flags, err = memc:get(clientIP)
                if err then
                    ngx.say(&amp;quot<span class="comment">;failed to get clientIP &amp;quot;, err)</span>
                    return
                end
                if  res == &amp;quot<span class="comment">;1&amp;quot; then</span>
                    ngx.exec(&amp;quot<span class="comment">;@client_test&amp;quot;)</span>
                    return
                end
                 ngx.exec(&amp;quot<span class="comment">;@client&amp;quot;)</span>
               &amp;apos<span class="comment">;;</span>
       }
       location @client{
           proxy_pass http://client<span class="comment">;</span>
       }
       location @client_test{
           proxy_pass http://client_test<span class="comment">;</span>
       }
    location /hello {
        default_type &amp;apos<span class="comment">;text/plain&amp;apos;;</span>
        content_by_lua &amp;apos<span class="comment">;ngx.say(&amp;quot;hello, lua&amp;quot;)&amp;apos;;</span>
    }
    location = /50x.html {
        root   html<span class="comment">;</span>
    }
   }
}
</code></pre><p><img src="http://taojinke.github.io/img/20150702/a670899.gif" alt=""></p>
<p>&#x68C0;&#x6D4B;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x3002;</p>
<pre><code>#<span class="regexp">/soft/</span>nginx<span class="regexp">/sbin/</span>nginx -t

nginx: the configuration <span class="keyword">file</span> <span class="regexp">/soft/</span>nginx<span class="regexp">/conf/</span>nginx.conf syntax is ok

nginx: configuration <span class="keyword">file</span> <span class="regexp">/soft/</span>nginx<span class="regexp">/conf/</span>nginx.conf test is successful
</code></pre><p>&#x542F;&#x52A8;nginx</p>
<pre><code><span class="regexp">/soft/</span>nginx<span class="regexp">/sbin/</span>nginx
</code></pre><p>&#x542F;&#x52A8;memcached&#x670D;&#x52A1;</p>
<pre><code>memcached -<span class="keyword">u</span> nobody -<span class="keyword">m</span> 1024 -c 2048 -p 11211 &amp;#x2013;<span class="literal">d</span>
</code></pre><p>&#x4E09;&#x3001;&#x6D4B;&#x8BD5;&#x9A8C;&#x8BC1;</p>
<p>&#x6D4B;&#x8BD5;lua&#x6A21;&#x5757;&#x662F;&#x5426;&#x8FD0;&#x884C;&#x6B63;&#x5E38;</p>
<p>&#x8BBF;&#x95EE;<a href="http://&#x6D4B;&#x8BD5;&#x670D;&#x52A1;&#x5668;ip&#x5730;&#x5740;/hello&#x3002;&#x5982;&#x679C;&#x663E;&#x793A;&#xFF1A;hello&#xFF0C;lua" target="_blank" rel="external">http://&#x6D4B;&#x8BD5;&#x670D;&#x52A1;&#x5668;ip&#x5730;&#x5740;/hello&#x3002;&#x5982;&#x679C;&#x663E;&#x793A;&#xFF1A;hello&#xFF0C;lua</a> &#x8868;&#x793A;&#x5B89;&#x88C5;&#x6210;&#x529F;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/a670b0a.jpg" alt=""></p>
<p>&#x5728;&#x53E6;&#x4E00;&#x53F0;&#x6D4B;&#x8BD5;&#x673A;(&#x8FD9;&#x91CC;&#x662F;192.168.200.29)&#x8BBE;&#x7F6E;&#x4E24;&#x4E2A;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;80&#x7AEF;&#x53E3;&#x662F;&#x6267;&#x884C;&#x6B63;&#x5E38;&#x4EE3;&#x7801;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;81&#x7AEF;&#x53E3;&#x6267;&#x884C;&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x5728;memcached&#x4E2D;&#x4EE5;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x673A;IP&#x5730;&#x5740;&#x4E3A;key&#xFF0C;value&#x503C;&#x4E3A;1&#x3002;&#x8FD9;&#x91CC;&#x6211;&#x7684;IP&#x662F;192.168.68.211.</p>
<p><img src="http://taojinke.github.io/img/20150702/a670d7b.gif" alt=""></p>
<pre><code><span class="tag">telnet</span> <span class="tag">localhost</span> 11211

<span class="rule"><span class="attribute">Trying </span>:<span class="value">:<span class="number">1</span>...

Connected to localhost.

Escape character is &amp;apos</span></span>;^]&amp;<span class="tag">apos</span>;.

<span class="tag">set</span> 192<span class="class">.168</span><span class="class">.68</span><span class="class">.211</span> 0 3600 1

1

<span class="tag">STORED</span>

<span class="tag">get</span> 192<span class="class">.168</span><span class="class">.68</span><span class="class">.211</span>

<span class="tag">VALUE</span> 192<span class="class">.168</span><span class="class">.68</span><span class="class">.211</span> 9 1

1

<span class="tag">END</span>

<span class="tag">quit</span>
</code></pre><p><img src="http://taojinke.github.io/img/20150702/a670d7b.gif" alt=""></p>
<p>&#x6CE8;&#x610F;&#xFF1A;</p>
<p>set&#x540E;&#x7B2C;&#x4E00;&#x4E2A;&#x503C;&#x4E3A;key&#x503C;&#x3002;</p>
<p>192.168.68.211&#x8FD9;&#x662F;key&#x503C;&#x662F;&#x9700;&#x8981;&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x7684;IP&#x5730;&#x5740;&#xFF1B;</p>
<p>0 &#x8868;&#x793A;&#x4E00;&#x4E2A;&#x8DDF;&#x8BE5;key&#x6709;&#x5173;&#x7684;&#x81EA;&#x5B9A;&#x4E49;&#x6570;&#x636E;&#xFF1B;</p>
<p>3600 &#x8868;&#x793A;&#x8BE5;key&#x503C;&#x7684;&#x6709;&#x6548;&#x65F6;&#x95F4;&#xFF1B;</p>
<p>1 &#x8868;&#x793A;key&#x6240;&#x5BF9;&#x5E94;&#x7684;value&#x503C;&#x7684;&#x5B57;&#x8282;&#x6570;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8BBF;&#x95EE;Nginx&#xFF0C;&#x6548;&#x679C;&#x7B26;&#x5408;&#x9884;&#x671F;&#xFF0C;&#x6211;&#x7684;IP&#x5DF2;&#x7ECF;&#x5728;memcached&#x4E2D;&#x5B58;&#x50A8;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x7ED9;&#x6267;&#x884C;&#x7070;&#x5EA6;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x7684;&#x4E3B;&#x673A;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/a670fec.jpg" alt=""></p>
<p>&#x4ECE;memcached&#x5220;&#x9664;&#x6211;&#x7684;&#x4E3B;&#x673A;IP&#x503C;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/a670fec.jpg" alt=""></p>
<p>&#x518D;&#x6B21;&#x8BF7;&#x6C42;Nginx&#xFF0C;&#x8BF7;&#x6C42;&#x8F6C;&#x53D1;&#x7ED9;&#x6267;&#x884C;&#x6B63;&#x5E38;&#x4EE3;&#x7801;&#x5185;&#x5BB9;&#x7684;&#x4E3B;&#x673A;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150702/a67125d.jpg" alt=""></p>
<p>&#x6574;&#x4E2A;&#x914D;&#x7F6E;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#xFF0C;&#x6574;&#x4E2A;&#x5224;&#x65AD;&#x8FC7;&#x7A0B;&#x5BF9;&#x670D;&#x52A1;&#x7684;&#x5F71;&#x54CD;&#x975E;&#x5E38;&#x5C0F;&#x3002;&#x5982;&#x679C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x6700;&#x597D;&#x81EA;&#x5DF1;&#x770B;&#x770B;lua&#x811A;&#x672C;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Lua/">Lua</a><a href="/tags/Memcached/">Memcached</a><a href="/tags/Nginx/">Nginx</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/48/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/47/">47</a><a class="page-number" href="/page/48/">48</a><span class="page-number current">49</span><a class="page-number" href="/page/50/">50</a><a class="page-number" href="/page/51/">51</a><span class="space">&hellip;</span><a class="page-number" href="/page/59/">59</a><a class="extend next" rel="next" href="/page/50/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>587</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>32</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>23</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>9</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
