
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="edwin jin dianzi blog">
<meta property="og:type" content="website">
<meta property="og:title" content="dianzi blog">
<meta property="og:url" content="http://taojinke.github.io/page/23/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="edwin jin dianzi blog">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="dianzi blog">
<meta name="twitter:description" content="edwin jin dianzi blog">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main">

   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/0358c4f/" title="《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏" itemprop="url">《Java Performance》笔记4——JVM性能调优入门 - Tony Chen的专栏</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:29:50.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>1.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF1A;</p>
<p>&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x67D0;&#x65B9;&#x9762;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x8B6C;&#x5982;&#x541E;&#x5410;&#x91CF;&#x3001;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3001;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x91CF;&#x3001;&#x53EF;&#x7528;&#x6027;&#x3001;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x7B49;&#x3002; JVM &#x6027;&#x80FD;&#x8C03;&#x4F18;&#x4E3B;&#x8981;&#x9488;&#x5BF9;&#x5982;&#x4E0B;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF1A;</p>
<p>(1). &#x53EF;&#x7528;&#x6027;&#xFF1A;</p>
<p>&#x662F;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5904;&#x4E8E;&#x53EF;&#x64CD;&#x4F5C;&#x3001;&#x53EF;&#x4F7F;&#x7528;&#x72B6;&#x6001;&#x7684;&#x5EA6;&#x91CF;&#x3002;&#x53EF;&#x7528;&#x6027;&#x9700;&#x6C42;&#x6307;&#x7684;&#x662F;&#x5F53;&#x7A0B;&#x5E8F;&#x7684;&#x67D0;&#x4E9B;&#x7EC4;&#x4EF6;&#x53D1;&#x751F;&#x6545;&#x969C;&#x6216;&#x5931;&#x6548;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x5728;&#x591A;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x6D77;&#x53EF;&#x4EE5;&#x7EE7;&#x7EED;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;</p>
<p>Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4E0A;&#x4E0B;&#x6587;&#x4E2D;&#xFF0C;&#x5229;&#x7528;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EC4;&#x4EF6;&#x5316;&#x3001;&#x5728;&#x591A;&#x4E2A; JVM &#x4E2D;&#x8FD0;&#x884C;&#x6216;&#x5728;&#x591A;&#x4E2A; JVM &#x4E0A;&#x8FD0;&#x884C;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5B9E;&#x4F8B;&#x90FD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3002;&#x5F3A;&#x8C03;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x7684;&#x4EE3;&#x4EF7;&#x4E4B;&#x4E00;&#x662F;&#x7BA1;&#x7406;&#x6210;&#x672C;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x5F15;&#x5165;&#x66F4;&#x591A;&#x7684; JVM &#x610F;&#x5473;&#x7740;&#x8981;&#x7BA1;&#x7406;&#x66F4;&#x591A;&#x7684; JVM &#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x590D;&#x6742;&#x6027;&#x589E;&#x52A0;&#x4EE5;&#x53CA;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x7684;&#x7BA1;&#x7406;&#x6210;&#x672C;&#x3002;</p>
<p>(2). &#x53EF;&#x7BA1;&#x7406;&#x6027;&#xFF1A;</p>
<p>&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x662F;&#x5BF9;&#x7531;&#x8FD0;&#x884C;&#x3001;&#x76D1;&#x63A7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x64CD;&#x4F5C;&#x6027;&#x5F00;&#x9500;&#x7684;&#x5EA6;&#x91CF;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x914D;&#x7F6E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#x3002;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x9700;&#x6C42;&#x7528;&#x4E8E;&#x8861;&#x91CF;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;&#x3002;</p>
<p>(3). &#x541E;&#x5410;&#x91CF;&#xFF1A;</p>
<p>&#x541E;&#x5410;&#x91CF;&#x662F;&#x5806;&#x5355;&#x4F4D;&#x65F6;&#x95F4;&#x5185;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x5EA6;&#x91CF;&#x3002;&#x8BBE;&#x8BA1;&#x541E;&#x5410;&#x91CF;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x8003;&#x8651;&#x5B83;&#x5BF9;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x589E;&#x52A0;&#x541E;&#x5410;&#x91CF;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x5EF6;&#x8FDF;&#x7684;&#x589E;&#x52A0;&#x6216;&#x8005;&#x5185;&#x5B58;&#x4F7F;&#x7528;&#x7684;&#x589E;&#x52A0;&#x3002;</p>
<p>(4). &#x5EF6;&#x8FDF;&#x53CA;&#x54CD;&#x5E94;&#x6027;&#xFF1A;</p>
<p>&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x54CD;&#x5E94;&#x6027;&#x662F;&#x6307;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6536;&#x5230;&#x6307;&#x4EE4;&#x5F00;&#x59CB;&#x5DE5;&#x4F5C;&#x76F4;&#x5230;&#x5B8C;&#x6210;&#x8BE5;&#x5DE5;&#x4F5C;&#x6240;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x7684;&#x5EA6;&#x91CF;&#x3002;</p>
<p>&#x5B9A;&#x4E49;&#x5EF6;&#x8FDF;&#x53CA;&#x54CD;&#x5E94;&#x6027;&#x9700;&#x6C42;&#x65F6;&#xFF0C;&#x4E00;&#x822C;&#x4E0D;&#x8003;&#x8651;&#x7A0B;&#x5E8F;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63D0;&#x9AD8;&#x54CD;&#x5E94;&#x6027;&#x6216;&#x7F29;&#x5C0F;&#x5EF6;&#x8FDF;&#x7684;&#x4EE3;&#x4EF7;&#x662F;&#x66F4;&#x4F4E;&#x541E;&#x5410;&#x91CF;&#x3001;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5B58;&#x6D88;&#x8017; ( &#x6216;&#x8005;&#x4E8C;&#x8005;&#x540C;&#x65F6;&#x53D1;&#x751F; ) &#x3002;</p>
<p>(5). &#x5185;&#x5B58;&#x5360;&#x7528;&#xFF1A;</p>
<p>&#x5185;&#x5B58;&#x5360;&#x7528;&#x662F;&#x6307;&#x5728;&#x540C;&#x7B49;&#x7A0B;&#x5EA6;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3001;&#x5EF6;&#x8FDF;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x3002;</p>
<p>&#x5185;&#x5B58;&#x5360;&#x7528;&#x901A;&#x5E38;&#x4EE5;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684; java &#x5806;&#x5927;&#x5C0F;&#x6216;&#x8005;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700;&#x7684;&#x603B;&#x5185;&#x5B58;&#x5927;&#x5C0F;&#x6765;&#x8868;&#x8FF0;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x901A;&#x8FC7;&#x589E;&#x5927; java &#x5806;&#x7684;&#x65B9;&#x5F0F;&#x589E;&#x52A0;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x80FD;&#x591F;&#x63D0;&#x4F9B;&#x541E;&#x5410;&#x91CF;&#x3001;&#x964D;&#x4F4E;&#x5EF6;&#x8FDF;&#x6216;&#x8005;&#x517C;&#x987E;&#x4E8C;&#x8005;&#x3002;</p>
<p>(6). &#x542F;&#x52A8;&#x65F6;&#x95F4;&#xFF1A;</p>
<p>&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6D88;&#x8017;&#x65F6;&#x95F4;&#x3002;&#x6B64;&#x5916;&#xFF0C; java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x53E6;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x5173;&#x6CE8;&#x7684;&#x6307;&#x6807;&#x662F;&#x73B0;&#x4EE3; JVM &#x5B8C;&#x6210;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x70ED;&#x533A;&#x4F18;&#x5316;&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x6240;&#x6D88;&#x8017;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>Java &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5B8C;&#x6210;&#x65F6;&#x95F4;&#x53D6;&#x51B3;&#x4E8E;&#x5F88;&#x591A;&#x56E0;&#x7D20;&#xFF0C;&#x5305;&#x62EC; ( &#x4F46;&#x4E0D;&#x9650;&#x4E8E; ) &#xFF1A;&#x521D;&#x59CB;&#x5316;&#x65F6;&#x8F7D;&#x5165;&#x7684;&#x7C7B;&#x7684;&#x6570;&#x91CF;&#x3001;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x7684;&#x5BF9;&#x8C61;&#x7684;&#x6570;&#x91CF;&#x3001;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5982;&#x4F55;&#x521D;&#x59CB;&#x5316;&#x4EE5;&#x53CA; HotSpot&#xA0;VM &#x7684;&#x8FD0;&#x884C;&#x65F6;&#x73AF;&#x5883;&#x9009;&#x62E9;&#xFF0C;&#x5373; Client &#x6A21;&#x5F0F;&#x8FD8;&#x662F; Server &#x6A21;&#x5F0F;&#x3002;</p>
<p>2.JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#xFF1A;</p>
<p>JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x7684;&#x9009;&#x62E9;&#x662F;&#x6307;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x90E8;&#x7F72;&#x5230;&#x5355;&#x4E2A; JVM &#x5B9E;&#x4F8B;&#x4E0A;&#xFF0C;&#x8FD8;&#x662F;&#x90E8;&#x7F72;&#x5230;&#x591A;&#x4E2A; JVM &#x5B9E;&#x4F8B;&#x4E0A;&#x3002;</p>
<p>(1). &#x5355; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#xFF1A;</p>
<p>&#x5C06; java &#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5728;&#x5355;&#x4E2A; JVM &#x4E0A;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x7BA1;&#x7406;&#x591A;&#x4E2A; JVM &#xFF0C;&#x53EF;&#x4EE5;&#x964D;&#x4F4E;&#x7BA1;&#x7406;&#x6210;&#x672C;&#xFF0C;&#x6B64;&#x5916;&#x6BCF;&#x4E2A;&#x90E8;&#x7F72;&#x7684; JVM &#x90FD;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x5185;&#x5B58;&#x5F00;&#x9500;&#xFF0C;&#x4F7F;&#x7528;&#x5355; JVM &#x907F;&#x514D;&#x4E86;&#x8FD9;&#x90E8;&#x5206;&#x8D44;&#x6E90;&#x4F7F;&#x7528;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x6D88;&#x8017;&#x7684;&#x603B;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x4F1A;&#x51CF;&#x5C11;&#x3002;</p>
<p>&#x5355; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x5B58;&#x5728;&#x5355;&#x70B9;&#x6545;&#x969C;&#xFF0C;&#x5373;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x906D;&#x9047;&#x707E;&#x96BE;&#x6027;&#x9519;&#x8BEF;&#x6216; JVM &#x5931;&#x6548;&#x65F6;&#xFF0C;&#x65E0;&#x6CD5;&#x4FDD;&#x8BC1;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x53EF;&#x7528;&#x6027;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x5185;&#x5B58;&#x6D88;&#x8017;&#x8D85;&#x8FC7;&#x4E86; 32 &#x4F4D; JVM &#x5904;&#x7406;&#x80FD;&#x529B;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528; 64 &#x4F4D; JVM &#xFF0C;&#x9700;&#x8981;&#x786E;&#x8BA4;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6A21;&#x5757;&#x662F;&#x5426;&#x652F;&#x6301; 64 &#x4F4D; JVM &#xFF0C;&#x5982;&#x679C;&#x8FD8;&#x4F7F;&#x7528;&#x4E86; JNI &#xFF0C;&#x9700;&#x8981;&#x4F7F;&#x7528; 64 &#x4F4D;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x3002;</p>
<p>(2). &#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#xFF1A;</p>
<p>&#x5C06; java &#x5E94;&#x7528;&#x90E8;&#x7F72;&#x5230;&#x591A;&#x4E2A; JVM &#x5B9E;&#x4F8B;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x66F4;&#x597D;&#x7684;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x66F4;&#x4F4E;&#x5EF6;&#x8FDF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x91C7;&#x7528;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x65F6;&#xFF0C;&#x5355;&#x4E00;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216; JVM &#x5B9E;&#x4F8B;&#x7684;&#x5931;&#x6548;&#x53EA;&#x4F1A;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x3002;&#x540C;&#x65F6;&#x7531;&#x4E8E;&#x5728;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C; java &#x5806;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x5C0F;&#xFF0C;&#x8F83;&#x5C0F;&#x7684;&#x5806;&#x5728;&#x5783;&#x573E;&#x6536;&#x96C6;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x505C;&#x987F;&#x66F4;&#x5C0F;&#xFF0C;&#x56E0;&#x6B64;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x53EF;&#x80FD;&#x63D0;&#x4F9B;&#x66F4;&#x4F4E;&#x7684;&#x5EF6;&#x8FDF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x91C7;&#x7528;&#x591A; JVM &#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#x7531;&#x4E8E;&#x5C06;&#x8D1F;&#x8377;&#x5206;&#x53D1;&#x5230;&#x591A;&#x4E2A; JVM &#xFF0C;&#x80FD;&#x591F;&#x6539;&#x5584;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4ECE;&#x800C;&#x5904;&#x7406;&#x66F4;&#x9AD8;&#x8D1F;&#x8377;&#xFF0C;&#x63D0;&#x4F9B;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>3.JVM &#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#x9009;&#x62E9;&#xFF1A;</p>
<p>(1).Client/Server &#x6A21;&#x5F0F;&#xFF1A;</p>
<p>A.Client &#x6A21;&#x5F0F;&#xFF1A;&#x7279;&#x70B9;&#x662F;&#x542F;&#x52A8;&#x5FEB;&#x3001;&#x5360;&#x7528;&#x5185;&#x5B58;&#x5C11;&#x3001; JIT &#x7F16;&#x8BD1;&#x5668;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x7684;&#x901F;&#x5EA6;&#x4E5F;&#x66F4;&#x5FEB;&#xFF0C;&#x4F46;&#x662F; JIT &#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x7684;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x4E0D;&#x5982; Server &#x6A21;&#x5F0F;&#x9AD8;&#x3002;</p>
<p>B.Server &#x6A21;&#x5F0F;&#xFF1A; JIT &#x7F16;&#x8BD1;&#x4F18;&#x5316;&#x9700;&#x8981;&#x6D88;&#x8017;&#x989D;&#x5916;&#x7684;&#x65F6;&#x95F4;&#x4EE5;&#x6536;&#x96C6;&#x66F4;&#x591A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#xFF0C;&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x66F4;&#x957F;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x751F;&#x6210;&#x9AD8;&#x5EA6;&#x4F18;&#x5316;&#x7684;&#x673A;&#x5668;&#x7801;&#x3002;</p>
<p>C.Tiered&#xA0;Server &#x6A21;&#x5F0F;&#xFF1A;&#x5728; JDK7 &#x4E2D;&#x6B63;&#x5F0F;&#x53D1;&#x5E03;&#xFF0C;&#x7ED3;&#x5408;&#x4E86; Client &#x548C; Server &#x6A21;&#x5F0F;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x5373;&#x5FEB;&#x901F;&#x542F;&#x52A8;&#x548C;&#x9AD8;&#x6548;&#x7684;&#x751F;&#x6210;&#x7801;&#x3002;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x7684;&#x662F; java7 &#x6216;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#x7684; JVM &#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; &#x201D;-server&#xA0;-XX:+TieredCompilation&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x542F;&#x52A8; Tiered&#xA0;Server &#x6A21;&#x5F0F;&#x3002;</p>
<p>(2).32 &#x4F4D; /64 &#x4F4D;&#xFF1A;</p>
<p>HotSpot&#xA0;VM &#x9ED8;&#x8BA4;&#x4F7F;&#x7528; 32 &#x4F4D;&#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#xFF0C;&#x4F46;&#x662F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x786C;&#x4EF6;&#x914D;&#x7F6E;&#x3001;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x662F;&#x5426;&#x652F;&#x6301; 64 &#x4F4D; JVM &#x4EE5;&#x53CA; JNI &#x662F;&#x5426;&#x4F7F;&#x7528; 64 &#x4F4D;&#x7F16;&#x8BD1;&#x4E5F;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x9002;&#x5408;&#x4F7F;&#x7528; 64 &#x4F4D; JVM &#x3002;</p>
<p>A.32 &#x4F4D; JVM &#xFF1A;</p>
<p>&#x9ED8;&#x8BA4;&#x7684; HotSpot&#xA0;VM &#x8FD0;&#x884C;&#x6A21;&#x5F0F;&#xFF0C; java &#x5806;&#x5185;&#x5B58;&#x5C0F;&#x4E8E; 2G &#x7684;&#x63A8;&#x8350;&#x9009;&#x62E9;&#x3002;</p>
<p>B.64 &#x4F4D; JVM &#xFF1A;</p>
<p>&#x5F53; java &#x5806;&#x4ECB;&#x4E8E; 2G~32G &#x65F6;&#xFF0C;&#x4F7F;&#x7528; &#x201D;-d64&#xA0;-XX:+UseCompressedOops&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x7684; 64 &#x4F4D; JVM &#x3002;</p>
<p>&#x5F53; java &#x5806;&#x5927;&#x4E8E; 32G &#x65F6;&#xFF0C;&#x4F7F;&#x7528; &#x201D;-d64&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x7684; 64 &#x4F4D; JVM &#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x4F7F;&#x7528;&#x201D;&#xA0;-XX:+UseCompressedOops&#x201D;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x7684; HotSpot&#xA0;VM &#xFF0C;&#x6700;&#x5927; java &#x5806;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; 26G &#x65F6;&#x6027;&#x80FD;&#x6700;&#x597D;&#xFF0C; java6&#xA0;Update18 &#x4E4B;&#x540E;&#x7684; HotSpot&#xA0;VM &#x80FD;&#x6839;&#x636E;&#x6700;&#x5927; java &#x5806;&#x7684;&#x60C5;&#x51B5;&#x81EA;&#x52A8;&#x542F;&#x7528;&#x5B83;&#x3002;</p>
<p>(3). &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x9009;&#x62E9;&#xFF1A;</p>
<p>JVM &#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x9009;&#x62E9;&#x4E5F;&#x5F71;&#x54CD;&#x7740;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#xFF0C; HotSpot&#xA0;VM &#x63D0;&#x4F9B;&#x4E86;&#x591A;&#x79CD;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528; Throughput &#x6216; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x5C31;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7CFB;&#x7EDF;&#x5BF9;&#x541E;&#x5410;&#x91CF;&#x3001;&#x54CD;&#x5E94;&#x6027;&#x7B49;&#x9700;&#x6C42;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>4.&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x57FA;&#x7840;&#xFF1A;</p>
<p>(1). &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x7684;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#xFF1A;</p>
<p>A.&#x541E;&#x5410;&#x91CF;&#xFF1A;</p>
<p>&#x8BC4;&#x4EF7;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#x4E4B;&#x4E00;&#xFF0C;&#x6307;&#x4E0D;&#x8003;&#x8651;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F15;&#x8D77;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6216;&#x5185;&#x5B58;&#x6D88;&#x8017;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x80FD;&#x652F;&#x6491;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FBE;&#x5230;&#x7684;&#x6700;&#x9AD8;&#x6027;&#x80FD;&#x6307;&#x6807;&#x3002;</p>
<p>B.&#x5EF6;&#x8FDF;&#xFF1A;</p>
<p>&#x4E5F;&#x662F;&#x8BC4;&#x4EF7;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x80FD;&#x529B;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#xFF0C;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x662F;&#x7F29;&#x77ED;&#x7531;&#x4E8E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5F15;&#x8D77;&#x7684;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x6216;&#x5B8C;&#x5168;&#x6D88;&#x9664;&#x56E0;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6240;&#x5F15;&#x8D77;&#x7684;&#x505C;&#x987F;&#xFF0C;&#x907F;&#x514D;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x53D1;&#x751F;&#x6296;&#x52A8;&#x3002;</p>
<p>C.&#x5185;&#x5B58;&#x5360;&#x7528;&#xFF1A;</p>
<p>&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x6D41;&#x7545;&#x8FD0;&#x884C;&#x6240;&#x9700;&#x8981;&#x7684;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x4E0A;&#x8FF0; 3 &#x4E2A;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x63D0;&#x9AD8;&#xFF0C;&#x90FD;&#x4F1A;&#x5BF9;&#x5176;&#x4ED6;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#x5E26;&#x6765;&#x635F;&#x5931;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x6839;&#x636E;&#x5E94;&#x7528;&#x573A;&#x666F;&#x786E;&#x5B9A;&#x4E0A;&#x8FF0;&#x6027;&#x80FD;&#x5C5E;&#x6027;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;</p>
<p>(2). &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.Minor&#xA0;GC &#x56DE;&#x6536;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x6BCF;&#x6B21; Minor&#xA0;GC &#x90FD;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x5730;&#x6536;&#x96C6;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#xFF0C;&#x9075;&#x5FAA;&#x8FD9;&#x4E00;&#x539F;&#x5219;&#x53EF;&#x4EE5;&#x51CF;&#x5C11; Full&#xA0;GC &#x7684;&#x9891;&#x7387;&#xFF0C; Full&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x603B;&#x662F;&#x6700;&#x957F;&#x7684;&#xFF0C;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x8FBE;&#x5230;&#x5176;&#x5EF6;&#x8FDF;&#x6216;&#x541E;&#x5410;&#x91CF;&#x8981;&#x6C42;&#x7684;&#x7F6A;&#x9B41;&#x7978;&#x9996;&#x3002;</p>
<p>B.GC &#x5185;&#x5B58;&#x6700;&#x5927;&#x5316;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x5904;&#x7406;&#x541E;&#x5410;&#x91CF;&#x548C;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5783;&#x573E;&#x5904;&#x7406;&#x5668;&#x80FD;&#x4F7F;&#x7528;&#x7684;&#x5185;&#x5B58;&#x8D8A;&#x5927;&#xFF0C;&#x5373; java &#x5806;&#x7A7A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6548;&#x679C;&#x8D8A;&#x597D;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E5F;&#x7EA6;&#x6D41;&#x7545;&#x3002;</p>
<p>C.GC &#x8C03;&#x4F18;&#x7684; 3 &#x9009; 2 &#x539F;&#x5219;&#xFF1A;</p>
<p>&#x5728;&#x4E09;&#x4E2A;&#x6027;&#x80FD;&#x5C5E;&#x6027; ( &#x541E;&#x5410;&#x91CF;&#x3001;&#x5EF6;&#x8FDF;&#x548C;&#x5185;&#x5B58;&#x5360;&#x7528; ) &#x4E2D;&#x4EFB;&#x610F;&#x9009;&#x62E9;&#x4E24;&#x4E2A;&#x8FDB;&#x884C; JVM &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x3002;</p>
<p>5.&#x786E;&#x5B9A;&#x5185;&#x5B58;&#x5360;&#x7528;&#xFF1A;</p>
<p>(1). &#x8BA1;&#x7B97;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x6307;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x957F;&#x671F;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x6240;&#x5360;&#x7528;&#x7684; java &#x5806;&#x5185;&#x5B58;&#x91CF;&#xFF0C;&#x5373;&#x5B83;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E8E;&#x7A33;&#x5B9A;&#x6001;&#x65F6;&#xFF0C; Full&#xA0;GC &#x4E4B;&#x540E; java &#x5806;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F; ( &#x5305;&#x62EC;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E; ) &#x3002;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x662F;&#x786E;&#x5B9A;&#x8FD0;&#x884C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6240;&#x9700; java &#x5806;&#x5927;&#x5C0F;&#x7684;&#x5207;&#x5165;&#x70B9;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5EA6;&#x91CF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#xFF0C;&#x6700;&#x597D;&#x5728;&#x591A;&#x6B21; Full&#xA0;GC &#x4E4B;&#x540E;&#x5728;&#x67E5;&#x770B; java &#x5806;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x53E6;&#x5916;&#xFF0C;&#x9700;&#x8981;&#x786E;&#x4FDD; Full&#xA0;GC &#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6B63;&#x5904;&#x4E8E;&#x7A33;&#x5B9A;&#x6001;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x53D1;&#x751F; Full&#xA0;GC &#x6216;&#x8005;&#x4E0D;&#x7ECF;&#x5E38;&#x53D1;&#x751F; Full&#xA0;GC &#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; JConsole &#x3001; VisualVM &#x6216;&#x8005; jmap( &#x9700;&#x8981;&#x4F7F;&#x7528; &#x201D;jmap&#xA0;-histo:live&#xA0;PID&#x201D;&#x547D;&#x4EE4; ) &#x4EBA;&#x5DE5;&#x89E6;&#x53D1; Full&#xA0;GC &#x3002;</p>
<p>(2). &#x521D;&#x59CB;&#x5806;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x914D;&#x7F6E;&#xFF1A;</p>
<p>&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x4E4B;&#x540E;&#xFF0C;&#x4E0B;&#x9762;&#x662F;&#x521D;&#x59CB;&#x5806;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x914D;&#x7F6E;&#x7684;&#x901A;&#x7528;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.java &#x5806;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -Xmx &#x548C; -Xms &#x5C06; java &#x5806;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 3~4 &#x500D;&#x3002;</p>
<p>B.&#x6C38;&#x4E45;&#x4EE3;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -XX:PermSize &#x548C; -XX:MaxPermSize &#x5C06;&#x6C38;&#x4E45;&#x4EE3;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x6C38;&#x4E45;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1.2~1.5 &#x500D;&#x3002;</p>
<p>C.&#x65B0;&#x751F;&#x4EE3;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -Xmn &#x5C06;&#x65B0;&#x751F;&#x4EE3;&#x521D;&#x59CB;&#x5927;&#x5C0F;&#x8BBE;&#x7F6E;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1~1.5 &#x500D;&#x3002;</p>
<p>D.&#x8001;&#x5E74;&#x4EE3;&#xFF1A;</p>
<p>&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5927;&#x5C0F; =java &#x5806; - &#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x5E94;&#x8BBE;&#x7F6E;&#x4E3A;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 2~3 &#x500D;&#x3002;</p>
<p>6.&#x8C03;&#x4F18;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#xFF1A;</p>
<p>(1). &#x786E;&#x5B9A;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#x7CFB;&#x7EDF;&#x8981;&#x6C42;&#xFF1A;</p>
<p>A.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x5E73;&#x5747;&#x505C;&#x6EDE;&#x65F6;&#x95F4;&#x3002;</p>
<p>B.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684; Minor&#xA0;GC( &#x4F1A;&#x5BFC;&#x81F4;&#x5EF6;&#x8FDF; ) &#x9891;&#x7387;&#x3002;</p>
<p>C.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x5927;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x3002;</p>
<p>D.&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x6700;&#x5927;&#x505C;&#x987F;&#x53D1;&#x751F;&#x9891;&#x7387;&#x3002;</p>
<p>(2). &#x8BC4;&#x4F30;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5BF9;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#x5F71;&#x54CD;&#x56E0;&#x7D20;&#xFF1A;</p>
<p>A.&#x6D4B;&#x91CF; Minor&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>B.&#x7EDF;&#x8BA1; Minor&#xA0;GC &#x7684;&#x9891;&#x7387;&#x3002;</p>
<p>C.&#x6D4B;&#x91CF; Full&#xA0;GC &#x7684;&#x6700;&#x5DEE; ( &#x6700;&#x957F; ) &#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>D.&#x7EDF;&#x8BA1;&#x6700;&#x5DEE;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; Full&#xA0;GC &#x7684;&#x9891;&#x7387;&#x3002;</p>
<p>(3). &#x4F18;&#x5316;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>Minor&#xA0;GC &#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x53CA;&#x9891;&#x7387;&#x4E0E;&#x65B0;&#x751F;&#x4EE3;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x8D8A;&#x5C0F;&#xFF0C; Minor&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8D8A;&#x77ED;&#xFF0C;&#x4F46;&#x662F; Minor&#xA0;GC &#x7684;&#x9891;&#x7387;&#x4F1A;&#x8D8A;&#x5927;&#xFF1B;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C; Minor&#xA0;GC &#x7684;&#x53D1;&#x751F;&#x9891;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x4F46;&#x662F; Minor&#xA0;GC &#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x8D8A;&#x957F;&#x3002;</p>
<p>&#x8C03;&#x6574;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E0D;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1.5 &#x500D;&#xFF0C;&#x5728;&#x56E0;&#x8C03;&#x6574; Minor&#xA0;GC &#x6301;&#x7EED;&#x65F6;&#x95F4;&#x548C;&#x9891;&#x7387;&#x800C;&#x8C03;&#x6574;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x65F6;&#xFF0C;&#x8981;&#x786E;&#x4FDD;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x540C;&#x6B65;&#x8C03;&#x6574; java &#x5806;&#x548C;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x3002;</p>
<p>B. &#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x81F3;&#x5C11;&#x5E94;&#x4E3A; java &#x5806;&#x5927;&#x5C0F;&#x7684; 10% &#x3002;</p>
<p>C.java &#x5806;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>java &#x5806;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E0D;&#x8981;&#x8D85;&#x8FC7; JVM &#x53EF;&#x7528;&#x7269;&#x7406;&#x5185;&#x5B58;&#x3002;</p>
<p>(4). &#x4F18;&#x5316;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x53D1;&#x751F;&#x4E8E;&#x7A33;&#x5B9A;&#x6001;&#x7684; Full&#xA0;GC &#x6301;&#x7EED;&#x65F6;&#x95F4;&#x662F;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6700;&#x5DEE; Full&#xA0;GC &#x6301;&#x7EED;&#x65F6;&#x95F4;&#xFF0C; Full&#xA0;GC &#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x662F;&#x6700;&#x5DEE; Full&#xA0;GC &#x9891;&#x7387;&#x3002;</p>
<p>&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x539F;&#x5219;&#xFF1A;</p>
<p>A.&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x65F6;&#xFF0C;&#x786E;&#x4FDD;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x540C;&#x6B65;&#x8C03;&#x6574; java &#x5806;&#x5927;&#x5C0F;&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x3002;</p>
<p>B.Full&#xA0;GC &#x9891;&#x7387;&#x7684;&#x9884;&#x4F30;&#x5E94;&#x8BE5;&#x4F9D;&#x636E;&#x5BF9;&#x8C61;&#x7684;&#x63D0;&#x5347;&#x7387;&#x8FDB;&#x884C;&#x8BA1;&#x7B97;&#xFF1A;</p>
<p>&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x7387;&#x662F;&#x5BF9;&#x8C61;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x590D;&#x5236;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x5BF9;&#x8C61;&#x7684;&#x6BD4;&#x7387;&#xFF0C;&#x8BA1;&#x7B97;&#x65B9;&#x6CD5;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x89C2;&#x5BDF; Full&#xA0;GC &#x4E4B;&#x524D;&#x7684;&#x8FDE;&#x7EED;&#x591A;&#x4E2A; Minor&#xA0;GC &#x4E2D;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x8BA1;&#x7B97;&#x76F8;&#x90BB; Minor&#xA0;GC &#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x3002;</p>
<p>&#x7B2C;&#x4E09;&#xFF0C;&#x8BA1;&#x7B97; Minor&#xA0;GC &#x5BF9;&#x8C61;&#x5E73;&#x5747;&#x63D0;&#x5347;&#x901F;&#x5EA6; = &#x76F8;&#x90BB; Minor&#xA0;GC &#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528; /Minor&#xA0;GC &#x95F4;&#x9694;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#xFF0C;&#x4F30;&#x7B97; Full&#xA0;GC &#x9891;&#x7387; = &#x8001;&#x5E74;&#x4EE3;&#x5269;&#x4F59;&#x7A7A;&#x95F4; /Minor&#xA0;GC &#x5BF9;&#x8C61;&#x5E73;&#x5747;&#x63D0;&#x5347;&#x901F;&#x5EA6;&#x3002;</p>
<p>7.CMS &#x8C03;&#x4F18;&#x5EF6;&#x8FDF; / &#x54CD;&#x5E94;&#x6027;&#xFF1A;</p>
<p>CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E2D; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x4E0E; Full&#xA0;GC &#x6709;&#x7EC6;&#x5FAE;&#x533A;&#x522B;&#xFF1A;&#x82E5;&#x8001;&#x5E74;&#x4EE3;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7A7A;&#x95F4;&#x5904;&#x7406;&#x6765;&#x81EA;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5373;&#x8001;&#x5E74;&#x4EE3;&#x6EA2;&#x51FA;&#xFF0C;&#x5219;&#x53EA;&#x4F1A;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x89E6;&#x53D1;&#x4E00;&#x6B21; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF1B;&#x53D1;&#x751F; Full&#xA0;GC &#x65F6;&#xFF0C;&#x89E6;&#x53D1;&#x4F7F;&#x7528;&#x4E86; -XX:-ScavengeBeforeFullGC &#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x5426;&#x5219;&#x8001;&#x5E74;&#x4EE3;&#x548C;&#x65B0;&#x751F;&#x4EE3;&#x90FD;&#x4F1A;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x3002;</p>
<p>&#x7531;&#x4E8E; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x5BF9;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x538B;&#x7F29;&#xFF0C;&#x8017;&#x65F6;&#x6BD4;&#x8F83;&#x957F;&#xFF0C;&#x56E0;&#x6B64;&#x8C03;&#x4F18; CMS &#x6536;&#x96C6;&#x5668;&#x7684;&#x76EE;&#x7684;&#x662F;&#x907F;&#x514D; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x3002;</p>
<p>(1). &#x8C03;&#x7528;&#x65B0;&#x751F;&#x4EE3;&#x7684; Survivor &#x7A7A;&#x95F4;&#xFF1A;</p>
<p>HotSpot&#xA0;VM &#x7684;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x901A;&#x5E38;&#x5206;&#x4E3A;&#x4E09;&#x90E8;&#x5206;&#xFF1A; Eden &#x3001; Survivor&#xA0;From &#x548C; Survivor&#xA0;To &#xFF0C;&#x5176;&#x4E2D; Survivor&#xA0;From &#x548C; Survivor&#xA0;To &#x662F;&#x76F8;&#x4E92;&#x4E92;&#x6362;&#x7684;&#xFF0C;&#x65B0;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x901A;&#x5E38;&#x5B58;&#x653E;&#x5728; Eden &#x548C; Survivor&#xA0;From &#x4E2D;&#xFF0C; Minor&#xA0;GC &#x4E4B;&#x540E;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x4F1A;&#x5B58;&#x653E;&#x5728; Survivor&#xA0;To &#x4E2D;&#xFF0C;&#x5408;&#x9002;&#x5927;&#x5C0F;&#x7684; Survivor &#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97; Minor&#xA0;GC &#x56DE;&#x6536;&#x6700;&#x591A;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#xFF0C;&#x907F;&#x514D;&#x77ED;&#x671F;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x589E;&#x52A0;&#x8001;&#x5E74;&#x4EE3;&#x788E;&#x7247;&#x3002;</p>
<p>A.Survivor &#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7; -XX:SurvivorRation=&lt;ration&gt; &#x9009;&#x9879;&#x6765;&#x63A7;&#x5236;&#xFF0C;</p>
<p>Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F; =-Xmn&lt;value&gt;/(-XX:SurvivorRation=&lt;ration&gt;+2) &#x3002;</p>
<p>B.Survivor &#x7A7A;&#x95F4;&#x8C03;&#x6574;&#xFF1A;</p>
<p>&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x65B0;&#x751F;&#x4EE3;&#xFF0C;&#x51CF;&#x5C11; Survivor &#x6BD4;&#x7387;&#x4F1A;&#x589E;&#x5927; Survivor &#x7A7A;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x51CF;&#x5C11; Eden &#x7A7A;&#x95F4;&#xFF0C;&#x5BFC;&#x81F4;&#x66F4;&#x9891;&#x7E41;&#x7684; Minor&#xA0;GC &#xFF0C;&#x5373;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x9891;&#x7387;&#x8D8A;&#x9AD8;&#xFF0C;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x7684;&#x901F;&#x5EA6;&#x8D8A;&#x5FEB;&#xFF1B;&#x589E;&#x5927; Survivor &#x6BD4;&#x7387;&#x4F1A;&#x51CF;&#x5C11; Survivor &#x7A7A;&#x95F4;&#xFF0C;&#x540C;&#x65F6;&#x589E;&#x5927; Eden &#x7A7A;&#x95F4;&#xFF0C;&#x51CF;&#x5C11; Minor&#xA0;GC &#x9891;&#x7387;&#xFF0C;&#x5373;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x9891;&#x7387;&#x8D8A;&#x4F4E;&#xFF0C;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x7684;&#x901F;&#x5EA6;&#x8D8A;&#x6162;&#x3002;</p>
<p>C.&#x8C03;&#x6574; Survivor &#x7A7A;&#x95F4;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x82E5;&#x53EF;&#x4EE5;&#x589E;&#x52A0; Minor&#xA0;GC &#x9891;&#x7387;&#xFF0C;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x4E00;&#x90E8;&#x5206; Eden &#x7A7A;&#x95F4;&#x6765;&#x589E;&#x5927; Survivor &#x7A7A;&#x95F4;&#xFF1B;&#x82E5;&#x5185;&#x5B58;&#x8DB3;&#x591F;&#xFF0C;&#x6700;&#x597D;&#x589E;&#x52A0;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x4FDD;&#x6301; Eden &#x7A7A;&#x95F4;&#x6052;&#x5B9A;&#x7684;&#x540C;&#x65F6;&#x589E;&#x52A0; Survivor &#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x8C03;&#x6574; Survivor &#x7A7A;&#x95F4;&#x8981;&#x548C;&#x76D1;&#x63A7;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#x4E00;&#x8D77;&#x914D;&#x5408;&#x3002;</p>
<p>(2). &#x8C03;&#x6574;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF1A;</p>
<p>&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x5E74;&#x9F84;&#x662F;&#x5B83;&#x6240;&#x7ECF;&#x5386;&#x7684; Minor&#xA0;GC &#x6B21;&#x6570;&#xFF0C;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x4E2D;&#x5E74;&#x9F84;&#x5927;&#x4E8E;&#x664B;&#x5347;&#x9600;&#x503C;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x4F1A;&#x88AB;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#xFF0C;&#x5373;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#x51B3;&#x5B9A;&#x4E86;&#x5BF9;&#x8C61;&#x5728;&#x65B0;&#x751F;&#x4EE3; Survivor &#x7A7A;&#x95F4;&#x4FDD;&#x7559;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x4E2D;&#x7684;&#x6709;&#x6548;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x5C06;&#x4E0D;&#x6210;&#x719F;&#x7684;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x7387;&#x589E;&#x957F;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x964D;&#x4F4E;&#x4E86; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x6267;&#x884C;&#x9891;&#x7387;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x53EF;&#x80FD;&#x7684;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x788E;&#x7247;&#x3002;</p>
<p>A.&#x76D1;&#x63A7;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -XX:+PrintTenuringDistribution &#x9009;&#x9879;&#x53EF;&#x4EE5;&#x76D1;&#x63A7;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x7684;&#x53D1;&#x5E03;&#x6216;&#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x53D1;&#x5E03;&#xFF0C;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>Desired&#xA0;survivor&#xA0;size&#xA0;3506176&#xA0;bytes,&#xA0;new&#xA0;threshold&#xA0;1&#xA0;(max&#xA0;15)</p>
<p>-&#xA0;age&#xA0;&#xA0;&#xA0;1:&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;bytes,&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;total</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#x6765;&#x9ED8;&#x8BA4;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x4E3A;15 &#xFF0C;&#x7531; (max&#xA0;15)&#x6807;&#x8BC6;&#xFF1B;&#x901A;&#x8FC7;new&#xA0;threshold&#xA0;1&#xA0;&#x53EF;&#x4EE5;&#x77E5;&#x9053;&#x865A;&#x62DF;&#x673A;&#x5185;&#x90E8;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x4E3A;1 &#xFF1B; Desired&#xA0;survivor&#xA0;size&#xA0;3506176&#xA0;bytes&#x662F;Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4E58;&#x4EE5;&#x76EE;&#x6807;&#x5B58;&#x6D3B;&#x7387; ( &#x7531; -XX:TargetSurvivorRation=&lt;percent&gt; &#x9009;&#x9879;&#x63A7;&#x5236;&#xFF0C;&#x9ED8;&#x8BA4;&#x662F; 50) &#x5F97;&#x5230;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF1B; -&#xA0;age&#xA0;&#xA0;&#xA0;1:&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;bytes,&#xA0;&#xA0;&#xA0;&#xA0;7012344&#xA0;total&#x662F;&#x6BCF;&#x4E2A;&#x5E74;&#x9F84;&#x6BB5;&#x5BF9;&#x8C61;&#x53CA;&#x5176;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x5355;&#x72EC;&#x5217;&#x4E3A;&#x4E00;&#x884C;&#x3002;</p>
<p>&#x7531;&#x4E0A;&#x9762;&#x4F8B;&#x5B50;&#x770B;&#x51FA;&#x671F;&#x671B;&#x7684;Survivor &#x7A7A;&#x95F4; 3506176&#xA0;bytes&#x8FDC;&#x5C0F;&#x4E8E;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;7012344&#xA0;bytes&#xFF0C;&#x5BFC;&#x81F4;Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97; Minor&#xA0;GC &#x5C06;&#x4E00;&#x4E9B;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x3002;</p>
<p>&#x89C2;&#x5BDF;&#x5230; Survivor &#x7A7A;&#x95F4;&#x8FC7;&#x5C0F;&#x65F6;&#xFF0C;&#x8C03;&#x6574; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x4F7F;&#x5F97;&#x603B;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E;&#x671F;&#x671B;&#x7684; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x540C;&#x65F6;&#x4F7F;&#x5F97;&#x664B;&#x5347;&#x9600;&#x503C;&#x7B49;&#x4E8E;&#x6700;&#x5927;&#x664B;&#x5347;&#x9600;&#x503C;&#x3002;</p>
<p>B.&#x8C03;&#x6574;&#x5BF9;&#x8C61;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#xFF1A;</p>
<p>&#x4F7F;&#x7528; -XX:MaxTenuringThreshold=&lt;n&gt; &#x9009;&#x9879;&#x6307;&#x5B9A; HotSpot&#xA0;VM &#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x6700;&#x5927;&#x664B;&#x5347;&#x9600;&#x503C;&#xFF0C;&#x5F53;&#x76EE;&#x6807; Survivor &#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; HotSpot&#xA0;VM &#x671F;&#x671B;&#x7EF4;&#x62A4;&#x7684;&#x503C;&#x65F6;&#xFF0C; HotSpot&#xA0;VM &#x5C06;&#x4F7F;&#x7528;&#x6700;&#x5927;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x4F5C;&#x4E3A;&#x5176;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#xFF1B;&#x5F53;&#x76EE;&#x6807; Survivor &#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x5927;&#x4E8E; HotSpot&#xA0;VM &#x671F;&#x671B;&#x7EF4;&#x62A4;&#x7684;&#x503C;&#x65F6;&#xFF0C; HotSpot&#xA0;VM &#x5C06;&#x4F7F;&#x7528;&#x8BA1;&#x7B97;&#x51FA;&#x7684;&#x4F4E;&#x4E8E;&#x6700;&#x5927;&#x9600;&#x503C;&#x7684;&#x664B;&#x5347;&#x9600;&#x503C;&#x6765;&#x4FDD;&#x8BC1;&#x76EE;&#x6807; Survivor &#x7A7A;&#x95F4;&#x7684;&#x5360;&#x7528;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x539F;&#x5219;&#xFF1A;</p>
<p>&#x4E0D;&#x5EFA;&#x8BAE;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A; 0 &#xFF0C;&#x8FD9;&#x4F1A;&#x9020;&#x6210;&#x521A;&#x521A;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x5728;&#x968F;&#x540E;&#x7684; Minor&#xA0;GC &#x4E2D;&#x76F4;&#x63A5;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x5F15;&#x8D77;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x8FC5;&#x901F;&#x589E;&#x957F;&#xFF0C;&#x5BFC;&#x81F4;&#x9891;&#x7E41;&#x7684; Full&#xA0;GC &#xFF1B;</p>
<p>&#x4E5F;&#x4E0D;&#x5EFA;&#x8BAE;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x8FDC;&#x5927;&#x4E8E;&#x5B9E;&#x9645;&#x53EF;&#x80FD;&#x7684;&#x6700;&#x5927;&#x503C;&#xFF0C;&#x8FD9;&#x4F1A;&#x9020;&#x6210;&#x5BF9;&#x8C61;&#x957F;&#x671F;&#x5B58;&#x5728;&#x4E8E; Survivor &#x7A7A;&#x95F4;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x540E; Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x4E00;&#x65E6; Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x5BF9;&#x8C61;&#x5C06;&#x88AB;&#x5168;&#x90E8;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x4E0D;&#x518D;&#x4F9D;&#x636E;&#x5176;&#x5B9E;&#x9645;&#x5E74;&#x9F84;&#x8FDB;&#x884C;&#x63D0;&#x5347;&#xFF0C;&#x5BFC;&#x81F4;&#x77ED;&#x671F;&#x5BF9;&#x8C61;&#x5728;&#x957F;&#x671F;&#x5BF9;&#x8C61;&#x4E4B;&#x524D;&#x88AB;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#xFF0C;&#x4E25;&#x91CD;&#x5F71;&#x54CD;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x673A;&#x5236;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002;</p>
<p>(3). &#x8C03;&#x7528;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#xFF1A;</p>
<p>CMS &#x7684;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x548C;&#x664B;&#x5347;&#x5E74;&#x9F84;&#x9600;&#x503C;&#x8C03;&#x6574;&#x597D;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x8BC1;&#x5927;&#x90E8;&#x5206;&#x5783;&#x573E;&#x5BF9;&#x8C61;&#x5728; Minor&#xA0;GC &#x65F6;&#x88AB;&#x56DE;&#x6536;&#xFF0C;&#x540C;&#x65F6;&#x4FDD;&#x8BC1;&#x5BF9;&#x8C61;&#x6709;&#x6548;&#x8001;&#x5316;&#xFF0C;&#x5373;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#x589E;&#x957F;&#x53EF;&#x63A7;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x8981;&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x907F;&#x514D;&#x8001;&#x5E74;&#x4EE3;&#x53D1;&#x751F; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x3002;</p>
<p>&#x6210;&#x529F;&#x7684; CMS &#x6536;&#x96C6;&#x5668;&#x6027;&#x80FD;&#x8C03;&#x4F18;&#x8981;&#x80FD;&#x4EE5;&#x5BF9;&#x8C61;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x540C;&#x7B49;&#x901F;&#x5EA6;&#x5BF9;&#x8001;&#x5E74;&#x4EE3;&#x5BF9;&#x8C61;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x8FBE;&#x4E0D;&#x5230;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x5219;&#x79F0;&#x4E4B;&#x4E3A; &#x201D;&#x5931;&#x901F;&#x201D;(Lost&#xA0;the&#xA0;race) &#xFF0C;&#x5931;&#x901F;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x4F1A;&#x53D1;&#x751F; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x3002;&#x907F;&#x514D;&#x5931;&#x901F;&#x7684;&#x5173;&#x952E;&#x662F;&#x8981;&#x7ED3;&#x5408;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x548C;&#x8DB3;&#x591F;&#x5FEB;&#x5730;&#x521D;&#x59CB;&#x5316; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#xFF0C;&#x8BA9;&#x5B83;&#x6BD4;&#x63D0;&#x5347;&#x901F;&#x7387;&#x66F4;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x56DE;&#x6536;&#x7A7A;&#x95F4;&#x3002;</p>
<p>CMS &#x5468;&#x671F;&#x7684;&#x521D;&#x59CB;&#x5316;&#x5468;&#x671F;&#x57FA;&#x4E8E;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x679C; CMS &#x5F00;&#x59CB;&#x7684;&#x592A;&#x665A;&#xFF0C;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x5931;&#x901F;&#xFF1B;&#x4F46;&#x662F;&#x5982;&#x679C; CMS &#x5468;&#x671F;&#x542F;&#x52A8;&#x7684;&#x592A;&#x65E9;&#xFF0C;&#x53C8;&#x4F1A;&#x5F15;&#x8D77;&#x65E0;&#x7528;&#x7684;&#x6D88;&#x8017;&#xFF0C;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;</p>
<p>HotSpot&#xA0;VM &#x4F1A;&#x5C1D;&#x8BD5;&#x81EA;&#x9002;&#x5E94;&#x7B2C;&#x8BA1;&#x7B97;&#x5728;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x591A;&#x5927;&#x65F6;&#x5F00;&#x542F; CMS &#x6536;&#x96C6;&#x5468;&#x671F;&#xFF0C;&#x4F46;&#x662F;&#x505A;&#x7684;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x4F1A;&#x51FA;&#x73B0; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF0C;&#x901A;&#x8FC7;&#x5728; GC &#x65E5;&#x5FD7;&#x4E2D;&#x67E5;&#x627E;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#x5931;&#x6548; (Concurrent&#xA0;Mode&#xA0;Failure) &#x5B9A;&#x4F4D; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF0C;&#x5982;&#x679C;&#x53D1;&#x751F; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x914D;&#x7F6E;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#x4EE5;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#xFF1A;</p>
<p>A.-XX:CMSInitiatingOccupancyFraction=&lt;percent&gt; &#xFF1A;</p>
<p>&#x8BBE;&#x5B9A;&#x7684;&#x503C;&#x662F; CMS &#x5783;&#x573E;&#x6536;&#x96C6;&#x5468;&#x671F;&#x5728;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x8FBE;&#x5230;&#x591A;&#x5C11;&#x767E;&#x5206;&#x6BD4;&#x65F6;&#x542F;&#x52A8;&#xFF0C;&#x4EC5;&#x5728;&#x7B2C;&#x4E00;&#x4E2A; CMS &#x5468;&#x671F;&#x4E2D;&#x4F7F;&#x7528;&#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#xFF0C;&#x4E4B;&#x540E;&#x5468;&#x671F;&#x53C8;&#x8F6C;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x7684;&#x539F;&#x5219;&#x4E3A;&#x81F3;&#x5C11;&#x5E94;&#x8BE5;&#x662F;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; 1.5 &#x500D;&#x3002;</p>
<p>B.-XX:+UseCMSInitiatingOccupancyOnly &#xFF1A;</p>
<p>&#x4E0E; -XX:CMSInitiatingOccupancyFraction=&lt;percent&gt; &#x9009;&#x9879;&#x4E00;&#x8D77;&#x4F7F;&#x7528;&#xFF0C;&#x544A;&#x77E5; HotSpot&#xA0;VM &#x603B;&#x662F;&#x4F7F;&#x7528; -XX:CMSInitiatingOccupancyFraction=&lt;percent&gt; &#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#x4F5C;&#x4E3A;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x7684;&#x9600;&#x503C;&#x3002;</p>
<p>(4). &#x8C03;&#x4F18; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x6536;&#x96C6;&#xFF1A;</p>
<p>Full&#xA0;GC &#x4E5F;&#x53EF;&#x80FD;&#x6E90;&#x4E8E;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x7528;&#x5C3D;&#xFF0C;&#x901A;&#x8FC7;&#x76D1;&#x63A7; GC &#x65E5;&#x5FD7;&#xFF0C;&#x53EF;&#x4EE5;&#x5224;&#x65AD; Full&#xA0;GC &#x662F;&#x5426;&#x7531;&#x6C38;&#x4E45;&#x4EE3;&#x8017;&#x5C3D;&#x5F15;&#x8D77;&#x3002;</p>
<p>&#x5728; CMS &#x4E2D;&#xFF0C; HotSpot&#xA0;VM &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#x4E0D;&#x4F1A;&#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#xFF0C;&#x53EF;&#x4EE5;&#x63A7;&#x5236; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x6536;&#x96C6;&#xFF1A;</p>
<p>A.&#x5F00;&#x542F; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF1A;</p>
<p>-XX:+CMSClassUnloadingEnabled &#xFF0C; Java6&#xA0;Update3 &#x6216;&#x66F4;&#x65B0;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:+CMSPermGenSweepingEnabled &#x4E0E; -XX:+CMSClassUnloadingEnabled &#x4E00;&#x8D77;&#x914D;&#x5408;&#x4F7F;&#x7528;&#x3002;</p>
<p>B.&#x8C03;&#x6574;&#x6C38;&#x4E45;&#x4EE3;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x548C;&#x8001;&#x5E74;&#x4EE3;&#x7C7B;&#x4F3C;&#xFF0C;&#x5F00;&#x542F; CMS &#x5BF9;&#x6C38;&#x4E45;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#x4E4B;&#x540E;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x5B9A;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#xFF0C;&#x6765;&#x63A7;&#x5236; CMS &#x5728;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x53C2;&#x6570;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>-XX:CMSInitiatingPermOccupancyFraction=&lt;percent&gt; &#xFF1A;</p>
<p>&#x6307;&#x5B9A;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#x7387;&#x8FBE;&#x5230;&#x591A;&#x5C11;&#x767E;&#x5206;&#x6BD4;&#x65F6;&#x542F;&#x52A8; CMS &#x5728;&#x6C38;&#x4E45;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF0C;&#x4EC5;&#x5728;&#x4EC5;&#x5728;&#x7B2C;&#x4E00;&#x4E2A; CMS &#x5468;&#x671F;&#x4E2D;&#x4F7F;&#x7528;&#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#xFF0C;&#x4E4B;&#x540E;&#x5468;&#x671F;&#x53C8;&#x8F6C;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x3002;</p>
<p>-XX:+UseCMSInitiatingOccupancyOnly &#xFF1A;<br>&#x4E0E; -XX:CMSInitiatingPermOccupancyFraction=&lt;percent&gt; &#x4E00;&#x8D77;&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x544A;&#x77E5; HotSpot&#xA0;VM &#x603B;&#x662F;&#x4F7F;&#x7528; -XX:CMSInitiatingPermOccupancyFraction=&lt;percent&gt; &#x8BBE;&#x5B9A;&#x7684;&#x6BD4;&#x7387;&#x4F5C;&#x4E3A;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x7684;&#x9600;&#x503C;&#x3002;</p>
<p>(5). &#x8C03;&#x4F18; CMS &#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF1A;</p>
<p>CMS &#x5468;&#x671F;&#x4E2D;&#x6709;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x662F; Stop-The-World &#x7684;&#x9636;&#x6BB5;&#xFF1A;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x548C;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#xFF0C;&#x5904;&#x4E8E;&#x8FD9;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x88AB;&#x963B;&#x585E;&#xFF0C;&#x867D;&#x7136;&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x5374;&#x6781;&#x5C11;&#x5360;&#x5F88;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x8FDC;&#x5C0F;&#x4E8E;&#x5176;&#x4ED6;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x505C;&#x987F;&#xFF0C;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0B;&#x9762;&#x7684; HotSpot&#xA0;VM &#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x63A7;&#x5236;&#xFF1A;</p>
<p>A.-XX:ParallelGCThreads=&lt;n&gt; &#xFF1A;<br>&#x63A7;&#x5236;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x4F7F;&#x7528;&#x7684;&#x7EBF;&#x7A0B;&#x6570;&#xFF0C;&#x82E5;Runtime.getRuntime().availableProcessors()&#x7684;&#x8FD4;&#x56DE;&#x503C;&#x5C0F;&#x4E8E;&#x7B49;&#x4E8E; 8 &#xFF0C;&#x5219;&#x9ED8;&#x8BA4;&#x7B49;&#x4E8E;&#x8FD9;&#x4E2A;&#x503C;&#xFF1B;&#x5426;&#x5219;&#xFF0C;&#x8BE5;&#x9ED8;&#x8BA4;&#x503C; =8+( Runtime.getRuntime().availableProcessors()&#xA0;-&#xA0;8)&#xA0;*&#xA0;5&#xA0;/&#xA0;8 &#x3002;</p>
<p>&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E8E;&#x540C;&#x4E00;&#x7CFB;&#x7EDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5EFA;&#x8BAE;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x7684;&#x5C0F;&#x4E8E;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x5426;&#x5219;&#x7531;&#x4E8E;&#x5927;&#x91CF;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7EBF;&#x7A0B;&#x540C;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x4F1A;&#x53D7;&#x5230;&#x6781;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p>B.-XX:+CMSScavengeBeforeRemark &#xFF1A;</p>
<p>&#x5F3A;&#x5236; HotSpot&#xA0;VM &#x5728;&#x8FDB;&#x5165; CMS &#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x4E4B;&#x524D;&#x5148;&#x8FDB;&#x884C;&#x4E00;&#x6B21; Minor&#xA0;GC &#xFF0C;&#x51CF;&#x5C11;&#x5F15;&#x7528;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x65B0;&#x751F;&#x4EE3;&#x5BF9;&#x8C61;&#x6570;&#x76EE;&#xFF0C;&#x51CF;&#x5C11;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x9636;&#x6BB5;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>C.-XX:+ParallelRefProcEnabled &#xFF1A;</p>
<p>&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;&#x5927;&#x91CF;&#x7684;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x6216;&#x53EF;&#x7EC8;&#x7ED3;&#x5BF9;&#x8C61;&#x8981;&#x5904;&#x7406;&#xFF0C;&#x4F7F;&#x7528;&#x8BE5;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3002;</p>
<p>8.&#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>(1).CMS &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>CMS &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#x4E0E;&#x5176;&#x5EF6;&#x8FDF;&#x8C03;&#x4F18;&#x7C7B;&#x4F3C;&#xFF0C;&#x7B80;&#x5355;&#x539F;&#x5219;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>A.&#x589E;&#x52A0;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x964D;&#x4F4E; Minor&#xA0;GC &#x9891;&#x7387;&#x3002;</p>
<p>B.&#x589E;&#x52A0;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x964D;&#x4F4E; CMS &#x5468;&#x671F;&#x9891;&#x7387;&#x5E76;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5E76;&#x53D1;&#x6A21;&#x5F0F;&#x5931;&#x6548;&#x4EE5;&#x53CA; Stop-The-World &#x7684;&#x538B;&#x7F29;&#x5F0F; GC &#x53D1;&#x751F;&#x51E0;&#x7387;&#x3002;</p>
<p>C.&#x8C03;&#x6574;&#x65B0;&#x751F;&#x4EE3;&#x4E2D; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x4EE5;&#x4F18;&#x5316;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#xFF0C;&#x51CF;&#x5C11;&#x7531;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x7684;&#x5BF9;&#x8C61;&#x6570;&#x76EE;&#xFF0C;&#x6700;&#x7EC8;&#x51CF;&#x5C11; CMS &#x5468;&#x671F;&#x53D1;&#x751F;&#x6570;&#x3002;</p>
<p>D.&#x4F18;&#x5316; CMS &#x5468;&#x671F;&#x542F;&#x52A8;&#x6761;&#x4EF6;&#xFF0C;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x8001;&#x5E74;&#x4EE3;&#x548C;&#x6C38;&#x4E45;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x7528;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x665A;&#x542F;&#x52A8; CMS &#x5468;&#x671F;&#x3002;</p>
<p>CMS &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#x7684;&#x6307;&#x5BFC;&#x539F;&#x5219;&#x662F; CMS &#x5305;&#x62EC; Minor&#xA0;GC &#x6240;&#x5E26;&#x6765;&#x7684;&#x5F00;&#x9500;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E; 10% &#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x5C06;&#x5F00;&#x9500;&#x964D;&#x4F4E;&#x5230; 1%~3% &#x3002;</p>
<p>(2).Throughput &#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>Throughput &#x6536;&#x96C6;&#x5668;&#x662F;&#x4EE5;&#x541E;&#x5410;&#x91CF;&#x6700;&#x4F18;&#x4E3A;&#x76EE;&#x6807;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5C3D;&#x53EF;&#x80FD;&#x907F;&#x514D;&#x53D1;&#x751F; Full&#xA0;GC &#xFF0C;&#x6216;&#x8005;&#x66F4;&#x7406;&#x60F3;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x5728;&#x7A33;&#x5B9A;&#x6001;&#x65F6;&#x6C38;&#x8FDC;&#x4E0D;&#x8981;&#x53D1;&#x751F; Full&#xA0;GC &#x3002;</p>
<p>Throughput &#x6536;&#x96C6;&#x5668;&#x9ED8;&#x8BA4;&#x542F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x81EA;&#x9002;&#x5E94;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x6839;&#x636E;&#x5BF9;&#x8C61;&#x5206;&#x914D;&#x4EE5;&#x53CA;&#x5B58;&#x6D3B;&#x7387;&#x81EA;&#x52A8;&#x5730;&#x5BF9;&#x65B0;&#x751F;&#x4EE3;&#x7684; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x4EE5;&#x6700;&#x4F18;&#x5316;&#x5BF9;&#x8C61;&#x8001;&#x5316;&#x9891;&#x7387;&#x3002;&#x81EA;&#x9002;&#x5E94;&#x8C03;&#x4F18;&#x65E2;&#x6613;&#x4E8E; JVM &#x8C03;&#x4F18;&#xFF0C;&#x53C8;&#x8FBE;&#x5230;&#x8DB3;&#x591F;&#x7684;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E9B;&#x9700;&#x8981;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x63D0;&#x9AD8;&#x541E;&#x5410;&#x91CF;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5982;&#x4E0B;&#x65B9;&#x5F0F;&#x7981;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x800C;&#x624B;&#x52A8;&#x8C03;&#x6574; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>A.-XX:-UseAdaptiveSizePolicy &#xFF1A;</p>
<p>&#x8BE5;&#x547D;&#x4EE4;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x7981;&#x7528;&#x81EA;&#x9002;&#x5E94;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x7279;&#x6027;&#xFF0C;&#x53EA;&#x5BF9; Throughput &#x6536;&#x96C6;&#x5668;&#x6709;&#x6548;&#x3002;</p>
<p>&#x7981;&#x7528;&#x5B83;&#x5C06;&#x4F1A;&#x727A;&#x7272;&#x6539;&#x53D8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x884C;&#x4E3A;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;</p>
<p>B.-XX:+PrintAdaptiveSizePolicy &#xFF1A;</p>
<p>&#x8BE5;&#x547D;&#x4EE4;&#x9009;&#x9879;&#x7528;&#x4E8E;&#x6253;&#x5370; Survivor &#x7A7A;&#x95F4;&#x5360;&#x7528;&#x65E5;&#x5FD7;&#xFF0C;&#x901A;&#x5E38;&#x4E0E; XX:+PrintGCDetails&#xA0; &#x3001; -XX:+PrintGCDateStamps &#x6216; -XX:+PrintGCTimeStamps &#x7B49;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x4E00;&#x8D77;&#x914D;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x76D1;&#x63A7; GC &#x65E5;&#x5FD7;&#x4E2D; Survivor &#x7A7A;&#x95F4;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x4E3A;&#x624B;&#x52A8;&#x8C03;&#x6574; Eden &#x548C; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#x63D0;&#x4F9B;&#x4F9D;&#x636E;&#xFF0C;&#x4F8B;&#x5B50;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>2015-05-20T11:01:59.507+0800:&#xA0; [GCAdaptiveSizePolicy::compute_survivor_space_size_and_thresh:&#xA0;&#xA0;</p>
<p>survived:&#xA0;651584&#xA0;&#xA0;</p>
<p>promoted:&#xA0;1622112&#xA0;&#xA0;</p>
<p>overflow:&#xA0;true&#xA0;</p>
<p>[PSYoungGen:&#xA0;4160K-&gt;636K(4800K)]&#xA0;</p>
<p>4160K-&gt;2220K(15744K),&#xA0;0.0057260&#xA0;secs]&#xA0;</p>
<p>[Times:&#xA0;user=0.00&#xA0;sys=0.00,&#xA0;real=0.01&#xA0;secs]</p>
<p>GCAdaptiveSizePolicy&#x6807;&#x7B7E;&#x8868;&#x660E;GC &#x65E5;&#x5FD7;&#x662F;&#x4EE5; -XX:+PrintAdaptiveSizePolicy &#x9009;&#x9879;&#x5F00;&#x542F;&#x7684;&#x3002;</p>
<p>Survived&#x6807;&#x7B7E;&#x540E;&#x9762;&#x7684;651584&#x662F;Survived&#xA0;To &#x7A7A;&#x95F4;&#x4E2D;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x3002;</p>
<p>Promoted&#x6807;&#x7B7E;&#x540E;&#x9762;&#x7684;1622112&#x662F;&#x7531;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x7684;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x3002;</p>
<p>Overflow&#x6807;&#x7B7E;&#x8868;&#x660E;&#x662F;&#x5426;Survived&#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#xFF0C;&#x5373;&#x6709;&#x65B0;&#x751F;&#x4EE3;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x81F3;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5BF9;Throughput &#x6536;&#x96C6;&#x5668;&#x7684; Survivor &#x7A7A;&#x95F4;&#x4E0D;&#x65AD;&#x8C03;&#x6574;&#x548C;&#x76D1;&#x63A7;&#xFF0C;&#x8BBE;&#x7F6E;&#x5408;&#x7406;&#x7684; Survivor &#x7A7A;&#x95F4;&#x5927;&#x5C0F;&#xFF0C;&#x4F7F;&#x5F97;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x5730;&#x53D1;&#x751F; Survivor &#x7A7A;&#x95F4;&#x6EA2;&#x51FA;&#x3002;</p>
<p>Throughput &#x6536;&#x96C6;&#x5668;&#x8C03;&#x4F18;&#x539F;&#x5219;&#x662F;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5F00;&#x9500;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E; 5% &#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x5C06;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7684;&#x5F00;&#x9500;&#x51CF;&#x5C11;&#x5230; 1% &#x751A;&#x81F3;&#x66F4;&#x5C11;&#xFF0C;&#x5C31;&#x8FBE;&#x5230;&#x6781;&#x9650;&#x4E86;&#x3002;</p>
<p>(3).NUMA &#x7CFB;&#x7EDF;&#x4E0A;&#x8C03;&#x4F18;&#xFF1A;</p>
<p>NUMA &#x7CFB;&#x7EDF;&#x662F;&#x975E;&#x4E00;&#x81F4;&#x6027;&#x5185;&#x5B58;&#x67B6;&#x6784;&#xFF0C;&#x652F;&#x6301; NUMA &#x7684; JVM &#x4F1A;&#x6839;&#x636E; NUMA &#x8282;&#x70B9;&#x5212;&#x5206;&#x5806;&#xFF0C;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x65F6;&#xFF0C;&#x53EA;&#x4F1A;&#x5728;&#x8BE5;&#x7EBF;&#x7A0B;&#x6240;&#x5728;&#x6838;&#x7684; NUMA &#x8282;&#x70B9;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#xFF0C;&#x540E;&#x7EED;&#x8BE5;&#x7EBF;&#x7A0B;&#x5982;&#x679C;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x5C31;&#x76F4;&#x63A5;&#x4ECE;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x8BBF;&#x95EE;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x8DE8; CPU &#x548C;&#x8DE8;&#x5185;&#x5B58;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x547D;&#x4EE4; (RHEL &#x4E0B;&#x4F7F;&#x7528; numactl) &#x8BBE;&#x7F6E; CPU &#x4EB2;&#x548C;&#x6027; (Affinity) &#xFF0C;&#x9ED8;&#x8BA4;&#x5C31;&#x8DE8;&#x591A;&#x4E2A;&#x5185;&#x5B58;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8DE8; CPU &#x6216;&#x5185;&#x5B58;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#xFF0C; HotSpot &#x4E3A; Throughput &#x6536;&#x96C6;&#x5668;&#x63D0;&#x4F9B; -XX:+UseNUMA &#x9009;&#x9879;&#xFF0C;&#x6839;&#x636E; CPU &#x4E0E;&#x5185;&#x5B58;&#x4F4D;&#x7F6E;&#x7684;&#x5173;&#x7CFB;&#x5728;&#x5206;&#x914D;&#x7EBF;&#x7A0B;&#x8FD0;&#x884C;&#x7684;&#x672C;&#x5730;&#x5185;&#x5B58;&#x4E2D;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x3002;</p>
<p>9.&#x5176;&#x4ED6;&#x4F18;&#x5316;&#x7B56;&#x7565;&#xFF1A;</p>
<p>(1). &#x5B9E;&#x9A8C;&#x6027; ( &#x6700;&#x8FD1;&#x6700;&#x5927; ) &#x4F18;&#x5316;&#xFF1A;</p>
<p>&#x65B0;&#x7684;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x96C6;&#x6210;&#x5230; HotSpot&#xA0;VM &#x65F6;&#xFF0C;&#x5E38;&#x5E38;&#x9996;&#x5148;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879; -XX:+AggressiveOpts &#x4E2D;&#x5F15;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x65B0;&#x7684;&#x4F18;&#x5316;&#x9009;&#x9879;&#x7ECF;&#x8FC7;&#x8BC1;&#x660E;&#x8DB3;&#x591F;&#x7A33;&#x5B9A;&#xFF0C;&#x5C31;&#x4F1A;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6027;&#x80FD;&#x8981;&#x6C42;&#x9AD8;&#x4E8E;&#x7A33;&#x5B9A;&#x6027;&#x8981;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x542F;&#x7528;&#x5B9E;&#x9A8C;&#x6027;&#x4F18;&#x5316;&#x3002;</p>
<p>(2). &#x9003;&#x9038;&#x5206;&#x6790;&#xFF1A;</p>
<p>&#x9003;&#x9038;&#x5206;&#x6790; (Escape&#xA0;Analysis) &#x662F;&#x4E00;&#x79CD;&#x8BC4;&#x4F30; java &#x5BF9;&#x8C61;&#x53EF;&#x89C1;&#x8303;&#x56F4;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x82E5;&#x7531;&#x67D0;&#x4E2A;&#x7EBF;&#x7A0B;&#x521B;&#x5EFA;&#x7684; java &#x5BF9;&#x8C61;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF0C;&#x5C31;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x8BE5;&#x5BF9;&#x8C61;&#x9003;&#x9038;&#x4E86;&#xFF0C;&#x82E5; java &#x5BF9;&#x8C61;&#x4E0D;&#x53D1;&#x751F;&#x9003;&#x9038;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8C03;&#x4F18;&#xFF0C;&#x8FD9;&#x79CD;&#x4F18;&#x5316;&#x6280;&#x672F;&#x88AB;&#x79F0;&#x4E3A;&#x9003;&#x9038;&#x5206;&#x6790;&#x3002;</p>
<p>HotSpot&#xA0;VM &#x4F7F;&#x7528; -XX:+DoEscapeAnalysis &#x547D;&#x4EE4;&#x9009;&#x9879;&#x5F00;&#x542F;&#x9003;&#x9038;&#x5206;&#x6790; ( &#x5728; Java6&#xA0;Update23 &#x4E4B;&#x540E;&#x9ED8;&#x8BA4;&#x5F00;&#x542F; ) &#xFF0C;&#x501F;&#x52A9;&#x9003;&#x9038;&#x5206;&#x6790;&#xFF0C; JIT &#x7F16;&#x8BD1;&#x5668;&#x53EF;&#x4EE5;&#x505A;&#x5982;&#x4E0B;&#x4F18;&#x5316;&#xFF1A;</p>
<p>A.&#x5BF9;&#x8C61;&#x5C55;&#x5F00;&#xFF1A;&#x5728;&#x53EF;&#x80FD;&#x76F4;&#x63A5;&#x56DE;&#x6536;&#x7684;&#x7A7A;&#x95F4;&#x800C;&#x975E; java &#x5806;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x5B57;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#x5BF9;&#x8C61;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5B58;&#x653E;&#x5728; CPU &#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x5728;&#x6808;&#x4E0A;&#x800C;&#x4E0D;&#x662F; java &#x5806;&#x4E0A;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#x3002;</p>
<p>B.&#x6807;&#x91CF;&#x66FF;&#x6362;&#xFF1A;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x7684;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x628A; java &#x5BF9;&#x8C61;&#x62C6;&#x6563;&#x4E3A;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x7684;&#x5B57;&#x6BB5;&#x76F4;&#x63A5;&#x5728; CPU &#x5BC4;&#x5B58;&#x5668;&#x4E2D;&#x5206;&#x914D;&#xFF0C;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x6B21;&#x6570;&#x3002;</p>
<p>C.&#x6808;&#x4E0A;&#x5206;&#x914D;&#xFF1A;&#x5728;&#x7EBF;&#x7A0B;&#x7684;&#x6808;&#x5E27;&#x4E0A;&#x800C;&#x975E; java &#x5806;&#x4E2D;&#x5206;&#x914D;&#x5BF9;&#x8C61;&#xFF0C;&#x51CF;&#x5C11;&#x5783;&#x573E;&#x6536;&#x96C6;&#x9891;&#x7387;&#x3002;</p>
<p>D.&#x6D88;&#x9664;&#x540C;&#x6B65;&#xFF1A;&#x82E5;&#x7EBF;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x4E0D;&#x4F1A;&#x53D1;&#x751F;&#x9003;&#x9038;&#xFF0C;&#x4E14;&#x8BE5;&#x7EBF;&#x7A0B;&#x6301;&#x6709;&#x8BE5;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x9501;&#xFF0C;&#x7531;&#x4E8E;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x4E0D;&#x4F1A;&#x8BBF;&#x95EE;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x901A;&#x8FC7; JIT &#x7F16;&#x8BD1;&#x5668;&#x79FB;&#x9664;&#x9501;&#x3002;</p>
<p>E.&#x6D88;&#x9664;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x8BFB; / &#x5199;&#x5C4F;&#x969C;&#xFF1A;&#x53EA;&#x6709;&#x7EBF;&#x7A0B;&#x5206;&#x914D;&#x7684;&#x5BF9;&#x8C61;&#x5728;&#x53E6;&#x4E00;&#x7EBF;&#x7A0B;&#x4E2D;&#x88AB;&#x8BBF;&#x95EE;&#x65F6;&#x624D;&#x9700;&#x8981;&#x8BFB; / &#x5199;&#x5C4F;&#x969C;&#xFF0C;&#x82E5;&#x8BE5;&#x5BF9;&#x8C61;&#x53EA;&#x80FD;&#x7531;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x7684;&#x6839;&#x8282;&#x70B9;&#x8BBF;&#x95EE;&#xFF0C;&#x5219;&#x5728;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x4E2D;&#x5B58;&#x50A8;&#x5176;&#x5730;&#x5740;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x6267;&#x884C;&#x8BFB; / &#x5199;&#x5C4F;&#x969C;&#x3002;</p>
<p>(3). &#x504F;&#x5411;&#x9501;&#xFF1A;</p>
<p>&#x504F;&#x5411;&#x9501;&#x662F;&#x504F;&#x5411;&#x4E8E;&#x6700;&#x540E;&#x83B7;&#x5F97;&#x5BF9;&#x8C61;&#x9501;&#x7EBF;&#x7A0B;&#x7684;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x5373;&#x5F53;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x521A;&#x521A;&#x83B7;&#x5F97;&#x5BF9;&#x8C61;&#x9501;&#xFF0C;&#x5F53;&#x4E0B;&#x4E00;&#x6B21;&#x518D;&#x83B7;&#x53D6;&#x8BE5;&#x5BF9;&#x8C61;&#x9501;&#x65F6; HotSpot &#x8BA4;&#x4E3A;&#x8BE5;&#x7EBF;&#x7A0B;&#x8FD8;&#x80FD;&#x83B7;&#x53D6;&#x6210;&#x529F;&#x800C;&#x76F4;&#x63A5;&#x628A;&#x5BF9;&#x8C61;&#x9501;&#x4EA4;&#x4E88;&#x8BE5;&#x7EBF;&#x7A0B;&#x7684;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#x6280;&#x672F;&#xFF0C;&#x5F53;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x9501;&#x5B9A;&#x8BE5;&#x5BF9;&#x8C61;&#xFF0C;&#x6CA1;&#x6709;&#x9501;&#x51B2;&#x7A81;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5176;&#x9501;&#x5F00;&#x9500;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x65E0;&#x9501;&#x3002;</p>
<p>&#x504F;&#x5411;&#x9501;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x5E94;&#x7528;&#x6027;&#x80FD;&#x63D0;&#x9AD8;&#x5F88;&#x591A;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:+UseBiasedLocking &#x5F00;&#x542F;&#x504F;&#x5411;&#x9501; ( &#x5728; JDK &#x4E2D;&#x9ED8;&#x8BA4;&#x5F00;&#x542F; ) &#xFF1B;&#x4F46;&#x5BF9;&#x4E8E;&#x6709;&#x9501;&#x5207;&#x6362;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x6027;&#x80FD;&#x5E76;&#x4E0D;&#x7406;&#x60F3;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; -XX:-UseBiasedLocking &#x5173;&#x95ED;&#x504F;&#x5411;&#x9501;&#x3002;</p>
<p>&#x5EFA;&#x8BAE;&#x5206;&#x522B;&#x6D4B;&#x91CF;&#x5F00;&#x542F;&#x548C;&#x5173;&#x95ED;&#x504F;&#x5411;&#x9501;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5E94;&#x7528;&#x6027;&#x80FD;&#xFF0C;&#x518D;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x5173;&#x95ED;&#x504F;&#x5411;&#x9501;&#x4F18;&#x5316;&#x3002;</p>
<p>(4). &#x5927;&#x9875;&#x9762;&#x5185;&#x5B58;&#x652F;&#x6301;&#xFF1A;</p>
<p>&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x5185;&#x5B58;&#x88AB;&#x5212;&#x5206;&#x6210;&#x79F0;&#x4E3A;&#x9875;&#x7684;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5757;&#xFF0C;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5C06;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x5730;&#x5740;&#x8F6C;&#x6362;&#x4E3A;&#x7269;&#x7406;&#x5185;&#x5B58;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x4E00;&#x8F6C;&#x6362;&#x8FC7;&#x7A0B;&#x901A;&#x5E38;&#x662F;&#x901A;&#x8FC7;&#x9875;&#x8868;&#x6765;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x904D;&#x5386;&#x9875;&#x8868;&#x7684;&#x4EE3;&#x4EF7;&#x901A;&#x5E38;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x6BCF;&#x6B21;&#x5185;&#x5B58;&#x8BBF;&#x95EE;&#x65F6;&#x8BBF;&#x95EE;&#x9875;&#x8868;&#x7684;&#x4EE3;&#x4EF7;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E00;&#x5757;&#x88AB;&#x79F0;&#x4E3A;&#x8F6C;&#x8BD1;&#x5FEB;&#x67E5;&#x7F13;&#x5B58; (TLB) &#x7684;&#x5FEB;&#x901F;&#x7F13;&#x5B58;&#x5BF9;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x8F6C;&#x6362;&#x8FDB;&#x884C;&#x7F13;&#x5B58;&#x3002; TLB &#x901A;&#x5E38;&#x53EA;&#x80FD;&#x5BB9;&#x7EB3;&#x56FA;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x6761;&#x76EE;&#xFF0C;&#x5176;&#x6BCF;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x5C31;&#x662F;&#x6309;&#x9875;&#x9762;&#x5927;&#x5C0F;&#x7EDF;&#x8BA1;&#x7684;&#x4E00;&#x5757;&#x5185;&#x5B58;&#x5730;&#x5740;&#x533A;&#x95F4;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x7CFB;&#x7EDF;&#x7684;&#x5185;&#x5B58;&#x9875;&#x9762;&#x8D8A;&#x5927;&#xFF0C;&#x6BCF;&#x4E2A;&#x6761;&#x76EE;&#x80FD;&#x6620;&#x5C04;&#x7684;&#x5185;&#x5B58;&#x5730;&#x5740;&#x533A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C;&#x6BCF;&#x4E2A; TLB &#x80FD;&#x7BA1;&#x7406;&#x7684;&#x7A7A;&#x95F4;&#x4E5F;&#x8D8A;&#x5927;&#xFF0C;&#x5730;&#x5740;&#x8F6C;&#x8BD1;&#x8BF7;&#x6C42;&#x5728; TLB &#x4E2D;&#x5931;&#x6548;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x5C0F;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x8F6C;&#x8BD1;&#x8BF7;&#x6C42;&#x5931;&#x6548;&#x5373;&#x65E0;&#x6CD5;&#x5728; TLB &#x4E2D;&#x627E;&#x5230;&#x5339;&#x914D;&#x9879;&#x65F6;&#xFF0C;&#x5E38;&#x5E38;&#x9700;&#x8981;&#x904D;&#x5386;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#x9875;&#x8868;&#x67E5;&#x627E;&#x865A;&#x62DF;&#x5730;&#x5740;&#x5230;&#x7269;&#x7406;&#x5730;&#x5740;&#x7684;&#x6620;&#x5C04;&#xFF0C;&#x56E0;&#x6B64;&#x4F7F;&#x7528;&#x5927;&#x9875;&#x9762;&#x5185;&#x5B58;&#x7684;&#x597D;&#x5904;&#x662F;&#x51CF;&#x5C11;&#x4E86; TLB &#x5931;&#x6548;&#x7684;&#x51E0;&#x7387;&#x3002;</p>
<p>Linux &#x548C; Windows &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x505A;&#x5927;&#x9875;&#x9762;&#x76F8;&#x5E94;&#x7684;&#x914D;&#x7F6E;&#x4E4B;&#x540E;&#xFF0C;&#x4F7F;&#x7528; -XX:+UseLargePages &#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x53EF;&#x4EE5;&#x5F00;&#x542F; HotSpot&#xA0;VM &#x7684;&#x5927;&#x9875;&#x9762;&#x5185;&#x5B58;&#x652F;&#x6301;&#x3002;</p>
<p>&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;&#x672C;&#x6587;&#x4E3A;&#x535A;&#x4E3B;&#x539F;&#x521B;&#x6587;&#x7AE0;&#xFF0C;&#x672A;&#x7ECF;&#x535A;&#x4E3B;&#x5141;&#x8BB8;&#x4E0D;&#x5F97;&#x8F6C;&#x8F7D;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/分类：-java技术/">分类： java技术</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/03386bb/" title="JVM学习笔记（四）------内存调优 - kobejayandy的专栏" itemprop="url">JVM学习笔记（四）------内存调优 - kobejayandy的专栏</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:29:50.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x9996;&#x5148;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x5728;&#x5BF9;JVM&#x5185;&#x5B58;&#x8C03;&#x4F18;&#x7684;&#x65F6;&#x5019;&#x4E0D;&#x80FD;&#x53EA;&#x770B;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;Java&#x8FDB;&#x7A0B;&#x6240;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#xFF0C;&#x8FD9;&#x4E2A;&#x6570;&#x503C;&#x4E0D;&#x80FD;&#x51C6;&#x786E;&#x7684;&#x53CD;&#x5E94;&#x5806;&#x5185;&#x5B58;&#x7684;&#x771F;&#x5B9E;&#x5360;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x56E0;&#x4E3A;GC&#x8FC7;&#x540E;&#x8FD9;&#x4E2A;&#x503C;&#x662F;&#x4E0D;&#x4F1A;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5185;&#x5B58;&#x8C03;&#x4F18;&#x7684;&#x65F6;&#x5019;&#x8981;&#x66F4;&#x591A;&#x5730;&#x4F7F;&#x7528;JDK&#x63D0;&#x4F9B;&#x7684;&#x5185;&#x5B58;&#x67E5;&#x770B;&#x5DE5;&#x5177;&#xFF0C;&#x6BD4;&#x5982;JConsole&#x548C;Java VisualVM&#x3002;</p>
<p>&#x5BF9;JVM&#x5185;&#x5B58;&#x7684;&#x7CFB;&#x7EDF;&#x7EA7;&#x7684;&#x8C03;&#x4F18;&#x4E3B;&#x8981;&#x7684;&#x76EE;&#x7684;&#x662F;&#x51CF;&#x5C11;GC&#x7684;&#x9891;&#x7387;&#x548C;Full GC&#x7684;&#x6B21;&#x6570;&#xFF0C;&#x8FC7;&#x591A;&#x7684;GC&#x548C;Full GC&#x662F;&#x4F1A;&#x5360;&#x7528;&#x5F88;&#x591A;&#x7684;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF08;&#x4E3B;&#x8981;&#x662F;CPU&#xFF09;&#xFF0C;&#x5F71;&#x54CD;&#x7CFB;&#x7EDF;&#x7684;&#x541E;&#x5410;&#x91CF;&#x3002;&#x7279;&#x522B;&#x8981;&#x5173;&#x6CE8;Full GC&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4F1A;&#x5BF9;&#x6574;&#x4E2A;&#x5806;&#x8FDB;&#x884C;&#x6574;&#x7406;&#xFF0C;&#x5BFC;&#x81F4;Full GC&#x4E00;&#x822C;&#x7531;&#x4E8E;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<ul>
<li>&#x65E7;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;<br>&#x8C03;&#x4F18;&#x65F6;&#x5C3D;&#x91CF;&#x8BA9;&#x5BF9;&#x8C61;&#x5728;&#x65B0;&#x751F;&#x4EE3;GC&#x65F6;&#x88AB;&#x56DE;&#x6536;&#x3001;&#x8BA9;&#x5BF9;&#x8C61;&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x591A;&#x5B58;&#x6D3B;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x548C;&#x4E0D;&#x8981;&#x521B;&#x5EFA;&#x8FC7;&#x5927;&#x7684;&#x5BF9;&#x8C61;&#x53CA;&#x6570;&#x7EC4;&#x907F;&#x514D;&#x76F4;&#x63A5;&#x5728;&#x65E7;&#x751F;&#x4EE3;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#xA0;</li>
<li>Pemanet Generation&#x7A7A;&#x95F4;&#x4E0D;&#x8DB3;<br>&#x589E;&#x5927;Perm Gen&#x7A7A;&#x95F4;&#xFF0C;&#x907F;&#x514D;&#x592A;&#x591A;&#x9759;&#x6001;&#x5BF9;&#x8C61;&#xA0;</li>
<li>&#x7EDF;&#x8BA1;&#x5F97;&#x5230;&#x7684;GC&#x540E;&#x664B;&#x5347;&#x5230;&#x65E7;&#x751F;&#x4EE3;&#x7684;&#x5E73;&#x5747;&#x5927;&#x5C0F;&#x5927;&#x4E8E;&#x65E7;&#x751F;&#x4EE3;&#x5269;&#x4F59;&#x7A7A;&#x95F4;<br>&#x63A7;&#x5236;&#x597D;&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x65E7;&#x751F;&#x4EE3;&#x7684;&#x6BD4;&#x4F8B;&#xA0;</li>
<li>System.gc()&#x88AB;&#x663E;&#x793A;&#x8C03;&#x7528;<br>&#x5783;&#x573E;&#x56DE;&#x6536;&#x4E0D;&#x8981;&#x624B;&#x52A8;&#x89E6;&#x53D1;&#xFF0C;&#x5C3D;&#x91CF;&#x4F9D;&#x9760;JVM&#x81EA;&#x8EAB;&#x7684;&#x673A;&#x5236;&#xA0;<br>&#x8C03;&#x4F18;&#x624B;&#x6BB5;&#x4E3B;&#x8981;&#x662F;&#x901A;&#x8FC7;&#x63A7;&#x5236;&#x5806;&#x5185;&#x5B58;&#x7684;&#x5404;&#x4E2A;&#x90E8;&#x5206;&#x7684;&#x6BD4;&#x4F8B;&#x548C;GC&#x7B56;&#x7565;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;&#x4E0B;&#x9762;&#x6765;&#x770B;&#x770B;&#x5404;&#x90E8;&#x5206;&#x6BD4;&#x4F8B;&#x4E0D;&#x826F;&#x8BBE;&#x7F6E;&#x4F1A;&#x5BFC;&#x81F4;&#x4EC0;&#x4E48;&#x540E;&#x679C;</li>
</ul>
<p>1&#xFF09;&#x65B0;&#x751F;&#x4EE3;&#x8BBE;&#x7F6E;&#x8FC7;&#x5C0F;</p>
<p>&#x4E00;&#x662F;&#x65B0;&#x751F;&#x4EE3;GC&#x6B21;&#x6570;&#x975E;&#x5E38;&#x9891;&#x7E41;&#xFF0C;&#x589E;&#x5927;&#x7CFB;&#x7EDF;&#x6D88;&#x8017;&#xFF1B;&#x4E8C;&#x662F;&#x5BFC;&#x81F4;&#x5927;&#x5BF9;&#x8C61;&#x76F4;&#x63A5;&#x8FDB;&#x5165;&#x65E7;&#x751F;&#x4EE3;&#xFF0C;&#x5360;&#x636E;&#x4E86;&#x65E7;&#x751F;&#x4EE3;&#x5269;&#x4F59;&#x7A7A;&#x95F4;&#xFF0C;&#x8BF1;&#x53D1;Full GC</p>
<p>2&#xFF09;&#x65B0;&#x751F;&#x4EE3;&#x8BBE;&#x7F6E;&#x8FC7;&#x5927;</p>
<p>&#x4E00;&#x662F;&#x65B0;&#x751F;&#x4EE3;&#x8BBE;&#x7F6E;&#x8FC7;&#x5927;&#x4F1A;&#x5BFC;&#x81F4;&#x65E7;&#x751F;&#x4EE3;&#x8FC7;&#x5C0F;&#xFF08;&#x5806;&#x603B;&#x91CF;&#x4E00;&#x5B9A;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x8BF1;&#x53D1;Full GC&#xFF1B;&#x4E8C;&#x662F;&#x65B0;&#x751F;&#x4EE3;GC&#x8017;&#x65F6;&#x5927;&#x5E45;&#x5EA6;&#x589E;&#x52A0;</p>
<p>&#x4E00;&#x822C;&#x8BF4;&#x6765;&#x65B0;&#x751F;&#x4EE3;&#x5360;&#x6574;&#x4E2A;&#x5806;1/3&#x6BD4;&#x8F83;&#x5408;&#x9002;</p>
<p>3&#xFF09;Survivor&#x8BBE;&#x7F6E;&#x8FC7;&#x5C0F;</p>
<p>&#x5BFC;&#x81F4;&#x5BF9;&#x8C61;&#x4ECE;eden&#x76F4;&#x63A5;&#x5230;&#x8FBE;&#x65E7;&#x751F;&#x4EE3;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;</p>
<p>4&#xFF09;Survivor&#x8BBE;&#x7F6E;&#x8FC7;&#x5927;</p>
<p>&#x5BFC;&#x81F4;eden&#x8FC7;&#x5C0F;&#xFF0C;&#x589E;&#x52A0;&#x4E86;GC&#x9891;&#x7387;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x901A;&#x8FC7;-XX:MaxTenuringThreshold=n&#x6765;&#x63A7;&#x5236;&#x65B0;&#x751F;&#x4EE3;&#x5B58;&#x6D3B;&#x65F6;&#x95F4;&#xFF0C;&#x5C3D;&#x91CF;&#x8BA9;&#x5BF9;&#x8C61;&#x5728;&#x65B0;&#x751F;&#x4EE3;&#x88AB;&#x56DE;&#x6536;</p>
<p>&#x65B0;&#x751F;&#x4EE3;&#x548C;&#x65E7;&#x751F;&#x4EE3;&#x90FD;&#x6709;&#x591A;&#x79CD;GC&#x7B56;&#x7565;&#x548C;&#x7EC4;&#x5408;&#x642D;&#x914D;&#xFF0C;&#x9009;&#x62E9;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x5BF9;&#x4E8E;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x662F;&#x4E2A;&#x96BE;&#x9898;&#xFF0C;JVM&#x63D0;&#x4F9B;&#x4E24;&#x79CD;&#x8F83;&#x4E3A;&#x7B80;&#x5355;&#x7684;GC&#x7B56;&#x7565;&#x7684;&#x8BBE;&#x7F6E;&#x65B9;&#x5F0F;</p>
<p>1&#xFF09;&#x541E;&#x5410;&#x91CF;&#x4F18;&#x5148;</p>
<p>JVM&#x4EE5;&#x541E;&#x5410;&#x91CF;&#x4E3A;&#x6307;&#x6807;&#xFF0C;&#x81EA;&#x884C;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x7684;GC&#x7B56;&#x7565;&#x53CA;&#x63A7;&#x5236;&#x65B0;&#x751F;&#x4EE3;&#x4E0E;&#x65E7;&#x751F;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#x6BD4;&#x4F8B;&#xFF0C;&#x6765;&#x8FBE;&#x5230;&#x541E;&#x5410;&#x91CF;&#x6307;&#x6807;&#x3002;&#x8FD9;&#x4E2A;&#x503C;&#x53EF;&#x7531;-XX:GCTimeRatio=n&#x6765;&#x8BBE;&#x7F6E;</p>
<p>2&#xFF09;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x4F18;&#x5148;</p>
<p>JVM&#x4EE5;&#x6682;&#x505C;&#x65F6;&#x95F4;&#x4E3A;&#x6307;&#x6807;&#xFF0C;&#x81EA;&#x884C;&#x9009;&#x62E9;&#x76F8;&#x5E94;&#x7684;GC&#x7B56;&#x7565;&#x53CA;&#x63A7;&#x5236;&#x65B0;&#x751F;&#x4EE3;&#x4E0E;&#x65E7;&#x751F;&#x4EE3;&#x7684;&#x5927;&#x5C0F;&#x6BD4;&#x4F8B;&#xFF0C;&#x5C3D;&#x91CF;&#x4FDD;&#x8BC1;&#x6BCF;&#x6B21;GC&#x9020;&#x6210;&#x7684;&#x5E94;&#x7528;&#x505C;&#x6B62;&#x65F6;&#x95F4;&#x90FD;&#x5728;&#x6307;&#x5B9A;&#x7684;&#x6570;&#x503C;&#x8303;&#x56F4;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x4E2A;&#x503C;&#x53EF;&#x7531;-XX:MaxGCPauseRatio=n&#x6765;&#x8BBE;&#x7F6E;</p>
<p>&#xA0;</p>
<p>&#x6700;&#x540E;&#x6C47;&#x603B;&#x4E00;&#x4E0B;JVM &#x5E38;&#x89C1;&#x914D;&#x7F6E;</p>
<ol>
<li>&#x5806;&#x8BBE;&#x7F6E; <ul>
<li>-Xms:&#x521D;&#x59CB;&#x5806;&#x5927;&#x5C0F;</li>
<li>-Xmx:&#x6700;&#x5927;&#x5806;&#x5927;&#x5C0F;</li>
<li>-XX:NewSize=n:&#x8BBE;&#x7F6E;&#x5E74;&#x8F7B;&#x4EE3;&#x5927;&#x5C0F;</li>
<li>-XX:NewRatio=n:&#x8BBE;&#x7F6E;&#x5E74;&#x8F7B;&#x4EE3;&#x548C;&#x5E74;&#x8001;&#x4EE3;&#x7684;&#x6BD4;&#x503C;&#x3002;&#x5982;:&#x4E3A;3&#xFF0C;&#x8868;&#x793A;&#x5E74;&#x8F7B;&#x4EE3;&#x4E0E;&#x5E74;&#x8001;&#x4EE3;&#x6BD4;&#x503C;&#x4E3A;1&#xFF1A;3&#xFF0C;&#x5E74;&#x8F7B;&#x4EE3;&#x5360;&#x6574;&#x4E2A;&#x5E74;&#x8F7B;&#x4EE3;&#x5E74;&#x8001;&#x4EE3;&#x548C;&#x7684;1/4</li>
<li>-XX:SurvivorRatio=n:&#x5E74;&#x8F7B;&#x4EE3;&#x4E2D;Eden&#x533A;&#x4E0E;&#x4E24;&#x4E2A;Survivor&#x533A;&#x7684;&#x6BD4;&#x503C;&#x3002;&#x6CE8;&#x610F;Survivor&#x533A;&#x6709;&#x4E24;&#x4E2A;&#x3002;&#x5982;&#xFF1A;3&#xFF0C;&#x8868;&#x793A;Eden&#xFF1A;Survivor=3&#xFF1A;2&#xFF0C;&#x4E00;&#x4E2A;Survivor&#x533A;&#x5360;&#x6574;&#x4E2A;&#x5E74;&#x8F7B;&#x4EE3;&#x7684;1/5</li>
<li>-XX:MaxPermSize=n:&#x8BBE;&#x7F6E;&#x6301;&#x4E45;&#x4EE3;&#x5927;&#x5C0F;</li>
</ul>
</li>
<li>&#x6536;&#x96C6;&#x5668;&#x8BBE;&#x7F6E; <ul>
<li>-XX:+UseSerialGC:&#x8BBE;&#x7F6E;&#x4E32;&#x884C;&#x6536;&#x96C6;&#x5668;</li>
<li>-XX:+UseParallelGC:&#x8BBE;&#x7F6E;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;</li>
<li>-XX:+UseParalledlOldGC:&#x8BBE;&#x7F6E;&#x5E76;&#x884C;&#x5E74;&#x8001;&#x4EE3;&#x6536;&#x96C6;&#x5668;</li>
<li>-XX:+UseConcMarkSweepGC:&#x8BBE;&#x7F6E;&#x5E76;&#x53D1;&#x6536;&#x96C6;&#x5668;</li>
</ul>
</li>
<li>&#x5783;&#x573E;&#x56DE;&#x6536;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F; <ul>
<li>-XX:+PrintGC</li>
<li>-XX:+PrintGCDetails</li>
<li>-XX:+PrintGCTimeStamps</li>
<li>-Xloggc:filename</li>
</ul>
</li>
<li>&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x8BBE;&#x7F6E; <ul>
<li>-XX:ParallelGCThreads=n:&#x8BBE;&#x7F6E;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x5668;&#x6536;&#x96C6;&#x65F6;&#x4F7F;&#x7528;&#x7684;CPU&#x6570;&#x3002;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x7EBF;&#x7A0B;&#x6570;&#x3002;</li>
<li>-XX:MaxGCPauseMillis=n:&#x8BBE;&#x7F6E;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x6700;&#x5927;&#x6682;&#x505C;&#x65F6;&#x95F4;</li>
<li>-XX:GCTimeRatio=n:&#x8BBE;&#x7F6E;&#x5783;&#x573E;&#x56DE;&#x6536;&#x65F6;&#x95F4;&#x5360;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x7684;&#x767E;&#x5206;&#x6BD4;&#x3002;&#x516C;&#x5F0F;&#x4E3A;1/(1+n)</li>
</ul>
</li>
<li>&#x5E76;&#x53D1;&#x6536;&#x96C6;&#x5668;&#x8BBE;&#x7F6E; <ul>
<li>-XX:+CMSIncrementalMode:&#x8BBE;&#x7F6E;&#x4E3A;&#x589E;&#x91CF;&#x6A21;&#x5F0F;&#x3002;&#x9002;&#x7528;&#x4E8E;&#x5355;CPU&#x60C5;&#x51B5;&#x3002;</li>
<li>-XX:ParallelGCThreads=n:&#x8BBE;&#x7F6E;&#x5E76;&#x53D1;&#x6536;&#x96C6;&#x5668;&#x5E74;&#x8F7B;&#x4EE3;&#x6536;&#x96C6;&#x65B9;&#x5F0F;&#x4E3A;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x7684;CPU&#x6570;&#x3002;&#x5E76;&#x884C;&#x6536;&#x96C6;&#x7EBF;&#x7A0B;&#x6570;&#x3002;</li>
</ul>
</li>
</ol>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/分类：-JVM虚拟机/">分类： JVM虚拟机</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/03821ee/" title="JVM调优的几种策略 -" itemprop="url">JVM调优的几种策略 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:29:50.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p> &#xA0;&#xA0;&#xA0; JVM&#x53C2;&#x6570;&#x8C03;&#x4F18;&#x662F;&#x4E00;&#x4E2A;&#x5F88;&#x5934;&#x75DB;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x80FD;&#x548C;&#x5E94;&#x7528;&#x6709;&#x5173;&#x7CFB;&#xFF0C;&#x522B;&#x4EBA;&#x8BF4;&#x53EF;&#x4EE5;&#x7684;&#x5BF9;&#x81EA;&#x5DF1;&#x4E0D;&#x4E00;&#x5B9A;&#x7BA1;&#x7528;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x672C;&#x4EBA;&#x4E00;&#x4E9B;JVM&#x8C03;&#x4F18;&#x7684;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x8BFB;&#x8005;&#x80FD;&#x6709;&#x5E2E;&#x52A9;&#xFF0C;&#x73AF;&#x5883;LinuxAS4,resin2.1.17,JDK6.0,2CPU,4G&#x5185;&#x5B58;&#xFF0C;dell2950&#x670D;&#x52A1;&#x5668;&#x3002;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; JVM&#x8C03;&#x4F18;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E00;&#xFF1A;JVM&#x8C03;&#x4F18;&#x4E4B;&#x4E32;&#x884C;&#x5783;&#x573E;&#x56DE;&#x6536;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E5F;&#x5C31;&#x662F;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#xFF0C;&#x5B8C;&#x6210;10&#x4E07;request&#x7528;&#x65F6;153&#x79D2;&#x3002;JVM&#x53C2;&#x6570;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xms2048M-Xmx2048M-Xmn512M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:PermSize=256M-XX:MaxPermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:MaxTenuringThreshold=7-XX:GCTimeRatio=19<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xnoclassgc-Xloggc:log/gc.log<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCDetails-XX:+PrintGCTimeStamps&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x4E00;&#x822C;&#x5728;resin&#x542F;&#x52A8;24&#x5C0F;&#x65F6;&#x5185;&#x4F3C;&#x4E4E;&#x6CA1;&#x6709;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x7F51;&#x7AD9;&#x53EF;&#x4EE5;&#x6B63;&#x5E38;&#x8BBF;&#x95EE;&#xFF0C;&#x4F46;&#x67E5;&#x770B;&#x65E5;&#x5FD7;&#x53D1;&#x73B0;&#xFF0C;&#x5728;&#x63A5;&#x8FD1;24&#x5C0F;&#x65F6;&#x65F6;&#xFF0C;FullGC&#x6267;&#x884C;&#x8D8A;&#x6765;&#x8D8A;&#x9891;&#x7E41;&#xFF0C;&#x5927;&#x7EA6;&#x6BCF;&#x9694;3&#x5206;&#x949F;&#x5C31;&#x6709;&#x4E00;&#x6B21;FullGC,&#x6BCF;&#x6B21;FullGC&#x7CFB;&#x7EDF;&#x4F1A;&#x505C;&#x987F;6&#x79D2;&#x5DE6;&#x53F3;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#x6765;&#x8BF4;&#xFF0C;&#x7528;&#x6237;&#x7B49;&#x5F85;6&#x79D2;&#x6050;&#x6015;&#x592A;&#x957F;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x6709;&#x5F85;&#x6539;&#x5584;&#x3002;MaxTenuringThreshold=7&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5982;&#x679C;&#x5728;&#x6551;&#x52A9;&#x7A7A;&#x95F4;&#x79FB;&#x52A8;7&#x6B21;&#x8FD8;&#x6CA1;&#x6709;&#x88AB;&#x56DE;&#x6536;&#x5C31;&#x653E;&#x5165;&#x5E74;&#x8001;&#x4EE3;&#xFF0C;GCTimeRatio=19&#x8868;&#x793A;java&#x53EF;&#x4EE5;&#x7528;5%&#x7684;&#x65F6;&#x95F4;&#x6765;&#x505A;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;1/&#xFF08;1+19&#xFF09;=1/20=5%.<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E8C;&#xFF1A;JVM&#x8C03;&#x4F18;&#x4E4B;&#x5E76;&#x884C;&#x56DE;&#x6536;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x5B8C;&#x6210;10&#x4E07;request&#x7528;&#x65F6;117&#x79D2;&#xFF0C;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server-Xmx2048M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xms2048M-Xmn512M-XX:PermSize=256M-XX:MaxPermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xnoclassgc-Xloggc:log/gc.log-XX:+PrintGCDetails<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCTimeStamps-XX:+UseParallelGC-XX:ParallelGCThreads=20<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+UseParallelOldGC-XX:MaxGCPauseMillis=500<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+UseAdaptiveSizePolicy-XX:MaxTenuringThreshold=7<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:GCTimeRatio=19&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x5E76;&#x884C;&#x56DE;&#x6536;&#x6211;&#x5C1D;&#x8BD5;&#x8FC7;&#x591A;&#x79CD;&#x7EC4;&#x5408;&#x914D;&#x7F6E;&#xFF0C;&#x4F3C;&#x4E4E;&#x90FD;&#x6CA1;&#x4EC0;&#x4E48;&#x7528;&#xFF0C;resin&#x542F;&#x52A8;3&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#x5C31;&#x4F1A;&#x505C;&#x987F;&#xFF0C;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;10&#x79D2;&#x3002;&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x53C2;&#x6570;&#x8BBE;&#x7F6E;&#x4E0D;&#x591F;&#x597D;&#x7684;&#x539F;&#x56E0;&#xFF0C;MaxGCPauseMillis&#x8868;&#x793A;GC&#x6700;&#x5927;&#x505C;&#x987F;&#x65F6;&#x95F4;&#xFF0C;&#x5728;resin&#x521A;&#x542F;&#x52A8;&#x8FD8;&#x6CA1;&#x6709;&#x6267;&#x884C;FullGC&#x65F6;&#x7CFB;&#x7EDF;&#x662F;&#x6B63;&#x5E38;&#x7684;&#xFF0C;&#x4F46;&#x4E00;&#x65E6;&#x6267;&#x884C;FullGC,MaxGCPauseMillis&#x6839;&#x672C;&#x6CA1;&#x6709;&#x7528;&#xFF0C;&#x505C;&#x987F;&#x65F6;&#x95F4;&#x53EF;&#x80FD;&#x8D85;&#x8FC7;20&#x79D2;&#xFF0C;&#x4E4B;&#x540E;&#x4F1A;&#x53D1;&#x751F;&#x4EC0;&#x4E48;&#x6211;&#x4E5F;&#x4E0D;&#x518D;&#x5173;&#x5FC3;&#x4E86;&#xFF0C;&#x8D76;&#x7D27;&#x91CD;&#x542F;resin,&#x5C1D;&#x8BD5;&#x5176;&#x4ED6;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x3002;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E09;&#xFF1A;JVM&#x8C03;&#x4F18;&#x4E4B;&#x5E76;&#x53D1;&#x56DE;&#x6536;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x5B8C;&#x6210;10&#x4E07;request&#x7528;&#x65F6;60&#x79D2;&#xFF0C;&#x6BD4;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5DEE;&#x4E0D;&#x591A;&#x5FEB;&#x4E00;&#x500D;&#xFF0C;&#x662F;&#x9ED8;&#x8BA4;&#x56DE;&#x6536;&#x7B56;&#x7565;&#x6027;&#x80FD;&#x7684;2.5&#x500D;&#xFF0C;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xms2048M-Xmx2048M-Xmn512M-XX:PermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:MaxPermSize=256M-XX:+UseConcMarkSweepGC<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:MaxTenuringThreshold=7-XX:GCTimeRatio=19<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xnoclassgc-Xloggc:log/gc.log-XX:+PrintGCDetails<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCTimeStamps-XX:+UseCMSCompactAtFullCollection<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:CMSFullGCsBeforeCompaction=0&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x867D;&#x7136;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;10&#x79D2;&#x8FDE;&#x4E0D;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x7CFB;&#x7EDF;&#x91CD;&#x542F;3&#x4E2A;&#x5C0F;&#x65F6;&#x5DE6;&#x53F3;&#xFF0C;&#x6BCF;&#x9694;&#x51E0;&#x5206;&#x949F;&#x5C31;&#x4F1A;&#x6709;5&#x79D2;&#x8FDE;&#x4E0D;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x67E5;&#x770B;gc.log,&#x53D1;&#x73B0;&#x5728;&#x6267;&#x884C;ParNewGC&#x65F6;&#x6709;&#x4E2A;promotionfailed&#x9519;&#x8BEF;&#xFF0C;&#x4ECE;&#x800C;&#x8F6C;&#x5411;&#x6267;&#x884C;FullGC,&#x9020;&#x6210;&#x7CFB;&#x7EDF;&#x505C;&#x987F;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x5F88;&#x9891;&#x7E41;&#xFF0C;&#x6BCF;&#x9694;&#x51E0;&#x5206;&#x949F;&#x5C31;&#x6709;&#x4E00;&#x6B21;&#xFF0C;&#x6240;&#x4EE5;&#x8FD8;&#x5F97;&#x6539;&#x5584;&#x3002;UseCMSCompactAtFullCollection&#x662F;&#x8868;&#x662F;&#x6267;&#x884C;FullGC&#x540E;&#x5BF9;&#x5185;&#x5B58;&#x8FDB;&#x884C;&#x6574;&#x7406;&#x538B;&#x7F29;&#xFF0C;&#x514D;&#x5F97;&#x4EA7;&#x751F;&#x5185;&#x5B58;&#x788E;&#x7247;&#xFF0C;CMSFullGCsBeforeCompaction=N&#x8868;&#x793A;&#x6267;&#x884C;N&#x6B21;FullGC&#x540E;&#x6267;&#x884C;&#x5185;&#x5B58;&#x538B;&#x7F29;&#x3002;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x56DB;&#xFF1A;JVM&#x8C03;&#x4F18;&#x4E4B;&#x589E;&#x91CF;&#x56DE;&#x6536;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x5B8C;&#x6210;10&#x4E07;request&#x7528;&#x65F6;171&#x79D2;&#xFF0C;&#x592A;&#x6162;&#x4E86;&#xFF0C;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xms2048M-Xmx2048M-Xmn512M-XX:PermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:MaxPermSize=256M-XX:MaxTenuringThreshold=7<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:GCTimeRatio=19-Xnoclassgc-Xloggc:log/gc.log<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCDetails-XX:+PrintGCTimeStamps-Xincgc&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4F3C;&#x4E4E;&#x56DE;&#x6536;&#x5F97;&#x4E5F;&#x4E0D;&#x592A;&#x5E72;&#x51C0;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x5BF9;&#x6027;&#x80FD;&#x6709;&#x8F83;&#x5927;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x503C;&#x5F97;&#x8BD5;&#x3002;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E94;&#xFF1A;JVM&#x8C03;&#x4F18;&#x4E4B;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x7684;I-CMS&#x6A21;&#x5F0F;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x548C;&#x589E;&#x91CF;&#x56DE;&#x6536;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x5B8C;&#x6210;10&#x4E07;request&#x7528;&#x65F6;170&#x79D2;&#x3002;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xms2048M-Xmx2048M-Xmn512M-XX:PermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:MaxPermSize=256M-XX:MaxTenuringThreshold=7<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:GCTimeRatio=19-Xnoclassgc-Xloggc:log/gc.log<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCDetails-XX:+PrintGCTimeStamps<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+UseConcMarkSweepGC-XX:+CMSIncrementalMode<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+CMSIncrementalPacing<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:CMSIncrementalDutyCycleMin=0<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:CMSIncrementalDutyCycle=10-XX:-TraceClassUnloading&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x91C7;&#x7528;&#x4E86;sun&#x63A8;&#x8350;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x56DE;&#x6536;&#x6548;&#x679C;&#x4E0D;&#x597D;&#xFF0C;&#x7167;&#x6837;&#x6709;&#x505C;&#x987F;&#xFF0C;&#x6570;&#x5C0F;&#x65F6;&#x4E4B;&#x5185;&#x5C31;&#x4F1A;&#x9891;&#x7E41;&#x51FA;&#x73B0;&#x505C;&#x987F;&#xFF0C;&#x4EC0;&#x4E48;sun&#x63A8;&#x8350;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x7167;&#x6837;&#x4E0D;&#x597D;&#x4F7F;&#x3002;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x516D;&#xFF1A;JVM&#x8C03;&#x4F18;&#x4E4B;&#x9012;&#x589E;&#x5F0F;&#x4F4E;&#x6682;&#x505C;&#x6536;&#x96C6;&#x5668;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x53C8;&#x53EB;&#x4EC0;&#x4E48;&#x706B;&#x8F66;&#x5F0F;&#x56DE;&#x6536;&#xFF0C;&#x5B8C;&#x6210;10&#x4E07;request&#x7528;&#x65F6;153&#x79D2;&#xFF0C;&#x914D;&#x7F6E;&#x5982;&#x4E0B;&#xFF1A;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xms2048M-Xmx2048M-Xmn512M-XX:PermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:MaxPermSize=256M-XX:MaxTenuringThreshold=7<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:GCTimeRatio=19-Xnoclassgc-Xloggc:log/gc.log<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCDetails-XX:+PrintGCTimeStamps-XX:+UseTrainGC&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x8BE5;&#x914D;&#x7F6E;&#x6548;&#x679C;&#x4E5F;&#x4E0D;&#x597D;&#xFF0C;&#x5F71;&#x54CD;&#x6027;&#x80FD;&#xFF0C;&#x6240;&#x4EE5;&#x6CA1;&#x8BD5;&#x3002;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E03;&#xFF1A;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x8FD8;&#x662F;&#x5E76;&#x53D1;&#x56DE;&#x6536;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x6027;&#x80FD;&#x6BD4;&#x8F83;&#x9AD8;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x89E3;&#x51B3;ParNewGC&#xFF08;&#x5E76;&#x884C;&#x56DE;&#x6536;&#x5E74;&#x8F7B;&#x4EE3;&#xFF09;&#x65F6;&#x7684;promotionfailed&#x9519;&#x8BEF;&#x5C31;&#x4E00;&#x5207;&#x597D;&#x529E;&#x4E86;&#xFF0C;&#x67E5;&#x4E86;&#x5F88;&#x591A;&#x6587;&#x7AE0;&#xFF0C;&#x53D1;&#x73B0;&#x5F15;&#x8D77;promotionfailed&#x9519;&#x8BEF;&#x7684;&#x539F;&#x56E0;&#x662F;CMS&#x6765;&#x4E0D;&#x53CA;&#x56DE;&#x6536;&#xFF08;CMS&#x9ED8;&#x8BA4;&#x5728;&#x5E74;&#x8001;&#x4EE3;&#x5360;&#x5230;90%&#x5DE6;&#x53F3;&#x624D;&#x4F1A;&#x6267;&#x884C;&#xFF09;&#xFF0C;&#x5E74;&#x8001;&#x4EE3;&#x53C8;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x7A7A;&#x95F4;&#x4F9B;GC&#x628A;&#x4E00;&#x4E9B;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x4ECE;&#x5E74;&#x8F7B;&#x4EE3;&#x79FB;&#x5230;&#x5E74;&#x8001;&#x4EE3;&#xFF0C;&#x6240;&#x4EE5;&#x6267;&#x884C;FullGC.CMSInitiatingOccupancyFraction=70&#x8868;&#x793A;&#x5E74;&#x8001;&#x4EE3;&#x5360;&#x5230;&#x7EA6;70%&#x65F6;&#x5C31;&#x5F00;&#x59CB;&#x6267;&#x884C;CMS,&#x8FD9;&#x6837;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;FullGC&#x4E86;&#x3002;SoftRefLRUPolicyMSPerMB&#x8FD9;&#x4E2A;&#x53C2;&#x6570;&#x4E5F;&#x662F;&#x6211;&#x8BA4;&#x4E3A;&#x6BD4;&#x8F83;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x5B98;&#x65B9;&#x89E3;&#x91CA;&#x662F;softlyreachableobjectswillremainaliveforsomeamountoftimeafterthelasttimetheywerereferenced.Thedefaultvalueisonesecondoflifetimeperfreemegabyteintheheap,&#x6211;&#x89C9;&#x5F97;&#x6CA1;&#x5FC5;&#x8981;&#x7B49;1&#x79D2;&#xFF0C;&#x6240;&#x4EE5;&#x8BBE;&#x7F6E;&#x6210;0.&#x914D;&#x7F6E;&#x5982;&#x4E0B;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; $JAVA_ARGS.=&#x201C;-Dresin.home=$SERVER_ROOT-server-Xms2048M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xmx2048M-Xmn512M-XX:PermSize=256M-XX:MaxPermSize=256M<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:SurvivorRatio=8-XX:MaxTenuringThreshold=7<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:GCTimeRatio=19-Xnoclassgc-XX:+DisableExplicitGC<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+UseParNewGC-XX:+UseConcMarkSweepGC<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+CMSPermGenSweepingEnabled<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+UseCMSCompactAtFullCollection<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:CMSFullGCsBeforeCompaction=0<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+CMSClassUnloadingEnabled-XX:-CMSParallelRemarkEnabled<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:CMSInitiatingOccupancyFraction=70<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:SoftRefLRUPolicyMSPerMB=0-XX:+PrintClassHistogram<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCDetails-XX:+PrintGCTimeStamps<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCApplicationConcurrentTime<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -XX:+PrintGCApplicationStoppedTime<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; -Xloggc:log/gc.log&#x201D;;<br>&#xA0;&#xA0;&#xA0;<br>&#xA0;&#xA0;&#xA0; &#x4E0A;&#x9762;&#x8FD9;&#x4E2A;&#x914D;&#x7F6E;&#x5185;&#x5B58;&#x4E0A;&#x5347;&#x7684;&#x5F88;&#x6162;&#xFF0C;24&#x5C0F;&#x65F6;&#x4E4B;&#x5185;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x505C;&#x987F;&#x73B0;&#x8C61;&#xFF0C;&#x6700;&#x957F;&#x7684;&#x53EA;&#x505C;&#x6EDE;&#x4E86;0.8s,ParNewGC&#x6BCF;30&#x79D2;&#x5DE6;&#x53F3;&#x624D;&#x6267;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x6BCF;&#x6B21;&#x56DE;&#x6536;&#x7EA6;0.2&#x79D2;&#xFF0C;&#x770B;&#x6765;&#x95EE;&#x9898;&#x5E94;&#x8BE5;&#x6682;&#x65F6;&#x89E3;&#x51B3;&#x4E86;&#x3002; &#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;&#x672C;&#x6587;&#x4E3A;&#x535A;&#x4E3B;&#x539F;&#x521B;&#x6587;&#x7AE0;&#xFF0C;&#x672A;&#x7ECF;&#x535A;&#x4E3B;&#x5141;&#x8BB8;&#x4E0D;&#x5F97;&#x8F6C;&#x8F7D;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/032558e/" title="笔记：Java 性能优化权威指南 第7章 JVM调优入门 - 荒岛码农" itemprop="url">笔记：Java 性能优化权威指南 第7章 JVM调优入门 - 荒岛码农</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:29:49.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><strong>&#x4E00;&#x3001;&#x8C03;&#x4F18;&#x5DE5;&#x4F5C;&#x6D41;&#x7A0B;</strong></p>
<p>(1)&#x3001;&#x5212;&#x5206;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x4F18;&#x5148;&#x7EA7;(&#x5185;&#x5B58;&#x6D88;&#x8017;&#x3001;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x3001;&#x541E;&#x5410;&#x91CF;&#x3001;&#x53EF;&#x7528;&#x6027;&#x3001;&#x53EF;&#x7BA1;&#x7406;&#x6027;&#x3001;&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x7B49;)</p>
<p>(2)&#x3001;&#x9009;&#x62E9;JVM&#x90E8;&#x7F72;&#x6A21;&#x5F0F;&#xFF1A;&#x5355;JVM&#x8FD8;&#x662F;&#x591A;JVM&#xFF0C; 32&#x4F4D;&#x6216;64&#x4F4D;&#xFF0C; 64&#x4F4D;&#x6307;&#x9488;&#x538B;&#x7F29;</p>
<p>(3)&#x3001;&#x9009;&#x62E9;JVM Runtime&#xFF1A;-client &#x8FD8;&#x662F; server &#x6A21;&#x5F0F;&#xFF0C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5668;Parallel &#x8FD8;&#x662F; CMS</p>
<p>(4)&#x3001;&#x8C03;&#x6574;&#x5185;&#x5B58;&#x4F7F;&#x7528;</p>
<p>(5)&#x3001;&#x8C03;&#x6574;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;</p>
<p>(6)&#x3001;&#x8C03;&#x6574;&#x541E;&#x5410;&#x91CF;</p>
<p><strong>&#x4E8C;&#x3001;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;</strong></p>
<p><strong>1&#x3001;&#x53EF;&#x7528;&#x6027;</strong>&#xFF1A;&#x4F8B;&#x5B50;&#xFF1A;&#x5373;&#x4F7F;&#x67D0;&#x4E2A;&#x7EC4;&#x4EF6;&#x53D1;&#x751F;&#x4E86;&#x4E0D;&#x53EF;&#x9884;&#x6599;&#x7684;&#x5931;&#x6548;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x3002;</p>
<p><strong>2&#x3001;&#x53EF;&#x7BA1;&#x7406;&#x6027;</strong>&#xFF1A;&#x4F8B;&#x5B50;&#xFF1A;&#x7531;&#x4E8E;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x6709;&#x9650;&#xFF0C;&#x5E94;&#x8BE5;&#x90E8;&#x7F72;&#x5C3D;&#x91CF;&#x5C11;&#x7684;JVM&#x6570;&#x91CF;&#x3002;</p>
<p><strong>3&#x3001;&#x541E;&#x5410;&#x91CF;</strong>&#xFF1A;&#x4F8B;&#x5B50;&#xFF1A;&#x7A0B;&#x5E8F;&#x6BCF;&#x79D2;&#x5E94;&#x8BE5;&#x5B8C;&#x6210;2500&#x6B21;&#x4E8B;&#x52A1;&#x3002;</p>
<p><strong>4&#x3001;&#x54CD;&#x5E94;&#x5EF6;&#x65F6;</strong>&#xFF1A;&#x4F8B;&#x5B50;&#xFF1A;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x5728;60&#x6BEB;&#x79D2;&#x5185;&#x5B8C;&#x6210;&#x8BF7;&#x6C42;&#x7684;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><strong>5&#x3001;&#x5185;&#x5B58;&#x5360;&#x7528;</strong>&#xFF1A;&#x4F8B;&#x5B50;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;8G&#x5185;&#x5B58;&#x7684;&#x7CFB;&#x7EDF;&#x4E0A;&#x5355;&#x4F8B;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#xFF0C;&#x6216;&#x8005;24G&#x5185;&#x5B58;&#x7CFB;&#x7EDF;&#x4E0A;3&#x4E2A;&#x5B9E;&#x4F8B;&#x8FD0;&#x884C;&#x3002;</p>
<p><strong>6&#x3001;&#x542F;&#x52A8;&#x65F6;&#x95F4;</strong>&#xFF1A;&#x4F8B;&#x5B50;&#xFF1A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x521D;&#x59CB;&#x5316;&#x5728;15&#x79D2;&#x4EE5;&#x5185;&#x3002;</p>
<p><strong>&#x4E09;&#x3001;&#x5BF9;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x8FDB;&#x884C;&#x5206;&#x7EA7;</strong></p>
<p>&#x6BD4;&#x5982;&#x4E92;&#x8054;&#x7F51;&#x3001;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x5BF9;&#x54CD;&#x5E94;&#x5EF6;&#x65F6;&#x8981;&#x6C42;&#x9AD8;&#x3002;</p>
<p><strong>&#x56DB;&#x3001;&#x9009;&#x62E9;JVM&#x90E8;&#x7F72;&#x6A21;&#x5F0F;</strong></p>
<p>&#x5355;JVM&#xFF1A;&#x7BA1;&#x7406;&#x65B9;&#x4FBF;&#xFF0C;&#x4F46;&#x662F;&#x5B58;&#x5728;&#x5355;&#x70B9;&#x6545;&#x969C;&#x3002;</p>
<p>&#x591A;JVM&#xFF1A;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3001;&#x4F4E;&#x5EF6;&#x65F6;&#xFF0C;&#x76D1;&#x63A7;&#x3001;&#x7BA1;&#x7406;&#x3001;&#x7EF4;&#x62A4;&#x66F4;&#x96BE;&#x3002;</p>
<p><strong>&#x4E94;&#x3001;&#x9009;&#x62E9;JVM &#x8FD0;&#x884C;&#x6A21;&#x5F0F;</strong></p>
<p>Client&#x6A21;&#x5F0F;&#xFF1A;&#x542F;&#x52A8;&#x5FEB;&#x3001;&#x5360;&#x7528;&#x5185;&#x5B58;&#x5C11;&#x3001;JIT&#x7F16;&#x7801;&#x5668;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x5FEB;&#x3002;</p>
<p>Server&#x6A21;&#x5F0F;&#xFF1A;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x590D;&#x6742;&#x7684;&#x751F;&#x6210;&#x4EE3;&#x7801;&#x4F18;&#x5316;&#x529F;&#x80FD;&#x3002; &#x4E00;&#x822C;&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;Server&#x6A21;&#x5F0F;&#x3002;</p>
<p>Linux&#x4E2D;&#xFF0C;&#x5982;&#x5185;&#x5B58;&#x5C0F;&#x4E8E;2G&#xFF1A;&#x4F7F;&#x7528;32&#x4F4D;&#x6A21;&#x5F0F;</p>
<p>Linux&#x4E2D;&#xFF0C; &#x5982;&#x5185;&#x5B58;&#x5728;2G~32G&#xFF1A;&#x4F7F;&#x7528;64&#x4F4D;&#x6A21;&#x5F0F;,&#x5E76;&#x542F;&#x7528;&#x6307;&#x9488;&#x538B;&#x7F29;&#xFF0C;-d64 -XX:+UseCompressedOops</p>
<p>Linux&#x4E2D;&#xFF0C;&#x5982;&#x5185;&#x5B58;&#x5927;&#x4E8E;32G&#xFF1A;&#x4F7F;&#x7528;64&#x4F4D;&#x6A21;&#x5F0F;&#xFF0C;&#x4E0D;&#x542F;&#x7528;&#x6307;&#x9488;&#x538B;&#x7F29; &#xFF0C;-d64 &#xA0;</p>
<p>&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Parallel &#x6536;&#x96C6;&#x5668;&#x80FD;&#x8FBE;&#x5230;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x505C;&#x987F;&#x8981;&#x6C42;&#xFF0C;&#x82E5;&#x518D;&#x9700;&#x8981;&#x4F4E;&#x5EF6;&#x65F6;&#xFF0C;&#x5219;&#x8F6C;&#x5411;CMS&#x6536;&#x96C6;&#x5668;&#x3002;</p>
<p><strong>&#x516D;&#x3001;&#x5783;&#x573E;&#x6536;&#x96C6;&#x8C03;&#x4F18;&#x57FA;&#x7840;</strong></p>
<p>&#x4E3B;&#x8981;&#x8C03;&#x8282;&#x4E09;&#x4E2A;&#x5C5E;&#x6027;&#xFF1A; &#x541E;&#x5410;&#x91CF;&#x3001;&#x5EF6;&#x65F6;&#x3001;&#x5185;&#x5B58;&#x5360;&#x7528; &#x3002;&#x4E00;&#x822C;&#x63D0;&#x9AD8;&#x67D0;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x90FD;&#x4F1A;&#x6D88;&#x8017;&#x53E6;&#x5916;&#x4E24;&#x4E2A;&#x5C5E;&#x6027;&#x3002;</p>
<p>&#x8C03;&#x89E3;&#x7684;&#x4E09;&#x4E2A;&#x539F;&#x5219;&#xFF1A;</p>
<p>(1)&#x3001; Minor GC &#x5E94;&#x8BE5;&#x5C3D;&#x53EF;&#x80FD;&#x591A;&#x6536;&#x96C6;&#x5783;&#x573E;&#xFF0C;&#x5C3D;&#x91CF;&#x51CF;&#x5C11;Full GC&#x3002;</p>
<p>(2)&#x3001;Java Heap&#x7A7A;&#x95F4;&#x8D8A;&#x5927;&#xFF0C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6548;&#x679C;&#x8D8A;&#x597D;&#xFF0C;&#x541E;&#x5410;&#x91CF;&#x548C;&#x5EF6;&#x65F6;&#x8D8A;&#x597D;</p>
<p>(3)&#x3001;&#x4E09;&#x4E2A;&#x5C5E;&#x6027;&#x4E2D;&#x9009;&#x62E9;&#x4E24;&#x4E2A;&#x8FDB;&#x884C;&#x8C03;&#x4F18; &#xFF08;GC &#x8C03;&#x4F18;3&#x9009;2&#x539F;&#x5219;&#xFF09;</p>
<p>&#x8C03;&#x4F18;&#x5E94;&#x8BE5;&#x5F00;&#x542F;GC &#x65E5;&#x5FD7;&#xFF1A;-XX:+PrintGCTimeStamps -XX:+PrintGCDetails -XXloggc:/opt/jvm-gc.log</p>
<p>-XX:PrintGCDateStamps &#xA0; &#x6253;&#x5370;&#x65E5;&#x5386;</p>
<p>-XX:PrintGCApplicationConcurrentTime &#xA0; &#xA0; &#xA0; &#x6253;&#x5370;&#x4E24;&#x4E2A;&#x5B89;&#x5168;&#x70B9;&#x4E4B;&#x95F4;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5224;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x662F;&#x5426;&#x5728;&#x6267;&#x884C; &#xA0;&#xA0;</p>
<p>-XX:PrintGCApplicationStoppedTime &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x6253;&#x5370;&#x7531;&#x4E8E;&#x5B89;&#x5168;&#x70B9;&#x64CD;&#x4F5C;&#x800C;&#x963B;&#x585E;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x786E;&#x8BA4;&#x5EF6;&#x8FDF;&#x662F;&#x6765;&#x81EA;&#x5B89;&#x5168;&#x70B9;&#x8FD8;&#x662F;&#x5176;&#x4ED6;&#x95EE;&#x9898;</p>
<p>-XX:PrintSatePointStastics &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x6253;&#x5370;&#x5B89;&#x5168;&#x70B9;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;</p>
<p><strong>&#x4E03;&#x3001;&#x786E;&#x5B9A;&#x5185;&#x5B58;&#x5360;&#x7528;</strong></p>
<hr>
<p><strong>1&#x3001;JVM&#x5E03;&#x5C40;</strong></p>
<hr>
<p>(1)&#x3001;&#x5173;&#x6CE8;&#x541E;&#x5410;&#x91CF;&#x3001;&#x4F4E;&#x5EF6;&#x65F6;&#x7684;&#x5E94;&#x7528;&#x5E94;&#x8BE5;&#x628A; -Xmx &#xA0;&#x548C; -Xms &#x8BBE;&#x4E3A;&#x540C;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x907F;&#x514D;&#x6269;&#x5C55;&#x6216;&#x7F29;&#x51CF;&#x65B0;&#x751F;&#x4EE3;&#x6216;&#x8001;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x800C;&#x8FDB;&#x884C;&#x7684;Full GC&#x3002;</p>
<p>(2)&#x3001;&#x4F7F;&#x7528;-Xmn &#x5C06;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x521D;&#x59CB;&#x503C;&#x548C;&#x6700;&#x5927;&#x503C;&#x8BBE;&#x4E3A;&#x540C;&#x4E00;&#x503C;&#x3002;</p>
<p>(3)&#x3001;&#x5173;&#x6CE8;&#x6027;&#x80FD;&#x7684;&#x5E94;&#x7528;&#x5E94;&#x8BE5;&#x5C06; -XX:PermSize &#x548C; -XX:MaxPermSize &#x8BBE;&#x4E3A;&#x540C;&#x4E00;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x6C38;&#x4E45;&#x4EE3;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x9700;&#x8981;Full GC&#x3002;</p>
<p>(4)&#x3001;&#x5982;&#x679C;&#x8001;&#x751F;&#x4EE3;&#x6216;&#x6C38;&#x4E45;&#x4EE3;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#xFF0C;&#x4E0D;&#x7BA1;&#x5176;&#x4ED6;&#x4EE3;&#x5185;&#x5B58;&#x662F;&#x5426;&#x5145;&#x8DB3;&#xFF0C;&#x90FD;&#x4F1A;&#x53D1;&#x751F;Full GC&#x3002;</p>
<p><strong>2&#x3001;Heap &#x5927;&#x5C0F;&#x8C03;&#x4F18;&#x6B65;&#x9AA4;</strong></p>
<hr>
<p>(1)&#x3001;&#x5148;&#x4F7F;&#x7528;JVM&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#x3001;&#x6216;&#x8005;&#x5148;&#x6307;&#x5B9A;-Xmx&#x548C;-Xms&#xFF0C;&#x5C06;&#x7A0B;&#x5E8F;&#x63A8;&#x8FDB;&#x5230;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#x4E2D;&#xFF0C;&#x7B49;&#x7A0B;&#x5E8F;&#x51FA;&#x73B0;&#x4E86;&#x8001;&#x5E74;&#x4EE3;&#x3001;&#x6C38;&#x4E45;&#x4EE3;&#x7684;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#xFF0C;&#x5219;&#x589E;&#x52A0;&#x8001;&#x751F;&#x4EE3;&#x5927;&#x5C0F; (-Xms &#x548C; -Xmx )&#xFF0C;&#x589E;&#x52A0;&#x6C38;&#x4E45;&#x4EE3;&#x5927;&#x5C0F;(-XX:PermSize &#x548C; -XX:MaxPermSize)&#xFF0C;&#x5982;&#x6B64;&#x8FED;&#x4EE3;&#xFF0C;&#x76F4;&#x5230;&#x4E0D;&#x518D;&#x51FA;&#x73B0;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#xFF0C;&#x7A0B;&#x5E8F;&#x7A33;&#x5B9A;&#x3002;</p>
<p>(2)&#x3001;&#x8BA1;&#x7B97;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#xFF1A;&#x5373;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x4E0E;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#x540E;&#xFF0C;&#x8001;&#x5E74;&#x4EE3;&#x3001;&#x6C38;&#x4E45;&#x5E26;&#x5206;&#x522B;&#x5360;&#x7528;Java Heap&#x7684;&#x5927;&#x5C0F;&#x3002;&#x53EF;&#x4F7F;&#x7528; VisualVM &#x89E6;&#x53D1;Full GC&#xFF0C;&#x770B;&#x65E5;&#x5FD7;&#x3002;</p>
<p>(3)&#x3001;&#x914D;&#x7F6E;&#x5806;&#x7A7A;&#x95F4;&#x521D;&#x59CB;&#x5806;&#x5927;&#x5C0F;&#xFF1A;</p>
<p>-Xmx &#x548C; -Xms &#xFF1A; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; Heap&#x603B;&#x5BB9;&#x91CF;&#x4E3A; &#x8001;&#x751F;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; <strong>3~4</strong> &#x500D;</p>
<p>-Xmn: &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;&#x65B0;&#x751F;&#x4EE3;&#x5BB9;&#x91CF;&#x4E3A;&#xA0; &#x8001;&#x751F;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; <strong>1~1.5</strong> &#x500D;&#xFF0C;&#x5373;&#x8001;&#x751F;&#x4EE3;&#x5BB9;&#x91CF;&#x4E3A;&#x8001;&#x751F;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x7684;2~3&#x500D;</p>
<p>-XX:PermSize -XX:MaxPermSize : &#xA0; &#x6C38;&#x4E45; &#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#x7684; <strong>1.5</strong> &#x500D;</p>
<p><strong>&#x516B;&#x3001;&#x786E;&#x5B9A;&#x8C03;&#x4F18;&#x5EF6;&#x8FDF;/&#x54CD;&#x5E94;&#x6027;</strong></p>
<p><strong>1&#x3001;&#x4ECE;&#x65E5;&#x5FD7;&#x4E2D;&#x7EDF;&#x8BA1;&#x4EE5;&#x4E0B;&#x6570;&#x636E;</strong></p>
<p>Minor GC&#x7684;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#x3001;Minor GC&#x7684;&#x9891;&#x7387;&#x3001;Full GC&#x7684;&#x6700;&#x957F;&#x65F6;&#x95F4;&#x3001;Full GC&#x7684;&#x6700;&#x5927;&#x9891;&#x7387;</p>
<p><strong>2&#x3001;&#x4F18;&#x5316;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;</strong></p>
<p>&#x82E5;Minor GC &#x65F6;&#x95F4;&#x8FC7;&#x957F;&#xFF0C;&#x51CF;&#x5C11;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x82E5;Minor GC &#x8FC7;&#x4E8E;&#x9891;&#x7E41;&#xFF0C;&#x589E;&#x5927;&#x65B0;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x3002;</p>
<p>&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>&#x5047;&#x8BBE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5EF6;&#x8FDF;&#x6027;&#x8981;&#x6C42;&#x662F;40&#x6BEB;&#x79D2;&#xFF0C; Minor GC &#x9891;&#x7387;&#x4E3A;54&#x6BEB;&#x79D2;&#xFF0C;&#x8D85;&#x8FC7;&#x4E86;&#x8981;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x5047;&#x8BBE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x9891;&#x7387;&#x8981;&#x6C42;&#x662F;5&#x79D2;&#x4E00;&#x6B21;&#xFF0C; Minor GC &#x9891;&#x7387;&#x4E3A;2.147&#x79D2;&#x4E00;&#x6B21;&#xFF0C;&#x8D85;&#x8FC7;&#x4E86;&#x8981;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x5E94;&#x8BE5;&#x589E;&#x5927;&#x5185;&#x5B58;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;</p>
<p>(1)&#x3001;&#x8C03;&#x8282;-Xmn &#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x540C;&#x65F6;&#x8C03;&#x89E3; -Xms &#x548C; -Xmx&#xFF0C; &#x4FDD;&#x8BC1;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x4E0D;&#x53D8;&#x3002;</p>
<p>(2)&#x3001; &#x8001;&#x751F;&#x4EE3;&#x5BB9;&#x91CF;&#x81F3;&#x5C11;&#x4E3A;&#x8001;&#x751F;&#x4EE3;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x7684;1.5&#x500D;</p>
<p>(3)&#x3001;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x81F3;&#x5C11;&#x4E3A;Heap&#x5927;&#x5C0F;&#x7684;10% &#xA0;(&#x8FC7;&#x5C0F;&#x4F1A;&#x5BFC;&#x81F4;Minor GC &#x9891;&#x7E41;)</p>
<p>(5)&#x3001;&#x589E;&#x5927;Java Heap&#x5927;&#x5C0F;&#x65F6;&#x5019;&#xFF0C;&#x4E0D;&#x53EF;&#x4EE5;&#x8D85;&#x8FC7;JVM &#x53EF;&#x7528;&#x7684;&#x7269;&#x7406;&#x5185;&#x5B58;&#x6570; &#xFF08;&#x4F7F;&#x7528;&#x865A;&#x62DF;&#x5185;&#x5B58;&#x6027;&#x80FD;&#x5E95;&#x4E0B;&#xFF09;</p>
<p><strong>3&#x3001;&#x4F18;&#x5316;&#x8001;&#x751F;&#x4EE3;&#x5927;&#x5C0F;</strong></p>
<p>Full GC &#x7684;&#x9891;&#x7387;&#x8FC7;&#x9AD8;&#xFF0C;&#x5219;&#x589E;&#x5927;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#xFF0C;&#x589E;&#x52A0;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x7684;&#x540C;&#x65F6;&#x5E94;&#x8BE5;&#x4FDD;&#x6301;&#x65B0;&#x751F;&#x4EE3;&#x5927;&#x5C0F;&#x4E0D;&#x53D8;&#x3002;</p>
<p>Full GC &#x7684;&#x5EF6;&#x65F6;&#x8FC7;&#x957F;&#xFF0C;&#x589E;&#x5927;&#x8001;&#x5E74;&#x4EE3;&#x4E00;&#x822C;&#x65E0;&#x6548;&#xFF0C;&#x9700;&#x8981;&#x5207;&#x6362;&#x4F7F;&#x7528;CMS &#x8C03;&#x4F18;&#x5668;&#xFF0C;-XX:UseConcMarkSweepGC&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x8C03;&#x4F18;</p>
<p>&#x53EF;&#x4EE5;&#x67E5;&#x770B;Minor GC &#x7684;&#x63D0;&#x5347;&#x7387;&#xFF0C;&#x9884;&#x6D4B;Full GC &#x7684;&#x9891;&#x7387;&#xFF1A;</p>
<p>&#xA0;Minor GC &#x7684;&#x65E5;&#x5FD7;&#x53EF;&#x4EE5;&#x67E5;&#x770B; Heap &#x7684;&#x603B;&#x5BB9;&#x91CF;&#xFF1A; totalHeap&#xA0;</p>
<p>&#x67E5;&#x770B;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x603B;&#x5BB9;&#x91CF;&#xFF1A; totalYoung&#xA0;</p>
<p>&#x67E5;&#x770B;MInor GC&apos;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#xFF1A; minorTime</p>
<p>&#x8BA1;&#x7B97;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x5BB9;&#x91CF;&#xFF1A;totalOld &#xA0;=&#xA0;totalHeap -&#xA0;totalYoung&#xA0;</p>
<p>&#x5728;Full GC&#x7684;&#x65E5;&#x5FD7;&#x4E2D;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x6D3B;&#x8DC3;&#x6570;&#x636E;&#x5927;&#x5C0F;&#xFF1A;activeOld&#xA0;</p>
<p>&#x8BA1;&#x7B97;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x7A7A;&#x95F2;&#x7A7A;&#x95F4;&#xFF1A;freeOld =totalOld &#xA0;-&#xA0;activeOld&#xA0;</p>
<p>Minor GC &#x4E2D;&#x89C2;&#x5BDF;&#x6BCF;&#x6B21;&#x65B0;&#x751F;&#x4EE3;&#x7684;&#x5269;&#x4F59;&#x7A7A;&#x95F4; freeYoung1&#x3001;freeYoung2&#x3001;freeYoung3</p>
<p>Minor GC &#x4E2D;&#x89C2;&#x5BDF;&#x6BCF;&#x6B21;Heap&#x7684;&#x5269;&#x4F59;&#x7A7A;&#x95F4; freeTotal1&#x3001;freeTotal2&#x3001;freeTotal3&#x3001;freeTotal4</p>
<p>&#x4E8E;&#x662F;&#x53EF;&#x4EE5;&#x6C42;&#x5F97;&#x6BCF;&#x6B21;MinorGC&#x540E;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#xFF1A;occupancyOld1= &#xA0;freeTotal1-&#xA0;freeYoung1, &#xA0;occupancyOld2= &#xA0;freeTotal2-&#xA0;freeYoung2,……</p>
<p>&#x6C42;&#x5F97;&#x6BCF;&#x6B21;Minor GC&#x63D0;&#x5347;&#x5230;&#x8001;&#x751F;&#x4EE3;&#x7684;&#x6570;&#x636E;&#x91CF;&#xFF1A;promoteOld1 =&#xA0;occupancyOld2-occupancyOld1; &#xA0;promoteOld2 =&#xA0;occupancyOld3-occupancyOld2</p>
<p>&#x6C42;&#x5F97;&#x6BCF;&#x6B21;Minor GC&#x63D0;&#x5347;&#x5230;&#x8001;&#x751F;&#x4EE3;&#x6570;&#x636E;&#x91CF;&#x7684;&#x5E73;&#x5747;&#x503C;&#xA0;promoteOld</p>
<p>&#x8001;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x6EE1;&#x9700;&#x8981;&#x7684;&#x6B21;&#x6570;&#xFF1A;promoteTotalCount =&#xA0;activeOld /promoteOld;</p>
<p>&#x8001;&#x751F;&#x4EE3;&#x7A7A;&#x95F4;&#x5360;&#x6EE1;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#xFF1A;promoteTotalTime =&#xA0;promoteCount *&#xA0;minorTime</p>
<p>promoteTotalTime &#x5373;&#x53EF;&#x63A8;&#x6D4B;&#x51FA;Full GC &#x591A;&#x4E45;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x3002;</p>
<p><strong>4&#x3001;&#x4E3A;CMS&#x8C03;&#x4F18;&#x5EF6;&#x8FDF;</strong></p>
<p>&#x91C7;&#x7528;CMS&#x7684;&#x7EDD;&#x5BF9;&#x6700;&#x5DEE;&#x5EF6;&#x8FDF;&#x6BD4;Parallel&#x7684;&#x6700;&#x5DEE;&#x5EF6;&#x8FDF;&#x66F4;&#x957F;&#xFF0C;&#x6240;&#x4EE5;&#xFF0C;&#x4ECE;Parallel&#x8F6C;&#x6362;&#x5230;CMS&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x9700;&#x8981;&#x5C06;&#x8001;&#x5E74;&#x4EE3;&#x7A7A;&#x95F4;&#x589E;&#x5927;20%-30%.</p>
<p>&#x5904;&#x7406;CMS&#x7684;&#x8001;&#x5E74;&#x4EE3;&#x788E;&#x7247;&#x95EE;&#x9898;&#xFF1A;&#x51CF;&#x5C11;&#x5BF9;&#x8C61;&#x4ECE;&#x65B0;&#x751F;&#x4EE3;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x6BD4;&#x7387;&#x3002;</p>
<p><strong>5&#x3001;&#x8C03;&#x4F18;Survivor&#x7A7A;&#x95F4;</strong></p>
<hr>
<p>Survivor&#x8FC7;&#x5C0F;&#x4F1A;&#x5C06;&#x5F88;&#x591A;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x8001;&#x751F;&#x4EE3;&#xFF0C;&#x5F15;&#x53D1;Full GC&#x3002;</p>
<p>(1)&#x3001;&#x901A;&#x8FC7;&#x547D;&#x4EE4; -XX&#xFF1A;+PrintTenuringDistribution &#x53EF;&#x4EE5;&#x89C2;&#x5BDF;Survivor&#x7A7A;&#x95F4;&#x5BF9;&#x8C61;&#x7684;&#x5E74;&#x9F84;&#x7EC4;&#x6210;&#x3002;</p>
<p>(2)&#x3001;&#x8C03;&#x4F18;Survivor&#x4E0E;Eden&#x7684;&#x6BD4;&#x4F8B;&#xFF1A;-XX:SurvivorRatio &#xA0;&#xA0;</p>
<p>&#x6BCF;&#x4E2A;Survivor&#x5BB9;&#x91CF; = &#x65B0;&#x751F;&#x4EE3;&#x5BB9;&#x91CF; / (SurvivorRadio +2) ;</p>
<p>&#x901A;&#x8FC7; <strong>-XX:PrintTenuringDistribution</strong>&#x53EF;&#x4EE5;&#x89C2;&#x5BDF;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#x5E74;&#x9F84;&#x7684;&#x603B;&#x5927;&#x5C0F;&#xFF0C; &#x7EDF;&#x8BA1;Survivor&#x7A7A;&#x95F4;&#x5B58;&#x6D3B;&#x7684;&#x5BF9;&#x8C61;&#x603B;&#x5927;&#x5C0F;&#xFF0C;&#x5C06;Survivor&#x5927;&#x5C0F;&#x8BBE;&#x4E3A;&#x5B58;&#x6D3B;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x7684; <strong>2</strong> &#x500D; &#xFF08;&#x9ED8;&#x8BA4; -XX: TargetSurvivorRatio=50 &#xFF09;&#x3002;</p>
<p>&#x589E;&#x5927;Survivor&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5E94;&#x8BE5;&#x4FDD;&#x6301;Eden&#x533A;&#x4E0D;&#x53D8;&#xFF0C;&#x5373;&#x9700;&#x8981;&#x540C;&#x65F6;&#x589E;&#x5927;-Xmn&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x8981;&#x8001;&#x5E74;&#x4EE3;&#x5927;&#x5C0F;&#x4E0D;&#x53D8;&#xFF0C;&#x6545;&#x800C;&#x8FD8;&#x9700;&#x8981;&#x589E;&#x5927;-Xmx &#x548C; -Xms</p>
<p>(3)&#x3001;&#x8C03;&#x4F18;&#x5BF9;&#x8C61;&#x63D0;&#x5347;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x7684;&#x5E74;&#x9F84;&#xFF1A;-XX:MaxTenuringThreshold &#xA0;</p>
<p>&#x4E00;&#x822C;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#xA0;-XX:MaxTenuringThreshold =15 &#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B81;&#x53EF;&#x5BF9;&#x8C61;&#x5728;Survivor&#x4E4B;&#x95F4;&#x591A;&#x6B21;&#x590D;&#x5236;&#xFF0C;&#x4E5F;&#x4E0D;&#x8981;&#x5C06;&#x5176;&#x5306;&#x5306;&#x590D;&#x5236;&#x5230;&#x8001;&#x5E74;&#x4EE3;&#x3002;&#xA0;</p>
<p>&#x53EF;&#x4EE5; &#xA0; -XX:PrintTenuringDistribution &#xA0;&#xA0; &#x76D1;&#x63A7;</p>
<p><strong>6&#x3001;&#x8C03;&#x4F18;CMS&#x53D1;&#x751F;&#x65F6;&#x523B; &#xA0;-XX&#xFF1A;CMSInitiatingOccupancyFraction=&lt;percent&gt;&#xA0; -XX:CMSInitialingOccupancyOnly&#xA0;</strong></p>
<p>CMSInitiatingOccupancyFraction &#x8FC7;&#x5927;&#xFF0C;&#x5219;CMS &#x542F;&#x52A8;&#x592A;&#x665A;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x957F;&#xFF0C;&#x751A;&#x81F3;&#x5185;&#x5B58;&#x6EA2;&#x51FA;&#x5931;&#x8D25;&#x3002;</p>
<p>CMSInitiatingOccupancyFraction &#x8FC7;&#x5C0F;&#xFF0C;&#x5219;CMS &#x542F;&#x52A8;&#x592A;&#x65E9;&#xFF0C;&#x5219;&#x6267;&#x884C;&#x9891;&#x7E41;&#xFF0C;&#x51E0;&#x4E4E;&#x56DE;&#x6536;&#x4E0D;&#x5230;&#x5783;&#x573E;&#x3002;</p>
<p>CMSInitiatingOccupancyFraction &#x8D77;&#x7801;&#x5E94;&#x8BE5;&#x5927;&#x4E8E; &#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;/&#x8001;&#x5E74;&#x4EE3;&#x603B;&#x5927;&#x5C0F;&#xFF0C;&#x5426;&#x5219;&#x5C06;&#x9677;&#x5165; &#x6B7B;&#x5FAA;&#x73AF; &#x3002;</p>
<p>CMSInitiatingOccupancyFraction &#x4E00;&#x822C;&#x5927;&#x4E8E; <strong>1.5</strong>&#x500D;&#x7684;&#xA0;&#x8001;&#x5E74;&#x4EE3;&#x6D3B;&#x8DC3;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;/&#x8001;&#x5E74;&#x4EE3;&#x603B;&#x5927;&#x5C0F;&#x3002;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x503C;&#xFF0C;&#x53C2;&#x7167;&#x65E5;&#x5FD7;&#x7EE7;&#x7EED;&#x8C03;&#x4F18;&#x3002;</p>
<p>&#x6700;&#x597D;&#x540C;&#x65F6;&#x8BBE;&#x7F6E; -XX:CMSInitialingOccupancyOnly &#xFF0C;&#x4F7F;&#x5F97;JVM &#x4E00;&#x76F4;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;percent&#xFF0C;&#x5426;&#x5219;JVM&#x4F1A;&#x5728;&#x4F7F;&#x7528;&#x4E86;&#x7B2C;&#x4E00;&#x904D;&#x4E4B;&#x540E;&#x53C8;&#x4F1A;&#x8F6C;&#x5411;&#x81EA;&#x9002;&#x5E94;&#x3002;</p>
<p><strong>7&#x3001;&#x7981;&#x6B62; &#x663E;&#x793A;&#x5783;&#x573E;&#x6536;&#x96C6;</strong></p>
<p>-XX&#xFF1A;+DisableExplicitGC &#x7981;&#x6B62;System.gc().</p>
<p><strong>8&#x3001;&#x8C03;&#x4F18;&#x6C38;&#x4E45;&#x4EE3;&#x5783;&#x573E;&#x6536;&#x96C6;</strong></p>
<p>CMS &#x9ED8;&#x8BA4;&#x4E0D;&#x5F00;&#x542F;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x5F00;&#x542F;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#xFF1A; -XX:CMSClassUnloadingEnabled</p>
<p>&#x540C;&#x65F6;&#x914D;&#x7F6E;&#x4F7F;&#x7528;&#xFF1A; -XX:CMSPermGenSweepingEnabled &#xA0;-XX:CMSInitiatingPermOccupanyFraction=&lt;percent&gt; &#xA0;-XX:UseCMSInitiatingOccupancyOnly</p>
<p><strong>9&#x3001;&#x8C03;&#x4F18;CMS&#x505C;&#x987F;&#x65F6;&#x95F4;</strong></p>
<p>&#x521D;&#x59CB;&#x6807;&#x8BB0;&#x662F;&#x5355;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x6781;&#x5C11;&#x5360;&#x7528;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x662F;&#x591A;&#x7EBF;&#x7A0B;&#x7684;&#xFF0C;&#x5360;&#x7528;&#x8F83;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x53EF;&#x4EE5;&#x8C03;&#x8282;&#x7EBF;&#x7A0B;&#x6570;&#xFF1A; +XX&#xFF1A;ParallelGCThreads=&lt;n&gt; &#xFF0C;&#x9ED8;&#x8BA4;&#x503C; = 8+ &#xFF08;&#x5904;&#x7406;&#x5668;&#x6838;&#x6570;-8&#xFF09;<em>5/8 &#xA0;,&#x7EA6;&#x4E3A; 3 + &#x5904;&#x7406;&#x5668;&#x6570;</em>0.6 &#x3002;&#x53EF;&#x4EE5;&#x8C03;&#x5C0F;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x51CF;&#x5C11;&#x505C;&#x987F;&#x3002;</p>
<p>&#x5F3A;&#x5236;&#x91CD;&#x65B0;&#x6807;&#x8BB0;&#x4E4B;&#x524D;&#x8FDB;&#x884C;Minor GC&#xFF1A; -XX:CMSScavengeBeforeRemark</p>
<p>&#x51CF;&#x5C11;&#x5927;&#x91CF;&#x5F15;&#x7528;&#x5BF9;&#x8C61;&#x3001;&#x53EF;&#x7EC8;&#x7ED3;&#x5BF9;&#x8C61;&#x5E26;&#x6765;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x6301;&#x7EED;&#x65F6;&#x95F4;&#xFF1A; -XX:+ParallelRefProcEnabled .</p>
<p><strong>&#x4E5D;&#x3001;&#x8C03;&#x4F18;&#x541E;&#x5410;&#x91CF;</strong></p>
<hr>
<p><strong>1&#x3001;CMS&#x7684;&#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;</strong></p>
<p>&#x589E;&#x5927;&#x65B0;&#x751F;&#x4EE3;&#xFF0C;&#x51CF;&#x5C11;Minor GC&#x7684;&#x6B21;&#x6570;</p>
<p>&#x589E;&#x5927;&#x8001;&#x751F;&#x4EE3;&#xFF0C;&#x51CF;&#x5C11;CMS&#x6B21;&#x6570;</p>
<p>&#x4F18;&#x5316;Survivor&#xFF0C;&#x51CF;&#x5C11;&#x63D0;&#x5347;&#x5230;&#x8001;&#x751F;&#x4EE3;&#x5BF9;&#x8C61;</p>
<p>&#x4F18;&#x5316;CMS&#x542F;&#x52A8;&#x6761;&#x4EF6;&#xFF0C;&#x665A;&#x70B9;&#x542F;&#x52A8;&#x3002;</p>
<p>&#x4E00;&#x822C;CMS &#x5305;&#x62EC;Minor GC&#x6240;&#x5E26;&#x6765;&#x7684;&#x5F00;&#x9500;&#x5E94;&#x8BE5;&#x5C0F;&#x4E8E;10%, &#x53EF;&#x4EE5;&#x4F18;&#x5316;&#x51CF;&#x5C11;&#x5230;1%-3%&#x3002;</p>
<hr>
<p><strong>2&#x3001;Parallel&#x7684;&#x541E;&#x5410;&#x91CF;&#x8C03;&#x4F18;</strong></p>
<p>&#x7981;&#x7528;&#x81EA;&#x9002;&#x5E94;&#xFF1A;-XX:-UseAdaptiveSizePolicy</p>
<p>&#x8C03;&#x4F18;Survivor&#x7A7A;&#x95F4;&#xFF1A;</p>
<p>&#x8C03;&#x4F18;&#x5E76;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#xFF1A;</p>
<p>&#x5728;NUMA&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#xFF1A;&#x4F7F;&#x7528; -XX:+UseNUMA</p>
<p>&#xA0;</p>
<p><strong>&#x5341;&#x3001;&#x5176;&#x4ED6;&#x6027;&#x80FD;&#x547D;&#x4EE4;</strong></p>
<p><strong>1&#x3001;&#x5F00;&#x542F;&#x5B9E;&#x9A8C;&#x6027;&#x7684;&#x4F18;&#x5316; &#xFF08;&#x6709;&#x98CE;&#x9669;&#xFF0C;&#x53EF;&#x80FD;&#x4E0D;&#x7A33;&#x5B9A;&#xFF09;</strong></p>
<p>-XX:+AggressiveOpts</p>
<hr>
<p><strong>2&#x3001;&#x9003;&#x9038;&#x5206;&#x6790;&#x4F18;&#x5316;</strong></p>
<p>-XX:+DoEscapeAnalysis</p>
<p>JVM&#x4F1A;&#x91C7;&#x7528;&#x4EE5;&#x4E0B;&#x65B9;&#x5F0F;&#x4F18;&#x5316;&#xFF1A;&#x5BF9;&#x8C61;&#x5C55;&#x5F00;&#x3001;&#x6807;&#x91CF;&#x66FF;&#x6362;&#x3001;&#x6808;&#x4E0A;&#x5206;&#x914D;&#x3001;&#x6D88;&#x9664;&#x540C;&#x6B65;&#x3001;&#x6D88;&#x9664;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x8BFB;&#x5199;&#x5C4F;&#x969C;</p>
<p><strong>3&#x3001;&#x504F;&#x5411;&#x9501;</strong></p>
<p>-XX:+UseBiasedLocjing</p>
<p><strong>4&#x3001;&#x5927;&#x9875;&#x9762;&#x652F;&#x6301;</strong></p>
<p>-XX:+UseLargePages</p>
<hr>
<p>&#xA0;</p>
<p>&#x7248;&#x6743;&#x58F0;&#x660E;&#xFF1A;&#x672C;&#x6587;&#x4E3A;&#x535A;&#x4E3B;&#x539F;&#x521B;&#x6587;&#x7AE0;&#xFF0C;&#x672A;&#x7ECF;&#x535A;&#x4E3B;&#x5141;&#x8BB8;&#x4E0D;&#x5F97;&#x8F6C;&#x8F7D;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/0330556/" title="BEA 官方 JRockit JVM 调优文档 - 蜡笔小辛的专栏" itemprop="url">BEA 官方 JRockit JVM 调优文档 - 蜡笔小辛的专栏</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T03:29:49.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x8F6C;&#x81EA;BEA&#xFF0C;&#x539F;&#x6587;&#x94FE;&#x63A5;&#x5DF2;&#x7ECF;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#xFF0C;&#x6587;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x94FE;&#x63A5;&#x4E5F;&#x66F4;&#x6539;&#x8FC7;&#x5730;&#x5740;&#xFF0C;&#x6211;&#x628A;&#x80FD;&#x627E;&#x5230;&#x7684;&#x90FD;&#x91CD;&#x65B0;&#x505A;&#x4E86;&#x8FDE;&#x63A5;&#x3002;&#x4EE5;&#x524D;&#x4E00;&#x76F4;&#x4EE5;&#x4E3A;Jrockit&#x548C;Sun&#x7684;JVM&#x914D;&#x7F6E;&#x5DEE;&#x4E0D;&#x591A;&#xFF0C;&#x770B;&#x4E86;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x548C;&#x6700;&#x540E;&#x53C2;&#x8003;&#x8D44;&#x6599;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53D1;&#x73B0;&#x533A;&#x522B;&#x4E0D;&#x662F;&#x4E00;&#x70B9;&#x70B9;&#xFF0C;&#x5F88;&#x591A;&#x5E38;&#x7528;&#x53C2;&#x6570;&#x7684;&#x4F7F;&#x7528;&#x90FD;&#x4E0D;&#x4E00;&#x6837;&#x3002;Jrockit&#x7684;&#x81EA;&#x52A8;&#x5316;&#x8BBE;&#x7F6E;&#x5E94;&#x8BE5;&#x8BF4;&#x505A;&#x7684;&#x4E0D;&#x9519;&#xFF0C;&#x5728;WebLogic&#x4E0A;&#x6211;&#x5F88;&#x5C11;&#x66F4;&#x6539;&#x5B83;&#x7684;&#x9ED8;&#x8BA4;&#x914D;&#x7F6E;&#xFF08;&#x9664;&#x4E86;&#x5806;&#x6700;&#x5927;&#x6700;&#x5C0F;&#x503C;&#xFF09;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E0D;&#x5F71;&#x54CD;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5B58;&#x5728;&#x7684;&#x4EF7;&#x503C;&#x3002;</p>
<h5 id="&#x6458;&#x8981;">&#x6458;&#x8981;</h5><p>&#x672C;&#x6587;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4EE5;&#x6E05;&#x5355;&#x7684;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;BEA JRockit JVM&#x7684;&#x8C03;&#x4F18;&#x4FE1;&#x606F;&#x3002;&#x4ECE;&#x6DF1;&#x5965;&#x7684;&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x5230;&#x8FED;&#x4EE3;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#xFF0C;&#x672C;&#x6587;&#x6DB5;&#x76D6;&#x4E86;&#x8BB8;&#x591A;&#x65B9;&#x9762;&#x3002;&#x5927;&#x90E8;&#x5206;&#x6570;&#x636E;&#x90FD;&#x662F;&#x6211;&#x4E0E;&#x7528;&#x6237;&#x5408;&#x4F5C;&#x8FC7;&#x7A0B;&#x4E2D;&#x6536;&#x96C6;&#x7684;&#x3002;&#x60A8;&#x8981;&#x662F;&#x4E5F;&#x6709;&#x4EC0;&#x4E48;&#x6280;&#x5DE7;&#x7684;&#x8BDD;&#xFF0C;&#x8BF7;&#x544A;&#x8BC9;&#x6211;&#xFF0C;&#x5728;&#x672C;&#x6587;&#x7684;&#x4E0B;&#x4E00;&#x7248;&#x4E2D;&#xFF0C;&#x6211;&#x4F1A;&#x5C1D;&#x8BD5;&#x5C06;&#x5B83;&#x4EEC;&#x6DFB;&#x52A0;&#x8FDB;&#x53BB;&#x3002; </p>
<p>&#x5177;&#x4F53;&#x7684;&#x4EA7;&#x54C1;&#x7248;&#x672C;&#x4FE1;&#x606F;&#x90FD;&#x5DF2;&#x5728;&#x9002;&#x5F53;&#x7684;&#x5730;&#x65B9;&#x5217;&#x51FA;&#xFF1B;&#x4F46;&#x662F;&#xFF0C;&#x672C;&#x6587;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x901A;&#x7528;&#x6307;&#x5357;&#x9002;&#x7528;&#x4E8E;JRockit&#x7684;&#x5927;&#x591A;&#x6570;&#x7248;&#x672C;&#x3002;&#x6BCF;&#x4E2A;&#x7248;&#x672C;&#x7684;JRockit&#x90FD;&#x589E;&#x52A0;&#x4E86;&#x65B0;&#x7684;&#x8BBE;&#x7F6E;&#x548C;&#x4F18;&#x5316;&#xFF0C;&#x6240;&#x4EE5;&#x8BF7;&#x67E5;&#x770B; <a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/jrdocs/index.html" target="_blank" rel="external">&#x53D1;&#x884C;&#x8BF4;&#x660E;</a> &#x548C; <a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/webdocs/index.html" target="_blank" rel="external">JRockit&#x4EA7;&#x54C1;&#x4E2D;&#x5FC3;</a>&#x3002; </p>
<h5 id="&#x9A8C;&#x8BC1;&#x5F53;&#x524D;&#x7684;JRockit&#x73AF;&#x5883;">&#x9A8C;&#x8BC1;&#x5F53;&#x524D;&#x7684;JRockit&#x73AF;&#x5883;</h5><p>&#x9996;&#x5148;&#x9700;&#x8981;&#x786E;&#x5B9A;&#x60A8;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x5668;&#x6240;&#x4F7F;&#x7528;&#x7684;JRockit&#x7684;&#x7248;&#x672C;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x76F8;&#x5E94;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x5668;&#x7684;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x9002;&#x5F53;&#x7684;&#x811A;&#x672C;&#x8BBE;&#x7F6E;&#x7CFB;&#x7EDF;&#x73AF;&#x5883;&#xFF0C;&#x7136;&#x540E;&#x6267;&#x884C;java &#x2013;version&#x547D;&#x4EE4;&#x6765;&#x786E;&#x5B9A;JRockit&#x7684;&#x7248;&#x672C;&#x3002; </p>
<p>&#x63A5;&#x7740;&#xFF0C;&#x6536;&#x96C6;&#x5F53;&#x524D;JVM&#x6807;&#x5FD7;&#xFF0C;&#x5F00;&#x53D1;&#x548C;/&#x6216;&#x751F;&#x4EA7;&#x9636;&#x6BB5;&#x9700;&#x8981;&#x7528;&#x5230;&#x5B83;&#x4EEC;&#xFF1A;</p>
<pre><code>-<span class="ruby">server -<span class="constant">Xms1024m</span> -<span class="constant">Xmx1536m</span> -<span class="constant">Xverboselog</span><span class="symbol">:gc</span>.log -<span class="constant">Xverbose</span><span class="symbol">:memory-Xgcprio</span><span class="symbol">:throughput</span></span>
</code></pre><p>&#x8FD9;&#x5C06;&#x544A;&#x8BC9;&#x60A8;&#x5F53;&#x524D;JRockit&#x5B9E;&#x4F8B;&#x7684;&#x914D;&#x7F6E;&#x60C5;&#x51B5;&#x3002; </p>
<h5 id="&#x786E;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x76EE;&#x6807;">&#x786E;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x76EE;&#x6807;</h5><p>&#x786E;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x76EE;&#x6807;&#x662F;&#x4EC0;&#x4E48;&#x3002;&#x662F;&#x201C;&#x54CD;&#x5E94;&#x5FEB;&#x201D;&#x8FD8;&#x662F;&#x201C;&#x6027;&#x80FD;&#x9AD8;&#x201D;&#xFF1F;&#x6839;&#x636E;&#x76EE;&#x6807;&#x7684;&#x4E0D;&#x540C;&#xFF0C;&#x9700;&#x8981;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x3002; </p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5B9E;&#x73B0;&#x9AD8;&#x6027;&#x80FD;&#xFF0C;&#x5219;&#x786E;&#x4FDD;&#x8BBE;&#x7F6E;&#x4E86;Dynamic Garbage Collector &quot;-Xgcprio:throughput&quot; &#x9009;&#x9879;&#x3002;&#x5982;&#x679C;&#x76EE;&#x6807;&#x662F;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x77ED;&#xFF0C;&#x90A3;&#x4E48;&#x9700;&#x8981;&#x5C06;-Xgcprio:pausetime -Xpausetarget=XXX&#x2019;&#x4E2D;&#x7684;pausetarget&#x8BBE;&#x7F6E;&#x4E3A;&#x6700;&#x4F73;&#x503C;&#x3002;&#x6709;&#x5173;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x8BF7;&#x67E5;&#x770B;JRockit <a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/geninfo/diagnos/part_02.html" target="_blank" rel="external">&#x8C03;&#x4F18;&#x6587;&#x6863;</a>&#x3002; </p>
<h5 id="&#x6536;&#x96C6;&#x6545;&#x969C;&#x8BCA;&#x65AD;&#x6570;&#x636E;">&#x6536;&#x96C6;&#x6545;&#x969C;&#x8BCA;&#x65AD;&#x6570;&#x636E;</h5><p>&#x5982;&#x679C;JVM&#x6027;&#x80FD;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x6700;&#x597D;&#x662F;&#x5148;&#x6536;&#x96C6;&#x4E00;&#x4E9B;&#x5206;&#x6790;&#x6570;&#x636E;&#x3002;&#x8BE5;&#x5DE5;&#x4F5C;&#x53EF;&#x4EE5;&#x7531;&#x56E2;&#x961F;&#x4E2D;&#x6709;&#x76F8;&#x5173;&#x7ECF;&#x9A8C;&#x7684;&#x4EBA;&#x5458;&#x6765;&#x5B8C;&#x6210;&#xFF0C;&#x60A8;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x53D1;&#x9001;&#x7ED9;BEA Support&#x505A;&#x8FDB;&#x4E00;&#x6B65;&#x5206;&#x6790;&#x3002; </p>
<p>&#x9996;&#x5148;&#xFF0C;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x65F6;&#x9700;&#x8981;&#x6536;&#x96C6;&#x5927;&#x7EA6;10&#x5206;&#x949F;&#x7684;&#x8FD0;&#x884C;&#x65F6;JRockit Recording&#xFF08;JRA)&#x6570;&#x636E;&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;jrcmd.sh&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x6216;<a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/geninfo/diagnos/intromiscon.html" target="_blank" rel="external">JRockit Mission Control</a>&#xFF08;JRMC&#xFF09;&#x5B8C;&#x6210;&#x6B64;&#x64CD;&#x4F5C;&#x3002;&#x8BF7;&#x9605;&#x8BFB;&#x201C;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x671F;&#x95F4;&#x7684;JRCMD/JRA&#x201D;&#x548C;&#x201C;JRockit Mission Control&#x201D;&#x4E24;&#x8282;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605; <a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/tools/index.html" target="_blank" rel="external">JRockit Mission Control&#x6587;&#x6863;</a>&#x3002;Latency Analysis&#x4E00;&#x8282;&#x63D0;&#x4F9B;&#x8BB8;&#x591A;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4ECE;&#x4E2D;&#x4E86;&#x89E3;&#x4EFB;&#x4F55;&#x6F5C;&#x5728;&#x7684;&#x5EF6;&#x8FDF;&#x95EE;&#x9898;&#xFF08;&#x5728;JRockit&#x4E2D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8BB8;&#x53EF;&#x8BC1;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#xFF09;&#x3002; </p>
<p>&#x7136;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x6536;&#x96C6;&#x95EE;&#x9898;&#x53D1;&#x751F;&#x65F6;&#x7684;&#x4E00;&#x4E9B;&#x8BE6;&#x7EC6;&#x65E5;&#x5FD7;&#x3002;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x542F;&#x52A8;&#x670D;&#x52A1;&#x5668;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#x5728;JVM&#x547D;&#x4EE4;&#x884C;&#x8F93;&#x5165;&#x4EE5;&#x4E0B;&#x53C2;&#x6570;&#xFF1A;</p>
<pre><code>-<span class="ruby"><span class="constant">Xverboselog</span><span class="symbol">:perTestGC</span>.log-<span class="constant">Xverbose</span><span class="symbol">:opt</span>,memory,gcpause,memdbg,compaction,gc,license-<span class="constant">Xverbosetimestamp</span> -<span class="constant">Xgcreport</span></span>
</code></pre><p>&#x8FD9;&#x6837;&#x4F1A;&#x5C06;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x5206;&#x6790;&#x6570;&#x636E;&#x6536;&#x96C6;&#x5230;&#x521A;&#x624D;&#x914D;&#x7F6E;&#x7684;perTestGC.log&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x56E2;&#x961F;&#x6210;&#x5458;&#x548C;/&#x6216;BEA Support&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x3002; </p>
<p>&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF1A;&#x901A;&#x5E38;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x4F1A;&#x8BF7;&#x6C42;&#x6267;&#x884C;&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x4E2D;&#x8C03;&#x7528;System.gc()&#xFF09;&#x3002;&#x4F46;&#x5982;&#x679C;&#x60A8;&#x6000;&#x7591;&#x5B83;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x5728;&#x542F;&#x52A8;&#x670D;&#x52A1;&#x5668;&#x5B9E;&#x4F8B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5728;Java&#x547D;&#x4EE4;&#x884C;&#x4F7F;&#x7528;-XXnoSystemGC&#x53C2;&#x6570;&#x6765;&#x7981;&#x7528;&#x5B83;&#x3002; </p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x5C06;&#x4ECB;&#x7ECD;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x8FED;&#x4EE3;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x3002; </p>
<p>&#xA0;</p>
<h5 id="&#x8FED;&#x4EE3;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x53CA;&#x5176;&#x65B9;&#x6CD5;">&#x8FED;&#x4EE3;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x53CA;&#x5176;&#x65B9;&#x6CD5;</h5><p>&#x5B8C;&#x6210;&#x521D;&#x59CB;&#x6570;&#x636E;&#x7684;&#x6536;&#x96C6;&#x548C;&#x5206;&#x6790;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FED;&#x4EE3;&#x65B9;&#x6CD5;&#x6765;&#x8C03;&#x4F18;JVM&#x3002;&#x6B64;&#x5904;&#x4ECB;&#x7ECD;&#x7684;&#x6D4B;&#x8BD5;&#x65B9;&#x6848;&#x662F;&#x5728;JRockit JVM&#x5C42;&#x6267;&#x884C;&#x8FED;&#x4EE3;&#x8C03;&#x4F18;&#x7684;&#x901A;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x54EA;&#x4E9B;&#x8BBE;&#x7F6E;&#x53EF;&#x80FD;&#x6709;&#x76CA;&#x4E8E;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x5047;&#x5B9A;&#x60A8;&#x6709;&#x6D4B;&#x91CF;&#x6027;&#x80FD;&#x7ED3;&#x679C;&#x7684;&#x65B9;&#x6CD5;&#xFF1B;&#x7136;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5B83;&#x4EEC;&#x4E0E;&#x201C;&#x57FA;&#x51C6;&#x201D;&#xFF08;&#x60A8;&#x5E94;&#x8BE5;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#xFF09; &#x8FDB;&#x884C;&#x6BD4;&#x8F83;&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;1&#xFF1A;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x533A;&#x57DF;&#x5927;&#x5C0F;&#x548C;&#x5927;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;">&#x6D4B;&#x8BD5;1&#xFF1A;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x533A;&#x57DF;&#x5927;&#x5C0F;&#x548C;&#x5927;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;</h5><p>&#x5728;&#x672C;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x67E5;&#x770B;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x533A;&#x57DF;&#x5927;&#x5C0F;&#x3002;&#x8FD9;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x7684;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x662F;&#x6700;&#x4F73;&#x7684;&#xFF08;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x662F;&#x8FD9;&#x6837;&#xFF09;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x9020;&#x6210;&#x5806;&#x9501;&#x5B9A;&#xFF0C;&#x8FD9;&#x5C06;&#x5BF9;&#x6027;&#x80FD;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x3002;&#x5C06;&#x5927;&#x90E8;&#x5206;&#x5BF9;&#x8C61;&#x9650;&#x5236;&#x5728;&#x4E00;&#x5B9A;&#x8303;&#x56F4;&#x5185;&#x5BF9;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x6709;&#x76CA;&#x3002; </p>
<ul>
<li><p>&#x5206;&#x6790;&#x6536;&#x96C6;&#x7684;JRA Recording&#x6570;&#x636E;</p>
</li>
<li><p>&#x5206;&#x6790;&#x7ED3;&#x679C;&#xFF0C;&#x67E5;&#x770B;-XXtlasize&#x548C;-XXlargeobjectlimit&#x662F;&#x5426;&#x9700;&#x8981;&#x8C03;&#x4F18;&#xFF08;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x5BF9;&#x4E8E;&#x591A;&#x6570;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x6839;&#x636E;eDocs&#xFF0C;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x533A;&#x57DF;&#x5927;&#x5C0F;&#x5E94;&#x8BE5;&#x81F3;&#x5C11;&#x662F;&#x5927;&#x5BF9;&#x8C61;&#x5927;&#x5C0F;&#x7684;&#x4E24;&#x500D;&#xFF09;&#x3002;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x4F4D;&#x4E8E;JRA Recording&#x9996;&#x9875;&#x7684;&#x53F3;&#x4E0A;&#x65B9;&#x3002;&#x8BF7;&#x67E5;&#x770B;&#x4E0B;&#x9762;&#x5173;&#x4E8E; <a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1020097" target="_blank" rel="external">tlaSize</a> &#x548C;<a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1008230" target="_blank" rel="external">largeObjectLimit</a> &#x7684;&#x4FE1;&#x606F;&#x3002;&#x5728;JRockit R27.3&#x4E4B;&#x524D;&#x7684;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x4E0D;&#x5FC5;&#x8C03;&#x4F18;&#x3002;</p>
</li>
</ul>
<p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong>&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x5728;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#x4E0B;&#x83B7;&#x53D6;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x548C;&#x5EA6;&#x91CF;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x70ED;&#x542F;&#x52A8;&#x65F6;&#x95F4;&#x3002;&#x8981;&#x5728;&#x6027;&#x80FD;&#x5206;&#x6790;&#x8FC7;&#x7A0B;&#x4E2D;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x7B26;&#x8981;&#x6C42;&#xFF0C;&#x53EF;&#x4EE5;&#x67E5;&#x770B;JRA Recording&#x4E2D;&#x7684;&#x4F18;&#x5316;&#x6807;&#x7B7E;&#xFF0C;&#x5176;&#x4E2D;&#x6027;&#x80FD;&#x5206;&#x6790;&#x524D;&#x540E;&#x7684;&#x4F18;&#x5316;&#x6570;&#x91CF;&#x548C;&#x4F18;&#x5316;&#x65F6;&#x95F4;&#x5E94;&#x8BE5;&#x5927;&#x81F4;&#xFF08;&#x7406;&#x8BBA;&#x4E0A;&#x5E94;&#x8BE5;&#x662F;&#x51C6;&#x786E;&#x5730;&#xFF09;&#x76F8;&#x7B49;&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;2&#xFF1A;&#x9501;&#x6027;&#x80FD;&#x5206;&#x6790;">&#x6D4B;&#x8BD5;2&#xFF1A;&#x9501;&#x6027;&#x80FD;&#x5206;&#x6790;</h5><p>&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x9501;&#x6027;&#x80FD;&#x5206;&#x6790;&#xFF0C;&#x5B83;&#x4F1A;&#x663E;&#x793A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x662F;&#x5426;&#x6709;&#x8FC7;&#x591A;&#x7684;&#x9501;&#x5B9A;&#x3002;&#x5982;&#x679C;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x5BF9;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x9020;&#x6210;&#x5F71;&#x54CD;&#x3002; </p>
<ul>
<li><p>&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF08;&#x542F;&#x7528;-Djrockit.lockprofiling&#xFF09;&#xFF0C;&#x5206;&#x6790;&#x8FD9;&#x4E9B;&#x7ED3;&#x679C;&#x3002;&#x786E;&#x5B9A;&#x6CA1;&#x6709;&#x901A;&#x8FC7;JVM&#x542F;&#x7528;&#x7684;&#x65E5;&#x5FD7;&#x3002;&#x8BE5;&#x6807;&#x5FD7;&#x5927;&#x6982;&#x4F1A;&#x5360;&#x7528;5%&#x5230;10%&#x7684;&#x7CFB;&#x7EDF;&#x5F00;&#x9500;&#xFF0C;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6D4B;&#x8BD5;&#x5C06;&#x6536;&#x96C6;&#x8BE5;&#x6570;&#x636E;&#xFF0C;&#x6B64;&#x65F6;&#x6027;&#x80FD;&#x88AB;&#x5FFD;&#x7565;&#xFF0C;&#x552F;&#x4E00;&#x505A;&#x5B8C;&#x7684;&#x5206;&#x6790;&#x662F;&#x9501;&#x5B9A;&#x5206;&#x6790;&#x3002;</p>
<p>  -server -Xms1536m -Xmx1536m <strong>-Djrockit.lockprofiling</strong></p>
</li>
<li><p>&#x5728;&#x76F8;&#x540C;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;jrcmd.sh&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x6216;JRockit Mission Control&#xFF08;JRMC&#xFF09;&#x70ED;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x540E;&#xFF0C;&#x8FD0;&#x884C;10&#x5206;&#x949F;&#x7684;JRA Recording&#x3002;&#x6709;&#x5173;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8BE5;&#x5DE5;&#x5177;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x7535;&#x5B50;&#x6587;&#x6863;&#x3002;</p>
</li>
<li>&#x4F7F;&#x7528;top&#x548C;iostat&#x9009;&#x9879;&#x76D1;&#x63A7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#x8FD8;&#x53EF;&#x4F7F;&#x7528;ctrhandler.act&#x6587;&#x4EF6;&#x6307;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x8F6C;&#x50A8;&#x3002;</li>
<li>&#x5206;&#x6790;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
<h5 id="&#x6D4B;&#x8BD5;3&#xFF1A;&#x8C03;&#x4F18;tlaSize&#x548C;largeObjectLimit">&#x6D4B;&#x8BD5;3&#xFF1A;&#x8C03;&#x4F18;tlaSize&#x548C;largeObjectLimit</h5><p>&#x5728;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6839;&#x636E;&#x524D;&#x9762;&#x6D4B;&#x8BD5;&#x7684;&#x7ED3;&#x679C;&#x8C03;&#x4F18;&#x7EBF;&#x7A0B;&#x672C;&#x5730;&#x533A;&#x57DF;&#x5927;&#x5C0F;&#x548C;&#x5927;&#x5BF9;&#x8C61;&#x9650;&#x5236;&#x3002; </p>
<ul>
<li>&#x786E;&#x5B9A;JVM&#x672A;&#x542F;&#x7528;&#x65E5;&#x5FD7;&#x3002;&#x5C06; &#x2013;XxtlaSize&#x548C;-XXlargeObjectLimit&#x7684;&#x503C;&#x8BBE;&#x7F6E;&#x8F83;&#x9AD8;&#x4E00;&#x70B9;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8981;&#x9A8C;&#x8BC1;&#x548C;&#x6BD4;&#x8F83;&#x8FD9;&#x70B9;&#x5219;&#x9700;&#x8981;&#x9700;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x5BF9;&#x4E8E; R27.2&#xFF0C;&#x5C06;preferredSize&#x8BBE;&#x7F6E;&#x4E3A;16k&#x53EF;&#x80FD;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5173;&#x4E8E;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x7684; <a href="http://edocs.bea.com/jrockit/geninfo/conftune/issues.html#wp999214" target="_blank" rel="external">&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;</a>&#x3002;&#x4E3A;&#x6B64;&#x8981;&#xFF0C;&#x66F4;&#x6539;TLA&#x8BBE;&#x7F6E;&#x5E76;&#x4F7F;&#x7528;&#x4E0E;&#x6D4B;&#x8BD5;1&#x76F8;&#x540C;&#x7684;Java&#x547D;&#x4EE4;&#x884C;&#x9009;&#x9879;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF1B;&#x589E;&#x52A0;-XXtlaSize&#x548C;-XXlargeobjectlimit&#x7684;TLA&#x503C;&#x8BBE;&#x7F6E;&#x3002;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;<a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1020097" target="_blank" rel="external">&#x53C2;&#x89C1; tlaSize</a>&#x3002;<strong>&#x6CE8;&#x610F;&#xFF1A;</strong>&#x5728;R27.3&#x4E4B;&#x524D;&#xFF0C;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x901A;&#x5E38;&#x4E0D;&#x9700;&#x8981;&#x8C03;&#x4F18;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8FC7;&#x5EA6;&#x8C03;&#x4F18;&#x8FD9;&#x4E9B;&#x6807;&#x5FD7;&#x5F88;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#x3002;</li>
<li><p>&#x5728;&#x76F8;&#x540C;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;jrcmd.sh&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x6216;JRockit Mission Control&#xFF08;JRMC&#xFF09;&#x70ED;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x540E;&#xFF0C;&#x8FD0;&#x884C;10&#x5206;&#x949F;&#x7684;JRA Recording&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8BE5;&#x5DE5;&#x5177;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x7535;&#x5B50;&#x6587;&#x6863;&#x3002;</p>
</li>
<li><p>&#x4F7F;&#x7528;top&#x548C;iostat&#x9009;&#x9879;&#x76D1;&#x63A7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#x8FD8;&#x53EF;&#x4F7F;&#x7528;ctrhandler.act&#x6587;&#x4EF6;&#x6307;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x8F6C;&#x50A8;&#x3002;</p>
</li>
<li><p>&#x5206;&#x6790;&#x7ED3;&#x679C;&#x3002;</p>
</li>
</ul>
<h5 id="&#x6D4B;&#x8BD5;4&#xFF1A;&#x8C03;&#x4F18;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;">&#x6D4B;&#x8BD5;4&#xFF1A;&#x8C03;&#x4F18;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;</h5><p>&#x672C;&#x8282;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x8FD0;&#x884C;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x8BBE;&#x7F6E;&#xFF0C;&#x5E76;&#x67E5;&#x770B;&#x54EA;&#x79CD;&#x8BBE;&#x7F6E;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6700;&#x4F73;&#x3002;&#x5173;&#x4E8E; <a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp999595" target="_blank" rel="external">-XXsetGC&#x6807;&#x5FD7;</a> &#x7684;&#x8BE6;&#x7EC6;&#x4EE4;&#x724C;&#xFF0C;&#x8BF7;&#x9605;&#x8BFB;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x3002;JRockit&#x5C06;&#x4EE5;&#x8C03;&#x4F18;&#x7684;nursery&#x5927;&#x5C0F;&#x8FD0;&#x884C;&#x5E76;&#x79FB;&#x9664;-Xgcprio:throughput&#x6807;&#x5FD7;&#x3002;&#x8BE5; throughput&#x9009;&#x9879;&#x5C06;&#x5728;&#x8FD9;&#x4E9B;&#x53CC;&#x7248;&#x672C;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x4E4B;&#x95F4;&#x81EA;&#x52A8;&#x5207;&#x6362;&#xFF0C;&#x4F46;&#x8FDB;&#x884C;&#x76F4;&#x63A5;&#x7684;&#x9009;&#x62E9;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x597D;&#x5904;&#x3002;Nursery&#x8C03;&#x4F18;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4F7F;&#x88AB;&#x63D0; &#x5347;&#x7684;&#x5BF9;&#x8C61;&#x4FDD;&#x6301;&#x8F83;&#x5C11;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;nursery&#x6536;&#x96C6;&#x4E2D;&#x4EE3;&#x4EF7;&#x9AD8;&#x7684;&#x90E8;&#x5206;&#x3002;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x548C;&#x51CF;&#x5C0F;nursery&#x7684;&#x5927;&#x5C0F;&#x5BF9;&#x5176;&#x8C03;&#x4F18;&#x3002;nursery&#x7684;&#x5927;&#x5C0F;&#x4E3B;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x5BF9;&#x8C61; &#x751F;&#x5B58;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x751F;&#x5B58;&#x7740;&#xFF0C;&#x5219;&#x5728;YC&#x671F;&#x95F4;&#x4F1A;&#x5F97;&#x5230;&#x63D0;&#x5347;&#x3002;&#x8FD0;&#x884C;jrcmd &lt;PID&gt;&#x7248;&#x672C;&#x67E5;&#x770B;&#x54EA;&#x4E2A;&#x5F53;&#x524D;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668;&#x7B56;&#x7565;&#x662F;&#x6D3B;&#x52A8;&#x7684;&#x3002; </p>
<ul>
<li><p>a. &#x6D4B;&#x8BD5;4-1&#xFF1A;</p>
</li>
<li><p>&#xA0; </p>
<ul>
<li><p>&#x4F7F;&#x7528;&#x2013;XxsetGC&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x8BBE;&#x7F6E;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x8BE5;&#x6D4B;&#x8BD5;&#x5C06;&#x8BBE;&#x7F6E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x9009;&#x9879;&#x4E3A;<strong>&#x5355;&#x500D;&#x884C;&#x8DDD;</strong>&#x52A0;&#x4E0A;<strong>&#x5E76;&#x884C;</strong>&#x6807;&#x8BB0;&#x7B97;&#x6CD5;&#x548C;<strong>&#x5E76;&#x884C;</strong>&#x626B;&#x63CF;&#x7B97;&#x6CD5;&#xFF1B;&#x8FD8;&#x8981;&#x624B;&#x52A8;&#x8C03;&#x4F18;nursery&#x5927;&#x5C0F;&#xFF1A;</p>
<p>-server -Xms1536m -Xmx1536m -Xns:384m&#xA0; -Xverboselog:perTestGC.log-Xverbose:opt,memory,gcpause,memdbg,compaction,gc,license-Xverbosetimestamp -Xgcreport -XXnoSystemGC -XXsetGC:<strong>singleparpar</strong></p>
</li>
</ul>
</li>
<li><p>&#xA0; </p>
<ul>
<li>&#x5728;&#x76F8;&#x540C;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;jrcmd.sh&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x6216;JRockit Mission Control&#xFF08;JRMC&#xFF09;&#x70ED;&#x542F;&#x52A8;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x540E;&#xFF0C;&#x8FD0;&#x884C;10&#x5206;&#x949F;&#x7684;JRA Recording&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8BE5;&#x5DE5;&#x5177;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x7535;&#x5B50;&#x6587;&#x6863;&#x3002;</li>
<li>&#x4F7F;&#x7528;top&#x548C;iostat&#x9009;&#x9879;&#x76D1;&#x63A7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x679C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#x8FD8;&#x53EF;&#x4F7F;&#x7528;ctrhandler.act&#x6587;&#x4EF6;&#x6307;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x8F6C;&#x50A8;&#x3002;</li>
<li>&#x5206;&#x6790;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
</li>
<li><p>b. &#x6D4B;&#x8BD5;4-2&#xFF1A;</p>
</li>
<li><p>&#xA0; </p>
<ul>
<li><p>&#x7528; &#x2013;XxsetGC&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x4F7F;&#x7528;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7B97;&#x6CD5;&#x96C6;&#x7684;&#x6D4B;&#x8BD5;&#x3002;&#x8BE5;&#x6D4B;&#x8BD5;&#x5C06;&#x8BBE;&#x7F6E;&#x5783;&#x573E;&#x6536;&#x96C6;&#x9009;&#x9879;&#x4E3A;<strong>&#x5206;&#x4EE3;</strong>&#x7684;&#xFF08;&#x53CC;&#x500D;&#x884C;&#x8DDD;&#xFF09;&#x52A0;&#x4E0A;<strong>&#x5E76;&#x884C;</strong>&#x6807;&#x8BB0;&#x7B97;&#x6CD5;&#x548C;<strong>&#x5E76;&#x884C;</strong>&#x626B;&#x63CF;&#x7B97;&#x6CD5;&#xFF1B;&#x8FD8;&#x8981;&#x624B;&#x52A8;&#x8C03;&#x4F18;nursery&#x5927;&#x5C0F;&#xFF1A;</p>
<p>-server -Xms1536m -Xmx1536m -Xns:384m&#xA0; -Xverboselog:perTestGC.log</p>
<p>-Xverbose:opt,memory,gcpause,memdbg,compaction,gc,license</p>
<p>-Xverbosetimestamp -Xgcreport -XXnoSystemGC -XXsetGC:<strong>genparpar</strong></p>
</li>
</ul>
</li>
<li><p>&#xA0; </p>
<ul>
<li>&#x5728;&#x505A;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F7F;&#x7528;jrcmd.sh&#x5B9E;&#x7528;&#x5DE5;&#x5177;&#x6216;JRockit Mission Control (JRMC)&#x6536;&#x96C6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x70ED;&#x542F;&#x52A8;&#x5E76;&#x8FD0;&#x884C;&#x540E;10&#x5206;&#x949F;&#x7684;JRA Recording&#x3002;&#x5173;&#x4E8E;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x8BE5;&#x5DE5;&#x5177;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;eDocs&#x3002;</li>
<li>&#x4F7F;&#x7528;top&#x3001;iostat&#xFF0C;&#x9700;&#x8981;&#x7684;&#x8BDD;&#xFF0C;&#x8FD8;&#x53EF;&#x7528;&#x5E26;&#x6709;ctrhandler.act&#x6587;&#x4EF6;&#x7ED9;&#x5B9A;&#x7684;&#x4FE1;&#x606F;&#x7684;&#x7EBF;&#x7A0B;&#x8F6C;&#x50A8;&#x6765;&#x76D1;&#x63A7;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</li>
<li>&#x5206;&#x6790;&#x7ED3;&#x679C;&#x3002;</li>
</ul>
</li>
<li><p>c. &#x6D4B;&#x8BD5;4-3&#xFF1A;&#x6839;&#x636E;&#x524D;&#x9762;&#x7684;-XXsetGC:genparpar&#x6D4B;&#x8BD5;&#x5411;&#x4E0A;&#x6216;&#x5411;&#x4E0B;&#x8C03;&#x4F18;nursery&#x5927;&#x5C0F;&#x3002;</p>
</li>
<li>d. &#x6D4B;&#x8BD5;4-4&#xFF1A;&#x7528;-Xgc:gencon -Xns50m&#xFF08;&#x548C;&#x8BBE;&#x4E3A;&#x6536;&#x96C6;&#x89C4;&#x683C;&#x7684;&#x65E5;&#x5FD7;&#xFF09;&#x8BD5;&#x8BD5;&#x3002;</li>
<li>e. &#x6D4B;&#x8BD5;4-5&#xFF1A;&#x7528;-Xgc:parallel -XXcompactratio:1&#xFF08;&#x548C;&#x8BBE;&#x4E3A;&#x6536;&#x96C6;&#x89C4;&#x683C;&#x7684;&#x65E5;&#x5FD7;&#xFF09;&#x8BD5;&#x8BD5;&#x3002;</li>
</ul>
<h5 id="&#x6D4B;&#x8BD5;5&#xFF1A;&#x8C03;&#x4F18;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7EBF;&#x7A0B;">&#x6D4B;&#x8BD5;5&#xFF1A;&#x8C03;&#x4F18;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7EBF;&#x7A0B;</h5><p>&#x672C;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x67E5;&#x770B;gcthreads&#x6807;&#x5FD7;&#x8BBE;&#x7F6E;&#x5BF9;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x7684;&#x5F71;&#x54CD;&#x3002; </p>
<ul>
<li>&#x6839;&#x636E;&#x524D;&#x9762;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8C03;&#x4F18;-XXgcthreads&#x6807;&#x5FD7;&#x4E3A;&#x5B9E;&#x9645;&#x7269;&#x7406;CPU&#x7684;&#x6570;&#x91CF;&#x5E76;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;(&#x7531;&#x4E8E;&#x8FD9;&#x4E9B;&#x503C;&#x9ED8;&#x8BA4;&#x662F;&#x57FA;&#x4E8E;&#x673A;&#x5668;&#x4E0A;&#x6838;&#x5FC3;&#x548C;&#x786C;&#x4EF6;&#x7EBF;&#x7A0B;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x5E94;&#x8BE5;&#x662F;&#x81EA;&#x52A8;&#x8C03;&#x4F18;&#x7684;)&#x3002;&#x60A8;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x5728;&#x201C;&#x6536;&#x96C6;&#x6545;&#x969C;&#x8BCA;&#x65AD;&#x6570;&#x636E;&#x201D;&#x4E00;&#x8282;&#x6536;&#x96C6;&#x7684;&#x8BE6;&#x7EC6;&#x8F93;&#x51FA;&#x65E5;&#x5FD7;&#x6765;&#x5BF9;&#x5176;&#x9A8C;&#x8BC1;&#x3002;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x8BF7;&#x53C2;&#x89C1; <a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1023988" target="_blank" rel="external">gcThreads flag</a>&#x3002;</li>
</ul>
<h5 id="&#x6D4B;&#x8BD5;6&#xFF1A;&#x8C03;&#x4F18;&#x9501;&#x4E89;&#x7528;">&#x6D4B;&#x8BD5;6&#xFF1A;&#x8C03;&#x4F18;&#x9501;&#x4E89;&#x7528;</h5><p>&#x5982;&#x679C;&#x5728;&#x80D6;&#x9501;&#xFF08;fat lock&#xFF09;&#x4E0A;&#x5B58;&#x5728;&#x9501;&#x4E89;&#x7528;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7528;-XXdisableFatSpin&#x7981;&#x6B62;&#x5B83;&#x4EEC;&#xFF0C;&#x6216;&#x8005;&#x7528;-Djrockit.useAdaptiveFatSpin= true&#x8BA9;JRockit&#x81EA;&#x9002;&#x5E94;&#x5730;&#x7981;&#x6B62;&#x5B83;&#x4EEC;&#x3002;&#x5F53;&#x6D4B;&#x8BD5;2&#x542F;&#x7528;-Djrockit.lockprofiling&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;JRA&#x4E2D;&#x67E5;&#x770B;&#x90A3;&#x4E2A;&#x6807;&#x7B7E;&#x6765;&#x786E;&#x5B9A;&#x8FD9;&#x4E00; &#x70B9;&#x3002;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;<a href="http://e-docs.bea.com/jrockit/geninfo/diagnos/thread_basics.html#wp1091168" target="_blank" rel="external">locking in JRockit</a>&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;7&#xFF1A;&#x8C03;&#x4F18;Xeon&#x786C;&#x4EF6;">&#x6D4B;&#x8BD5;7&#xFF1A;&#x8C03;&#x4F18;Xeon&#x786C;&#x4EF6;</h5><p>&#x5982;&#x679C;&#x8FD0;&#x884C;&#x5728;Xeon&#x786C;&#x4EF6;&#x4E4B;&#x4E0A;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x4EE5;&#x6DFB;&#x52A0;-XXallocPrefetch&#x548C;-XXallocRedoPrefetch&#xFF0C;&#x5B83;&#x4EEC;&#x4E0E;TLA&#x548C;LargeObjectLimit&#x4E00;&#x8D77;&#x5C06;&#x6709;&#x52A9;&#x4E8E;&#x51CF;&#x5C11;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x5F00;&#x9500;&#x3002;&#x6709;&#x5173;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x89C1; <a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1023657" target="_blank" rel="external">allocPrefetch&#x6807;&#x5FD7;</a>&#x3002;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x6700;&#x4F73;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x5728;BIOS&#x4E2D;<strong>&#x7981;&#x7528;</strong>&#x786C;&#x4EF6;&#x9884;&#x53D6;&#x6307;&#x4EE4;&#x3002;&#x867D;&#x7136;&#x64CD;&#x4F5C;&#x65B9;&#x5F0F;&#x53D6;&#x51B3;&#x4E8E;BIOS&#x7684;&#x724C;&#x5B50;&#xFF0C;&#x4F46;&#x53C2;&#x6570;&#x7684;&#x540D;&#x79F0;&#x901A;&#x5E38;&#x90FD;&#x4E3A;&#x201C;Hardware Prefetcher&#x201D;&#x3001;&#x201C;Adjacent Sector Prefetcher&#x201D;&#x3001;&#x201C;Adjacent Cache Line Prefetcher&#x201D;&#x7B49;&#x3002;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x89C1; <a href="http://www.intel.com/cd/ids/developer/asmo-na/eng/dc/xeon/298229.htm?page=4" target="_blank" rel="external">Intel on this subject</a>&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;8&#xFF1A;&#x5C06;&#x5806;&#x653E;&#x5165;largePage">&#x6D4B;&#x8BD5;8&#xFF1A;&#x5C06;&#x5806;&#x653E;&#x5165;largePage</h5><p>&#x8FD9;&#x4F1A;&#x5C06;&#x5806;&#x9501;&#x5165;&#x5185;&#x5B58;&#xFF0C;&#x4F7F;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x5C06;&#x5176;&#x4EA4;&#x6362;&#x51FA;&#x6765;&#x3002;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8BF7;&#x53C2;&#x89C1; <a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1019120" target="_blank" rel="external">largePages&#x6807;&#x5FD7;</a>&#xFF0C;&#x6709;&#x5173;Linux&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7AEF;&#x914D;&#x7F6E;&#x7684;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#x8FD8;&#x53EF;&#x4EE5;&#x53C2;&#x8003; <a href="http://dev2dev.bea.com.cn/techdoc/2008/4/jrockit-tuning.html.html?page=3#linux" target="_blank" rel="external">&#x5728;Linux&#x4E0A;&#x914D;&#x7F6E;-XXlargePages</a> &#x4E00;&#x8282;&#x3002;&#x5728;JRockit R27&#x7248;&#x4E2D;&#xFF0C;&#x8BE5;&#x9009;&#x9879;&#x7684;&#x540D;&#x79F0;&#x4E3A;-XlargePages&#x3002;&#x6839;&#x636E;&#x524D;&#x9762;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x8C03;&#x4F18;-XlargePages&#x6807;&#x5FD7;&#x53EF;&#x80FD;&#x6709;&#x6240;&#x5E2E;&#x52A9;&#xFF0C;&#x4F46;&#x53EF;&#x80FD;&#x4E5F;&#x6CA1;&#x6709;&#x3002;&#x4F7F;&#x7528;&#x8BE5;&#x6807;&#x5FD7;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x5426;&#x5BF9;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x6709;&#x5E2E;&#x52A9;&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;9&#xFF1A;&#x7528;-XXaggressive&#x6807;&#x5FD7;&#x6D4B;&#x8BD5;">&#x6D4B;&#x8BD5;9&#xFF1A;&#x7528;-XXaggressive&#x6807;&#x5FD7;&#x6D4B;&#x8BD5;</h5><p>&#x672C;&#x8282;&#x4E2D;&#x7684;&#x8FD9;&#x4E9B;&#x914D;&#x7F6E;&#x5C06;&#x4F7F;JVM&#x9AD8;&#x901F;&#x8FD0;&#x884C;&#x5E76;&#x5C3D;&#x5FEB;&#x8FBE;&#x5230;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#x3002;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x6B64;&#x76EE;&#x6807;&#xFF0C;JVM&#x5728;&#x542F;&#x52A8;&#x65F6;&#x9700;&#x8981;&#x66F4;&#x591A;&#x5185;&#x90E8;&#x8D44;&#x6E90;&#xFF1B;&#x4F46;&#x5F53;&#x76EE;&#x6807;&#x4E00;&#x65E6;&#x8FBE;&#x6210;&#xFF0C;&#x5B83;&#x6240;&#x9700;&#x8981;&#x7684;&#x81EA;&#x9002;&#x5E94;&#x4F18;&#x5316;&#x5C06;&#x66F4;&#x5C11;&#x3002;&#x6211;&#x4EEC;&#x63A8;&#x8350;&#x60A8;&#x4E3A;&#x4E86;&#x90A3;&#x4E9B;&#x5355;&#x72EC;&#x5DE5;&#x4F5C;&#x7684;&#x3001;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x957F;&#x7684;&#x3001;&#x5185;&#x5B58;&#x654F;&#x611F;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x3002;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x8BF7;&#x53C2;&#x89C1; <a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp999550" target="_blank" rel="external">aggressive&#x6807;&#x5FD7;</a>&#x3002;&#x4F7F;&#x7528;-XXaggressive&#x6807;&#x5FD7;&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x5426;&#x5BF9;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x6709;&#x5E2E;&#x52A9;&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;10&#xFF1A;&#x7528;-XX:+UseNewHashFunction&#x6807;&#x5FD7;&#x6D4B;&#x8BD5;">&#x6D4B;&#x8BD5;10&#xFF1A;&#x7528;-XX:+UseNewHashFunction&#x6807;&#x5FD7;&#x6D4B;&#x8BD5;</h5><p>&#x8FD9;&#x4E2A;&#x9009;&#x9879;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x3001;&#x66F4;&#x5FEB;&#x7684;HashMap&#x6563;&#x5217;&#x51FD;&#x6570;&#xFF0C;&#x5B83;&#x5728;Java 5.0 Update 8&#x4E2D;&#x5F15;&#x5165;&#xFF0C;&#x4ECE;R27.1.0&#x5F00;&#x59CB;&#x4E5F;&#x662F;BEA JRockit&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x8FD9;&#x4E2A;&#x6563;&#x5217;&#x51FD;&#x6570;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x6539;&#x8FDB;&#x7684;&#x6563;&#x5217;&#x6269;&#x5C55;&#x63D0;&#x9AD8;&#x6027;&#x80FD;&#x800C;&#x4E0D;&#x6539;&#x53D8;HashMap&#x4E2D;&#x5143;&#x7D20;&#x5B58;&#x653E;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x8BF7;&#x53C2;&#x89C1;<a href="http://edocs.bea.com/jrockit/jrdocs/refman/optionXX.html#wp1028966" target="_blank" rel="external">UseNewHashFunction&#x6807;&#x5FD7;</a>&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;-XX:+UseNewHashFunction&#x8FD0;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#xFF0C;&#x67E5;&#x770B;&#x7ED3;&#x679C;&#x5426;&#x5BF9;&#x6574;&#x4F53;&#x6027;&#x80FD;&#x6709;&#x5E2E;&#x52A9;&#x3002; </p>
<h5 id="&#x6D4B;&#x8BD5;11&#xFF1A;&#x5C06;&#x6697;&#x7269;&#x8D28;&#x51CF;&#x5230;&#x6700;&#x5C11;">&#x6D4B;&#x8BD5;11&#xFF1A;&#x5C06;&#x6697;&#x7269;&#x8D28;&#x51CF;&#x5230;&#x6700;&#x5C11;</h5><p>&#x201C;&#x6697;&#x7269;&#x8D28;&#x201D;&#x6307;&#x88AB;&#x6D6A;&#x8D39;&#x7684;&#x5806;&#x5185;&#x5B58;&#xFF0C;&#x5B83;&#x4F7F;&#x5806;&#x6210;&#x4E3A;&#x8BB8;&#x591A;&#x788E;&#x7247;&#x3002;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x6700;&#x5927;&#x7A0B;&#x5E8F;&#x5730;&#x51CF;&#x5C11;&#x6697;&#x7269;&#x8D28;&#xFF0C;&#x4EE5;&#x4FBF;&#x5F53;&#x5806;&#x9700;&#x8981;&#x538B;&#x7F29;&#x65F6;&#xFF0C;&#x6574;&#x4F53;&#x541E;&#x5410;&#x91CF;&#x4E0D;&#x53D7;&#x5F71;&#x54CD;&#x3002;&#x8BF7;&#x770B;&#x4EE5;&#x4E0B;&#x9009;&#x9879;&#xFF1A; </p>
<ul>
<li>&#x4F7F;&#x7528;&#x5206;&#x4EE3;&#x7684;&#x5783;&#x573E;&#x6536;&#x96C6;&#x5668; (-Xgc:gencon or -Xgc:genpar)&#x3002;&#x5728;&#x521D;&#x59CB;&#x6536;&#x96C6;&#xFF08;nursery&#x5783;&#x573E;&#x6536;&#x96C6;&#xFF09;&#x671F;&#x95F4;&#xFF0C;&#x5728;nursery&#x4E2D;&#x88AB;&#x53D1;&#x73B0;&#x751F;&#x5B58;&#x7684;&#x5BF9;&#x8C61;&#x88AB;&#x8FC1;&#x79FB;&#x5230;&#x65E7;&#x7684;&#x4E00;&#x4EE3;&#x3002;&#x8FD9;&#x6837;&#x6709;&#x597D;&#x7684;&#x526F;&#x4F5C;&#x7528;&#xFF0C;&#x5F53;&#x8FC1;&#x79FB;&#x5BF9;&#x8C61;&#x65F6;&#x53EF;&#x4EE5;&#x538B;&#x7F29;&#x5B83;&#x4EEC;&#x3002;</li>
<li>&#x63D0;&#x9AD8;&#x538B;&#x7F29;&#x6BD4;&#xFF08;-XXcompactionRatio=nn&#xFF09;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x5BF9;&#x8C61;&#x8FC1;&#x79FB;&#x5230;&#x538B;&#x7F29;&#x5757;&#x4E2D;&#x3001;&#x6D88;&#x9664;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x6697;&#x7269;&#x8D28;&#xFF0C;&#x538B;&#x7F29;&#x51CF;&#x5C11;&#x4E86;&#x6697;&#x7269;&#x8D28;&#x3002;</li>
<li>&#x901A; &#x8FC7;-XXminBlockSize:&lt;memSize&gt;&#x9009;&#x9879;&#x4FEE;&#x6539;&#x89C4;&#x8303;&#xFF08;&#x5C06;&#x4EC0;&#x4E48;&#x89C6;&#x4E3A;&#x6697;&#x7269;&#x8D28;&#xFF1F;&#xFF09;&#x3002;&#x5806;&#x4E0A;&#x5C0F;&#x4E8E;&#x6700;&#x5C0F;&#x5757;&#x5927;&#x5C0F;&#x7684;&#x5757;&#x89C6;&#x4E3A;&#x6697;&#x7269;&#x8D28;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x901A;&#x8FC7; &#x51CF;&#x5C0F;&#x6700;&#x5C0F;&#x5757;&#x5927;&#x5C0F;&#xFF0C;&#x60A8;&#x6700;&#x7EC8;&#x51CF;&#x5C11;&#x4E86;&#x6697;&#x7269;&#x8D28;&#x3002;&#x4F46;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x56E0;&#x4E3A;JRockit&#x4E3A;&#x4E86;&#x91CA;&#x653E;&#x5806;&#x7A7A;&#x95F4;&#x5FC5;&#x987B;&#x505A;&#x66F4;&#x7EC6;&#x5BC6;&#x7684;&#x641C;&#x7D22;&#xFF0C;&#x6240;&#x4EE5;&#x5783;&#x573E;&#x6536;&#x96C6;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x66F4;&#x957F;&#x3002;&#x6700;&#x5C0F;&#x5757;&#x5927;&#x5C0F;&#x9ED8;&#x8BA4;&#x4E3A;2 KB&#x3002;</li>
</ul>
<h5 id="&#x8FDB;&#x4E00;&#x6B65;&#x6D4B;&#x8BD5;&#xFF1A;&#x8C03;&#x4F18;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x5668;&#x5C42;">&#x8FDB;&#x4E00;&#x6B65;&#x6D4B;&#x8BD5;&#xFF1A;&#x8C03;&#x4F18;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x670D;&#x52A1;&#x5668;&#x5C42;</h5><p>&#x6700;&#x540E;&#xFF0C;&#x67E5;&#x770B;&#x4E0A;&#x8FF0;&#x8C03;&#x4F18;&#x5EFA;&#x8BAE;&#xFF0C;&#x8C03;&#x4F18;WebLogic Server&#x5B9E;&#x4F8B;&#x5C42;&#x3002; </p>
<h5 id="&#x7ED3;&#x675F;&#x8BED;">&#x7ED3;&#x675F;&#x8BED;</h5><p>&#x672C;&#x6587;&#x63D0;&#x4F9B;&#x7684;&#x4FE1;&#x606F;&#x7EDD;&#x975E;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x6E05;&#x5355;&#x3002;&#x4F46;&#x5B83;&#x4F1A;&#x8BA9;&#x60A8;&#x5F00;&#x59CB;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x548C;&#x8C03;&#x4F18;JRockit JVM&#x5C42;&#xFF01; </p>
<h5 id="&#x53C2;&#x8003;&#x8D44;&#x6599;">&#x53C2;&#x8003;&#x8D44;&#x6599;</h5><ul>
<li><a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/geninfo/diagnos/part_02.html" target="_blank" rel="external">JRockit&#x8C03;&#x4F18;&#x6587;&#x6863;</a></li>
<li><a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/jrdocs/refman/optionX.html" target="_blank" rel="external">JRocikit&#x53C2;&#x8003;&#x6587;&#x6863;&#xFF1A;X Flags</a></li>
<li><a href="http://download.oracle.com/docs/cd/E13188_01/jrockit/jrdocs/refman/optionXX.html" target="_blank" rel="external">JRocikit&#x53C2;&#x8003;&#x6587;&#x6863;&#xFF1A;XX Flags</a></li>
</ul>
<h5 id="&#x9644;&#x5F55;">&#x9644;&#x5F55;</h5><p>&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#x4E3A;&#x6B63;&#x6587;&#x5F15;&#x7528;&#x8FC7;&#x7684;&#x989D;&#x5916;&#x4FE1;&#x606F;&#x3002; </p>
<h5 id="&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x671F;&#x95F4;&#x7684;JRCMD/JRA">&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x671F;&#x95F4;&#x7684;JRCMD/JRA</h5><p>&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x6216;&#x8005;&#x57FA;&#x4E8E;JRockit Mission Control (JRMC) Eclipse&#x7684;&#x5DE5;&#x5177;&#x90FD;&#x80FD;&#x591F;&#x6267;&#x884C;JRA Recoding&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;JRMC&#x8FDE;&#x63A5;&#x5230;&#x591A;&#x4E2A; JRockit JVM&#xFF0C;&#x6536;&#x96C6;JRA recording&#xFF0C;&#x67E5;&#x770B;JVM&#x7684;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#xFF0C;&#x68C0;&#x6D4B;&#x548C;&#x6392;&#x9664;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x4EE5;&#x53CA;&#x67E5;&#x770B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5185;&#x7684;&#x6F5C;&#x4F0F;&#x7269;&#xFF08;&#x6267;&#x884C;&#x7F13;&#x6162;&#x201C;&#x70B9;&#x201D;&#xFF09;&#x3002;&#x6709;&#x5173;&#x5982;&#x4F55;&#x8FD0;&#x884C;JRockit Mission Control&#xFF0C;&#x8BF7;&#x53C2;&#x89C1;&#x4E0B;&#x4E00;&#x8282;&#x3002; </p>
<ul>
<li>&#x4E0B;&#x8F7D; <a href="http://commerce.bea.com/downloadproduct.jsp?family=JRMC&amp;major=3.0&amp;minor=0&amp;delivery=1&amp;os=All&amp;intent=purchase" target="_blank" rel="external">&#x6587;&#x6863;&#x8BB8;&#x53EF;&#x8BC1;</a>&#x3002;</li>
<li>&#x5C06;&#x4E0B;&#x8F7D;&#x7684;license.bea&#x6587;&#x4EF6;&#x6DFB;&#x52A0;&#x5230;&lt;JROCKIT_HOME&gt;/jre&#x76EE;&#x5F55;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x5B8C;&#x6574;&#x8DEF;&#x5F84;&#x5C06;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;&lt;JROCKIT_HOME&gt;/jre/license.bea</li>
<li>&#x8FD0; &#x884C;JRCMD&#x5982;&#x4E0B;&#xFF1A;jrcmd.sh &lt;PID&gt; jrarecording filename=myrecording.xml time=600&#xFF08;&#x8BE5;&#x6587;&#x4EF6;&#x88AB;&#x5199;&#x5165;&#x672C;&#x5730;&#x76EE;&#x5F55;&#x6216;&#x8005;&#x6307;&#x5B9A;&#x7684;&#x5B8C;&#x6574;&#x8DEF;&#x5F84;&#xFF0F;&#x6587;&#x4EF6;&#x540D;&#xFF09;&#x6216;jrcmd.sh &lt;PID&gt; print_threads&#x3002;</li>
<li>&#x4F7F;&#x7528;&#x8131;&#x673A;JRA&#x5DE5;&#x5177;&#x5206;&#x6790;&#x6700;&#x540E;&#x5F97;&#x5230;&#x7684;myrecording.xml.zip&#x6587;&#x4EF6;&#x3002;&#x901A;&#x8FC7;&#x5728;&lt;JROCKIT_HOME&gt;/bin&#x4E2D;&#x6267;&#x884C;JRA binary&#xFF0C;&#x5C06;&#x8BE5;JRA&#x5DE5;&#x5177;&#x653E;&#x5165;&#x6B64;&#x76EE;&#x5F55;&#x4E0B;&#x3002;</li>
<li>&#x8BF7;&#x67E5;&#x770B; <a href="http://e-docs.bea.com/jrockit/geninfo/diagnos/ctrlbreakhndlr.html#wp1000350" target="_blank" rel="external">JRCMD&#x6587;&#x6863;</a>&#x3002;</li>
</ul>
<h5 id="JRockit_Mission_Control">JRockit Mission Control</h5><ul>
<li>&#x4F7F;&#x7528;JRockit&#x5C06;&#x4E0B;&#x5217;&#x5185;&#x5BB9;&#x6DFB;&#x52A0;&#x5230;WebLogic Instance&#x7684;&#x542F;&#x52A8;&#x884C;&#x4E2D;&#xFF1A;java -Xmanagement:autodiscovery=true,ssl=false,authenticate=false,port=7091</li>
<li>&#x4F7F;&#x7528;&lt;jrockit-install-directory&gt;/bin/jrmc.exe(sh)&#x542F;&#x52A8;JRockit Mission Control</li>
<li>&#x5982;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x5C06;JR Mission Control&#x7684;license.bea file&#x6587;&#x4EF6;&#x6DFB;&#x52A0;&#x5230;&#xFF1A;&lt;JROCKIT_HOME&gt;/jre/license.bea</li>
<li>&#x5728;Mission Control&#x7684;&#x5E2E;&#x52A9;&#x4E0B;&#xFF0C;JRA Recordings&#x3001;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x3001;&#x6F5C;&#x4F0F;&#x7269;&#x63A2;&#x67E5;&#x548C;&#x76D1;&#x63A7;&#x80FD;&#x591F;&#x5168;&#x90E8;&#x5728;&#x4E00;&#x5904;&#x5B8C;&#x6210;&#x3002;</li>
</ul>
<h5 id="&#x5806;/&#x7EBF;&#x7A0B;&#x7684;&#x6D4B;&#x8BD5;&#x671F;&#x5FEB;&#x7167;">&#x5806;/&#x7EBF;&#x7A0B;&#x7684;&#x6D4B;&#x8BD5;&#x671F;&#x5FEB;&#x7167;</h5><ul>
<li>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x3001;&#x540D;&#x79F0;ctrhandler.act&#x7684;&#x6587;&#x4EF6;&#x5E76;&#x5C06;&#x5176;&#x5B58;&#x653E;&#x5728;&lt;JROCKIT_HOME&gt;/jre/bin/jrockit&#x76EE;&#x5F55;&#x3002;</li>
<li>&#x6267;&#x884C;&#x7EBF;&#x7A0B;&#x8F6C;&#x50A8;&#x547D;&#x4EE4;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;kill -3)&#xFF0C;JRockit&#x4F1A;&#x67E5;&#x770B;&#x6B64;&#x6587;&#x4EF6;&#x5E76;&#x6267;&#x884C;&#x547D;&#x4EE4;&#x5217;&#x8868;&#x3002;</li>
<li><p>ctrlhandler.act&#x6587;&#x4EF6;&#x5E94;&#x8BE5;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x5185;&#x5BB9;&#xFF1A;</p>
<h1 id="ctrlhander-act_file_located_in_the_&lt;JROCKIT_HOME&gt;/jre/bin/jrockit_directoryset_filename_filename=-/jrocket_control_breakoutput-txt_append=truetimestampprint_threadstimestampversionprint_class_summaryprint_object_summary_increaseonly=trueprint_threadsprint_threads_nativestack=trueprint_utf8pooltimestampprint_memusagetimestampheap_diagnosticstimestamp#_The_following_is_optional_and_is_another_way_to_generate_a_JRArecordingjrarecording_filename=-/myjra-xml_time=600">ctrlhander.act file located in the &lt;JROCKIT_HOME&gt;/jre/bin/jrockit directoryset_filename filename=./jrocket_control_breakoutput.txt append=truetimestampprint_threadstimestampversionprint_class_summaryprint_object_summary increaseonly=trueprint_threadsprint_threads nativestack=trueprint_utf8pooltimestampprint_memusagetimestampheap_diagnosticstimestamp# The following is optional and is another way to generate a JRArecordingjrarecording filename=./myjra.xml time=600</h1></li>
</ul>
<h5 id="&#x5728;Linux&#x4E0A;&#x914D;&#x7F6E;-XXlargePages">&#x5728;Linux&#x4E0A;&#x914D;&#x7F6E;-XXlargePages</h5><p><strong>&#x95EE;&#x9898;&#xFF1A;</strong>&#x4E3A;&#x4F55;&#x4F7F;&#x7528;largePages&#xFF1F; </p>
<p><strong>&#x56DE;&#x7B54;&#xFF1A;</strong>&#x4F7F;&#x7528;largePages&#x7684;&#x4F18;&#x70B9;&#x662F;&#x53EF;&#x4EE5;&#x9501;&#x5B9A;&#x5806;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x9002;&#x7528;&#x9875;&#x9762;&#x4EA4;&#x6362;&#xFF08;&#x8FD8;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;IOWait&#x548C;GC&#xFF09;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x8BBF;&#x95EE;&#x5806;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x660E;&#x663E;&#x53D8;&#x5FEB;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x6027;&#x80FD;&#x76EE;&#x6807;&#xFF0C;largePages&#x9009;&#x9879;&#x662F;&#x4E00;&#x4E2A;&#x7406;&#x60F3;&#x7684;&#x9009;&#x62E9;&#x3002; </p>
<ul>
<li><p>&#x5982;&#x679C;&#x673A;&#x5668;&#x652F;&#x6301;&#x5927;&#x9875;&#x9762;&#xFF0C;&#x5219;cat /proc/meminfo&#x7684;&#x8F93;&#x51FA;&#x5C06;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<p>  HugePages_Total: xxxHugePages_Free:&#xA0; yyyHugepagesize:&#xA0;&#xA0;&#xA0; zzz KB</p>
</li>
</ul>
<p>&#x5982;&#x679C;xxx&#x4E3A;0&#xFF0C;&#x5219;&#x6CA1;&#x6709;&#x5206;&#x914D;&#x4EFB;&#x4F55;&#x5927;&#x9875;&#x9762;&#x3002; </p>
<ul>
<li>&#x5982;&#x679C;&#x4E0D;&#x4E3A;0&#xFF0C;&#x5219;&#x9700;&#x8981;&#x4F7F;&#x7528;CONFIG_HUGETLBFS(&#x4F4D;&#x4E8E;&#x201C;File systems&#x201D;&#x4E0B;&#x9762;)&#x548C;CONFIG_HUGETLB_PAGE&#xFF08;&#x5F53;CONFIG_HUGETLBFS&#x88AB;&#x9009;&#x65F6;&#xFF0C;&#x81EA;&#x52A8;&#x88AB;&#x9009;&#x4E0A;&#xFF09;&#x914D;&#x7F6E;&#x9009;&#x9879;&#x6784;&#x5EFA;Linux kernel&#x3002;</li>
<li><p>&#x63A5;&#x7740;&#xFF0C;&#x5728;Linux&#x4E0A;&#x5206;&#x914D;&#x5927;&#x9875;&#x3002;&#x6CE8;&#x610F;&#xFF1A;&#x53EA;&#x5141;&#x8BB8;&#x6839;&#x7528;&#x6237;&#x5206;&#x914D;&#x5927;&#x9875;&#x9762;&#x3002; </p>
<ul>
<li><p>&#x88C5;&#x8F7D;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;JRockit&#x4F7F;&#x7528;hugepages&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x9A7B;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x3002;&#x8FD9;&#x4E9B;&#x6B65;&#x9AA4;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x88C5;&#x3002;&#x6BCF;&#x6B21;&#x673A;&#x5668;&#x91CD;&#x542F;&#x65F6;&#x90FD;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x5B9E;&#x9645;&#x88C5;&#x8F7D;&#x548C;chmod&#x547D;&#x4EE4;&#xFF0C;&#x6216;&#x8005;&#x4E5F;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x6DFB;&#x52A0;&#x5230;&#x4E00;&#x4E2A;/etc/rc.d/rc.local&#x7C7B;&#x578B;&#x7684;&#x6587;&#x4EF6;&#xFF1A;</p>
<p>&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; mkdir -p&#xA0; /mnt/hugepages&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; mount -t hugetlbfs nodev /mnt/hugepages&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0;&#xA0; chmod 777 /mnt/hugepages</p>
</li>
</ul>
</li>
<li><p>&#xA0; </p>
<ul>
<li><p>&#x5206;&#x914D;&#x5927;&#x9875;&#x9762;&#x3002;&#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x5E94;&#x8BE5;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x6570;&#x91CF;&#x6765;&#x81EA;&#x52A8;&#x6267;&#x884C;&#x7684;&#x3002;&#x5728;&#x5206;&#x914D;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E9B;&#x9762;&#x9875;&#x5C06;&#x88AB;&#x4FDD;&#x7559;&#x8D77;&#x6765;&#xFF0C;&#x4E0D;&#x80FD;&#x50CF;&#x666E;&#x901A;&#x9875;&#x9762;&#x90A3;&#x6837;&#x4F7F;&#x7528;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x5206;&#x914D;&#x548C;&#x89E3;&#x9664;&#x5206;&#x914D;&#x65B9;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>echo 20 &gt; /proc/sys/vm/nr_hugepages</p>
</li>
</ul>
</li>
</ul>
<p>&#x6B64;&#x5904;&#xFF0C;&#x6570;&#x5B57;20&#x6307;&#x5E94;&#x8BE5;&#x4FDD;&#x7559;&#x7684;&#x9875;&#x9762;&#x6570;&#x91CF;&#x3002;&#x8981;&#x89E3;&#x9664;&#x5206;&#x914D;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x5206;&#x914D;&#x9875;&#x9762;&#x8BBE;&#x7F6E;&#x4E3A;0&#x3002;&#xFF08;<strong>&#x6CE8;&#x610F;&#xFF1A;</strong>&#x8BF7;&#x53C2;&#x89C1;&#x540E;&#x9762;Q&amp;A&#x90E8;&#x5206;&#x4EE5;&#x786E;&#x5B9A;&#x6B63;&#x786E;&#x7684;&#x6570;&#x91CF;&#x3002;&#xFF09; </p>
<p>&#x5982;&#x679C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x7684;&#x9875;&#x9762;&#x90FD;&#x88AB;&#x4FDD;&#x7559;&#xFF0C;&#x90A3;&#x4E48;&#x53EF;&#x7528;&#x5185;&#x5B58;&#x5C31;&#x4E0D;&#x591F;&#x4E86;&#x3002;&#x5982;&#x679C;&#x786E;&#x8981;&#x5982;&#x6B64;&#xFF0C;&#x5185;&#x5B58;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x592A;&#x591A;&#x7684;&#x788E;&#x7247;&#xFF0C;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x5EFA;&#x8BAE;&#x662F;&#x91CD;&#x542F;&#x673A;&#x5668;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5927;&#x9875;&#x9762;&#x4E0D;&#x80FD;&#x88AB;&#x4EA4;&#x6362;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5207;&#x90FD;&#x5FC5;&#x987B;&#x653E;&#x5728;&#x7269;&#x7406;&#x5185;&#x5B58;&#x4E2D;&#x3002; </p>
<p>&#x5728;<strong>RHEL3</strong>&#x4E0A;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x540D;&#x79F0;&#x4E3A;/proc/sys/vm/hugetlb_pool&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EE5;&#x4E0B;&#x547D;&#x4EE4;&#x6267;&#x884C;&#xFF1A;</p>
<pre><code>echo <span class="number">500</span> &amp;gt; /<span class="keyword">proc</span>/sys/vm/hugetlb_pool
</code></pre><p>&#x8FD9;&#x91CC;&#x7684;&#x6570;&#x5B57;500&#x6307;&#x8BF7;&#x6C42;&#x7684;&#x5927;&#x5C0F;&#x4E3A;&#x591A;&#x5C11;MB&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x9875;&#x6570;&#x3002;&#x5982;&#x679C;JRockit&#x4E0D;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x6D88;&#x9664;&#x4E34;&#x65F6;&#x7684;&#x5927;&#x9875;&#x6587;&#x4EF6;&#xFF0C;&#x8BF7;&#x522B;&#x5FD8;&#x8BB0;&#x5728;&#x6267;&#x884C;&#x4E4B;&#x540E;&#x8FDB;&#x884C;&#x6D88;&#x9664;&#x3002;&#x5426;&#x5219;&#xFF0C; &#x90A3;&#x4E9B;&#x9875;&#x5728;&#x88AB;&#x91CA;&#x653E;&#x4E4B;&#x524D;&#x5C06;&#x4E0D;&#x53EF;&#x7528;&#x3002;&#x8FD9;&#x5BF9;RedHat kernel build 2.4.18-e.25.smp&#x9002;&#x7528;&#xFF0C;&#x800C;2.4.18-e.12.smp&#x5374;&#x4E0D;&#x884C;&#x3002; </p>
<p><strong>&#x95EE;&#x9898;&#xFF1A;</strong>&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x53D1;&#x7ED9;/proc/sys/vm/nr_hugepages&#x7684;&#x6B63;&#x786E;&#x6570;&#x91CF;&#x5462;&#xFF1F; </p>
<p><strong>&#x56DE;&#x7B54;&#xFF1A;</strong>&#x56E0;&#x4E3A;&#x8981;&#x5C06;&#x6574;&#x4E2A;Java&#x5806;&#x653E;&#x5165;largePages&#xFF0C;&#x6240;&#x4EE5;&#x5FC5;&#x987B;&#x6839;&#x636E;&#x5806;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x9875;&#x9762;&#x5927;&#x5C0F;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x4E3A;/proc/sys/vm/nr_hugepages&#x786E;&#x5B9A;&#x6B63;&#x786E;&#x7684;&#x6570;&#x91CF;&#x5C31;&#x50CF;&#x4E0B;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x90A3;&#x6837;&#x7B80;&#x5355;&#xFF0C;&#x4FE1;&#x606F;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code><span class="type">JVM</span> <span class="type">Max</span> <span class="type">Heap</span> = <span class="number">1536</span>MB (<span class="number">1572864</span> <span class="type">KB</span> approx)<span class="type">HPAGE_SIZE</span> = <span class="number">2</span> <span class="type">MB</span> then  the value sent to /<span class="keyword">proc</span>/sys/vm/nr_hugepages would be approximately <span class="number">7</span>.<span class="number">7</span>.  (<span class="number">1572864</span> <span class="type">MB</span> / <span class="number">2</span> <span class="type">MB</span>)
</code></pre><p><strong>&#x6CE8;&#x610F;&#xFF1A;</strong></p>
<p>&#x5C3D;&#x7BA1;&#x52A8;&#x6001;&#x8BBE;&#x7F6E;&#x5927;&#x9875;&#x9762;&#x7684;&#x6570;&#x91CF;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x53EF;&#x884C;&#x7684;&#xFF0C;&#x4F46;&#x5B9E;&#x8DF5;&#x4E2D;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;&#x51CF;&#x5C11;&#x5927;&#x9875;&#x9762;&#x7684;&#x6570;&#x91CF;&#x51B3;&#x4E0D;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x589E;&#x52A0;&#x5927;&#x9875;&#x9762;&#x7684;&#x6570;&#x91CF;&#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x95EE;&#x9898;&#x3002;&#x539F;&#x56E0;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5927;&#x9875;&#xFF0C;Linux&#x9700;&#x8981;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x8FDE;&#x7EED;&#x7684;&#x533A;&#x57DF;&#x3002;&#x5982;&#x679C;&#x627E;&#x4E0D;&#x5230;&#xFF0C;&#x5C31;&#x4E0D;&#x80FD;&#x521B;&#x5EFA;&#x5927;&#x9875;&#x9762;&#x3002; </p>
<p>&#x521A;&#x542F;&#x52A8;&#x7CFB;&#x7EDF;&#x65F6;&#xFF0C;&#x5185;&#x5B58;&#x7684;&#x788E;&#x7247;&#x8FD8;&#x4E0D;&#x662F;&#x5F88;&#x591A;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x8FDE;&#x7EED;&#x7684;&#x533A;&#x57DF;&#x5E76;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x673A;&#x5668;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x4E00;&#x957F;&#xFF0C;&#x5185;&#x5B58;&#x4F1A;&#x4EA7;&#x751F;&#x66F4;&#x591A;&#x7684;&#x788E;&#x7247;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x786E;&#x4FDD;&#x80FD;&#x591F;&#x5206;&#x914D;&#x8DB3;&#x591F;&#x5927;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x5728;&#x542F;&#x52A8;&#x521A;&#x5B8C;&#x6210;&#x65F6;&#x901A;&#x8FC7;&#x542F;&#x52A8;&#x811A;&#x672C;&#x6216;&#x624B;&#x52A8;&#x8BBE;&#x7F6E;&#x5B83;&#x4EEC;&#x3002;</p>
<p>&#xA0;</p>
<p>&#xA0;</p>
<p>&#x5907;&#x6CE8;&#xFF1A;</p>
<p>&#x672C;&#x6587;&#x8F6C;&#x8F7D;&#x81EA;&#xFF1A;<a href="http://www.hashei.me/2009/09/weblogic_profiling_and_performance_tuning.html" target="_blank" rel="external">http://www.hashei.me/2009/09/weblogic_profiling_and_performance_tuning.html</a></p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/分类：-Weblogic-Websphere/">分类： Weblogic/Websphere</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/7d58dde/" title="旧金山Spark Summit 2015，见证中国的技术力量 -" itemprop="url">旧金山Spark Summit 2015，见证中国的技术力量 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T01:38:43.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><img src="http://taojinke.github.io/img/20150701/7d56e21.png" alt=""></p>
<p>2015&#x5E74;6&#x6708;15&#x65E5;-17&#x65E5;&#xFF0C;Spark Summit 2015&#x4E8E;&#x7F8E;&#x56FD;&#x65E7;&#x91D1;&#x5C71;&#x4E3E;&#x884C;&#xFF0C;&#x8FD1;2000&#x4F4D;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x89C1;&#x8BC1;&#x548C;&#x53C2;&#x4E0E;&#x4E86;&#x8FD9;&#x6B21;&#x76DB;&#x4F1A;&#x3002;&#x5386;&#x65F6;&#x4E09;&#x5929;&#x7684;&#x4F1A;&#x8BAE;&#x91CC;&#xFF0C;&#x6765;&#x81EA;Databricks&#x3001;UC Berkeley AMPLab&#x3001;Baidu&#x3001;Alibaba&#x3001;Yahoo!&#x3001;Intel&#x3001;Amazon&#x3001;Red Hat&#x3001;Microsoft&#x7B49;&#x6570;&#x5341;&#x4E2A;&#x673A;&#x6784;&#x5171;&#x5206;&#x4EAB;&#x4E86;&#x8FD1;100&#x4E2A;&#x7CBE;&#x5F69;&#x7EB7;&#x5448;&#x7684;&#x62A5;&#x544A;&#xFF0C;&#x5176;&#x4E2D;Keynotes&#x6F14;&#x8BB2;&#x4E3B;&#x8981;&#x96C6;&#x4E2D;&#x5728;&#x524D;&#x4E24;&#x65E5;&#x7684;&#x4E0A;&#x5348;&#xFF0C;&#x4E0B;&#x5348;&#x5219;&#x5206;&#x4E3A;&#x5F00;&#x53D1;&#x8005;&#x3001;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x3001;&#x5E94;&#x7528;&#x548C;&#x7528;&#x6237;&#x6848;&#x4F8B;&#x5206;&#x4F1A;&#x573A;&#xFF0C;&#x6574;&#x4E2A;&#x4F1A;&#x8BAE;&#x7684;&#x7B2C;&#x4E09;&#x5929;&#x662F;&#x7531;&#x57F9;&#x8BAD;&#x6784;&#x6210;&#x3002;&#x4E0E;&#x5F80;&#x5E74;&#x4E00;&#x6837;&#xFF0C;Keynotes&#x7684;&#x5206;&#x4EAB;&#x4E3B;&#x8981;&#x91C7;&#x53D6;&#x7279;&#x6027;&#x5206;&#x4EAB;&#x52A0;Demo&#x6F14;&#x793A;&#xFF0C;&#x552F;&#x4E00;&#x533A;&#x522B;&#x5C31;&#x662F;&#x672C;&#x6B21;&#x5CF0;&#x4F1A;&#x7684;Demo&#x6F14;&#x793A;&#x65F6;&#x95F4;&#x7A0D;&#x5FAE;&#x663E;&#x957F;&#x3002;</p>
<h3 id="2015_Spark_Summit_&#x4E4B;&#x6211;&#x89C1;&#x2014;&#x2014;Day_1">2015 Spark Summit &#x4E4B;&#x6211;&#x89C1;&#x2014;&#x2014;Day 1</h3><p><img src="http://taojinke.github.io/img/20150701/7d57303.png" alt=""></p>
<p>&#x56FE;1&#xFF1A;Databricks&#x7684;CTO Matei Zaharia</p>
<p>&#x5728;&#x6B64;&#x6B21;&#x5CF0;&#x4F1A;&#x91CC;&#x611F;&#x53D7;&#x6700;&#x6DF1;&#x7684;&#x5C31;&#x662F;&#x4E2D;&#x56FD;&#x7684;Spark&#x53D1;&#x5C55;&#x592A;&#x5FEB;&#x4E86;&#xFF0C;Spark&#x53D1;&#x8D77;&#x4EBA;Databricks&#x7684;CTO Matei Zaharia&#x5728;Keynotes&#x91CD;&#x70B9;&#x6307;&#x51FA;&#xFF1A;Spark&#x6700;&#x5927;&#x7684;&#x96C6;&#x7FA4;&#x6765;&#x81EA;&#x817E;&#x8BAF;&#x2014;&#x2014;8000&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5355;&#x4E2A;Job&#x6700;&#x5927;&#x5206;&#x522B;&#x662F;&#x963F;&#x91CC;&#x5DF4;&#x5DF4;&#x548C;Databricks&#x2014;&#x2014;1PB&#xFF0C;&#x9707;&#x64BC;&#x4EBA;&#x5FC3;&#xFF01;&#x540C;&#x65F6;&#xFF0C;&#x622A;&#x6B62;2015&#x5E74;6&#x6708;&#xFF0C;Spark&#x7684;Contributor&#x6BD4;2014&#x5E74;&#x6DA8;&#x4E86;3&#x500D;&#xFF0C;&#x8FBE;&#x5230;730&#x4EBA;&#xFF1B;&#x603B;&#x4EE3;&#x7801;&#x884C;&#x6570;&#x4E5F;&#x6BD4;2014&#x5E74;&#x6DA8;&#x4E86;2&#x500D;&#x591A;&#xFF0C;&#x8FBE;&#x5230;40&#x4E07;&#x884C;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/7d57574.png" alt=""></p>
<p>&#x56FE;2&#xFF1A;Spark&#x7684;&#x5927;&#x89C4;&#x6A21;&#x5E94;&#x7528;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x4EE5;Spark&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x5F00;&#x6E90;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ECE;&#x5E94;&#x7528;&#x3001;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x3001;&#x6570;&#x636E;&#x6E90;&#x7B49;&#x65B9;&#x9762;&#x90FD;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x57FA;&#x672C;&#x56CA;&#x62EC;&#x4E86;&#x4E0E;&#x5927;&#x6570;&#x636E;&#x76F8;&#x5173;&#x7684;&#x6240;&#x6709;&#x7CFB;&#x7EDF;&#xFF0C;&#x5177;&#x4F53;&#x8BF7;&#x770B;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150701/7d57574.png" alt=""></p>
<p>&#x56FE;3&#xFF1A;Spark&#x8FDE;&#x63A5;&#x5F00;&#x6E90;&#x5927;&#x6570;&#x636E;&#x751F;&#x6001;&#x7CFB;&#x7EDF;</p>
<p>Matei Zaharia&#x5728;&#x6F14;&#x8BB2;&#x4E2D;&#x8868;&#x793A;&#xFF0C;&#x5F53;&#x4E0B;Spark&#x6700;&#x91CD;&#x8981;&#x7684;&#x6838;&#x5FC3;&#x7EC4;&#x4EF6;&#x4ECD;&#x7136;&#x662F;Spark SQL&#x3002;&#x800C;&#x5728;&#x672A;&#x6765;&#x7684;&#x51E0;&#x6B21;&#x53D1;&#x5E03;&#x4E2D;&#xFF0C;&#x9664;&#x4E86;&#x6027;&#x80FD;&#x4E0A;&#x7684;&#x66F4;&#x52A0;&#x4F18;&#x5316;&#x5916;&#xFF08;&#x5305;&#x62EC;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x548C;&#x5FEB;&#x901F;Join&#x64CD;&#x4F5C;&#xFF09;&#xFF0C;&#x8FD8;&#x8981;&#x63D0;&#x4F9B;&#x5BF9;SQL&#x8BED;&#x53E5;&#x7684;&#x6269;&#x5C55;&#x548C;&#x66F4;&#x597D;&#x5730;&#x96C6;&#x6210;&#x3002;2015&#x5E74;&#x53D1;&#x5C55;&#x7684;&#x91CD;&#x70B9;&#x5C06;&#x662F;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x548C;&#x5E73;&#x53F0;API&#x5316;&#xFF0C;&#x9664;&#x4E86;&#x4F20;&#x7EDF;&#x7684;&#x7EDF;&#x8BA1;&#x7B97;&#x6CD5;&#x5916;&#xFF0C;&#x8FD8;&#x5305;&#x62EC;&#x5B66;&#x4E60;&#x7B97;&#x6CD5;&#xFF0C;&#x4F7F;&#x5F97;SparkR&#x5F97;&#x5230;&#x4E86;&#x957F;&#x8DB3;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x4F7F;Spark&#x7684;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x8D8A;&#x6765;&#x8D8A;&#x5B8C;&#x5584;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x8FD8;&#x6709;Tungsten&#x9879;&#x76EE;&#x548C;DAG&#x53EF;&#x89C6;&#x5316;&#x3001;&#x8C03;&#x8BD5;&#x5DE5;&#x5177;&#x7B49;&#x540C;&#x6837;&#x662F;&#x6301;&#x7EED;&#x7684;&#x91CD;&#x70B9;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x3002;</p>
<p>&#x88AB;Google&#x6536;&#x8D2D;&#x7684;Timeful&#x516C;&#x53F8;&#x7684;&#x6570;&#x636E;&#x526F;&#x603B;&#x88C1;&#x534E;&#x4EBA;Gloria Lau&#x5728;&#x5979;&#x7684;&#x6F14;&#x8BB2;&#x201C;A Tale of a Data-Driven Culture&#x201D;&#x4E2D;&#x91CD;&#x70B9;&#x5F3A;&#x8C03;&#x5343;&#x4E07;&#x6211;&#x4EEC;&#x4E0D;&#x8981;&#x628A;&#x62DB;&#x8FC7;&#x6765;&#x7684;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#x90FD;&#x6700;&#x540E;&#x57F9;&#x517B;&#x6210;&#x53EA;&#x4F1A;SQL&#x7684;&#x201C;&#x7334;&#x5B50;&#x201D;&#x4E86;&#xFF0C;&#x800C;&#x662F;&#x9700;&#x8981;&#x8BA9;&#x6570;&#x636E;&#x79D1;&#x5B66;&#x5BB6;&#x96C6;&#x4E2D;&#x5728;&#x600E;&#x4E48;&#x6837;&#x6253;&#x9020;&#x6570;&#x636E;&#x4EA7;&#x54C1;&#x4E0A;&#x6765;&#x3002;</p>
<p>&#x53E6;&#x5916;&#x542C;&#x4E86;Solr&#x3001;ElasticSearch&#x4E0E;Spark&#x878D;&#x5408;&#x7684;&#x4E24;&#x4E2A;&#x4E3B;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x662F; Lucidworks&#x7684;Timothy Potter&#xFF0C;&#x4ED6;&#x662F;Solr&#x7684;PMC&#x6210;&#x5458;&#xFF0C;&#x4E5F;&#x662F;&#x300A;Solr in Action&#x300B;&#x7684;&#x4F5C;&#x8005;&#xFF0C;&#x4ED6;&#x5206;&#x4EAB;&#x7684;&#x4E3B;&#x9898;&#x662F;&#x201C;Integrating Spark and Solr&#x201D;&#xFF0C;&#x53D1;&#x73B0;Solr&#x4E0E;Spark&#x7684;&#x878D;&#x5408;&#x66F4;&#x6709;&#x6548;&#x4E00;&#x4E9B;&#xFF0C;&#x7279;&#x522B;&#x662F;SolrRDD&#x53EF;&#x4EE5;&#x975E;&#x5E38;&#x65B9;&#x4FBF;&#x5730;&#x8BA9;Spark&#x4ECE;Solr&#x91CC;&#x5C06;&#x6570;&#x636E;&#x8BFB;&#x51FA;&#x8BA1;&#x7B97;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x95EE;&#x4E86;&#x4E24;&#x4E2A;&#x8DDF;Solr&#x3001;ElasticSearch&#x548C;Spark&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;Solr&#x4E0E;ElasticSearch&#x7684;&#x533A;&#x522B;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;ElasticSearch&#x4E0E;Spark&#x878D;&#x5408;&#x662F;&#x5426;&#x6BD4;Solr&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#xFF0C;&#x5F53;&#x65F6;&#x4ED6;&#x56DE;&#x7B54;&#x7684;&#x6709;&#x4E9B;&#x7B80;&#x5355;&#xFF0C;&#x6240;&#x4EE5;&#x4F1A;&#x540E;&#x8DDF;Timothy Potter&#x5728;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7EC4;&#x91CC;&#x7684;&#x65E5;&#x672C;&#x4EBA;Taka Shinagawa&#x4E3B;&#x52A8;&#x6765;&#x8DDF;&#x6211;&#x89E3;&#x91CA;&#x6C9F;&#x901A;&#xFF0C;&#x5982;&#x679C;&#x4EC5;&#x662F;&#x5EFA;&#x7D22;&#x5F15;&#xFF0C;&#x5EFA;&#x8BAE;&#x4E0D;&#x9700;&#x8981;&#x7528;Solr&#x6216;&#x8005;ElasticSearch&#xFF1B;&#x53E6;&#x4E00;&#x4E2A;&#x4E3B;&#x9898;&#x662F;Nube &#x516C;&#x53F8;&#x7684;Sonal Goyal &#x5206;&#x4EAB;&#x4E86;&#x201C;Real Time Fuzzy Matching with Spark and Elastic Search&#x201D;&#xFF0C;&#x5979;&#x53EA;&#x91CD;&#x70B9;&#x8BF4;&#x4E86;&#x6A21;&#x7CCA;&#x5339;&#x914D;&#x548C;Spark&#x7684;&#x7279;&#x70B9;&#xFF0C;&#x5176;&#x4ED6;&#x5206;&#x4EAB;&#x6CA1;&#x6709;&#x591A;&#x5C11;&#x5E72;&#x8D27;&#xFF08;&#x7B2C;&#x4E8C;&#x5929;&#x7684;&#x5206;&#x4EAB;&#xFF09;&#x3002;</p>
<p>Spark 1.4 Overview &amp; Spark Committers Q&amp;A</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x4F1A;&#x8BAE;&#x9996;&#x65E5;&#x665A;&#xFF0C;Databricks&#x8FD8;&#x4E3E;&#x529E;&#x4E86;Spark 1.4 Overview &amp; Spark Committers Q&amp;A&#xFF0C;&#x5176;&#x4E2D;1.4&#x91CD;&#x70B9;&#x66F4;&#x65B0;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150701/7d577e5.png" alt=""></p>
<p>&#x56FE;4&#xFF1A; Databricks&#x7684;Spark Committers&#x56DE;&#x7B54;&#x7528;&#x6237;&#x95EE;</p>
<p><strong>1.</strong> Spark&#x4E3A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x4E86;REST API&#x6765;&#x83B7;&#x53D6;&#x5404;&#x79CD;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;jobs&#x3001;stages&#x3001;tasks&#x3001;storage info&#x7B49;&#x3002; </p>
<p><strong>2.</strong> Spark Streaming &#x589E;&#x52A0;&#x4E86;UI&#xFF0C;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7528;&#x6237;&#x67E5;&#x770B;&#x5404;&#x79CD;&#x72B6;&#x6001;&#xFF0C;&#x53E6;&#x5916;&#x4E0E;Kafka&#x7684;&#x878D;&#x5408;&#x4E5F;&#x66F4;&#x52A0;&#x6DF1;&#x5EA6;&#xFF0C;&#x4E5F;&#x52A0;&#x5F3A;&#x4E86;&#x5BF9;Kinesis&#x7684;&#x652F;&#x6301;&#x3002; </p>
<p><strong>3.</strong> Spark SQL&#xFF08;DataFrame&#xFF09;&#x6DFB;&#x52A0;ORCFile&#x7C7B;&#x578B;&#x652F;&#x6301;&#xFF0C;&#x53E6;&#x5916;&#x8FD8;&#x652F;&#x6301;&#x6240;&#x6709;&#x7684;Hive metastore&#x3002; </p>
<p><strong>4.</strong> Spark ML/MLlib&#x7684;ML pipelines&#x6108;&#x52A0;&#x6210;&#x719F;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x7B97;&#x6CD5;&#x548C;&#x5DE5;&#x5177;&#x3002; </p>
<p><strong>5.</strong> Tungsten&#x9879;&#x76EE;&#x7684;&#x6301;&#x7EED;&#x4F18;&#x5316;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x3001;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x3001;&#x5783;&#x573E;&#x56DE;&#x6536;&#x7B49;&#x65B9;&#x9762;&#x90FD;&#x6709;&#x5F88;&#x591A;&#x6539;&#x8FDB;&#x3002; </p>
<p><strong>6.</strong> SparkR&#x53D1;&#x5E03;&#xFF0C;&#x66F4;&#x53CB;&#x597D;&#x7684;R&#x8BED;&#x6CD5;&#x652F;&#x6301;&#x3002; </p>
<p>&#x6700;&#x540E;&#xFF0C;&#x963F;&#x91CC;&#x660E;&#x98CE;&#x7684;&#x201C;Dynamic Community Detection for Large-scale e-Commerce data with Spark Streaming and GraphX&#x201D;&#xFF0C;&#x8FD8;&#x6709;Intel&#x9EC4;&#x6D01;&#x7684;&#x201C;Towards Benchmarking Modern Distributed Streaming Systems&#x201D;&#x540C;&#x6837;&#x975E;&#x5E38;&#x7CBE;&#x5F69;&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x53BB;&#x641C;&#x7D22;&#x5B66;&#x4E60;&#x3002;</p>
<h3 id="2015_Spark_Summit_&#x4E4B;&#x6211;&#x89C1;&#x2014;&#x2014;Day_2">2015 Spark Summit &#x4E4B;&#x6211;&#x89C1;&#x2014;&#x2014;Day 2</h3><p>&#x5728;&#x7B2C;2&#x65E5;Databricks&#x8054;&#x5408;&#x521B;&#x59CB;&#x4EBA;Reynold Xin&#xFF08;&#x8F9B;&#x6E5C;&#xFF09;&#x7684;Keynotes&#x4E2D;&#x6307;&#x51FA;&#xFF0C;Tungsten&#x9879;&#x76EE;&#x4EE5;&#x5927;&#x5E45;&#x5EA6;&#x63D0;&#x5347;Spark&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x5B58;&#x548C;CPU&#x5229;&#x7528;&#x7387;&#x4E3A;&#x76EE;&#x6807;&#xFF0C;&#x65E8;&#x5728;&#x6700;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x538B;&#x69A8;&#x65B0;&#x65F6;&#x4EE3;&#x786C;&#x4EF6;&#x6027;&#x80FD;&#x3002;&#x91CD;&#x70B9;&#x5305;&#x62EC;&#x5982;&#x4E0B;&#x4E09;&#x65B9;&#x9762;&#xFF1A;</p>
<p><strong>1.</strong> &#x4EE3;&#x7801;&#x751F;&#x6210;&#xFF08;Code generation&#xFF09;&#xFF1A;&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x751F;&#x6210;&#x6765;&#x5229;&#x7528;&#x65B0;&#x578B;&#x7F16;&#x8BD1;&#x5668;&#x548C;CPU&#x3002; </p>
<p><strong>2.</strong> Binary Processing&#xFF1A;&#x5229;&#x7528;&#x5E94;&#x7528;&#x7684;&#x8BED;&#x4E49;&#xFF08;Application Semantics&#xFF09;&#x6765;&#x66F4;&#x660E;&#x786E;&#x5730;&#x7BA1;&#x7406;&#x5185;&#x5B58;&#xFF0C;&#x540C;&#x65F6;&#x6D88;&#x9664;JVM&#x5BF9;&#x8C61;&#x6A21;&#x578B;&#x548C;&#x5783;&#x573E;&#x56DE;&#x6536;&#x5F00;&#x9500;&#x3002; </p>
<p><strong>3.</strong> Cache-aware computation&#xFF1A;&#x4F7F;&#x7528;&#x7B97;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x5B9E;&#x73B0;&#x5185;&#x5B58;&#x5206;&#x7EA7;&#x7ED3;&#x6784;&#xFF08;Memory Hierarchy&#xFF09;&#x3002; </p>
<p>&#x57FA;&#x4E8E;AdMaster&#x5F53;&#x4E0B;&#x4E5F;&#x5728;&#x91CD;&#x70B9;&#x53D1;&#x529B;&#x79FB;&#x52A8;&#x7AEF;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x8FD8;&#x91CD;&#x70B9;&#x542C;&#x4E86;InMobi&#x516C;&#x53F8;&#x7684;LBS&#x5B9E;&#x8DF5;&#xFF08;Building a Location Based Social Graph in Spark at InMobi&#xFF09;&#xFF0C;&#x57FA;&#x672C;&#x539F;&#x7406;&#x662F;&#x7528;SSID&#x4F5C;&#x4E3A;&#x70B9;&#xFF0C;&#x628A;&#x8FDE;&#x63A5;&#x9891;&#x7387;&#x505A;&#x8FB9;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8FDE;&#x901A;&#x56FE;&#x7B97;&#x6CD5;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5929;&#x4E0B;&#x5348;&#xFF0C;Intel&#x7684;&#x4F0A;&#x91CC;&#x5947;&#x5206;&#x4EAB;&#x4E86;&#x201C;Taming GC Pauses for Humongous Java Heaps in Spark Graph Computing&#x201D;&#xFF1A;&#x968F;&#x7740;Spark&#x7684;&#x53D1;&#x5C55;&#xFF0C;JVM&#x5BF9;&#x5927;&#x5185;&#x5B58;&#x7684;&#x7BA1;&#x7406;&#x4E5F;&#x663E;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x91CD;&#x8981;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5783;&#x573E;&#x56DE;&#x6536;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x91CD;&#x70B9;&#x4ECB;&#x7ECD;&#x4E86;GC&#x7684;G1&#x56DE;&#x6536;&#x7B56;&#x7565;&#x7279;&#x70B9;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x6307;&#x51FA;G1&#x5728;1.8&#x7248;&#x672C;&#x8981;&#x6BD4;1.7&#x7248;&#x672C;&#x6027;&#x80FD;&#x8981;&#x9AD8;&#x51FA;20%&#x4EE5;&#x4E0A;&#x3002;</p>
<p>&#x4ECE;&#x672C;&#x6B21;&#x5CF0;&#x4F1A;&#x6765;&#x770B;&#xFF0C;&#x4E1A;&#x754C;&#x5BF9;Spark&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x8BA4;&#x53EF;&#xFF0C;Spark&#x4E5F;&#x88AB;&#x8BB8;&#x591A;&#x4F01;&#x4E1A;&#x5C24;&#x5176;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x5230;&#x5546;&#x4E1A;&#x9879;&#x76EE;&#x4E2D;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x56FD;&#x5185;&#x73A9;&#x5BB6;&#x5728;Spark&#x4E0A;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x540C;&#x6837;&#x503C;&#x5F97;&#x80AF;&#x5B9A;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x53C2;&#x4F1A;&#x4EBA;&#x5458;&#x8BF4;&#x5230;&#x611F;&#x89C9;&#x8FD9;&#x662F;&#x4E00;&#x573A;&#x4E2D;&#x56FD;&#x4EBA;&#x7684;&#x6280;&#x672F;&#x5CF0;&#x4F1A;&#xFF01;</p>
<h3 id="2015_Spark_Summit_&#x4E4B;&#x6211;&#x89C1;&#x2014;&#x2014;&#x5728;Databricks&#x804A;&#x5B9E;&#x6218;">2015 Spark Summit &#x4E4B;&#x6211;&#x89C1;&#x2014;&#x2014;&#x5728;Databricks&#x804A;&#x5B9E;&#x6218;</h3><p>&#x9274;&#x4E8E;&#x7B2C;&#x4E09;&#x5929;&#x7684;&#x4F1A;&#x8BAE;&#x5185;&#x5BB9;&#x662F;&#x5B9E;&#x6218;&#x57F9;&#x8BAD;&#xFF0C;&#x56E0;&#x6B64;&#x4E0E;AdMaster &#x521B;&#x59CB;&#x4EBA;&#x6D2A;&#x500D;&#x8D70;&#x8FDB;&#x4E86;Spark&#x62A4;&#x822A;&#x516C;&#x53F8;Databricks&#x516C;&#x53F8;&#xFF0C;&#x5C31;Spark&#x5E94;&#x7528;&#x548C;&#x5408;&#x4F5C;&#x573A;&#x666F;&#x4E0E;Databricks&#x7684;&#x521B;&#x59CB;&#x4EBA;Reynold Xin&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x51E0;&#x70B9;&#x503C;&#x5F97;&#x4E00;&#x63D0;&#xFF1A;</p>
<p><strong>1.</strong> Spark&#x4E0E;Flink&#x7684;&#x533A;&#x522B;&#x3002;&#x63D0;&#x5230;Flink&#xFF0C;&#x5176;&#x6700;&#x5927;&#x7684;&#x7279;&#x70B9;&#x662F;&#x4E0E;Hadoop &#x6709;&#x7740;&#x975E;&#x5E38;&#x597D;&#x7684;&#x517C;&#x5BB9;&#xFF0C;&#x5982;&#x53EF;&#x4EE5;&#x652F;&#x6301;&#x539F;&#x751F;&#x7684;HBase&#x7684;TableMapper&#x548C;TableReducer&#xFF0C;&#x552F;&#x4E00;&#x4E0D;&#x8DB3;&#x662F;&#x73B0;&#x5728;&#x53EA;&#x652F;&#x6301;&#x8001;&#x7248;&#x672C;&#x7684;MapRed&#x65B9;&#x6CD5;&#xFF0C;&#x65B0;&#x7248;&#x672C;&#x7684;MapReduce&#x65B9;&#x6CD5;&#x65E0;&#x6CD5;&#x5F97;&#x5230;&#x652F;&#x6301;&#x3002; </p>
<p><strong>2.</strong> Cascading&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x4EE5;&#x53CA;Spark&#x600E;&#x4E48;&#x6837;&#x517C;&#x5BB9;Cascading&#x3002;Cascading&#x662F;&#x4E00;&#x4E2A;&#x67B6;&#x6784;&#x5728;Hadoop&#x4E0A;&#x7684;API&#xFF0C;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x590D;&#x6742;&#x548C;&#x5BB9;&#x9519;&#x6570;&#x636E;&#x5904;&#x7406;&#x5DE5;&#x4F5C;&#x6D41;&#x3002;&#x5B83;&#x62BD;&#x8C61;&#x4E86;&#x96C6;&#x7FA4;&#x62D3;&#x6251;&#x7ED3;&#x6784;&#x548C;&#x914D;&#x7F6E;&#xFF0C;&#x65E8;&#x5728;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x590D;&#x6742;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5E94;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x7528;&#x8003;&#x8651;&#x80CC;&#x540E;&#x7684;MapReduce&#x539F;&#x7406;&#x3002; </p>
<p><strong>3.</strong> &#x5C31;AdMaster&#x7528;&#x6237;&#x884C;&#x4E3A;&#x7684;&#x589E;&#x91CF;&#x7EDF;&#x8BA1;&#x7B97;&#x6CD5;&#x5982;&#x4F55;&#x901A;&#x8FC7;Spark&#x5FEB;&#x901F;&#x5B9E;&#x73B0;&#x5E76;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x8FDB;&#x884C;&#x4E86;&#x6DF1;&#x5165;&#x63A2;&#x8BA8;&#xFF0C; &#x7B97;&#x6CD5;&#x4E3E;&#x4F8B;&#xFF1A; </p>
<p>&#x5728; 2013.1.1-2013.11.30 &#x8FD9;&#x4E00;&#x65F6;&#x95F4;&#x6BB5;&#xFF0C;&#x6709; U1&#x3001;U2&#x3001;U3&#x3001;U4 &#x8FD9;&#x56DB;&#x4E2A;&#x7528;&#x6237;&#xFF0C;&#x4ED6;&#x4EEC;&#x6BCF;&#x5929;&#x5BF9;&#x5E7F;&#x544A;&#x7684;&#x6D4F;&#x89C8;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF0C;&#x6570;&#x5B57;&#x4EE3;&#x8868;&#x5F53;&#x5929;&#x7684;&#x8BBF;&#x95EE;&#x6B21;&#x6570;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/7d577e5.png" alt=""></p>
<p>&#x7531;&#x4E0A;&#x8868;&#x53EF;&#x77E5;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x5185;&#xFF0C;U1 &#x6D4F;&#x89C8;&#x5E7F;&#x544A;&#x5171; 4 &#x6B21;&#xFF0C;&#x6B21;&#x6570;&#x4E3A; 4&#xFF1B;U2 &#x6D4F;&#x89C8;&#x5E7F;&#x544A; 2 &#x6B21;&#xFF0C;&#x6B21;&#x6570;&#x4E3A; 2&#xFF1B;U3 &#x6D4F;&#x89C8;&#x5E7F;&#x544A;&#x5171; 4 &#x6B21;&#xFF0C;&#x6B21;&#x6570;&#x4E3A; 4&#xFF1B;U4 &#x6D4F;&#x89C8;&#x5E7F;&#x544A; 1 &#x6B21;&#xFF0C;&#x6B21;&#x6570;&#x4E3A; 1&#x3002;&#x6574;&#x7406;&#x540E;&#xFF0C;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x7684;&#x6B21;&#x6570;&#x5206;&#x5E03;&#x60C5;&#x51B5;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A; </p>
<p><img src="http://taojinke.github.io/img/20150701/7d577e5.png" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x7B97;&#x6CD5;&#x6700;&#x5927;&#x7684;&#x590D;&#x6742;&#x5EA6;&#x5C31;&#x5728;&#x4E8E;&#x6BCF;&#x5929;&#x9700;&#x8981;&#x628A;&#x4EE5;&#x524D;&#x7684;&#x5168;&#x90E8;&#x6570;&#x636E;&#x548C;&#x5F53;&#x5929;&#x7684;&#x6570;&#x636E;&#x505A;&#x8054;&#x5408;&#x67E5;&#x8BE2;&#xFF0C;&#x800C;&#x67E5;&#x8BE2;&#x6761;&#x4EF6;&#x53C8;&#x5206;&#x5F88;&#x591A;&#x7EF4;&#x5EA6;&#x3002;</p>
<p>Reynold&#x6700;&#x540E;&#x5EFA;&#x8BAE;&#x6211;&#x4EEC;&#x7B49;7&#x6708;&#x5E95;&#x63A8;&#x51FA;&#x5BF9;join&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5C4A;&#x65F6;&#x6D4B;&#x8BD5;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x66F4;&#x52A0;&#x8BE6;&#x7EC6;&#x6C9F;&#x901A;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/7d57a56.png" alt=""></p>
<p>&#x5362;&#x4EBF;&#x96F7;</p>
<p>AdMaster&#x6280;&#x672F;&#x526F;&#x603B;&#x88C1;&#xFF0C;&#x8D44;&#x6DF1;&#x5927;&#x6570;&#x636E;&#x6280;&#x672F;&#x4E13;&#x5BB6;&#x3002;&#x5173;&#x6CE8;&#x9AD8;&#x53EF;&#x9760;&#x3001;&#x9AD8;&#x53EF;&#x7528;&#x3001;&#x9AD8;&#x6269;&#x5C55;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#xFF0C;&#x5173;&#x6CE8;Hadoop/HBase/Storm/Spark/ElasticSearch&#x7B49;&#x79BB;&#x7EBF;&#x3001;&#x6D41;&#x5F0F;&#x53CA;&#x5B9E;&#x65F6;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x6280;&#x672F;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/技术/">技术</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/7d5b9d0/" title="麻省理工学院（MIT）发明漏洞自动修复系统 -" itemprop="url">麻省理工学院（MIT）发明漏洞自动修复系统 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T01:38:43.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>&#x5728;&#x672C;&#x6708;&#x8BA1;&#x7B97;&#x673A;&#x534F;&#x4F1A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x8BBE;&#x8BA1;&#x4E0E;&#x5B9E;&#x73B0;&#x4F1A;&#x8BAE;&#x4E0A;&#xFF08;Association for Computing Machinery&apos;s Programming Language Design and Implementation&#xFF09;&#xFF0C;MIT&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x5BFC;&#x5165;&#x5176;&#x4ED6;&#x66F4;&#x4E3A;&#x5B89;&#x5168;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x529F;&#x80FD;&#xFF0C;&#x81EA;&#x52A8;&#x4FEE;&#x590D;&#x5371;&#x9669;&#x7684;&#x8F6F;&#x4EF6;&#x6F0F;&#x6D1E;&#x3002;</p>
<h4 id="&#x6F0F;&#x6D1E;&#x81EA;&#x52A8;&#x4FEE;&#x590D;&#x7CFB;&#x7EDF;&#xFF1A;CodePhage">&#x6F0F;&#x6D1E;&#x81EA;&#x52A8;&#x4FEE;&#x590D;&#x7CFB;&#x7EDF;&#xFF1A;CodePhage</h4><p>&#x8BE5;&#x7CFB;&#x7EDF;&#x79F0;&#x4E3A;CodePhage&#xFF0C;&#x5B83;&#x5728;&#x81EA;&#x52A8;&#x201C;&#x501F;&#x7528;&#x201D;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x7684;&#x529F;&#x80FD;&#x65F6;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x83B7;&#x53D6;&#x6E90;&#x4EE3;&#x7801;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x88AB;&#x5BFC;&#x5165;&#x7A0B;&#x5E8F;&#xFF08; &#x5373;Donor&#x6350;&#x732E;&#x8005;&#xFF0C;&#x540E;&#x6587;&#x7B80;&#x79F0;D &#xFF09;&#x7684;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x4E00;&#x65E6;&#x7528;&#x4E8E;&#x4FEE;&#x590D;&#x7684;&#x4EE3;&#x7801;&#x5BFC;&#x5165;&#x81F3;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF08; &#x5373;Recipient&#x63A5;&#x6536;&#x8005;&#xFF0C;&#x7B80;&#x79F0;R &#xFF09;&#x4E2D;&#xFF0C;CodePhage&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x66F4;&#x6DF1;&#x5C42;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6F0F;&#x6D1E;&#x88AB;&#x4FEE;&#x590D;&#x3002; </p>
<h4 id="MIT_&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF08;CSAIL&#xFF09;CodePhage&#x5F00;&#x53D1;&#x8D1F;&#x8D23;&#x4EBA;Stelios_Sidiroglou-Douskos&#x8868;&#x793A;&#xFF0C;">MIT &#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5B9E;&#x9A8C;&#x5BA4;&#xFF08;CSAIL&#xFF09;CodePhage&#x5F00;&#x53D1;&#x8D1F;&#x8D23;&#x4EBA;Stelios Sidiroglou-Douskos&#x8868;&#x793A;&#xFF0C;</h4><pre><code>&amp;<span class="id">#x201C</span>;&amp;<span class="id">#x5728</span>;&amp;<span class="id">#x5F00</span>;&amp;<span class="id">#x6E90</span>;&amp;<span class="id">#x5E93</span>;&amp;<span class="id">#x4E2D</span>;&amp;<span class="id">#xFF0C</span>;&amp;<span class="id">#x6211</span>;&amp;<span class="id">#x4EEC</span>;&amp;<span class="id">#x6709</span>;&amp;<span class="id">#x5927</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x6E90</span>;&amp;<span class="id">#x4EE3</span>;&amp;<span class="id">#x7801</span>;&amp;<span class="id">#x53EF</span>;&amp;<span class="id">#x4F9B</span>;&amp;<span class="id">#x4F7F</span>;&amp;<span class="id">#x7528</span>;&amp;<span class="id">#xFF0C</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E9B</span>;&amp;<span class="id">#x6570</span>;&amp;<span class="id">#x4EE5</span>;&amp;<span class="id">#x767E</span>;&amp;<span class="id">#x4E07</span>;&amp;<span class="id">#x8BA1</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x9879</span>;&amp;<span class="id">#x76EE</span>;&amp;<span class="id">#x4EE5</span>;&amp;<span class="id">#x53CA</span>;&amp;<span class="id">#x5927</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#x89C4</span>;&amp;<span class="id">#x8303</span>;&amp;<span class="id">#x76F8</span>;&amp;<span class="id">#x4F3C</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x9879</span>;&amp;<span class="id">#x76EE</span>;&amp;<span class="id">#x5B9E</span>;&amp;<span class="id">#x73B0</span>;&amp;<span class="id">#x3002</span>;&amp;<span class="id">#x968F</span>;&amp;<span class="id">#x7740</span>;&amp;<span class="id">#x65F6</span>;&amp;<span class="id">#x95F4</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x63A8</span>;&amp;<span class="id">#x79FB</span>;&amp;<span class="id">#xFF0C</span>;&amp;<span class="id">#x4F60</span>;&amp;<span class="id">#x9700</span>;&amp;<span class="id">#x8981</span>;&amp;<span class="id">#x5B8C</span>;&amp;<span class="id">#x6210</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x5C31</span>;&amp;<span class="id">#x662F</span>;&amp;<span class="id">#x4ECE</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E9B</span>;&amp;<span class="id">#x9879</span>;&amp;<span class="id">#x76EE</span>;&amp;<span class="id">#x4E2D</span>;&amp;<span class="id">#x83B7</span>;&amp;<span class="id">#x53D6</span>;&amp;<span class="id">#x6700</span>;&amp;<span class="id">#x597D</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x7EC4</span>;&amp;<span class="id">#x4EF6</span>;&amp;<span class="id">#x6765</span>;&amp;<span class="id">#x6784</span>;&amp;<span class="id">#x5EFA</span>;<span class="tag">CodePhage</span>&amp;<span class="id">#x2014</span>;&amp;<span class="id">#x2014</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E00</span>;&amp;<span class="id">#x6DF7</span>;&amp;<span class="id">#x5408</span>;&amp;<span class="id">#x7CFB</span>;&amp;<span class="id">#x7EDF</span>;&amp;<span class="id">#x3002</span>;&amp;<span class="id">#x201D</span>;
</code></pre><p>&#x5F00;&#x59CB;&#x5206;&#x6790;&#x65F6;&#xFF0C;CodePhage&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x6837;&#x672C;&#x503C;&#x8F93;&#x5165;&#xFF1A;&#x4E00;&#x4E2A;&#x4F1A;&#x9020;&#x6210; R &#x5D29;&#x6E83;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x5219;&#x4E0D;&#x4F1A;&#x3002;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;DIODE&#x7684;&#x6F0F;&#x6D1E;&#x5B9A;&#x4F4D;&#x7A0B;&#x5E8F;&#x53EF;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x5F15;&#x8D77;&#x5D29;&#x6E83;&#xFF08;crash-inducing&#xFF09;&#x8F93;&#x5165;&#x3002;&#x4F46;&#x7528;&#x6237;&#x4EC5;&#x4EC5;&#x8BA4;&#x4E3A;&#x662F;&#x6253;&#x5F00;&#x4E86;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x6587;&#x4EF6;&#x800C;&#x5F15;&#x53D1;&#x7684;&#x5D29;&#x6E83;&#x4E8B;&#x6545;&#x3002;</p>
<h4 id="&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;">&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x8FC7;&#x7A0B;</h4><p>&#x9996;&#x5148;&#xFF0C;CodePhage&#x4E3A; D &#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x4E0D;&#x4F1A;&#x5F15;&#x8D77;&#x5D29;&#x6E83;&#x7684;&#x201C;&#x5B89;&#x5168;&#x201D;&#x8F93;&#x5165;&#x3002;&#x7136;&#x540E;&#x8DDF;&#x8E2A; D &#x7684;&#x6267;&#x884C;&#x64CD;&#x7EB5;&#x5E8F;&#x5217;&#x5E76;&#x4F7F;&#x7528;&#x7B26;&#x53F7;&#x8868;&#x8FBE;&#x5F0F;&#x8BB0;&#x5F55;&#x4E0B;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x91CC;&#x7684;&#x7B26;&#x53F7;&#x8868;&#x8FBE;&#x5F0F;&#xFF08;  symbolic expression&#xFF0C;&#x7B80;&#x79F0;SE &#xFF09;&#x662F;&#x4E00;&#x4E32;&#x63CF;&#x8FF0;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x65BD;&#x52A0;&#x7684;&#x903B;&#x8F91;&#x7EA6;&#x675F;&#x7B26;&#x53F7;&#x3002; </p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x5982;&#x53EF;&#x80FD;&#x4F1A;&#x68C0;&#x6D4B; D &#x7684;&#x8F93;&#x5165;&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x67D0;&#x4E2A;&#x9608;&#x503C;&#x3002;&#x5982;&#x679C;&#x7ED3;&#x679C;&#x662F;&#x5C0F;&#x4E8E;&#x7684;&#xFF0C;CodePhage&#x5C06;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A; SE &#x672F;&#x8BED;&#x6765;&#x8868;&#x793A;&#x8BE5;&#x60C5;&#x51B5;&#x4F4E;&#x4E8E;&#x9608;&#x503C;&#x3002;&#x8FD9;&#x91CC;&#x5E76;&#x4E0D;&#x8BB0;&#x5F55;&#x6587;&#x4EF6;&#x7684;&#x5B9E;&#x9645;&#x5927;&#x5C0F;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x901A;&#x8FC7;&#x68C0;&#x6D4B;&#x65BD;&#x52A0;&#x9650;&#x5236;&#x7EA6;&#x675F;&#x3002; </p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;CodePhage&#x4E3A; D &#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x5F15;&#x8D77;&#x5D29;&#x6E83;&#x7684;&#x8F93;&#x5165;&#x3002;&#x5B83;&#x518D;&#x4E00;&#x6B21;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;SE&#x6765;&#x4EE3;&#x8868; D &#x6267;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#x7A0B;&#x5E8F;&#x3002;&#x4F46;&#x662F;&#x5F53;&#x65B0;&#x7684;SE&#x4ECE;&#x65E7;&#x7684;&#x5F53;&#x4E2D;&#x5206;&#x79BB;&#x51FA;&#x65F6;&#xFF0C;CodePhage&#x4F1A;&#x4E2D;&#x65AD;&#x5176;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E00;&#x504F;&#x5DEE;&#xFF08;divergence&#xFF09;&#x5C31;&#x662F;&#x4E86;&#x5B89;&#x5168;&#x8F93;&#x5165;&#x4F1A;&#x9047;&#x5230;&#x7684;&#x7EA6;&#x675F;&#x800C;&#x5F15;&#x8D77;&#x5D29;&#x6E83;&#x7684;&#x8F93;&#x5165;&#x4E0D;&#x4F1A;&#x9047;&#x89C1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x662F;R&#x5B89;&#x5168;&#x68C0;&#x6D4B;&#x6240;&#x7F3A;&#x5931;&#x7684;&#x90E8;&#x5206;&#x3002; </p>
<p>&#x7136;&#x540E;CodePhage&#x5206;&#x6790; R &#x7A0B;&#x5E8F;&#x4EE5;&#x5BFB;&#x627E;&#x5927;&#x591A;&#x6570; SE &#x6240;&#x9650;&#x5236;&#x8F93;&#x5165;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x5168;&#x90E8;&#x3002;R&#x80FD;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x987A;&#x5E8F;&#x6267;&#x884C;&#x4E0D;&#x540C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x975E;&#x5B8C;&#x5168;&#x6309;&#x7167;&#x65BD;&#x8005;&#x6240;&#x505A;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x6570;&#x636E;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E4B;&#x540E;&#xFF0C;SE &#x63CF;&#x8FF0;&#x4E86;&#x6570;&#x636E;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x800C;&#x975E;&#x8FC7;&#x7A0B;&#x672C;&#x8EAB;&#x3002; </p>
<p>  &#x5728;&#x6BCF;&#x4E2A;&#x6807;&#x8BC6;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;CodePhage&#x80FD;&#x591F;&#x4E0D;&#x53D7;&#x5927;&#x90E8;&#x5206; SE &#x7684;&#x7EA6;&#x675F;&#x2014;&#x2014;&#x540C;&#x6837;&#x9002;&#x7528; R&#x3002;&#x4ECE;&#x7B2C;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x5F00;&#x59CB;&#xFF0C;CodePhage&#x5C06;&#x4ECD;&#x7136;&#x7559;&#x5728; R &#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x4E2D;&#x7684;&#x5C11;&#x91CF;&#x7EA6;&#x675F;&#x8F6C;&#x5316;&#x6210;&#x65B0;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x63D2;&#x5165;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x3002;&#x7136;&#x540E;&#x518D;&#x6B21;&#x8FD0;&#x884C;&#x5F15;&#x8D77;&#x5D29;&#x6E83;&#x8F93;&#x5165;&#x3002;</p>
<p>&#x5982;&#x679C;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#xFF0C;&#x5219;&#x65B0;&#x4EE3;&#x7801;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#xFF0C;CodePhage&#x4F1A;&#x79FB;&#x52A8;&#x5230;R&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x4F4D;&#x7F6E;&#x3002;&#x5982;&#x679C;&#x9879;&#x76EE;&#x4F9D;&#x65E7;&#x5D29;&#x6E83;&#xFF0C;&#x5373;&#x4F7F;&#x5728;CodePhage&#x5DF2;&#x7ECF;&#x5C1D;&#x8BD5;&#x4FEE;&#x590D;&#x4E86;&#x6240;&#x6709;&#x5019;&#x9009;&#x4F4D;&#x7F6E;&#x4E4B;&#x540E;&#xFF0C;&#x5B83;&#x4ECD;&#x4F1A;&#x91CD;&#x8FD4; D &#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x5EFA;&#x7ACB; SE&#xFF0C;&#x76F4;&#x81F3;&#x627E;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x504F;&#x5DEE;&#x3002; </p>
<p> &lt;&#x4E0A;&#x8FF0;&#x5185;&#x5BB9;&#x4E13;&#x4E1A;&#x6027;&#x5F88;&#x5F3A;&#xFF0C;&#x5C0F;&#x7F16;&#x7FFB;&#x8BD1;&#x7684;&#x6BD4;&#x8F83;&#x751F;&#x6DA9;&#x2026;&#x2026;&#x5177;&#x4F53;&#x8BF7; <a href="http://newsoffice.mit.edu/2015/automatic-code-bug-repair-0629" target="_blank" rel="external"><strong>&#x67E5;&#x770B;&#x539F;&#x6587;</strong></a><strong>&gt;</strong></p>
<h4 id="&#x81EA;&#x52A8;&#x5316;&#x7684;&#x672A;&#x6765;">&#x81EA;&#x52A8;&#x5316;&#x7684;&#x672A;&#x6765;</h4><p>&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5728;&#x53D1;&#x73B0;&#x6F0F;&#x6D1E;&#x7684;DIODE&#x4E03;&#x4E2A;&#x5E38;&#x89C1;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x4E2D;&#x6D4B;&#x8BD5;&#x4E86;CodePhage&#xFF0C;&#x6BCF;&#x4E2A;&#x4ECE; D &#x5BFC;&#x5165;&#x4E86;&#x4E24;&#x4E2A;&#x5230;&#x56DB;&#x4E2A;&#x6570;&#x91CF;&#x4E0D;&#x7B49;&#x7684;&#x6F0F;&#x6D1E;&#x4FEE;&#x590D;&#x3002;&#x5728;&#x6240;&#x6709;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;CodePhage&#x5747;&#x80FD;&#x591F;&#x4FEE;&#x590D;&#x6F0F;&#x6D1E;&#x4EE3;&#x7801;&#xFF0C;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x4FEE;&#x590D;&#x53EA;&#x9700;&#x8981;&#x4E8C;&#x5230;&#x5341;&#x5206;&#x949F;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x5B89;&#x5168;&#x68C0;&#x6D4B;&#x5360;&#x636E;&#x4E86;&#x73B0;&#x4EE3;&#x5546;&#x4E1A;&#x8F6F;&#x4EF6;80%&#x751A;&#x81F3;&#x66F4;&#x591A;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x7814;&#x7A76;&#x8005;&#x5E0C;&#x671B;&#x672A;&#x6765;CodePhage&#x7684;&#x7248;&#x672C;&#x4E2D;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x81EA;&#x52A8;&#x68C0;&#x67E5;&#x5E76;&#x63D2;&#x5165;&#x7CFB;&#x7EDF;&#xFF0C;&#x4ECE;&#x800C;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8005;&#x82B1;&#x8D39;&#x5728;&#x7E41;&#x91CD;&#x5DE5;&#x4F5C;&#x4E2D;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x89E3;&#x653E;&#x7A0B;&#x5E8F;&#x5458;&#x3002;</p>
<h4 id="&#x5F00;&#x53D1;&#x8005;&#x4E4B;&#x8BED;">&#x5F00;&#x53D1;&#x8005;&#x4E4B;&#x8BED;</h4><h4 id="MIT&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x5DE5;&#x7A0B;&#x6559;&#x6388;Martin_Rinard&#x8BF4;&#xFF0C;">MIT&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x4E0E;&#x5DE5;&#x7A0B;&#x6559;&#x6388;Martin Rinard&#x8BF4;&#xFF0C;</h4><pre><code><span class="keyword">&amp;</span><span class="id">#x201C</span>;<span class="keyword">&amp;</span><span class="id">#x672A</span>;<span class="keyword">&amp;</span><span class="id">#x6765</span>;<span class="keyword">&amp;</span><span class="id">#x7684</span>;<span class="keyword">&amp;</span><span class="id">#x613F</span>;<span class="keyword">&amp;</span><span class="id">#x666F</span>;<span class="keyword">&amp;</span><span class="id">#x662F</span>;<span class="keyword">&amp;</span><span class="id">#xFF0C</span>;<span class="keyword">&amp;</span><span class="id">#x4F60</span>;<span class="keyword">&amp;</span><span class="id">#x518D</span>;<span class="keyword">&amp;</span><span class="id">#x4E5F</span>;<span class="keyword">&amp;</span><span class="id">#x4E0D</span>;<span class="keyword">&amp;</span><span class="id">#x9700</span>;<span class="keyword">&amp;</span><span class="id">#x8981</span>;<span class="keyword">&amp;</span><span class="id">#x5199</span>;<span class="keyword">&amp;</span><span class="id">#x4E00</span>;<span class="keyword">&amp;</span><span class="id">#x6BB5</span>;<span class="keyword">&amp;</span><span class="id">#x522B</span>;<span class="keyword">&amp;</span><span class="id">#x4EBA</span>;<span class="keyword">&amp;</span><span class="id">#x66FE</span>;<span class="keyword">&amp;</span><span class="id">#x5199</span>;<span class="keyword">&amp;</span><span class="id">#x8FC7</span>;<span class="keyword">&amp;</span><span class="id">#x7684</span>;<span class="keyword">&amp;</span><span class="id">#x4EE3</span>;<span class="keyword">&amp;</span><span class="id">#x7801</span>;<span class="keyword">&amp;</span><span class="id">#x3002</span>;<span class="keyword">&amp;</span><span class="id">#x8FD9</span>;<span class="keyword">&amp;</span><span class="id">#x4E2A</span>;<span class="keyword">&amp;</span><span class="id">#x7CFB</span>;<span class="keyword">&amp;</span><span class="id">#x7EDF</span>;<span class="keyword">&amp;</span><span class="id">#x80FD</span>;<span class="keyword">&amp;</span><span class="id">#x591F</span>;<span class="keyword">&amp;</span><span class="id">#x53D1</span>;<span class="keyword">&amp;</span><span class="id">#x73B0</span>;<span class="keyword">&amp;</span><span class="id">#x4EE3</span>;<span class="keyword">&amp;</span><span class="id">#x7801</span>;<span class="keyword">&amp;</span><span class="id">#xFF0C</span>;<span class="keyword">&amp;</span><span class="id">#x5E76</span>;<span class="keyword">&amp;</span><span class="id">#x65E0</span>;<span class="keyword">&amp;</span><span class="id">#x8BBA</span>;<span class="keyword">&amp;</span><span class="id">#x662F</span>;<span class="keyword">&amp;</span><span class="id">#x4F55</span>;<span class="keyword">&amp;</span><span class="id">#x79CD</span>;<span class="keyword">&amp;</span><span class="id">#x4EE3</span>;<span class="keyword">&amp;</span><span class="id">#x7801</span>;<span class="keyword">&amp;</span><span class="id">#x90FD</span>;<span class="keyword">&amp;</span><span class="id">#x80FD</span>;<span class="keyword">&amp;</span><span class="id">#x81EA</span>;<span class="keyword">&amp;</span><span class="id">#x52A8</span>;<span class="keyword">&amp;</span><span class="id">#x628A</span>;<span class="keyword">&amp;</span><span class="id">#x5B83</span>;<span class="keyword">&amp;</span><span class="id">#x4EEC</span>;<span class="keyword">&amp;</span><span class="id">#x8FDE</span>;<span class="keyword">&amp;</span><span class="id">#x5728</span>;<span class="keyword">&amp;</span><span class="id">#x4E00</span>;<span class="keyword">&amp;</span><span class="id">#x8D77</span>;<span class="keyword">&amp;</span><span class="id">#xFF0C</span>;<span class="keyword">&amp;</span><span class="id">#x8BA9</span>;<span class="keyword">&amp;</span><span class="id">#x4F60</span>;<span class="keyword">&amp;</span><span class="id">#x7684</span>;<span class="keyword">&amp;</span><span class="id">#x7A0B</span>;<span class="keyword">&amp;</span><span class="id">#x5E8F</span>;<span class="keyword">&amp;</span><span class="id">#x8FD0</span>;<span class="keyword">&amp;</span><span class="id">#x884C</span>;<span class="keyword">&amp;</span><span class="id">#x8D77</span>;<span class="keyword">&amp;</span><span class="id">#x6765</span>;<span class="keyword">&amp;</span><span class="id">#x3002</span>;<span class="keyword">&amp;</span><span class="id">#x201D</span>;
<span class="keyword">&amp;</span><span class="id">#x501F</span>;<span class="keyword">&amp;</span><span class="id">#x7528</span>;<span class="keyword">&amp;</span><span class="id">#x53E6</span>;<span class="keyword">&amp;</span><span class="id">#x4E00</span>;<span class="keyword">&amp;</span><span class="id">#x4E2A</span>;<span class="keyword">&amp;</span><span class="id">#x5177</span>;<span class="keyword">&amp;</span><span class="id">#x6709</span>;<span class="keyword">&amp;</span><span class="id">#x76F8</span>;<span class="keyword">&amp;</span><span class="id">#x4F3C</span>;<span class="keyword">&amp;</span><span class="id">#x529F</span>;<span class="keyword">&amp;</span><span class="id">#x80FD</span>;<span class="keyword">&amp;</span><span class="id">#x7A0B</span>;<span class="keyword">&amp;</span><span class="id">#x5E8F</span>;<span class="keyword">&amp;</span><span class="id">#x4EE3</span>;<span class="keyword">&amp;</span><span class="id">#x7801</span>;<span class="keyword">&amp;</span><span class="id">#x7684</span>;<span class="keyword">&amp;</span><span class="id">#x6280</span>;<span class="keyword">&amp;</span><span class="id">#x5DE7</span>;<span class="keyword">&amp;</span><span class="id">#xFF0C</span>;<span class="keyword">&amp;</span><span class="id">#x5E76</span>;<span class="keyword">&amp;</span><span class="id">#x4E14</span>;<span class="keyword">&amp;</span><span class="id">#x7528</span>;<span class="keyword">&amp;</span><span class="id">#x6765</span>;<span class="keyword">&amp;</span><span class="id">#x4FEE</span>;<span class="keyword">&amp;</span><span class="id">#x590D</span>;<span class="keyword">&amp;</span><span class="id">#x4E00</span>;<span class="keyword">&amp;</span><span class="id">#x4E2A</span>;<span class="keyword">&amp;</span><span class="id">#x57FA</span>;<span class="keyword">&amp;</span><span class="id">#x672C</span>;<span class="keyword">&amp;</span><span class="id">#x4E0A</span>;<span class="keyword">&amp;</span><span class="id">#x5DF2</span>;<span class="keyword">&amp;</span><span class="id">#x7ECF</span>;<span class="keyword">&amp;</span><span class="id">#x574F</span>;<span class="keyword">&amp;</span><span class="id">#x6389</span>;<span class="keyword">&amp;</span><span class="id">#x7684</span>;<span class="keyword">&amp;</span><span class="id">#x7A0B</span>;<span class="keyword">&amp;</span><span class="id">#x5E8F</span>;<span class="keyword">&amp;</span><span class="id">#xFF0C</span>;<span class="keyword">&amp;</span><span class="id">#x8FD9</span>;<span class="keyword">&amp;</span><span class="id">#x662F</span>;<span class="keyword">&amp;</span><span class="id">#x975E</span>;<span class="keyword">&amp;</span><span class="id">#x5E38</span>;<span class="keyword">&amp;</span><span class="id">#x9177</span>;<span class="keyword">&amp;</span><span class="id">#x7684</span>;<span class="keyword">&amp;</span><span class="id">#x8FC7</span>;<span class="keyword">&amp;</span><span class="id">#x7A0B</span>;<span class="keyword">&amp;</span><span class="id">#x3002</span>;<span class="keyword">&amp;</span><span class="id">#x8BF4</span>;<span class="keyword">&amp;</span><span class="id">#x5B9E</span>;<span class="keyword">&amp;</span><span class="id">#x8BDD</span>;<span class="keyword">&amp;</span><span class="id">#xFF0C</span>;<span class="keyword">&amp;</span><span class="id">#x6211</span>;<span class="keyword">&amp;</span><span class="id">#x5F88</span>;<span class="keyword">&amp;</span><span class="id">#x60CA</span>;<span class="keyword">&amp;</span><span class="id">#x8BB6</span>;<span class="keyword">&amp;</span><span class="id">#x5B83</span>;<span class="keyword">&amp;</span><span class="id">#x7ADF</span>;<span class="keyword">&amp;</span><span class="id">#x7136</span>;<span class="keyword">&amp;</span><span class="id">#x80FD</span>;<span class="keyword">&amp;</span><span class="id">#x591F</span>;<span class="keyword">&amp;</span><span class="id">#x8FD0</span>;<span class="keyword">&amp;</span><span class="id">#x884C</span>;<span class="keyword">&amp;</span><span class="id">#x3002</span>;<span class="keyword">&amp;</span><span class="id">#x201D</span>;
</code></pre><h4 id="Berger&#x89E3;&#x91CA;&#x8BF4;&#xFF0C;">Berger&#x89E3;&#x91CA;&#x8BF4;&#xFF0C;</h4><pre><code>&amp;<span class="id">#x201C</span>;&amp;<span class="id">#x65BD</span>;&amp;<span class="id">#x8005</span>;&amp;<span class="id">#x7A0B</span>;&amp;<span class="id">#x5E8F</span>;&amp;<span class="id">#x5E76</span>;&amp;<span class="id">#x4E0D</span>;&amp;<span class="id">#x662F</span>;&amp;<span class="id">#x76F8</span>;&amp;<span class="id">#x540C</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x4EBA</span>;&amp;<span class="id">#x5199</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x3002</span>;&amp;<span class="id">#x4ED6</span>;&amp;<span class="id">#x4EEC</span>;&amp;<span class="id">#x6709</span>;&amp;<span class="id">#x4E0D</span>;&amp;<span class="id">#x540C</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x7F16</span>;&amp;<span class="id">#x7801</span>;&amp;<span class="id">#x6807</span>;&amp;<span class="id">#x51C6</span>;&amp;<span class="id">#xFF1B</span>;&amp;<span class="id">#x5BF9</span>;&amp;<span class="id">#x53D8</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x547D</span>;&amp;<span class="id">#x540D</span>;&amp;<span class="id">#x4E5F</span>;&amp;<span class="id">#x4E0D</span>;&amp;<span class="id">#x540C</span>;&amp;<span class="id">#xFF1B</span>;&amp;<span class="id">#x4F7F</span>;&amp;<span class="id">#x7528</span>;&amp;<span class="id">#x5B8C</span>;&amp;<span class="id">#x5168</span>;&amp;<span class="id">#x4E0D</span>;&amp;<span class="id">#x540C</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x53D8</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#xFF1B</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E9B</span>;&amp;<span class="id">#x53D8</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#x53EF</span>;&amp;<span class="id">#x4EE5</span>;&amp;<span class="id">#x662F</span>;&amp;<span class="id">#x672C</span>;&amp;<span class="id">#x5730</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#xFF1B</span>;&amp;<span class="id">#x6216</span>;&amp;<span class="id">#x8005</span>;&amp;<span class="id">#x662F</span>;&amp;<span class="id">#x66F4</span>;&amp;<span class="id">#x9AD8</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x5806</span>;&amp;<span class="id">#x6808</span>;&amp;<span class="id">#x3002</span>;<span class="tag">CodePhage</span>&amp;<span class="id">#x80FD</span>;&amp;<span class="id">#x591F</span>;&amp;<span class="id">#x8BC6</span>;&amp;<span class="id">#x522B</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E9B</span>;&amp;<span class="id">#x94FE</span>;&amp;<span class="id">#x63A5</span>;&amp;<span class="id">#xFF0C</span>;&amp;<span class="id">#x5E76</span>;&amp;<span class="id">#x5224</span>;&amp;<span class="id">#x65AD</span>;&amp;<span class="id">#x2018</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E9B</span>;&amp;<span class="id">#x53D8</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#x4E0E</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x4E9B</span>;&amp;<span class="id">#x53D8</span>;&amp;<span class="id">#x91CF</span>;&amp;<span class="id">#x6709</span>;&amp;<span class="id">#x5173</span>;&amp;<span class="id">#x8054</span>;&amp;<span class="id">#x2019</span>;&amp;<span class="id">#x3002</span>;&amp;<span class="id">#x4E0E</span>;&amp;<span class="id">#x5668</span>;&amp;<span class="id">#x5B98</span>;&amp;<span class="id">#x6350</span>;&amp;<span class="id">#x8D60</span>;&amp;<span class="id">#x76F8</span>;&amp;<span class="id">#x4F3C</span>;&amp;<span class="id">#xFF0C</span>;&amp;<span class="id">#x901A</span>;&amp;<span class="id">#x8FC7</span>;&amp;<span class="id">#x9057</span>;&amp;<span class="id">#x4F20</span>;&amp;<span class="id">#x5BC6</span>;&amp;<span class="id">#x7801</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x8F6C</span>;&amp;<span class="id">#x79FB</span>;&amp;<span class="id">#x8BA9</span>;&amp;<span class="id">#x4E2A</span>;&amp;<span class="id">#x4F53</span>;&amp;<span class="id">#x66F4</span>;&amp;<span class="id">#x5B8C</span>;&amp;<span class="id">#x7F8E</span>;&amp;<span class="id">#x3002</span>;&amp;<span class="id">#x5B83</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x5DE5</span>;&amp;<span class="id">#x4F5C</span>;&amp;<span class="id">#x539F</span>;&amp;<span class="id">#x7406</span>;&amp;<span class="id">#x53CA</span>;&amp;<span class="id">#x6700</span>;&amp;<span class="id">#x7EC8</span>;&amp;<span class="id">#x6210</span>;&amp;<span class="id">#x679C</span>;&amp;<span class="id">#x771F</span>;&amp;<span class="id">#x7684</span>;&amp;<span class="id">#x5F88</span>;&amp;<span class="id">#x4EE4</span>;&amp;<span class="id">#x4EBA</span>;&amp;<span class="id">#x60CA</span>;&amp;<span class="id">#x8BB6</span>;&amp;<span class="id">#xFF0C</span>;&amp;<span class="id">#x8FD9</span>;&amp;<span class="id">#x975E</span>;&amp;<span class="id">#x5E38</span>;&amp;<span class="id">#x9177</span>;&amp;<span class="id">#x3002</span>;&amp;<span class="id">#x201D</span>;
</code></pre><p>*&#x53C2;&#x8003;&#x6765;&#x6E90;&#xFF1A; <a href="http://newsoffice.mit.edu/2015/automatic-code-bug-repair-0629" target="_blank" rel="external">MIT News</a> &#xFF0C;&#x5C0F;&#x592A;&#x9633;&#x82B1;&#x7FFB;&#x8BD1;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x6CE8;&#x660E;&#x6765;&#x81EA;FreeBuf&#x9ED1;&#x5BA2;&#x4E0E;&#x6781;&#x5BA2;&#xFF08;FreeBuf.COM&#xFF09; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/安全漏洞/">安全漏洞</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/7d52754/" title="10.10.4 原生支持第三方SSD TRIM，一条命令即可开启 -" itemprop="url">10.10.4 原生支持第三方SSD TRIM，一条命令即可开启 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-01T01:38:42.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p><em>&#x672C;&#x5E16;&#x6700;&#x540E;&#x7531; - &#x4E8E; 15-7-1 12:45 &#x7F16;&#x8F91;</em></p>
<p>&#x4ECA;&#x5929;&#x65E9;&#x4E9B;&#x65F6;&#x5019;&#xFF0C;&#x82F9;&#x679C;&#x53D1;&#x5E03;&#x4E86; OS X 10.10.4 &#x6B63;&#x5F0F;&#x7248;&#x3002;OS X 10.10.4 &#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x66F4;&#x65B0;&#xFFFD;&#xFFFD;&#xFFFD;&#x4FEE;&#x590D;&#x4E86; Bug &#x5E76;&#x6539;&#x5584;&#x4E86;&#x6027;&#x80FD;&#x3002;&#x6839;&#x636E; Ars Technica &#x62A5;&#x544A;&#xFF0C;OS X 10.10.4 &#x652F;&#x6301;&#x5728;&#x7B2C;&#x4E09;&#x65B9; SSD &#x56FA;&#x6001;&#x786C;&#x76D8;&#x4E0A;&#x5F00;&#x542F; TRIM&#x3002;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x62A5;&#x544A;&#x79F0; OS X El Capitan &#x5C06;&#x539F;&#x751F;&#x5F00;&#x542F;&#x7B2C;&#x4E09;&#x65B9; SSD TRIM &#x652F;&#x6301;&#xFF0C;&#x4E0D;&#x8FC7;&#x73B0;&#x5728;&#x770B;&#x8D77;&#x6765;&#x82F9;&#x679C;&#x63D0;&#x524D;&#x5C06;&#x8FD9;&#x9879;&#x529F;&#x80FD;&#x63A8;&#x51FA;&#x3002;</p>
<p>TRIM &#x662F;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;&#x7684;&#x547D;&#x4EE4;&#xFF0C;&#x5141;&#x8BB8;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x548C;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x66F4;&#x597D;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x786E;&#x5B9A; SSD &#x4E0A;&#x54EA;&#x4E9B;&#x533A;&#x57DF;&#x6CA1;&#x6709;&#x88AB;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x51C6;&#x5907;&#x597D;&#x64E6;&#x9664;&#x548C;&#x91CD;&#x65B0;&#x5199;&#x5165;&#x3002;&#x5BF9;&#x4E8E;&#x56FA;&#x6001;&#x786C;&#x76D8;&#xFF08;SSD&#xFF09;&#xFF0C;&#x7531;&#x4E8E;&#x95EA;&#x5B58;&#x7684;&#x56FA;&#x6709;&#x7279;&#x6027;&#xFF0C;&#x66F4;&#x65B0;&#x9875;&#x4E4B;&#x524D;&#x5FC5;&#x987B;&#x8981;&#x64E6;&#x9664;&#x76F8;&#x5173;&#x5757;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x5F00;&#x542F;TRIM&#xFF0C;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#x65E9;&#x5DF2;&#x88AB;&#x5220;&#x9664;&#x7684;&#x5757;&#x5728;&#x7269;&#x7406;&#x4E0A;&#x8FD8;&#x5B58;&#x653E;&#x7740;&#x539F;&#x6765;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4E14; SSD &#x4E3B;&#x63A7;&#x65E0;&#x6CD5;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x5757;&#x5DF2;&#x7ECF;&#x65E0;&#x7528;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x65B0;&#x7684;&#x6570;&#x636E;&#x8981;&#x6C42;&#x5199;&#x5165;&#x8BE5;&#x5757;&#x3002;&#x7269;&#x7406;&#x4E0A;&#x5B58;&#x653E;&#x5DF2;&#x65E0;&#x7528;&#x7684;&#x6570;&#x636E;&#x4F1A;&#x5728; SSD &#x5783;&#x573E;&#x56DE;&#x6536;&#xFF08;GC&#xFF09;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x88AB;&#x5F53;&#x6210;&#x6709;&#x7528;&#x6570;&#x636E;&#x5BF9;&#x5F85;&#xFF0C;&#x88AB;&#x8FD9;&#x5BF9;&#x4E8E;&#x56FA;&#x6001;&#x786C;&#x76D8;&#x7684;&#x5BFF;&#x547D;&#x662F;&#x975E;&#x5E38;&#x4E0D;&#x5229;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x4F1A;&#x5BFC;&#x81F4;&#x5176;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x548C;&#x6027;&#x80FD;&#x7684;&#x964D;&#x4F4E;&#x3002;</p>
<p><img src="http://taojinke.github.io/img/20150701/7d502b5.jpg" alt="trimforce.jpg"></p>
<p>&#x6B64;&#x524D;&#xFF0C;&#x5982;&#x679C;&#x60F3;&#x8981; Mac &#x4E0A;&#x5BF9;&#x7B2C;&#x4E09;&#x65B9; SSD &#x5F00;&#x542F; TRIM &#x652F;&#x6301;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0B;&#x8F7D; Trim Enabler &#x7B49;&#x5DE5;&#x5177;&#x3002;&#x5728; OS X 10.10.4 &#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x6253;&#x5F00;&#x7EC8;&#x7AEF;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x8F93;&#x5165;&#x4E0B;&#x9762;&#x547D;&#x4EE4;&#x5373;&#x53EF;&#xFF1A;</p>
<ol>
<li>sudo trimforce enable</li>
</ol>
<p><em>&#x590D;&#x5236;&#x4EE3;&#x7801;</em></p>
<p>&#x5B8C;&#x6210;&#x8F93;&#x5165;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#xFF0C;&#x7136;&#x540E;&#x8F93;&#x5165; y&#xFF08;yes&#xFF09;&#x5E76;&#x56DE;&#x8F66;&#x3002;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x91CD;&#x542F;&#xFF0C;&#x91CD;&#x542F;&#x5B8C;&#x6210;&#x540E;&#xFF0C;TRIM &#x652F;&#x6301;&#x5DF2;&#x7ECF;&#x5F00;&#x542F;&#x3002;</p>
<p>MacX.cn &#x7F16;&#x8BD1; </p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/操作系统/">操作系统</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f981b39/" title="【开源访谈】NoSQL 数据库 SSDB 作者访谈 -" itemprop="url">【开源访谈】NoSQL 数据库 SSDB 作者访谈 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <h4 id="&#x3010;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x3011;">&#x3010;&#x9879;&#x76EE;&#x4ECB;&#x7ECD;&#x3011;</h4><p>SSDB &#x662F;&#x4E00;&#x4E2A; C/C++ &#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x7684;&#x9AD8;&#x6027;&#x80FD; NoSQL &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x652F;&#x6301; zset(sorted set), map(hash)&#xFF0C;kv&#xFF0C;list &#x7B49;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x7528;&#x6765;&#x66FF;&#x4EE3;&#x6216;&#x8005;&#x4E0E; Redis &#x914D;&#x5408;&#x5B58;&#x50A8;&#x5341;&#x4EBF;&#x7EA7;&#x522B;&#x5217;&#x8868;&#x7684;&#x6570;&#x636E;&#x3002;SSDB &#x5728; QIHU 360 &#x88AB;&#x5927;&#x91CF;&#x4F7F;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x88AB;&#x56FD;&#x5185;&#x5916;&#x4E1A;&#x754C;&#x7684;&#x4F17;&#x591A;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#x6240;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x9879;&#x76EE;&#x4E3B;&#x9875;&#xFF1A; <a href="http://ssdb.io/zh_cn/" target="_blank" rel="external">http://ssdb.io/zh_cn/</a></p>
<p>&#x4F5C;&#x8005;&#xFF1A;@ideawu </p>
<p><img src="http://taojinke.github.io/img/20150701/f980540.jpg" alt=""></p>
<p>&#x3010;&#x6B63;&#x6587;&#x3011; </p>
<h4 id="1-&#x8BF7;&#x7B80;&#x5355;&#x5730;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x4F60;&#x81EA;&#x5DF1;&#xFF08;&#x6280;&#x672F;&#x80CC;&#x666F;&#x3001;&#x5B66;&#x4E60;&#x7ECF;&#x5386;&#x3001;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF09;&#x3002;">1.&#x8BF7;&#x7B80;&#x5355;&#x5730;&#x4ECB;&#x7ECD;&#x4E00;&#x4E0B;&#x4F60;&#x81EA;&#x5DF1;&#xFF08;&#x6280;&#x672F;&#x80CC;&#x666F;&#x3001;&#x5B66;&#x4E60;&#x7ECF;&#x5386;&#x3001;&#x5DE5;&#x4F5C;&#x7ECF;&#x5386;&#xFF09;&#x3002;</h4><p>&#x6211;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x662F;&#x5728;&#x767E;&#x5EA6;, &#x7B2C;&#x4E8C;&#x4EFD;&#x5DE5;&#x4F5C;&#x5728; 360&#xFF0C;&#x90FD;&#x662F;&#x5E38;&#x8BF4;&#x7684; Web &#x5F00;&#x53D1;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4ECE;&#x6765;&#x4E0D;&#x662F;&#x4EC5;&#x4EC5;&#x628A;&#x81EA;&#x5DF1;&#x5F53;&#x4F5C;&#x4E00;&#x4E2A; Web &#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x6216;&#x8005;&#x67D0;&#x4E2A;&#x8BED;&#x8A00;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6765;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x6211;&#x5F00;&#x53D1;&#x8FC7;&#x6536;&#x8D39;&#x7684; Mac OS X &#x8F6F;&#x4EF6;&#x548C; iOS &#x8F6F;&#x4EF6;&#x5E76;&#x6709;&#x53EF;&#x89C2;&#x7684;&#x7528;&#x6237;&#x91CF;&#x3002;</p>
<p>&#x76EE;&#x524D;&#xFF0C;&#x6211;&#x548C;&#x51E0;&#x4E2A;&#x670B;&#x53CB;&#x521B;&#x529E;&#x4E86;&#x61D2;&#x6295;&#x8D44;(lantouzi.com)&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x91D1;&#x878D;&#x65B9;&#x9762;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x76EE;&#x524D;&#x5728;&#x8BE5;&#x9886;&#x57DF;&#x5DF2;&#x7ECF;&#x5904;&#x5728;&#x9886;&#x5148;&#x8005;&#x884C;&#x5217;&#x3002;</p>
<h4 id="2-&#x4F60;&#x5F00;&#x53D1;_SSDB_&#x662F;&#x57FA;&#x4E8E;&#x4F55;&#x79CD;&#x7F18;&#x7531;&#xFF1F;">2.&#x4F60;&#x5F00;&#x53D1; SSDB &#x662F;&#x57FA;&#x4E8E;&#x4F55;&#x79CD;&#x7F18;&#x7531;&#xFF1F;</h4><p>&#x6211;&#x5F00;&#x53D1; SSDB &#x6570;&#x636E;&#x5E93;&#x7684;&#x76EE;&#xFFFD;&#xFFFD;&#xFFFD;&#x5C31;&#x662F;&#x8981;&#x66FF;&#x4EE3; Redis&#xFF0C;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;SSDB &#x5DF2;&#x7ECF;&#x5728;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x548C;&#x521B;&#x4E1A;&#x56E2;&#x961F;&#x7684;&#x4EA7;&#x54C1;&#x4E2D;&#x66FF;&#x4EE3;&#x4E86; Redis&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x77E5;&#x540D;&#x7684;&#x4F20;&#x7EDF;&#x5927;&#x4F01;&#x4E1A;&#x3002;SSDB &#x4E4B;&#x6240;&#x4EE5;&#x80FD;&#x66FF;&#x4EE3; Redis&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x6210;&#x719F;&#x7A33;&#x5B9A;&#xFF0C;&#x6709;&#x91D1;&#x94B1;&#x6210;&#x672C;&#x4F18;&#x52BF;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x5B58;&#x603B;&#x662F;&#x8981;&#x6BD4;&#x786C;&#x76D8;&#x8D35;&#x5F97;&#x591A;&#x3002;</p>
<h4 id="3-&#x4F60;&#x5E73;&#x65F6;&#x662F;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x548C;&#x7EF4;&#x62A4;_SSDB_&#x9879;&#x76EE;&#x7684;&#xFF1F;">3.&#x4F60;&#x5E73;&#x65F6;&#x662F;&#x5982;&#x4F55;&#x7BA1;&#x7406;&#x548C;&#x7EF4;&#x62A4; SSDB &#x9879;&#x76EE;&#x7684;&#xFF1F;</h4><p>&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4EA7;&#x54C1;&#x4E2D;&#x4F7F;&#x7528;SSDB&#xFF0C;&quot;&#x5403;&#x81EA;&#x5DF1;&#x72D7;&#x7CAE;&quot;&#xFF0C;&#x8FD9;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x5FEB;&#x901F;&#x5730;&#x53D1;&#x73B0;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x65B9;&#x9762;, &#x6211;&#x4F1A;&#x901A;&#x8FC7;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x7F51;&#x7AD9;&#xFF0C;Github&#xFF0C;QQ&#x7FA4;&#xFF0C;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;&#x548C;&#x5FAE;&#x535A;&#x7B49;&#x9014;&#x5F84;&#xFF0C;&#x548C;&#x5927;&#x5BB6;&#x4EA4;&#x6D41;&#xFF0C;&#x6536;&#x96C6;&#x53CD;&#x9988;&#x3002;&#x6211;&#x5F88;&#x9AD8;&#x5174;&#x7684;&#x662F;&#xFF0C;&#x4EA4;&#x6D41;&#x7684;&#x4EBA;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#xFF0C;&#x63D0;&#x4EA4; Pull Request &#x548C; Issue &#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x3002;</p>
<h4 id="4-&#x4E0E;_MongoDB&#x3001;Redis_&#x7B49;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x76F8;&#x6BD4;&#xFF0C;SSDB_&#x7684;&#x6838;&#x5FC3;&#x4F18;&#x52BF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;">4.&#x4E0E; MongoDB&#x3001;Redis &#x7B49;&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x76F8;&#x6BD4;&#xFF0C;SSDB &#x7684;&#x6838;&#x5FC3;&#x4F18;&#x52BF;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h4><p>SSDB &#x4ECE;&#x6765;&#x53EA;&#x548C; Redis &#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#xFF0C;SSDB &#x7684;&#x6838;&#x5FC3;&#x4F18;&#x52BF;&#x662F;&#x5355;&#x5B9E;&#x4F8B;&#x5927;&#x5BB9;&#x91CF;&#x548C;&#x6210;&#x672C;&#x4F18;&#x52BF;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5173;&#x6CE8;&#x548C;&#x4F7F;&#x7528; SSDB&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x548C;&#x5B83;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x9762;&#x5BF9;&#x9762;&#x7684;&#x7F51;&#x4E0A;&#x4EA4;&#x6D41;&#xFF0C;&#x8FD9;&#x79CD;&#x4EB2;&#x5207;&#x611F;&#x662F;&#x4E00;&#x79CD;&#x8F6F;&#x4F18;&#x52BF;&#xFF0C;&#x867D;&#x7136;&#x5B83;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x5F85;&#x6280;&#x672F;&#x4F1A;&#x5F88;&#x4E25;&#x5389;&#x3002;</p>
<p>&#x5982;&#x679C; SSDB &#x975E;&#x8981;&#x548C; MongoDB &#x5BF9;&#x6BD4;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x5C31;&#x662F; MongoDB &#x7684;&#x7528;&#x6237;&#x8E29;&#x4E86;&#x5927;&#x5751;&#x4E4B;&#x540E;&#x7684;&#x81EA;&#x7136;&#x53CD;&#x6620;&#x3002;</p>
<h4 id="5-&#x5728;&#x5F00;&#x53D1;_SSDB_&#x7684;&#x65F6;&#x5019;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x9009;&#x62E9;_NoSQL_&#x6570;&#x636E;&#x5E93;&#xFF1F;">5.&#x5728;&#x5F00;&#x53D1; SSDB &#x7684;&#x65F6;&#x5019;&#x4E3A;&#x4EC0;&#x4E48;&#x4F1A;&#x9009;&#x62E9; NoSQL &#x6570;&#x636E;&#x5E93;&#xFF1F;</h4><p>&#x56E0;&#x4E3A; SSDB &#x7684;&#x4E0A;&#x7684;&#x662F;&#x8981;&#x66FF;&#x4EE3; Redis&#xFF0C;Redis &#x5C31;&#x662F;&#x4E00;&#x4E2A; NoSQL &#x6570;&#x636E;&#x5E93;&#x3002;</p>
<h4 id="6-&#x4F60;&#x80FD;&#x5426;&#x8C08;&#x8C08;_SSDB_&#x548C;_NoSQL_&#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#xFF1F;">6.&#x4F60;&#x80FD;&#x5426;&#x8C08;&#x8C08; SSDB &#x548C; NoSQL &#x672A;&#x6765;&#x7684;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#xFF1F;</h4><p>SSDB &#x7684;&#x672A;&#x6765;&#x65B9;&#x5411;&#x662F;&#x96C6;&#x7FA4;&#xFF0C;&#x4F46;&#x96C6;&#x7FA4;&#x4ECE;&#x6765;&#x5C31;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8B;&#x3002;&#x6211;&#x5E38;&#x5E38;&#x8C03;&#x4F83;&#x90A3;&#x4E9B;&#x8A00;&#x96C6;&#x7FA4;&#x5FC5;&#x79F0;&#x4E00;&#x81F4;&#x6027;&#x54C8;&#x5E0C;&#x7684;&#x6280;&#x672F;&#x534A;&#x6876;&#x6C34;&#xFF0C;&#x597D;&#x50CF;&#x4ED6;&#x4EEC;&#x53E3;&#x4E2D;&#x558A;&#x558A;&#x4E00;&#x4E24;&#x4E2A;&#x540D;&#x8BCD;&#x5C31;&#x80FD;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4F3C;&#x7684;&#xFF0C;&#x5373;&#x4F7F;&#x662F; Redis &#x96C6;&#x7FA4;&#xFF0C;&#x505A;&#x4E86;&#x51E0;&#x5E74;&#x4E5F;&#x6CA1;&#x6709;&#x8FBE;&#x5230;&#x751F;&#x4EA7;&#x8981;&#x6C42;&#x3002;SSDB &#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x53EF;&#x7528;&#x7684;&#x5B9E;&#x9A8C;&#x6027;&#x8D28;&#x7684;&#x96C6;&#x7FA4;&#x96CF;&#x5F62;&#x3002;</p>
<p>&#x201C;&#x672A;&#x6765;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x6BD4;&#x8F83;&#x5927;&#xFF0C;&#x9009;&#x62E9; NoSQL &#x5C31;&#x662F;&#x60F3;&#x8981;&#x9AD8;&#x6027;&#x80FD;&#x548C;&#x5927;&#x5BB9;&#x91CF;(&#x6216;&#x96C6;&#x7FA4;)&#xFF0C;&#x66FE;&#x7ECF;&#x4EBA;&#x4EEC;&#x4EE5;&#x4E3A; KV=NoSQL&#xFF0C;&#x73B0;&#x5728;&#x6CA1;&#x4EBA;&#x8FD9;&#x6837;&#x8BA4;&#x4E3A;&#xFF0C;&#x7ED3;&#x6784;&#x5316;&#x548C;&#x5173;&#x7CFB;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<h4 id="7-&#x4F60;&#x80FD;&#x5426;&#x8C08;&#x4E00;&#x4E0B;&#x4F60;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x7406;&#x89E3;&#xFF1F;&#x4F60;&#x8BA4;&#x4E3A;&#x56FD;&#x5185;&#x5F00;&#x6E90;&#x73B0;&#x72B6;&#x5982;&#x4F55;&#xFF1F;">7.&#x4F60;&#x80FD;&#x5426;&#x8C08;&#x4E00;&#x4E0B;&#x4F60;&#x5BF9;&#x5F00;&#x6E90;&#x7684;&#x7406;&#x89E3;&#xFF1F;&#x4F60;&#x8BA4;&#x4E3A;&#x56FD;&#x5185;&#x5F00;&#x6E90;&#x73B0;&#x72B6;&#x5982;&#x4F55;&#xFF1F;</h4><p>&#x6211;&#x8BA4;&#x4E3A;&#x5F00;&#x6E90;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x662F;&#x6709;&#x5229;&#x65E0;&#x5F0A;&#x7684;&#xFF0C;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x548C;&#x6280;&#x672F;&#x7684;&#x63D0;&#x4F9B;&#x8005;&#xFF0C;&#x68C0;&#x9A8C;&#x4E86;&#x81EA;&#x5DF1;&#xFF0C;&#x6536;&#x83B7;&#x770B;&#x5F97;&#x89C1;&#x548C;&#x770B;&#x4E0D;&#x89C1;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x800C;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x7684;&#x4F7F;&#x7528;&#x8005;&#xFF0C;&#x83B7;&#x5F97;&#x4F4E;&#x6210;&#x672C;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5B66;&#x5230;&#x514D;&#x8D39;&#x7684;&#x6280;&#x672F;&#xFF0C;&#x4E5F;&#x63D0;&#x9AD8;&#x4E86;&#x81EA;&#x5DF1;&#x3002;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x62DB;&#x7A0B;&#x5E8F;&#x5458;&#x65F6;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x6B63;&#x5F0F;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x8BDD;&#xFF0C;&#x76F4;&#x63A5;&#x5F55;&#x7528;&#x3002;&#x80FD;&#x505A;&#x51FA;&#x5B8C;&#x6574;&#x7684;&#x4EA7;&#x54C1;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x4EBA;&#xFF0C;&#x548C;&#x6240;&#x8C13;&#x7684;&#x7801;&#x519C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x7684;&#x9009;&#x624B;&#xFF0C;&#x524D;&#x8005;&#x8981;&#x9AD8;&#x8D35;&#x5F97;&#x591A;&#x3002;&#x800C;&#x505A;&#x51FA;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x4EBA;&#xFF0C;&#x4E0D;&#x4EC5;&#x662F;&#x786C;&#x5B9E;&#x529B;&#x7684;&#x4F53;&#x73B0;&#xFF0C;&#x66F4;&#x662F;&#x5728;&#x81EA;&#x4FE1;&#x5FC3;&#x548C;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#x7B49;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x8F6F;&#x5B9E;&#x529B;&#x4E0A;&#x9762;&#x7684;&#x5B8C;&#x80DC;&#x3002;</p>
<p>&#x56FD;&#x5185;&#x7684;&#x5F00;&#x6E90;&#x6211;&#x8BA4;&#x4E3A;&#x8FD8;&#x4E0D;&#x9519;&#xFF0C;10 &#x5E74;&#x524D;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4F18;&#x79C0;&#x548C;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x548C;&#x4EE3;&#x7801;&#x4E2D;&#x627E;&#x5230;&#x4E2D;&#x56FD;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x90A3;&#x662F;&#x51E4;&#x6BDB;&#x9E9F;&#x89D2;&#xFF0C;&#x5982;&#x4ECA;&#x4E2D;&#x56FD;&#x4EBA;&#x5F00;&#x53D1;&#x548C;&#x4E3B;&#x5BFC;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x666E;&#x904D;&#x3002;&#x8FD9;&#x5176;&#x5B9E;&#x548C;&#x6211;&#x4EEC;&#x793E;&#x4F1A;&#x7684;&#x53D1;&#x5C55;&#x662F;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x3002;&#x4E2D;&#x56FD;&#x5728;&#x5F00;&#x6E90;&#x4E0A;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x548C;&#x4E2D;&#x56FD;&#x7684;&#x6574;&#x4F53;&#x53D1;&#x5C55;&#x4E00;&#x6837;&#xFF0C;&#x89C1;&#x4EC1;&#x89C1;&#x667A;&#x3002;</p>
<p>&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x7A81;&#x51FA;&#x7684;&#x4E8B;&#x6211;&#x60F3;&#x8BF4;&#x8BF4;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5927;&#x90E8;&#x5206;&#x4E2D;&#x56FD;&#x7684;&#x5F00;&#x6E90;&#x4F7F;&#x7528;&#x8005;(&#x6280;&#x672F;&#x4EBA;&#x5458;)&#x7684;&#x63D0;&#x95EE;&#x80FD;&#x529B;&#x5B9E;&#x5728;&#x8BA9;&#x4EBA;&#x65E0;&#x6CD5;&#x606D;&#x7EF4;&#xFF0C;&#x548C;&#x6211;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x770B;&#x5230;&#x7684;&#x56FD;&#x5916;&#x7684;&#x4F1A;&#x63D0;&#x95EE;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x5C31;&#x662F;&#x53E4;&#x4EE3;&#x4E2D;&#x56FD;&quot;&#x79D1;&#x5B66;&quot;&#x548C;&#x897F;&#x65B9;&#x79D1;&#x5B66;&#x7684;&#x533A;&#x522B;&#xFF0C;&#x524D;&#x8005;&#x6CA1;&#x6709;&#x6761;&#x7406;&#x6CA1;&#x6709;&#x903B;&#x8F91;&#x3002;</p>
<h4 id="8-&#x4F60;&#x5BF9;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x6709;&#x4F55;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#xFF1F;">8.&#x4F60;&#x5BF9;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x6709;&#x4F55;&#x610F;&#x89C1;&#x548C;&#x5EFA;&#x8BAE;&#xFF1F;</h4><p>&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x5728;&#x56FD;&#x5185;&#x7684;&#x6280;&#x672F;&#x754C;&#x975E;&#x5E38;&#x6709;&#x4F20;&#x64AD;&#x6027;&#x548C;&#x63A8;&#x5E7F;&#x529B;&#x7684;&#xFF0C;&#x4F46;&#x5C42;&#x6B21;&#x4E0A;&#x4E0D;&#x591F;&#x9AD8;&#x5927;&#x4E0A;&#x3002;&#x6211;&#x89C9;&#x5F97;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x53EF;&#x4EE5;&#x66F4;&#x4E13;&#x6CE8;&#x4E00;&#x4E9B;&#xFF0C;&#x540C;&#x65F6;&#x8981;&#x5411;&#x67D0;&#x4E9B;&#x628A;&#x63E1;&#x4E86;&quot;&#x4E07;&#x4F17;&#x521B;&#x4E1A;&quot;&#x548C;&quot;&#x4E92;&#x8054;&#x7F51;+&quot;&#x7684;&#x516C;&#x53F8;&#x5B66;&#x4E60;&#x3002;</p>
<h4 id="&#x5173;&#x4E8E;&#x5F00;&#x6E90;&#x8BBF;&#x8C08;">&#x5173;&#x4E8E;&#x5F00;&#x6E90;&#x8BBF;&#x8C08;</h4><p>&#x5F00;&#x6E90;&#x8BBF;&#x8C08;&#x662F;&#x5F00;&#x6E90;&#x4E2D;&#x56FD;&#x63A8;&#x51FA;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x9488;&#x5BF9;&#x56FD;&#x5185;&#x5F00;&#x6E90;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x7684;&#x8BBF;&#x8C08;&#xFF0C;&#x4EE5;&#x6587;&#x5B57;&#x7684;&#x65B9;&#x5F0F;&#x8BB0;&#x5F55;&#x5E76;&#x4F20;&#x64AD;&#x3002;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x5F00;&#x6E90;&#x8BBF;&#x8C08;&#x80FD;&#x5168;&#x9762;&#x7684;&#x5C55;&#x73B0;&#x56FD;&#x5185;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x3001;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x4F5C;&#x8005;&#x7684;&#x73B0;&#x72B6;&#xFF0C;&#x7740;&#x5B9E;&#x63A8;&#x52A8;&#x56FD;&#x5185;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x63A8;&#x5E7F;&#x4E0E;&#x5E94;&#x7528;&#x3002;</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/SSDB/">SSDB</a><a href="/tags/开源/">开源</a><a href="/tags/数据库/">数据库</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>






   
    
    <article class="post-expand post" itemprop="articleBody"> 
        <header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/01/f97f90b/" title="clip-path动画分享 -" itemprop="url">clip-path动画分享 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-06-30T23:37:30.000Z" itemprop="datePublished"> 发表于 2015-07-01</time>
    
  </p>
</header>
    <div class="article-content">
        
        <p>CSS&#x6837;&#x5F0F;&#x7684;clip-path&#x6765;&#x6E90;&#x4E8E;SVG&lt;clipPath&gt;&#x5143;&#x7D20;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x672C;&#x8D28;&#x90FD;&#x662F;&#x526A;&#x5207;</p>
<p>&#x6BCF;&#x4E2A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x526A;&#x5207;&#xFF0C;&#x90A3;&#x4E48;clip-path&#x5B9E;&#x73B0;&#x7684;&#x526A;&#x5207;&#x6709;&#x4EC0;&#x4E48;&#x7279;&#x522B;&#x4E4B;&#x5904;&#x5462;&#xFF1F;</p>
<h4 id="&#x5B83;&#x7684;&#x526A;&#x5207;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x5BF9;&#x8C61;">&#x5B83;&#x7684;&#x526A;&#x5207;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x662F;&#x4EFB;&#x610F;&#x5BF9;&#x8C61;</h4><p>&#x4F60;&#x6574;&#x4E2A;HTML&#x9875;&#x9762;&#x4E5F;&#x597D;&#xFF0C;&#x4E00;&#x4E2A;form&#x8868;&#x5355;&#x4E5F;&#x597D;&#xFF0C;&#x56FE;&#x7247;&#x4E5F;&#x597D;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x53EF;&#x4EE5;&#x53D8;&#x6210;&#x4E00;&#x5757;&#x4E00;&#x5757;&#x7684;</p>
<p>&#x5728;&#x770B;&#x6548;&#x679C;&#x4E4B;&#x524D;&#x5148;&#x68C0;&#x67E5;&#x4E00;&#x4E2A;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x517C;&#x5BB9;&#x60C5;&#x51B5;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p>
<p><img src="http://taojinke.github.io/img/20150701/f97cf8a.png" alt=""></p>
<p>IE&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x652F;&#x6301;&#xFF0C;&#x5C3D;&#x91CF;&#x4F7F;&#x7528;webkit&#x5185;&#x6838;&#xFF0C;&#x9700;&#x8981;&#x52A0;&#x4E0A;&#x5185;&#x6838;&#x524D;&#x7F00;-webkit-</p>
<p>&#x597D;&#x4E86;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5C31;&#x662F;&#x6817;&#x5B50;&#x4E86;&#xFF0C;&#x6574;&#x7247;&#x6587;&#x7AE0;&#x591A;&#x56FE;~</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#x7684;&#x9759;&#x6001;&#x9875;&#x9762;</p>
<p><img src="http://taojinke.github.io/img/20150701/f97cf8a.png" alt=""></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5BF9;&#x5176;&#x7B80;&#x5355;&#x7684;&#x526A;&#x5207;&#x4E0B;</p>
<p><img src="http://taojinke.github.io/img/20150701/f97d1fb.png" alt=""></p>
<p>&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#x4EE3;&#x7801;</p>
<table><tr><td> -  webkit  -  clip  -  path  :  polygon  (  0  0  ,  750px  0  ,  750px  500px  )  ;<br><br></td></tr></table>

<p>&#x5229;&#x7528;polygon&#x591A;&#x8FB9;&#x5F62;&#x7ED9;&#x51FA;&#x4E86;&#x4E09;&#x4E2A;&#x70B9;&#xFF0C;&#x753B;&#x4E86;&#x4E00;&#xFFFD;&#xFFFD;&#xFFFD;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5C06;&#x6574;&#x4E2A;&#x56FE;&#x5207;&#x5272;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;</p>
<p>&#x7ED9;&#x591A;&#x4E86;&#x7684;&#x70B9;&#x7684;&#x8BDD;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x5404;&#x79CD;&#x5F62;&#x72B6;&#xFF0C;&#x6BD4;&#x5982;&#x56DB;&#x8FB9;&#x5F62;&#xFF0C;&#x4E94;&#x89D2;&#x661F;&#xFF0C;&#x516D;&#x8FB9;&#x5F62;&#x7B49;&#x7B49;&#x2026;&#x2026;</p>
<p>&#x76EE;&#x524D;&#x6765;&#x8BF4;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x4EAE;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;clip-path&#x91CC;&#x9762;&#x7684;&#x6570;&#x503C;&#x53D8;&#x5316;&#x53EF;&#x4EE5;&#x89E6;&#x53D1;transition&#x7684;&#x8BDD;&#x90A3;&#x77AC;&#x95F4;&#x5C31;&#x4E0D;&#x4E00;&#x6837;&#x4E86;</p>
<p>&#x6240;&#x4EE5;&#x5173;&#x4E8E;clip-path&#x7684;&#x5927;&#x90E8;&#x5206;&#x52A8;&#x753B;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF0C;&#x6211;&#x7ED9;&#x51FA;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;</p>
<p><img src="http://taojinke.github.io/img/20150701/f97d46c.gif" alt=""></p>
<p>&#x672C;&#x8EAB;&#x6548;&#x679C;&#x662F;&#x6BEB;&#x65E0;&#x5361;&#x987F;&#x611F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5F55;&#x5236;&#x6210;gif&#x5E0C;&#x671B;&#x6587;&#x4EF6;&#x8F83;&#x5C0F;&#x6240;&#x4EE5;&#x5E27;&#x95F4;&#x9694;&#x8F83;&#x5927;&#xFF0C;&#x663E;&#x5F97;&#x6BD4;&#x8F83;&#x5361;</p>
<p>&#x7531;&#x4E8E;clip-path&#x526A;&#x5207;&#x51FA;&#x6765;&#x7684;&#x90E8;&#x5206;&#x548C;&#x6B63;&#x5E38;&#x7684;DOM&#x8282;&#x70B9;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x6837;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x5F88;&#x591A;&#x5173;&#x4E8E;DOM&#x8282;&#x70B9;&#x7684;&#x64CD;&#x4F5C;&#x4E5F;&#x53EF;&#x4EE5;&#x7ED9;&#x5B83;&#x52A0;&#x4E0A;&#xFF0C;&#x6BD4;&#x5982;&#x2026;&#x2026;</p>
<p>3D&#x52A8;&#x753B;&#xFF01;</p>
<p>&#x4E4B;&#x524D;&#x7684;&#x957F;&#x65B9;&#x5F62;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x957F;&#x65B9;&#x5F62;&#x53D8;&#x6210;&#x591A;&#x4E2A;&#x4E09;&#x89D2;&#x5F62;&#x5462;&#xFF0C;&#x7136;&#x540E;&#x4ED6;&#x4EEC;&#x8FDB;&#x884C;3D&#x53D8;&#x5316;&#x4E86;&#x5462;&#xFF1F;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x5236;&#x4F5C;&#x7684;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6548;&#x679C;</p>
<p><img src="http://taojinke.github.io/img/20150701/f97d6dd.gif" alt=""></p>
<p>&#x8FD9;&#x91CC;&#x6211;&#x8FDB;&#x884C;&#x4E86;3D&#x53D8;&#x5316;&#xFF0C;&#x968F;&#x673A;&#x52A8;&#x6001;&#x7684;&#x6539;&#x53D8;&#x5176;rotateXYZ&#x3001;translate3D&#x7684;&#x503C;&#xFF0C;&#x5982;&#x679C;&#x5B9E;&#x73B0;&#x786E;&#x5B9A;&#x597D;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x6298;&#x7EB8;&#x554A;&#xFF0C;&#x6298;&#x53E0;&#x4E4B;&#x7C7B;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x5C31;&#x4E0D;&#x6F14;&#x793A;&#x4E86;&#xFF0C;&#x9053;&#x7406;&#x8BF4;&#x9053;&#x5C31;&#x597D;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;&#x7ECF;&#x8FC7;clip-path&#x526A;&#x5207;&#x4E4B;&#x540E;&#x7684;&#x5143;&#x7D20;&#xFF0C;background-color&#x548C;background-image&#x540C;&#x65F6;&#x4F7F;&#x7528;&#x4F1A;&#x4EA7;&#x751F;bug&#xFF0C;&#x4F1A;&#x6709;&#x8FB9;&#x7F18;&#x7EBF;&#x4EA7;&#x751F;&#xFF0C;&#x8BF7;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF01;</p>
<p>&#x5206;&#x4EAB;&#x4E00;&#x4E2A;&#x52A8;&#x753B;&#x732E;&#x7ED9;AlloyTeam&#xFF0C;&#x6BD5;&#x7ADF;&#x662F;&#x5728;&#x8FD9;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x7BC7;&#x6587;&#xFF01;&#x52A8;&#x753B;&#x524D;&#x534A;&#x90E8;&#x5206;&#x548C;&#x540E;&#x534A;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x4F7F;&#x7528;clip-path&#x5B9E;&#x73B0;&#x7684;</p>
<p><img src="http://taojinke.github.io/img/20150701/f97d94e.gif" alt=""></p>
<p>&#x7531;&#x4E8E;&#x52A8;&#x753B;&#x65F6;&#x95F4;&#x8F83;&#x957F;&#xFF0C;&#x7279;&#x5730;&#x7F29;&#x5C0F;&#x4E86;&#x5F55;&#x5236;&#x533A;&#x57DF;&#x6765;&#x907F;&#x514D;&#x6587;&#x4EF6;&#x8FC7;&#x5927;&#xFF0C;&#x663E;&#x5F97;&#x8FD8;&#x662F;&#x6709;&#x70B9;&#x5361;&#x987F;&#xFF0C;&#x771F;&#x5B9E;&#x60C5;&#x51B5;&#x4E0B;&#x771F;&#x7684;&#x8FD8;&#x597D;&#x2026;&#x2026;</p>
<p>&#x6700;&#x540E;&#x63D0;&#x4E00;&#x4E0B;&#x6BD5;&#x7ADF;&#x5229;&#x7528;clip-path&#x9891;&#x7E41;&#x64CD;&#x4F5C;DOM&#xFF0C;&#x7B80;&#x5355;&#x4E00;&#x70B9;&#x7684;&#x8FD8;&#x597D;&#xFF0C;&#x5982;&#x679C;&#x662F;&#x7279;&#x522B;&#x590D;&#x6742;&#xFF0C;&#x6216;&#x8005;&#x50CF;&#x6211;&#x8FD9;&#x4E2A;&#x52A8;&#x753B;&#x91CC;&#x9762;&#x788E;&#x56FE;&#x7684;&#x5757;&#x518D;&#x591A;&#x4E00;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x4F1A;&#x5361;&#x5230;&#x4F60;&#x6293;&#x72C2;</p>
<p>&#x6240;&#x4EE5;&#x505A;&#x52A8;&#x753B;&#x8FD8;&#x662F;Canvas&#x5927;&#x6CD5;&#x597D;~&#x90A3;&#x4E48;&#x4E0B;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x8FD8;&#x662F;&#x52A8;&#x753B;&#xFF0C;&#x4E0D;&#x8FC7;&#x662F;Canvas&#x76F8;&#x5173;</p>
<p>&#x7ED3;&#xFFFD;&#xFFFD;&#xFFFD;&#xFF1A;&#x6574;&#x7BC7;&#x6587;&#x7AE0;&#x4EE3;&#x7801;&#x5F88;&#x5C11;&#xFF08;&#x5C31;&#x662F;&#x6CA1;&#x6709;&#x4EE3;&#x7801;&#x2026;&#x2026;&#xFF09;&#xFF0C;&#x6CA1;&#x6709;&#x628A;&#x67D0;&#x4E2A;&#x6548;&#x679C;&#x5177;&#x4F53;&#x4ECE;&#x5F00;&#x59CB;&#x7B2C;&#x4E00;&#x79D2;&#x5230;&#x6700;&#x540E;&#x4E00;&#x79D2;&#x5177;&#x4F53;&#x53BB;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;clip-path&#x672C;&#x8EAB;&#x4E0D;&#x96BE;&#xFF0C;&#x4E5F;&#x4E0D;&#x7B97;&#x4EC0;&#x4E48;&#x65B0;&#x4E1C;&#x897F;~&#x6709;&#x54EA;&#x4E9B;&#x5C5E;&#x6027;&#x503C;&#xFF0C;&#x600E;&#x4E48;&#x4F7F;&#x7528;&#xFF0C;&#x7F51;&#x4E0A;&#x4E00;&#x641C;&#x4E00;&#x5927;&#x5806;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x7F57;&#x5217;&#x4E86;&#x554A;~&#x5982;&#x679C;&#x6709;&#x4EC0;&#x4E48;&#x7591;&#x95EE;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#x543C;&#x543C;~</p>

        
        
        <p class="article-more-link">
          
       </p>
    </div>
    <footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/Canvas/">Canvas</a><a href="/tags/WebKit/">WebKit</a>
  </div>

</div>




<div class="comments-count">
	
</div>

</footer>


    </article>







  <nav id="page-nav" class="clearfix">
    <a class="extend prev" rel="prev" href="/page/22/"><span></span>Prev</a><a class="page-number" href="/">1</a><span class="space">&hellip;</span><a class="page-number" href="/page/21/">21</a><a class="page-number" href="/page/22/">22</a><span class="page-number current">23</span><a class="page-number" href="/page/24/">24</a><a class="page-number" href="/page/25/">25</a><span class="space">&hellip;</span><a class="page-number" href="/page/30/">30</a><a class="extend next" rel="next" href="/page/24/">Next<span></span></a>
  </nav>

</div>
      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>294</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>64</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>42</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>30</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/Mac-OS-X/" title="Mac OS X">Mac OS X<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>9</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>7</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-JAVA/" title="分类： JAVA">分类： JAVA<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Java8/" title="Java8">Java8<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Ubuntu/" title="Ubuntu">Ubuntu<sup>6</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/分类：-java/" title="分类： java">分类： java<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/函数式编程/" title="函数式编程">函数式编程<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Apple/" title="Apple">Apple<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/Ruby/" title="Ruby">Ruby<sup>5</sup></a></li>
			
		
			
				<li><a href="/tags/PaaS/" title="PaaS">PaaS<sup>4</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
        
    }
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
 </html>
