
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>“NodeJS在大搜车” 之 MVC基础结构 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x957F;&amp;#x957F;&amp;#x800C;&amp;#x4E14;&amp;#x65E0;&amp;#x5173;&amp;#x7684;&amp;#x524D;&amp;#x8A00;&amp;#x7ECF;&amp;#x5E38;&amp;#x4F1A;&amp;#x6709;&amp;#x540C;&amp;#x5B66;&amp;#x6765;&amp;#x95EE;&amp;#x6211;&amp;#x524D;&amp;#x7AEF;&amp;#x662F;&amp;#x5426;&amp;#x9002;&amp;#x5408;&amp;#x5411;">
<meta property="og:type" content="article">
<meta property="og:title" content="“NodeJS在大搜车” 之 MVC基础结构 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/02/9fde8b0/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x957F;&amp;#x957F;&amp;#x800C;&amp;#x4E14;&amp;#x65E0;&amp;#x5173;&amp;#x7684;&amp;#x524D;&amp;#x8A00;&amp;#x7ECF;&amp;#x5E38;&amp;#x4F1A;&amp;#x6709;&amp;#x540C;&amp;#x5B66;&amp;#x6765;&amp;#x95EE;&amp;#x6211;&amp;#x524D;&amp;#x7AEF;&amp;#x662F;&amp;#x5426;&amp;#x9002;&amp;#x5408;&amp;#x5411;">
<meta property="og:image" content="http://taojinke.github.io/img/20150702/9fdd2b7.png">
<meta property="og:updated_time" content="2015-07-02T15:04:23.925Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="“NodeJS在大搜车” 之 MVC基础结构 -">
<meta name="twitter:description" content="&amp;#x957F;&amp;#x957F;&amp;#x800C;&amp;#x4E14;&amp;#x65E0;&amp;#x5173;&amp;#x7684;&amp;#x524D;&amp;#x8A00;&amp;#x7ECF;&amp;#x5E38;&amp;#x4F1A;&amp;#x6709;&amp;#x540C;&amp;#x5B66;&amp;#x6765;&amp;#x95EE;&amp;#x6211;&amp;#x524D;&amp;#x7AEF;&amp;#x662F;&amp;#x5426;&amp;#x9002;&amp;#x5408;&amp;#x5411;">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/02/9fde8b0/" title="“NodeJS在大搜车” 之 MVC基础结构 -" itemprop="url">“NodeJS在大搜车” 之 MVC基础结构 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-02T03:04:23.000Z" itemprop="datePublished"> 发表于 2015-07-02</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#长长而且无关的前言"><span class="toc-number">1.</span> <span class="toc-text">长长而且无关的前言</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#1-_Controller，Model，View。"><span class="toc-number">2.</span> <span class="toc-text">1. Controller，Model，View。</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#2-_Service"><span class="toc-number">3.</span> <span class="toc-text">2. Service</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#3-_Route"><span class="toc-number">4.</span> <span class="toc-text">3. Route</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#4-_ORM"><span class="toc-number">5.</span> <span class="toc-text">4. ORM</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#5-_Util"><span class="toc-number">6.</span> <span class="toc-text">5. Util</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#6-_filter"><span class="toc-number">7.</span> <span class="toc-text">6. filter</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#小结。"><span class="toc-number">8.</span> <span class="toc-text">小结。</span></a></li></ol>
		
		</div>
		
		<h2 id="&#x957F;&#x957F;&#x800C;&#x4E14;&#x65E0;&#x5173;&#x7684;&#x524D;&#x8A00;">&#x957F;&#x957F;&#x800C;&#x4E14;&#x65E0;&#x5173;&#x7684;&#x524D;&#x8A00;</h2><p>&#x7ECF;&#x5E38;&#x4F1A;&#x6709;&#x540C;&#x5B66;&#x6765;&#x95EE;&#x6211;&#x524D;&#x7AEF;&#x662F;&#x5426;&#x9002;&#x5408;&#x5411;NodeJS&#x65B9;&#x5411;&#x53D1;&#x5C55;&#xFF0C;&#x5176;&#x5B9E;&#x5927;&#x591A;&#x6570;&#x65F6;&#x5019;&#x6211;&#x662F;&#x62D2;&#x7EDD;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5176;&#x5B9E;&#x524D;&#x7AEF;&#x63A5;&#x89E6;&#x4E00;&#x4E0B;NodeJS&#x8FD9;&#x4E2A;&#x4E1C;&#x897F;&#x672C;&#x8EAB;&#x6211;&#x662F;&#x4E0D;&#x6392;&#x65A5;&#x7684;&#xFF0C;&#x6BD5;&#x7ADF;&#x662F;&#x57FA;&#x4E8E;JS&#xFF0C;&#x80FD;&#x591F;&#x638C;&#x63E1;&#x4E00;&#x95E8;&#x624B;&#x827A;&#xFF0C;&#x62D3;&#x5C55;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x89C6;&#x91CE;&#xFF0C;&#x7136;&#x540E;&#x5199;&#x4E00;&#x4E9B;&#x8BFB;&#x5199;&#x6587;&#x4EF6;&#xFF0C;grunt&#x63D2;&#x4EF6;&#x4E4B;&#x7C7B;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x4E5F;&#x662F;&#x6781;&#x597D;&#x7684;&#x3002;&#x6211;&#x6240;&#x8C13;&#x7684;&#x62D2;&#x7EDD;&#xFF0C;&#x4E3B;&#x8981;&#x662F;&#x57FA;&#x4E8E;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x8003;&#x8651;&#xFF0C;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x60F3;&#x501F;NodeJS&#x8F7B;&#x8F7B;&#x677E;&#x677E;&#x7684;&#x628A;&#x9B54;&#x722A;&#x4F38;&#x5411;&#x7EAF;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#xFF0C;NodeJS&#x672C;&#x8EAB;&#x5BF9;&#x4E8E;&#x524D;&#x7AEF;&#x6765;&#x8BF4;&#x662F;&#x6781;&#x5176;&#x5BB9;&#x6613;&#x638C;&#x63E1;&#x7684;&#xFF0C;&#x7167;&#x7740;&#x6587;&#x6863;&#x5199;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E5F;&#x662F;&#x6781;&#x5176;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x540C;&#x5B66;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x4E00;&#x4E0B;&#x5B50;&#x8DE8;&#x8FDB;&#x4E86;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#x7684;&#x5927;&#x95E8;&#xFF0C;&#x7136;&#x800C;&#xFF0C;&#x771F;&#x662F;&#x5982;&#x6B64;&#x4E48;&#xFF1F;</p>
<p>&#x73B0;&#x5728;&#x5F88;&#x591A;&#x6280;&#x672F;&#x65B9;&#x9762;&#x7684;&#x8425;&#x9500;&#x6587;&#xFF0C;&#x837C;&#x6BD2;&#xFF01;&#x8BA9;&#x65B0;&#x4EBA;&#x53D8;&#x5F97;&#x4E5F;&#x6D6E;&#x8E81;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x9762;&#x524D;&#x6709;&#x4E00;&#x4E2A;&#x725B;&#x903C;&#x7684;&#x524D;&#x7AEF;&#x548C;&#x725B;&#x903C;&#x7684;PHP&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x8BA9;&#x6211;&#x9009;&#x4E00;&#x4E2A;&#x6765;&#x8F6C;&#x578B;NodeJS&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#xFF0C;&#x6211;&#x4F1A;&#x6BEB;&#x4E0D;&#x72B9;&#x8C6B;&#x7684;&#x9009;&#x62E9;PHP&#x3002;&#x8FD9;&#x6837;&#x6211;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BA9;&#x4ED6;&#x53BB;&#x770B;&#x4E00;&#x4E2A;&#x5468;&#x7684;JS&#x8BED;&#x6CD5;&#xFF0C;&#x7ED9;&#x4ED6;&#x82B1;&#x4E00;&#x5929;&#x8BB2;&#x89E3;&#x4E0B;callback&#xFF08;&#x5BF9;php&#xFF0C;java&#xFF0C;ruby&#x6765;&#x8BF4;&#x8FD9;&#x4E2A;&#x7684;&#x786E;&#x5F88;&#x96BE;&#x7406;&#x89E3;&#xFF09;&#xFF0C;&#x82B1;&#x4E00;&#x70B9;&#x65F6;&#x95F4;&#x719F;&#x6089;&#x4E0B;nodejs&#x7684;&#x6A21;&#x5757;&#x548C;&#x5199;&#x6CD5;&#x3002;&#x7136;&#x540E;&#x4E0B;&#x9762;&#x5C31;&#x5F88;&#x987A;&#x7545;&#x4E86;&#x3002;</p>
<p>&#x800C;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x524D;&#x7AEF;&#xFF0C;&#x597D;&#x55BD;&#xFF0C;&#x9EBB;&#x70E6;&#x55BD;&#xFF0C;&#x4EE5;&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x5806;&#x79EF;&#x4E1A;&#x52A1;&#x4E48;&#xFF1F;&#x670D;&#x52A1;&#x7AEF;&#x903B;&#x8F91;&#x90A3;&#x4E48;&#x7D27;&#x5BC6;&#xFF0C;&#x5982;&#x4F55;hold&#x4F4F;&#xFF1F;&#x670D;&#x52A1;&#x7AEF;&#x8DDF;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x7684;&#x8026;&#x5408;&#xFF0C;&#x5982;&#x4F55;hold&#x4F4F;&#xFF1F;&#x6574;&#x4F53;&#x4E1A;&#x52A1;&#x7684;&#x628A;&#x63E1;&#xFF0C;&#x8BF7;&#x6C42;&#x91CF;&#x592A;&#x5927;&#x5929;&#x5929;&#x6302;&#xFF0C;IO&#x74F6;&#x9888;&#x4E86;&#x5982;&#x4F55;&#x641E;&#x5B9A;&#xFF0C;&#x7F13;&#x5B58;&#x8BE5;&#x600E;&#x4E48;&#x7528;&#xFF0C;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#xFF0C;&#x5206;&#x5C42;&#x5982;&#x4F55;&#x8BBE;&#x8BA1;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5982;&#x4F55;&#x4F18;&#x5316;&#xFF0C;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x8C03;&#x8BD5;&#xFF0C;&#x5982;&#x4F55;&#x5206;&#x6790;&#x5185;&#x5B58;&#x6CC4;&#x9732;&#xFF0C;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x5199;&#x6CA1;&#x5199;&#x8FC7;&#xFF0C;HTTP&#x539F;&#x7406;&#x4E86;&#x89E3;&#x591A;&#x5C11;&#xFF0C;Nginx&#x914D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x90E8;&#x7F72;&#x77E5;&#x9053;&#x51E0;&#x4F55;&#xFF0C;&#x6027;&#x80FD;&#x76D1;&#x63A7;&#x8DDF;&#x8E2A;&#x5462;&#xFF1F;</p>
<p>&#x626F;&#x8FDC;&#x4E86;&#x3002;</p>
<p>&#x5176;&#x5B9E;&#x6211;&#x672C;&#x6765;&#x53EA;&#x662F;&#x60F3;&#x8BF4;&#x4E00;&#x4E0B;&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#x601D;&#x7EF4;&#x5728;NodeJS&#x5F00;&#x53D1;&#x65B9;&#x9762;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x800C;&#x4ECA;&#x5929;&#x8981;&#x5206;&#x4EAB;&#x7684;&#x5C31;&#x662F;&#x5176;&#x4E2D;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF1A;MVC&#x3002;</p>
<p>&#x5728;&#x5199;NodeJS&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x5199;&#x8FC7;&#x4E00;&#x9635;Java&#xFF0C;&#x57FA;&#x4E8E;spring&#x6846;&#x67B6;&#xFF0C;&#x6240;&#x4EE5;&#x601D;&#x7EF4;&#x4E2D;&#x5BF9;MVC&#x6A21;&#x5F0F;&#x4E5F;&#x7B97;&#x6709;&#x4E2A;&#x6BD4;&#x8F83;&#x7B80;&#x5355;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x6784;&#x5EFA;NodeJS&#x6846;&#x67B6;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x591A;&#x5C11;&#x5E26;&#x5165;&#x4E86;&#x4E00;&#x70B9;Spring&#x7684;&#x601D;&#x7EF4;&#x3002;</p>
<p>&#x57FA;&#x672C;&#x8981;&#x7D20;&#xFF1A;</p>
<h2 id="1-_Controller&#xFF0C;Model&#xFF0C;View&#x3002;">1. Controller&#xFF0C;Model&#xFF0C;View&#x3002;</h2><p>&#x4E09;&#x8981;&#x7D20;&#x5566;&#xFF0C;&#x4E0D;&#x7528;&#x8D28;&#x7591;&#xFF0C;&#x518D;&#x590D;&#x8FF0;&#x4E00;&#x904D;&#x3002;</p>
<p>Controller &#xFF0C;&#x8D1F;&#x8D23;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x662F;&#x4E2D;&#x67A2;&#xFF0C;&#x8FDE;&#x63A5;&#x6570;&#x636E;&#x548C;&#x89C6;&#x56FE;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x4E0D;&#x8FC7;controller&#x4E00;&#x822C;&#x4E0D;&#x4F1A;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x4E2D;&#x95F4;&#x9700;&#x8981;&#x518D;&#x52A0;&#x4E00;&#x5C42;&#xFF0C;&#x8FD9;&#x4E2A;&#x540E;&#x9762;&#x8BF4;&#x3002;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;controller&#x91CC;&#xFF0C;&#x5E94;&#x8BE5;&#x8C03;&#x7528;&#x5404;&#x65B9;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x540E;&#x7EC4;&#x88C5;&#x6210;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x6570;&#x636E;&#x4F20;&#x7ED9;&#x89C6;&#x56FE;&#x3002;</p>
<p>Model&#xFF0C;&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;Model&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5C42;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x6211;&#x4EEC;&#x7684;NodeJS&#x9879;&#x76EE;&#x4E2D;&#xFF0C;Model&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;ORM&#x62BD;&#x8C61;&#x6210;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x53D8;&#x6210;&#x4E86;&#x5B9E;&#x4F53;&#x5B9A;&#x4E49;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E5F;&#x662F;&#x540E;&#x9762;&#x5177;&#x4F53;&#x8BB2;&#x3002;</p>
<p>View&#xFF0C;&#x89C6;&#x56FE;&#x5C42;&#xFF0C;&#x4E00;&#x822C;&#x901A;&#x8FC7;&#x6A21;&#x677F;&#x5F15;&#x64CE;&#x628A;&#x6570;&#x636E;&#x6E32;&#x67D3;&#x6210;&#x52A8;&#x6001;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x7EDF;&#x4E00;&#x4F7F;&#x7528;Jade&#xFF0C;Jade&#x7684;&#x7ED3;&#x6784;&#x4E25;&#x683C;&#x6E05;&#x6670;&#xFF0C;&#x901F;&#x5EA6;&#x4E5F;&#x591F;&#x5FEB;&#xFF0C;&#x529F;&#x80FD;&#x591F;&#x4E30;&#x5BCC;&#xFF0C;&#x65E0;&#x5B83;&#x3002;</p>
<h2 id="2-_Service">2. Service</h2><p>&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x662F;&#x4ECE;Spring&#x91CC;&#x9762;&#x5B66;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x611F;&#x89C9;Service&#x8FD9;&#x4E2A;&#x8BCD;&#x672C;&#x8EAB;&#x5C31;&#x5F88;&#x80FD;&#x4EE3;&#x8868;&#x8FD9;&#x4E2A;&#x5206;&#x5C42;&#x6240;&#x62C5;&#x5F53;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x5C42;&#x3002;</p>
<p>&#x4EC0;&#x4E48;&#x662F;&#x670D;&#x52A1;&#x5462;&#xFF1F;&#x5B83;&#x51CC;&#x9A7E;&#x4E8E;&#x6570;&#x636E;&#x5C42;&#x4E4B;&#x4E0A;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x8FDB;&#x884C;&#x62BD;&#x8C61;&#xFF0C;&#x901A;&#x8FC7;&#x670D;&#x52A1;&#x7C7B;&#x578B;&#x62BD;&#x8C61;&#x6210;&#x4E0D;&#x540C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x4F9B;&#x7ED9;&#x4E0D;&#x540C;&#x7684;&#x4E1A;&#x52A1;&#x8C03;&#x7528;&#x3002;&#x4F8B;&#x5982;&#x5728;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#x6700;&#x57FA;&#x7840;&#x7684;&#x51E0;&#x4E2A;&#x670D;&#x52A1;&#xFF1A;&#x8F66;&#x8F86;&#x6570;&#x636E;&#x670D;&#x52A1;&#xFF0C;&#x7528;&#x6237;&#x6570;&#x636E;&#x670D;&#x52A1;&#xFF0C;&#x63A8;&#x9001;&#x670D;&#x52A1;&#xFF0C;&#x641C;&#x7D22;&#x670D;&#x52A1;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x5927;&#x90E8;&#x5206;&#x4E0D;&#x662F;&#x5355;&#x7EAF;&#x7684;&#x64CD;&#x4F5C;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x8868;&#x4E4B;&#x7C7B;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x9876;&#x5C42;&#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x56E0;&#x4E3A;&#x8F66;&#x8F86;&#x76F8;&#x5173;&#x7684;&#x4E1A;&#x52A1;&#x53EF;&#x80FD;&#x6709;&#x5F88;&#x591A;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x4F8B;&#x5982;&#x8F66;&#x8F86;&#x57FA;&#x7840;&#x4FE1;&#x606F;&#xFF0C;&#x8F66;&#x8F86;&#x5BA1;&#x6838;&#x4FE1;&#x606F;&#xFF0C;&#x5404;&#x79CD;&#x72B6;&#x6001;&#x53D8;&#x66F4;&#x8BB0;&#x5F55;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x800C;&#x4E14;&#x4F1A;&#x6A2A;&#x8DE8;&#x5728;mysql&#xFF0C;mongodb&#xFF0C;&#x4EE5;&#x53CA;redis&#x7F13;&#x5B58;&#x4E4B;&#x95F4;&#x7684;&#x5404;&#x79CD;&#x903B;&#x8F91;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x79CD;&#x79CD;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x901A;&#x8FC7;service&#x5C42;&#x5B8C;&#x5168;&#x9690;&#x85CF;&#x8D77;&#x6765;&#xFF0C;&#x628A;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x53D8;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x4E2A;&#x9488;&#x5BF9;&#x8F66;&#x8F86;&#x7684;&#x201C;&#x64CD;&#x4F5C;&#x201D;&#x3002;&#x8FD9;&#x5C31;&#x662F;service&#x6700;&#x540E;&#x63D0;&#x4F9B;&#x51FA;&#x6765;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x201C;&#x64CD;&#x4F5C;&#x201D;&#x3002;</p>
<p>&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x5176;&#x5B9E;service&#x5C42;&#x662F;&#x6574;&#x4E2A;&#x67B6;&#x6784;&#x4E2D;&#x6700;&#x91CD;&#x7684;&#x4E00;&#x5C42;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x90FD;&#x96C6;&#x4E2D;&#x4E8E;&#x8FD9;&#x4E00;&#x5C42;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x8FDB;&#x6765;&#xFF0C;&#x8FDB;&#x5165;controller&#x7684;&#x65F6;&#x5019;&#xFF0C;controller&#x5C31;&#x4F1A;&#x8C03;&#x7528;&#x5404;&#x4E2A;service&#x6765;&#x62FC;&#x88C5;&#x670D;&#x52A1;&#x6570;&#x636E;&#xFF0C;&#x6700;&#x540E;&#x628A;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x7ED9;&#x524D;&#x7AEF;&#x3002;&#x5230;&#x6B64;&#xFF0C;&#x5176;&#x5B9E;service&#x5C42;&#x662F;&#x505A;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x6709;&#x5176;&#x5B58;&#x5728;&#x7684;&#x5FC5;&#x8981;&#x5C31;&#x5F88;&#x6E05;&#x695A;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF0C;&#x4E00;&#x4E2A;&#x6E05;&#x6670;&#x7684;MVC&#x91CC;&#xFF0C;controller&#x91CC;&#x4E0D;&#x5E94;&#x8BE5;&#x6709;&#x4EFB;&#x4F55;&#x76F4;&#x63A5;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x6240;&#x6709;&#x64CD;&#x4F5C;&#x90FD;&#x8C03;&#x7528;service&#x5C42;&#x6765;&#x64CD;&#x4F5C;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;controller&#x624D;&#x80FD;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x201C;&#x5E72;&#x51C0;&#x7684;controller&#x201D;&#x3002;</p>
<h2 id="3-_Route">3. Route</h2><p>&#x54A6;&#xFF0C;&#x5947;&#x602A;&#x7684;&#x4E00;&#x5C42;&#xFF0C;Route&#x8DDF;controller&#x6709;&#x5565;&#x533A;&#x522B;&#xFF1F;&#x600E;&#x4E48;&#x8BF4;&#x5462;&#xFF0C;&#x5F88;&#x96BE;&#x5206;&#x6E05;&#x3002;controller&#x662F;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x8FDB;&#x6765;&#x4E4B;&#x540E;&#x5904;&#x7406;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x800C;route&#x5219;&#x5B9A;&#x4E49;&#x4E86;&#x8BF7;&#x6C42;&#x5E94;&#x8BE5;&#x8FDB;&#x5165;&#x90A3;&#x4E2A;controller&#x3002;</p>
<p>&#x8FD9;&#x91CC;&#x628A;Route&#x5355;&#x72EC;&#x62FF;&#x51FA;&#x6765;&#x8BF4;&#xFF0C;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5C55;&#x793A;&#x4E0B;&#x6211;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x7BA1;&#x7406;Route&#x7684;&#x3002;&#x90A3;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x5C0F;&#x5E93;&#xFF1A;rainbowy&#x3002;</p>
<p>&#x8FD9;&#x4E2A;&#x73A9;&#x610F;&#x7684;&#x4F5C;&#x7528;&#x662F;&#xFF1A;&#x7528;&#x6587;&#x4EF6;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x81EA;&#x52A8;&#x751F;&#x6210;route&#x3002;&#x6069;&#x5C31;&#x662F;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x7ED9;&#x4ED6;&#x96C6;&#x6210;&#x4E86;&#x4E00;&#x4E9B;&#x5C0F;&#x7279;&#x8272;&#xFF0C;&#x4F8B;&#x5982;&#x5728;route&#x4E2D;&#x76F4;&#x63A5;&#x5B9A;&#x4E49;&#x63A5;&#x53E3;&#x6587;&#x6863;&#xFF0C;&#x7136;&#x540E;&#x6700;&#x540E;&#x6C47;&#x603B;&#x751F;&#x6210;&#x4E00;&#x4E2A;api&#x6587;&#x6863;&#x6C47;&#x603B;&#x9875;&#x9762;&#xFF0C;&#x4F9B;&#x524D;&#x7AEF;&#x81EA;&#x5DF1;&#x6A21;&#x62DF;&#x8BF7;&#x6C42;&#x63A5;&#x53E3;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x6587;&#x6863;&#x548C;&#x4EE3;&#x7801;&#x89C1;&#xFF1A; <a href="https://github.com/xinyu198736/rainbow" target="_blank" rel="external">https://github.com/xinyu198736/rainbow</a></p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x662F;&#x7528;&#x5305;&#x7684;&#x65B9;&#x5F0F;&#x5F15;&#x5165;&#x7684;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x5185;&#x7F6E;&#x5230;&#x9879;&#x76EE;lib&#x91CC;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x4E0D;&#x80FD;&#x4FDD;&#x8BC1;&#x53CA;&#x65F6;&#x66F4;&#x65B0;&#xFF0C;&#x5176;&#x5B9E;&#x539F;&#x7406;&#x5F88;&#x7B80;&#x5355;&#x3002;</p>
<p>&#x4E0D;&#x8981;&#x5C0F;&#x770B;&#x8FD9;&#x79CD;route&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#xFF0C;&#x5F53;route&#x53D8;&#x5F97;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6587;&#x4EF6;&#x5939;&#x5D4C;&#x5957;&#x7684;&#x65B9;&#x5F0F;&#x5C31;&#x53D8;&#x5F97;&#x975E;&#x5E38;&#x5B9E;&#x7528;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x5B9A;&#x4F4D;&#x5230;&#x67D0;&#x4E2A;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x4E2D;&#x3002;</p>
<h2 id="4-_ORM">4. ORM</h2><p>ORM&#x662F;&#x4E00;&#x79CD;&#x5C06;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x62BD;&#x8C61;&#x6210;&#x8BED;&#x8A00;&#x539F;&#x751F;&#x5BF9;&#x8C61;&#x64CD;&#x4F5C;&#x7684;&#x65B9;&#x6CD5;&#x5DE5;&#x5177;&#x3002;&#x5728;NodeJS&#x91CC;&#x6709;&#x4E0D;&#x5C11;orm&#x5E93;&#xFF0C;&#x4E0D;&#x8FC7;&#x5DF2;&#x7ECF;&#x7A33;&#x5065;&#x6210;&#x719F;&#x7684;&#x4E0D;&#x591A;&#xFF0C;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;sequelize&#xFF0C;&#x5DF2;&#x7ECF;&#x53D1;&#x5C55;&#x5F88;&#x4E45;&#x4E86;&#xFF0C;&#x57FA;&#x7840;&#x529F;&#x80FD;&#x7A33;&#x5B9A;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5F88;&#x591A;&#x529F;&#x80FD;&#x8FD8;&#x5728;beta&#xFF0C;&#x5076;&#x5C14;&#x8FD8;&#x4F1A;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x86CB;&#x75BC;&#x7684;bug&#xFF0C;&#x4F8B;&#x5982;&#x4ED6;&#x7684;promise&#xFF0C;&#x91CC;&#x9762;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x4E24;&#x6B21;&#x56DE;&#x8C03;&#x4E4B;&#x7C7B;&#x7684;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x65E2;&#x7136;&#x7528;&#x4E86;&#x90A3;&#x4E5F;&#x6CA1;&#x8BDD;&#x8BF4;&#x4E86;&#xFF0C;ORM&#x9664;&#x4E86;&#x6027;&#x80FD;&#x4E0A;&#x6709;&#x4E00;&#x5B9A;&#x5F71;&#x54CD;&#x4E4B;&#x5916;&#xFF0C;&#x597D;&#x5904;&#x8FD8;&#x662F;&#x5927;&#x4E8E;&#x574F;&#x5904;&#x7684;&#xFF0C;&#x9996;&#x5148;&#x662F;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x5F88;&#x65B9;&#x4FBF;&#xFF0C;&#x51E0;&#x53E5;&#x8BDD;&#x641E;&#x5B9A;&#xFF0C;&#x7136;&#x540E;&#x7EF4;&#x62A4;&#x66F4;&#x65B9;&#x4FBF;&#xFF0C;&#x589E;&#x52A0;&#x5B57;&#x6BB5;&#x4E4B;&#x7C7B;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x57FA;&#x672C;&#x5C31;&#x662F;&#x5206;&#x5206;&#x949F;&#x641E;&#x5B9A;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x6728;&#x6709;ORM&#x7684;MVC&#x7ED3;&#x6784;&#x662F;&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x6211;&#x4EEC;&#x7684;&#x7ED3;&#x6784;&#x66F4;&#x5B8C;&#x7F8E;&#xFF0C;&#x6211;&#x4EEC;&#x5F88;&#x86CB;&#x75BC;&#x7684;&#x5728;ORM&#x4E0A;&#x9762;&#x53C8;&#x5C01;&#x88C5;&#x4E86;&#x4E00;&#x5C42;&#x3002;&#x540D;&#x5B57;&#x53EB;&#x505A;SuperModel&#x3002;</p>
<p>SuperModel&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E;ORM&#x7684;&#x9876;&#x5C42;&#x5C01;&#x88C5;&#xFF0C;&#x4F5C;&#x7528;&#x6709;&#x4E8C;&#xFF1A;</p>
<p>A. &#x7EDF;&#x8BA1;mysql&#x548C;mongodb&#x7684;&#x64CD;&#x4F5C;&#x63A5;&#x53E3;&#xFF0C;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x5316;&#xFF0C;&#x751A;&#x81F3;&#x4F60;&#x6839;&#x672C;&#x4E0D;&#x77E5;&#x9053;&#x4F60;&#x5728;&#x7528;mysql&#x8FD8;&#x662F;mongo&#x7684;&#x8BF4;&#x3002;</p>
<p>B. &#x628A;ORM&#x5C01;&#x88C5;&#x6210;&#x7EDF;&#x4E00;&#x7684;&#x94FE;&#x5F0F;&#x64CD;&#x4F5C;&#xFF0C;&#x8DDF;mongoose&#x7684;&#x64CD;&#x4F5C;&#x6709;&#x70B9;&#x7C7B;&#x4F3C;&#x3002;</p>
<pre><code><span class="built_in">var</span> userModel <span class="subst">=</span> <span class="literal">new</span> SuperModel(<span class="subst">&amp;</span><span class="variable">#x201C</span>;user<span class="subst">&amp;</span><span class="variable">#x201D</span>;);
</code></pre><p>&#x8FD9;&#x53E5;&#x8BDD;&#x5C31;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;SuperModel&#x5B9E;&#x4F8B;&#xFF0C;user&#x662F;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x662F;&#x4E00;&#x4E2A;json&#x683C;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x822C;&#x653E;&#x5728;&#x9879;&#x76EE;&#x91CC;&#x7684;model&#x76EE;&#x5F55;&#x4E0B;</p>
<p><img src="http://taojinke.github.io/img/20150702/9fdd2b7.png" alt=""></p>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x64CD;&#x4F5C;&#xFF1A;</p>
<pre><code>Example.findAll<span class="params">()</span>.where<span class="params">({id:{lt:<span class="number">3</span>}})</span>.<span class="built_in">offset</span><span class="params">(<span class="number">10</span>)</span>.limit<span class="params">(<span class="number">10</span>)</span>
.order<span class="params">({id:&amp;quot;desc&amp;quot;})</span>.fields<span class="params">([&amp;apos;id&amp;apos;,&amp;apos;title&amp;apos;,&amp;apos;content&amp;apos;])</span>
.done<span class="params">(function<span class="params">(error,datas)</span>{

})</span>
</code></pre><p>&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x7684;&#x9879;&#x76EE;&#x662F;&#x79FB;&#x690D;&#x8FC7;&#x6765;&#x7684;&#xFF0C;&#x65B0;&#x7248;&#x7684;&#x4E1A;&#x52A1;&#x624D;&#x4F7F;&#x7528;&#x4E86;ORM&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x5F88;&#x5C0F;&#x4E00;&#x90E8;&#x5206;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#x3002;</p>
<h2 id="5-_Util">5. Util</h2><p>&#x8FD9;&#x4E2A;&#x8DDF;MVC&#x6CA1;&#x4EC0;&#x4E48;&#x5173;&#x7CFB;&#x4E86;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x6709;&#x4E9B;&#x5DE5;&#x5177;&#x7C7B;&#x5355;&#x72EC;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#xFF0C;&#x4F8B;&#x5982;JSON&#x8BF7;&#x6C42;&#x7EDF;&#x4E00;&#x8FD4;&#x56DE;&#x7C7B;&#xFF0C;&#x5B57;&#x7B26;&#x4E32;&#x5904;&#x7406;&#xFF0C;&#x65E5;&#x671F;&#x5904;&#x7406;&#x7C7B;&#xFF0C;&#x7F16;&#x7801;&#x5904;&#x7406;&#x7C7B;&#xFF0C;&#x63A8;&#x9001;&#x77ED;&#x4FE1;&#x7C7B;&#xFF0C;&#x52A0;&#x5BC6;&#x89E3;&#x5BC6;&#x7B49;&#x3002;&#x8FD9;&#x4E9B;&#x5DE5;&#x5177;&#x8DDF;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x5173;&#xFF0C;&#x7EAF;&#x5DE5;&#x5177;&#x6027;&#x8D28;&#xFF0C;&#x6240;&#x4EE5;&#x62BD;&#x53D6;&#x51FA;&#x6765;&#x4F5C;&#x4E3A;Util&#x5B58;&#x5728;&#x3002;</p>
<h2 id="6-_filter">6. filter</h2><p>&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x5947;&#x602A;&#x7684;&#x5C42;&#xFF0C;&#x662F;&#x7531;rainbow&#x5F15;&#x5165;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5C06;&#x5176;&#x4F5C;&#x4E3A;controller&#x7684;&#x524D;&#x7F6E;&#x5C42;&#xFF0C;&#x5927;&#x6982;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x524D;&#x7F6E;&#x4E2D;&#x95F4;&#x4EF6;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x529F;&#x80FD;&#x65B9;&#x9762;&#xFF0C;&#x4E3B;&#x8981;&#x505A;&#x4E9B; &#x7528;&#x6237;&#x767B;&#x5F55;&#x524D;&#x7F6E;&#x9A8C;&#x8BC1;&#x7B49;&#x3002;&#x6240;&#x8C13;&#x7684;filter&#xFF0C;&#x5B57;&#x9762;&#x610F;&#x601D;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x7684;&#xFF0C;&#x5728;&#x8FDB;&#x5165;&#x7EAF;&#x51C0;&#x7684;controller&#x4E4B;&#x524D;&#x8FC7;&#x6EE4;&#x4E00;&#x4E0B;&#x3002;</p>
<p>&#x5177;&#x4F53;&#x7528;&#x6CD5;&#x89C1; &#x4E0A;&#x9762; rainbow&#x7684;&#x6587;&#x6863;&#x3002;</p>
<h2 id="&#x5C0F;&#x7ED3;&#x3002;">&#x5C0F;&#x7ED3;&#x3002;</h2><p>&#x5176;&#x5B9E;&#x8BF4;&#x662F;&#x8981;&#x603B;&#x7ED3;MVC&#x57FA;&#x7840;&#x8981;&#x7D20;&#x4E00;&#x6837;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x6700;&#x540E;&#x76EE;&#x7684;&#x53EA;&#x662F;&#x4E3A;&#x4E86;&#x5206;&#x4EAB;&#x4E0B;&#x6211;&#x4EEC;&#x9879;&#x76EE;&#x7684;&#x5E94;&#x7528;&#x7ED3;&#x6784;&#x3002;&#x4E5F;&#x7B97;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x4E00;&#x70B9;&#x70B9;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x5E0C;&#x671B;&#x5BF9;&#x521D;&#x5B66;&#x8005;&#x80FD;&#x591F;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x542F;&#x53D1;&#xFF0C;&#x5BF9;&#x8D44;&#x6DF1;&#x5F00;&#x53D1;&#x80FD;&#x591F;&#x6709;&#x53E6;&#x5916;&#x4E00;&#x79CD;&#x601D;&#x8DEF;&#xFF0C;&#x4E5F;&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x4E00;&#x8D77;&#x4EA4;&#x6D41;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x8FD8;&#x4F1A;&#x6709;&#x5176;&#x4ED6;&#x4E00;&#x7CFB;&#x5217;&#x6587;&#x7AE0;&#xFF0C;&#x4E8B;&#x5148;&#x9884;&#x544A;&#x4E0B;&#xFF1A;</p>
<ol>
<li>&#x5B58;&#x50A8;&#xFF0C;&#x7F13;&#x5B58;&#xFF0C;&#x4E91;&#x670D;&#x52A1; &#x65B9;&#x9762;&#x7684;&#x4E00;&#x4E9B;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x548C;&#x7ECF;&#x9A8C;&#x3002;</li>
<li>NodeJS&#x670D;&#x52A1;&#x6027;&#x80FD;&#x76D1;&#x6D4B;&#xFF0C;&#x8C03;&#x4F18;&#xFF0C;&#x8C03;&#x8BD5;&#xFF0C;&#x76D1;&#x63A7;&#x62A5;&#x8B66;&#xFF0C;&#x5E94;&#x6025;&#x5904;&#x7406;&#x65B9;&#x9762;&#x7684;&#x8BDD;&#x9898;&#x3002;</li>
<li>NodeJS&#x7EBF;&#x4E0A;&#x591A;&#x673A;&#x90E8;&#x7F72;&#xFF0C;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x90E8;&#x7F72;&#x548C;&#x4F7F;&#x7528;&#xFF0C;&#x65B9;&#x9762;&#x7684;&#x8BDD;&#x9898;&#x3002;</li>
</ol>
<p>&#x6B22;&#x8FCE;&#x5927;&#x5BB6;&#x6301;&#x7EED;&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#x7684;&#x4E13;&#x680F;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;&#x6211;&#x4EEC;&#x7684;NodeJS&#x670D;&#x52A1;&#x7AEF;&#x5F00;&#x53D1;&#x56E2;&#x961F;&#x4E5F;&#x5728;&#x62DB;&#x8058;&#x5C0F;&#x4F19;&#x4F34;&#x4E00;&#x8D77;&#x52A0;&#x5165;&#x5DE5;&#x4F5C;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x3002;&#x5173;&#x4E8E;&#x6211;&#x4EEC;&#x516C;&#x53F8;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4E0D;&#x591A;&#x4ECB;&#x7ECD;&#x5566;&#xFF0C;C&#x8F6E;&#x521A;&#x8FC7;&#x7684;&#x4E8C;&#x624B;&#x8F66;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E92;&#x8054;&#x7F51;&#x4F01;&#x4E1A;&#xFF0C;&#x5750;&#x6807;&#x676D;&#x5DDE;&#xFF0C;300&#x4EBA;&#x56E2;&#x961F;&#xFF0C;&#x5927;&#x6982;100&#x540D;&#x5F00;&#x53D1;&#x4EA7;&#x54C1;&#x8BBE;&#x8BA1;&#xFF0C;&#x6211;&#x7684;&#x56E2;&#x961F;&#x73B0;&#x5728;&#x5927;&#x6982;16&#x4EBA;&#xFF0C;&#x5206;&#x4E3A;&#x524D;&#x7AEF;&#x548C;NodeJS&#x4E24;&#x90E8;&#x5206;&#xFF0C;&#x90FD;&#x7F3A;&#x4EBA;&#xFF0C;&#x5404;&#x79CD;&#x6C42;&#x624D;&#x3002;&#x7B80;&#x5386;&#x76F4;&#x63A5;&#x53D1;&#x6211;&#x90AE;&#x7BB1;&#x5373;&#x53EF;&#xFF1A;sunxinyu@souche.com</p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/MVC模式/">MVC模式</a><a href="/tags/Node-js/">Node.js</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/02/9fd2cb3/" title="大话cocos2d-js(2) -">
  <strong>上一篇：</strong><br/>
  <span>
  大话cocos2d-js(2) -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/02/9fa2937/"  title="拒绝外部修改的对象（Node.js） -">
 <strong>下一篇：</strong><br/> 
 <span>拒绝外部修改的对象（Node.js） -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-2"><a class="toc-link" href="#长长而且无关的前言"><span class="toc-number">1.</span> <span class="toc-text">长长而且无关的前言</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#1-_Controller，Model，View。"><span class="toc-number">2.</span> <span class="toc-text">1. Controller，Model，View。</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#2-_Service"><span class="toc-number">3.</span> <span class="toc-text">2. Service</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#3-_Route"><span class="toc-number">4.</span> <span class="toc-text">3. Route</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#4-_ORM"><span class="toc-number">5.</span> <span class="toc-text">4. ORM</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#5-_Util"><span class="toc-number">6.</span> <span class="toc-text">5. Util</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#6-_filter"><span class="toc-number">7.</span> <span class="toc-text">6. filter</span></a></li><li class="toc-item toc-level-2"><a class="toc-link" href="#小结。"><span class="toc-number">8.</span> <span class="toc-text">小结。</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>587</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>32</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>23</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/MySQL/" title="MySQL">MySQL<sup>9</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
