
 <!DOCTYPE HTML>
<html lang="zh-CN">
<head>
  <meta charset="UTF-8">
  <meta name="baidu-site-verification" content="1XvvwQ7Apt" />
  
    <title>mongodb复制集内部机制 - | dianzi blog</title>
    <meta name="viewport" content="width=device-width, initial-scale=1,user-scalable=no">
    
    <meta name="author" content="edwin">
    

    
    <meta name="description" content="&amp;#x5E26;&amp;#x7740;&amp;#x526F;&amp;#x672C;&amp;#x96C6;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x6765;&amp;#x770B;&amp;#x5427;&amp;#xFF01;

&amp;#x526F;&amp;#x672C;&amp;#x96C6;&amp;#x6545;&amp;#x969C;&amp;#x8F6C;&amp;#x79FB;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8282;&amp;#x70B9;&amp;#x662F;&amp;#x598">
<meta property="og:type" content="article">
<meta property="og:title" content="mongodb复制集内部机制 -">
<meta property="og:url" content="http://taojinke.github.io/2015/07/06/19edee8/index.html">
<meta property="og:site_name" content="dianzi blog">
<meta property="og:description" content="&amp;#x5E26;&amp;#x7740;&amp;#x526F;&amp;#x672C;&amp;#x96C6;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x6765;&amp;#x770B;&amp;#x5427;&amp;#xFF01;

&amp;#x526F;&amp;#x672C;&amp;#x96C6;&amp;#x6545;&amp;#x969C;&amp;#x8F6C;&amp;#x79FB;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8282;&amp;#x70B9;&amp;#x662F;&amp;#x598">
<meta property="og:updated_time" content="2015-07-06T13:30:00.495Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="mongodb复制集内部机制 -">
<meta name="twitter:description" content="&amp;#x5E26;&amp;#x7740;&amp;#x526F;&amp;#x672C;&amp;#x96C6;&amp;#x7684;&amp;#x95EE;&amp;#x9898;&amp;#x6765;&amp;#x770B;&amp;#x5427;&amp;#xFF01;

&amp;#x526F;&amp;#x672C;&amp;#x96C6;&amp;#x6545;&amp;#x969C;&amp;#x8F6C;&amp;#x79FB;&amp;#xFF0C;&amp;#x4E3B;&amp;#x8282;&amp;#x70B9;&amp;#x662F;&amp;#x598">

    
    <link rel="alternative" href="/atom.xml" title="dianzi blog" type="application/atom+xml">
    
    
    <link rel="icon" href="/img/favicon.ico">
    
    
    <link rel="apple-touch-icon" href="/img/jacman.jpg">
    <link rel="apple-touch-icon-precomposed" href="/img/jacman.jpg">
    
    <link rel="stylesheet" href="/css/style.css" type="text/css">

  <script>
    var _hmt = _hmt || [];
    (function() {
      var hm = document.createElement("script");
      hm.src = "//hm.baidu.com/hm.js?345f95aea4ada2935d6f9ea4177b51ab";
      var s = document.getElementsByTagName("script")[0];
      s.parentNode.insertBefore(hm, s);
    })();
  </script>

</head>

  <body>
    <header>
      
<div>
		
			<div id="imglogo">
				<a href="/"><img src="/img/logo.png" alt="dianzi blog" title="dianzi blog"/></a>
			</div>
			
			<div id="textlogo">
				<h1 class="site-name"><a href="/" title="dianzi blog">dianzi blog</a></h1>
				<h2 class="blog-motto"></h2>
			</div>
			<div class="navbar"><a class="navbutton navmobile" href="#" title="菜单">
			</a></div>
			<nav class="animated">
				<ul>
					<ul>
					 
						<li><a href="/">Home</a></li>
					
						<li><a href="/archives">Archives</a></li>
					
						<li><a href="/about">About</a></li>
					
					<li>
						<a href="/music/index.html" target="_blank">Music</a>
					</li>
					<li>
 					
						<form class="search" action="http://taojinke.github.io/" target="_blank">
							<label>Search</label>
						<input name="s" type="hidden" value= null ><input type="text" name="q" size="30" placeholder="搜索"><br>
						</form>
					
					</li>
				</ul>
			</nav>			
</div>

    </header>
    <div id="container">
      <div id="main" class="post" itemscope itemprop="blogPost">
  
	<article itemprop="articleBody"> 
		<header class="article-info clearfix">
  <h1 itemprop="name">
    
      <a href="/2015/07/06/19edee8/" title="mongodb复制集内部机制 -" itemprop="url">mongodb复制集内部机制 -</a>
  </h1>
  <p class="article-author">By
       
		<a href="/about" title="edwin" target="_blank" itemprop="author">edwin</a>
		
  <p class="article-time">
    <time datetime="2015-07-06T01:30:00.000Z" itemprop="datePublished"> 发表于 2015-07-06</time>
    
  </p>
</header>
	<div class="article-content">
		
		<div id="toc" class="toc-article">
			<strong class="toc-title">文章目录</strong>
		
			<ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#Bully算法"><span class="toc-number">1.</span> <span class="toc-text">Bully算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#选举"><span class="toc-number">2.</span> <span class="toc-text">选举</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#选举触发条件"><span class="toc-number">3.</span> <span class="toc-text">选举触发条件</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#奇数"><span class="toc-number">4.</span> <span class="toc-text">奇数</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#心跳"><span class="toc-number">5.</span> <span class="toc-text">心跳</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#同步"><span class="toc-number">6.</span> <span class="toc-text">同步</span></a></li></ol>
		
		</div>
		
		<p>&#x5E26;&#x7740;&#x526F;&#x672C;&#x96C6;&#x7684;&#x95EE;&#x9898;&#x6765;&#x770B;&#x5427;&#xFF01;</p>
<ul>
<li>&#x526F;&#x672C;&#x96C6;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x662F;&#x5982;&#x4F55;&#x9009;&#x4E3E;&#x7684;&#xFF1F;&#x80FD;&#x5426;&#x624B;&#x52A8;&#x5E72;&#x6D89;&#x4E0B;&#x67B6;&#x67D0;&#x4E00;&#x53F0;&#x4E3B;&#x8282;&#x70B9;&#x3002;</li>
<li>&#x5B98;&#x65B9;&#x8BF4;&#x526F;&#x672C;&#x96C6;&#x6570;&#x91CF;&#x6700;&#x597D;&#x662F;&#x5947;&#x6570;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#xFF1F;</li>
<li>mongodb&#x526F;&#x672C;&#x96C6;&#x662F;&#x5982;&#x4F55;&#x540C;&#x6B65;&#x7684;&#xFF1F;&#x5982;&#x679C;&#x540C;&#x6B65;&#x4E0D;&#x53CA;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x4EC0;&#x4E48;&#x60C5;&#x51B5;&#xFF1F;&#x4F1A;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x4E0D;&#x4E00;&#x81F4;&#x6027;&#xFF1F;</li>
<li>mongodb&#x7684;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x4F1A;&#x4E0D;&#x4F1A;&#x65E0;&#x6545;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#xFF1F;&#x4EC0;&#x4E48;&#x6761;&#x4EF6;&#x4F1A;&#x89E6;&#x53D1;&#xFF1F;&#x9891;&#x7E41;&#x89E6;&#x53D1;&#x53EF;&#x80FD;&#x4F1A;&#x5E26;&#x6765;&#x7CFB;&#x7EDF;&#x8D1F;&#x8F7D;&#x52A0;&#x91CD;&#xFF1F;</li>
</ul>
<h3 id="Bully&#x7B97;&#x6CD5;">Bully&#x7B97;&#x6CD5;</h3><p>mongodb&#x526F;&#x672C;&#x96C6;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x529F;&#x80FD;&#x5F97;&#x76CA;&#x4E8E;&#x5B83;&#x7684;&#x9009;&#x4E3E;&#x673A;&#x5236;&#x3002;&#x9009;&#x4E3E;&#x673A;&#x5236;&#x91C7;&#x7528;&#x4E86;Bully&#x7B97;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x4ECE;&#x5206;&#x5E03;&#x5F0F;&#x8282;&#x70B9;&#x4E2D;&#x9009;&#x51FA;&#x4E3B;&#x8282;&#x70B9;&#x3002;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x96C6;&#x7FA4;&#x67B6;&#x6784;&#x4E2D;&#x4E00;&#x822C;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x6240;&#x8C13;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x5F88;&#x591A;&#x7528;&#x9014;&#xFF0C;&#x6BD4;&#x5982;&#x7F13;&#x5B58;&#x673A;&#x5668;&#x8282;&#x70B9;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x4F5C;&#x4E3A;&#x96C6;&#x7FA4;&#x7684;&#x8BBF;&#x95EE;&#x5165;&#x53E3;&#x7B49;&#x7B49;&#x3002;&#x4E3B;&#x8282;&#x70B9;&#x6709;&#x5C31;&#x6709;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x5E72;&#x561B;&#x8981;&#x4EC0;&#x4E48;Bully&#x7B97;&#x6CD5;&#xFF1F;&#x8981;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x6211;&#x4EEC;&#x5148;&#x770B;&#x770B;&#x8FD9;&#x4E24;&#x79CD;&#x67B6;&#x6784;&#xFF1A;</p>
<ol>
<li>&#x6307;&#x5B9A;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#x4E00;&#x822C;&#x90FD;&#x4F1A;&#x7533;&#x660E;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x4ECE;&#x8282;&#x70B9;&#xFF0C;&#x5982;&#x6211;&#x4EEC;&#x5E38;&#x7528;&#x7684;mysql&#x5C31;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x67B6;&#x6784;&#x6211;&#x4EEC;&#x5728;&#x7B2C;&#x4E00;&#x8282;&#x8BF4;&#x4E86;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x5982;&#x679C;&#x4E3B;&#x8282;&#x70B9;&#x6302;&#x6389;&#x4E86;&#x5C31;&#x5F97;&#x624B;&#x5DE5;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0A;&#x67B6;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#x6216;&#x8005;&#x4ECE;&#x4ECE;&#x8282;&#x70B9;&#x6062;&#x590D;&#x6570;&#x636E;&#xFF0C;&#x4E0D;&#x592A;&#x7075;&#x6D3B;&#x3002;</li>
<li>&#x4E0D;&#x6307;&#x5B9A;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x8282;&#x70B9;&#x90FD;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x3002;mongodb&#x4E5F;&#x5C31;&#x662F;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x67B6;&#x6784;&#xFF0C;&#x4E00;&#x4F46;&#x4E3B;&#x8282;&#x70B9;&#x6302;&#x4E86;&#x5176;&#x4ED6;&#x4ECE;&#x8282;&#x70B9;&#x81EA;&#x52A8;&#x63A5;&#x66FF;&#x53D8;&#x6210;&#x4E3B;&#x8282;&#x70B9;&#x3002;</li>
</ol>
<p>&#x597D;&#x4E86;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x5728;&#x8FD9;&#x4E2A;&#x5730;&#x65B9;&#xFF0C;&#x65E2;&#x7136;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x4E00;&#x4F46;&#x4E3B;&#x8282;&#x70B9;&#x6302;&#x4E86;&#xFF0C;&#x600E;&#x4E48;&#x9009;&#x62E9;&#x51FA;&#x6765;&#x4E0B;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;&#x8C01;&#x6765;&#x505A;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x5462;&#xFF1F;&#x8FD9;&#x5C31;&#x662F;Bully&#x7B97;&#x6CD5;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x90A3;&#x4EC0;&#x4E48;&#x662F;Bully&#x7B97;&#x6CD5;&#xFF0C; <strong>Bully&#x7B97;&#x6CD5;</strong> &#x662F;&#x4E00;&#x79CD;&#x534F;&#x8C03;&#x8005;&#xFF08;&#x4E3B;&#x8282;&#x70B9;&#xFF09;&#x7ADE;&#x9009;&#x7B97;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x601D;&#x60F3;&#x662F;&#x96C6;&#x7FA4;&#x7684;&#x6BCF;&#x4E2A;&#x6210;&#x5458;&#x90FD;&#x53EF;&#x4EE5;&#x58F0;&#x660E;&#x5B83;&#x662F;&#x4E3B;&#x8282;&#x70B9;&#x5E76;&#x901A;&#x77E5;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002;&#x522B;&#x7684;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x63A5;&#x53D7;&#x8FD9;&#x4E2A;&#x58F0;&#x79F0;&#x6216;&#x662F;&#x62D2;&#x7EDD;&#x5E76;&#x8FDB;&#x5165;&#x4E3B;&#x8282;&#x70B9;&#x7ADE;&#x4E89;&#x3002;&#x88AB;&#x5176;&#x4ED6;&#x6240;&#x6709;&#x8282;&#x70B9;&#x63A5;&#x53D7;&#x7684;&#x8282;&#x70B9;&#x624D;&#x80FD;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x3002;&#x8282;&#x70B9;&#x6309;&#x7167;&#x4E00;&#x4E9B;&#x5C5E;&#x6027;&#x6765;&#x5224;&#x65AD;&#x8C01;&#x5E94;&#x8BE5;&#x80DC;&#x51FA;&#x3002;&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x53EF;&#x4EE5;&#x662F;&#x4E00;&#x4E2A;&#x9759;&#x6001;ID&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x66F4;&#x65B0;&#x7684;&#x5EA6;&#x91CF;&#x50CF;&#x6700;&#x8FD1;&#x4E00;&#x6B21;&#x4E8B;&#x52A1;ID&#xFF08;&#x6700;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x4F1A;&#x80DC;&#x51FA;&#xFF09;&#x3002;&#x8BE6;&#x60C5;&#x8BF7;&#x53C2;&#x8003; <a href="http://blog.nosqlfan.com/html/4139.html" target="_blank" rel="external">NoSQL&#x6570;&#x636E;&#x5E93;&#x5206;&#x5E03;&#x5F0F;&#x7B97;&#x6CD5;&#x7684;&#x534F;&#x8C03;&#x8005;&#x7ADE;&#x9009;</a> &#x8FD8;&#x6709; <a href="http://en.wikipedia.org/wiki/Bully_algorithm" target="_blank" rel="external">&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x7684;&#x89E3;&#x91CA;</a> &#x3002; </p>
<h3 id="&#x9009;&#x4E3E;">&#x9009;&#x4E3E;</h3><p>&#x90A3;mongodb&#x662F;&#x600E;&#x8FDB;&#x884C;&#x9009;&#x4E3E;&#x7684;&#x5462;&#xFF1F;&#x5B98;&#x65B9;&#x8FD9;&#x4E48;&#x63CF;&#x8FF0;:</p>
<p>We use a consensus protocol to pick a primary. Exact details will be spared here but that basic process is:</p>
<ol>
<li>get maxLocalOpOrdinal from each server.</li>
<li>if a majority of servers are not up (from this server&#x2019;s POV), remain in Secondary mode and stop.</li>
<li>if the last op time seems very old, stop and await human intervention.</li>
<li>else, using a consensus protocol, pick the server with the highest maxLocalOpOrdinal as the Primary.</li>
</ol>
<p>&#x5927;&#x81F4;&#x7FFB;&#x8BD1;&#x8FC7;&#x6765;&#x4E3A;&#x4F7F;&#x7528;&#x4E00;&#x81F4;&#x534F;&#x8BAE;&#x9009;&#x62E9;&#x4E3B;&#x8282;&#x70B9;&#x3002;&#x57FA;&#x672C;&#x6B65;&#x9AA4;&#x4E3A;&#xFF1A;</p>
<ol>
<li>&#x5F97;&#x5230;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x7684;&#x6700;&#x540E;&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x6BCF;&#x4E2A;mongodb&#x90FD;&#x6709;oplog&#x673A;&#x5236;&#x4F1A;&#x8BB0;&#x5F55;&#x672C;&#x673A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x65B9;&#x4FBF;&#x548C;&#x4E3B;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#x6570;&#x636E;&#x662F;&#x5426;&#x540C;&#x6B65;&#x8FD8;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x9519;&#x8BEF;&#x6062;&#x590D;&#x3002;</li>
<li>&#x5982;&#x679C;&#x96C6;&#x7FA4;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x670D;&#x52A1;&#x5668;down&#x673A;&#x4E86;&#xFF0C;&#x4FDD;&#x7559;&#x6D3B;&#x7740;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x4E3A; secondary&#x72B6;&#x6001;&#x5E76;&#x505C;&#x6B62;&#xFF0C;&#x4E0D;&#x9009;&#x4E3E;&#x4E86;&#x3002;</li>
<li>&#x5982;&#x679C;&#x96C6;&#x7FA4;&#x4E2D;&#x9009;&#x4E3E;&#x51FA;&#x6765;&#x7684;&#x4E3B;&#x8282;&#x70B9;&#x6216;&#x8005;&#x6240;&#x6709;&#x4ECE;&#x8282;&#x70B9;&#x6700;&#x540E;&#x4E00;&#x6B21;&#x540C;&#x6B65;&#x65F6;&#x95F4;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x65E7;&#x4E86;&#xFF0C;&#x505C;&#x6B62;&#x9009;&#x4E3E;&#x7B49;&#x5F85;&#x4EBA;&#x6765;&#x64CD;&#x4F5C;&#x3002;</li>
<li>&#x5982;&#x679C;&#x4E0A;&#x9762;&#x90FD;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x5C31;&#x9009;&#x62E9;&#x6700;&#x540E;&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#x6233;&#x6700;&#x65B0;&#xFF08;&#x4FDD;&#x8BC1;&#x6570;&#x636E;&#x662F;&#x6700;&#x65B0;&#x7684;&#xFF09;&#x7684;&#x670D;&#x52A1;&#x5668;&#x8282;&#x70B9;&#x4F5C;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x3002;</li>
</ol>
<p>&#x8FD9;&#x91CC;&#x63D0;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x4E00;&#x81F4;&#x534F;&#x8BAE;&#xFF08;&#x5176;&#x5B9E;&#x5C31;&#x662F;bully&#x7B97;&#x6CD5;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x548C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#x8FD8;&#x662F;&#x6709;&#x4E9B;&#x533A;&#x522B;&#xFF0C;&#x4E00;&#x81F4;&#x534F;&#x8BAE;&#x4E3B;&#x8981;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x901A;&#x8FC7;&#x4E00;&#x4E9B;&#x673A;&#x5236;&#x4FDD;&#x8BC1;&#x5927;&#x5BB6;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#xFF1B;&#x800C;&#x4E00;&#x81F4;&#x6027;&#x534F;&#x8BAE;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x64CD;&#x4F5C;&#x7684;&#x987A;&#x5E8F;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x6BD4;&#x5982;&#x540C;&#x65F6;&#x8BFB;&#x5199;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4F1A;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x810F;&#x6570;&#x636E;&#x3002;&#x4E00;&#x81F4;&#x534F;&#x8BAE;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x91CC;&#x6709;&#x4E00;&#x4E2A;&#x7ECF;&#x5178;&#x7684;&#x7B97;&#x6CD5;&#x53EB;&#x201C;Paxos&#x7B97;&#x6CD5;&#x201D;&#xFF0C;&#x540E;&#x7EED;&#x518D;&#x4ECB;&#x7ECD;&#x3002;</p>
<p>&#x4E0A;&#x9762;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x6240;&#x6709;&#x4ECE;&#x8282;&#x70B9;&#x7684;&#x6700;&#x540E;&#x64CD;&#x4F5C;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x4E00;&#x6837;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x5C31;&#x662F;&#x8C01;&#x5148;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x65F6;&#x95F4;&#x6700;&#x5FEB;&#x5C31;&#x9009;&#x8C01;&#x3002;</p>
<h3 id="&#x9009;&#x4E3E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;">&#x9009;&#x4E3E;&#x89E6;&#x53D1;&#x6761;&#x4EF6;</h3><p>&#x9009;&#x4E3E;&#x4E0D;&#x662F;&#x4EC0;&#x4E48;&#x65F6;&#x523B;&#x90FD;&#x4F1A;&#x88AB;&#x89E6;&#x53D1;&#x7684;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x89E6;&#x53D1;&#x3002;</p>
<ol>
<li>&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x96C6;&#x65F6;&#x3002;</li>
<li>&#x526F;&#x672C;&#x96C6;&#x548C;&#x4E3B;&#x8282;&#x70B9;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x7F51;&#x7EDC;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x4E3B;&#x8282;&#x70B9;&#x6302;&#x6389;&#x3002;</li>
</ol>
<p>&#x9009;&#x4E3E;&#x8FD8;&#x6709;&#x4E2A;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#xFF0C;&#x53C2;&#x4E0E;&#x9009;&#x4E3E;&#x7684;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x526F;&#x672C;&#x96C6;&#x603B;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x5982;&#x679C;&#x5DF2;&#x7ECF;&#x5C0F;&#x4E8E;&#x4E00;&#x534A;&#x4E86;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4FDD;&#x6301;&#x53EA;&#x8BFB;&#x72B6;&#x6001;&#x3002;&#x65E5;&#x5FD7;&#x5C06;&#x4F1A;&#x51FA;&#x73B0;&#xFF1A; </p>
<pre><code>can&amp;apos;t see <span class="operator">a</span> majority <span class="operator">of</span> <span class="operator">the</span> <span class="built_in">set</span>, relinquishing primary
</code></pre><p>&#x4E3B;&#x8282;&#x70B9;&#x6302;&#x6389;&#x80FD;&#x5426;&#x4EBA;&#x4E3A;&#x5E72;&#x9884;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#x3002;</p>
<ol>
<li><p>&#x53EF;&#x4EE5;&#x901A;&#x8FC7;replSetStepDown&#x547D;&#x4EE4;&#x4E0B;&#x67B6;&#x4E3B;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x53EF;&#x4EE5;&#x767B;&#x5F55;&#x4E3B;&#x8282;&#x70B9;&#x4F7F;&#x7528;</p>
<p> db.adminCommand({replSetStepDown : 1})</p>
</li>
</ol>
<p>&#x5982;&#x679C;&#x6740;&#x4E0D;&#x6389;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5F3A;&#x5236;&#x5F00;&#x5173;</p>
<pre><code><span class="tag">db</span><span class="class">.adminCommand</span>({<span class="attribute">replSetStepDown </span>: <span class="number">1</span>, <span class="attribute">force </span>: true})
</code></pre><p>&#x6216;&#x8005;&#x4F7F;&#x7528; rs.stepDown(120)&#x4E5F;&#x53EF;&#x4EE5;&#x8FBE;&#x5230;&#x540C;&#x6837;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4E2D;&#x95F4;&#x7684;&#x6570;&#x5B57;&#x6307;&#x4E0D;&#x80FD;&#x5728;&#x505C;&#x6B62;&#x670D;&#x52A1;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x5355;&#x4F4D;&#x4E3A;&#x79D2;&#x3002;</p>
<ol>
<li>&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x4ECE;&#x8282;&#x70B9;&#x6709;&#x6BD4;&#x4E3B;&#x8282;&#x70B9;&#x6709;&#x66F4;&#x9AD8;&#x7684;&#x4F18;&#x5148;&#x7EA7;&#x3002;<br>&#x5148;&#x67E5;&#x770B;&#x5F53;&#x524D;&#x96C6;&#x7FA4;&#x4E2D;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x901A;&#x8FC7;rs.conf()&#x547D;&#x4EE4;&#xFF0C;&#x9ED8;&#x8BA4;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;1&#x662F;&#x4E0D;&#x663E;&#x793A;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x6807;&#x793A;&#x51FA;&#x6765;&#x3002;</li>
</ol>
<p>rs.conf();</p>
<p>{</p>
<p>&quot;_id&quot; : &quot;rs0&quot;,</p>
<p>&quot;version&quot; : 9,</p>
<p>&quot;members&quot; : [</p>
<p>{</p>
<p>&quot;_id&quot; : 0,</p>
<p>&quot;host&quot; : &quot;192.168.1.136:27017&quot; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;},</p>
<p>{</p>
<p>&quot;_id&quot; : 1,</p>
<p>&quot;host&quot; : &quot;192.168.1.137:27017&quot; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;},</p>
<p>{</p>
<p>&quot;_id&quot; : 2,</p>
<p>&quot;host&quot; : &quot;192.168.1.138:27017&quot; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0; &#xA0;}</p>
<p>]</p>
<p>}</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x8BBE;&#x7F6E;&#xFF0C;&#x8BA9;id&#x4E3A;1&#x7684;&#x4E3B;&#x673A;&#x53EF;&#x4EE5;&#x4F18;&#x5148;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x3002;</p>
<pre><code>cfg = rs.<span class="function"><span class="title">conf</span><span class="params">()</span></span>
cfg<span class="class">.members</span>[<span class="number">0</span>]<span class="class">.priority</span> = <span class="number">1</span>
cfg<span class="class">.members</span>[<span class="number">1</span>]<span class="class">.priority</span> = <span class="number">2</span>
cfg<span class="class">.members</span>[<span class="number">2</span>]<span class="class">.priority</span> = <span class="number">1</span>
rs.<span class="function"><span class="title">reconfig</span><span class="params">(cfg)</span></span>
</code></pre><p>&#x7136;&#x540E;&#x518D;&#x6267;&#x884C;rs.conf()&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x4F18;&#x5148;&#x7EA7;&#x5DF2;&#x7ECF;&#x8BBE;&#x7F6E;&#x6210;&#x529F;&#xFF0C;&#x4E3B;&#x8282;&#x70B9;&#x9009;&#x4E3E;&#x4E5F;&#x4F1A;&#x89E6;&#x53D1;&#x3002;</p>
<pre><code>{
&amp;quot;_id&amp;quot; <span class="value">: &amp;quot;</span>rs0&amp;quot;,
&amp;quot;version&amp;quot; <span class="value">: <span class="number">9</span>,
&amp;quot;</span>members&amp;quot; <span class="value">: [
    {
        &amp;quot;</span>_id&amp;quot; <span class="value">: <span class="number">0</span>,
        &amp;quot;</span>host&amp;quot; <span class="value">: &amp;quot;</span>192<span class="class">.168</span><span class="class">.1</span><span class="class">.136</span><span class="value">:<span class="number">27017</span>&amp;quot;</span>        },
    {
        &amp;quot;_id&amp;quot; <span class="value">: <span class="number">1</span>,
        &amp;quot;</span>host&amp;quot; <span class="value">: &amp;quot;</span>192<span class="class">.168</span><span class="class">.1</span><span class="class">.137</span><span class="value">:<span class="number">27017</span>&amp;quot;</span>,
        &amp;quot;priority&amp;quot; <span class="value">: <span class="number">2</span>
    },
    {
        &amp;quot;</span>_id&amp;quot; <span class="value">: <span class="number">2</span>,
        &amp;quot;</span>host&amp;quot; <span class="value">: &amp;quot;</span>192<span class="class">.168</span><span class="class">.1</span><span class="class">.138</span><span class="value">:<span class="number">27017</span>&amp;quot;</span>        }
  ]
 }
</code></pre><p>&#x5982;&#x679C;&#x4E0D;&#x60F3;&#x8BA9;&#x4E00;&#x4E2A;&#x4ECE;&#x8282;&#x70B9;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x600E;&#x4E48;&#x64CD;&#x4F5C;&#xFF1F;</p>
<p>a&#x3001;&#x4F7F;&#x7528;rs.freeze(120)&#x51BB;&#x7ED3;&#x6307;&#x5B9A;&#x7684;&#x79D2;&#x6570;&#x4E0D;&#x80FD;&#x9009;&#x4E3E;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x3002;</p>
<p>b&#x3001;&#x6309;&#x7167;&#x4E0A;&#x4E00;&#x7BC7;&#x8BBE;&#x7F6E;&#x8282;&#x70B9;&#x4E3A;Non-Voting&#x7C7B;&#x578B;&#x3002;</p>
<ol>
<li>&#x5F53;&#x4E3B;&#x8282;&#x70B9;&#x4E0D;&#x80FD;&#x548C;&#x5927;&#x90E8;&#x5206;&#x4ECE;&#x8282;&#x70B9;&#x901A;&#x8BAF;&#x3002;&#x628A;&#x4E3B;&#x673A;&#x8282;&#x70B9;&#x7F51;&#x7EBF;&#x62D4;&#x6389;&#xFF0C;&#x563F;&#x563F;&#xFF1A;&#xFF09;</li>
</ol>
<p>&#x4F18;&#x5148;&#x7EA7;&#x8FD8;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4E0D;&#x60F3;&#x8BBE;&#x7F6E;&#x4EC0;&#x4E48;hidden&#x8282;&#x70B9;&#xFF0C;&#x5C31;&#x7528;secondary&#x7C7B;&#x578B;&#x4F5C;&#x4E3A;&#x5907;&#x4EFD;&#x8282;&#x70B9;&#x4E5F;&#x4E0D;&#x60F3;&#x8BA9;&#x4ED6;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#x770B;&#x4E0B;&#x56FE;&#xFF0C;&#x5171;&#x4E09;&#x4E2A;&#x8282;&#x70B9;&#x5206;&#x5E03;&#x5728;&#x4E24;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#xFF0C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;2&#x7684;&#x8282;&#x70B9;&#x8BBE;&#x7F6E;&#x4F18;&#x5148;&#x7EA7;&#x4E3A;0&#x4E0D;&#x80FD;&#x6210;&#x4E3A;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x9009;&#x4E3E;&#x3001;&#x6570;&#x636E;&#x590D;&#x5236;&#x3002;&#x67B6;&#x6784;&#x8FD8;&#x662F;&#x5F88;&#x7075;&#x6D3B;&#x5427;&#xFF01;</p>
<h3 id="&#x5947;&#x6570;">&#x5947;&#x6570;</h3><p>&#x5B98;&#x65B9;&#x63A8;&#x8350;&#x526F;&#x672C;&#x96C6;&#x7684;&#x6210;&#x5458;&#x6570;&#x91CF;&#x4E3A;&#x5947;&#x6570;&#xFF0C;&#x6700;&#x591A;12&#x4E2A;&#x526F;&#x672C;&#x96C6;&#x8282;&#x70B9;&#xFF0C;&#x6700;&#x591A;7&#x4E2A;&#x8282;&#x70B9;&#x53C2;&#x4E0E;&#x9009;&#x4E3E;&#x3002;&#x6700;&#x591A;12&#x4E2A;&#x526F;&#x672C;&#x96C6;&#x8282;&#x70B9;&#x662F;&#x56E0;&#x4E3A;&#x6CA1;&#x5FC5;&#x8981;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x590D;&#x5236;&#x90A3;&#x4E48;&#x591A;&#x4EFD;&#xFF0C;&#x5907;&#x4EFD;&#x592A;&#x591A;&#x53CD;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x7F51;&#x7EDC;&#x8D1F;&#x8F7D;&#x548C;&#x62D6;&#x6162;&#x4E86;&#x96C6;&#x7FA4;&#x6027;&#x80FD;&#xFF1B;&#x800C;&#x6700;&#x591A;7&#x4E2A;&#x8282;&#x70B9;&#x53C2;&#x4E0E;&#x9009;&#x4E3E;&#x662F;&#x56E0;&#x4E3A;&#x5185;&#x90E8;&#x9009;&#x4E3E;&#x673A;&#x5236;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x592A;&#x591A;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;1&#x5206;&#x949F;&#x5185;&#x8FD8;&#x9009;&#x4E0D;&#x51FA;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x51E1;&#x4E8B;&#x53EA;&#x8981;&#x9002;&#x5F53;&#x5C31;&#x597D;&#x3002;&#x8FD9;&#x4E2A;&#x201C;12&#x201D;&#x3001;&#x201C;7&#x201D;&#x6570;&#x5B57;&#x8FD8;&#x597D;&#xFF0C;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x5B98;&#x65B9;&#x7ECF;&#x8FC7;&#x6027;&#x80FD;&#x6D4B;&#x8BD5;&#x5B9A;&#x4E49;&#x51FA;&#x6765;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x3002;&#x5177;&#x4F53;&#x8FD8;&#x6709;&#x54EA;&#x4E9B;&#x9650;&#x5236;&#x53C2;&#x8003;&#x5B98;&#x65B9;&#x6587;&#x6863; <a href="http://docs.mongodb.org/manual/reference/limits/" target="_blank" rel="external">&#x300A; MongoDB Limits and Thresholds &#x300B;</a> &#x3002; &#x4F46;&#x662F;&#x8FD9;&#x91CC;&#x4E00;&#x76F4;&#x6CA1;&#x641E;&#x61C2;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x5947;&#x6570;&#xFF0C;&#x901A;&#x8FC7;&#x6D4B;&#x8BD5;&#x96C6;&#x7FA4;&#x7684;&#x6570;&#x91CF;&#x4E3A;&#x5076;&#x6570;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x7684;&#xFF0C;&#x53C2;&#x8003;&#x8FD9;&#x4E2A;&#x6587;&#x7AE0;<a href="http://www.itpub.net/thread-1740982-1-1.html&#x3002;&#x540E;&#x6765;&#x7A81;&#x7136;&#x770B;&#x4E86;&#x4E00;&amp;#x7BC7" target="_blank" rel="external">http://www.itpub.net/thread-1740982-1-1.html&#x3002;&#x540E;&#x6765;&#x7A81;&#x7136;&#x770B;&#x4E86;&#x4E00;&amp;#x7BC7</a>; <a href="http://stackoverflow.com/questions/16150409/why-does-a-mongodb-replica-set-require-an-odd-number-of-voting-nodes" target="_blank" rel="external">stackoverflow&#x7684;&#x6587;&#x7AE0;</a> &#x7EC8;&#x4E8E;&#x987F;&#x609F;&#x4E86;&#xFF0C;mongodb&#x672C;&#x8EAB;&#x8BBE;&#x8BA1;&#x7684;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x8DE8;IDC&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x628A;&#x5B83;&#x653E;&#x5230;&#x5927;&#x7684;&#x73AF;&#x5883;&#x6765;&#x770B;&#x3002; </p>
<p>&#x5047;&#x8BBE;&#x56DB;&#x4E2A;&#x8282;&#x70B9;&#x88AB;&#x5206;&#x6210;&#x4E24;&#x4E2A;IDC&#xFF0C;&#x6BCF;&#x4E2A;IDC&#x5404;&#x4E24;&#x53F0;&#x673A;&#x5668;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x3002;&#x4F46;&#x8FD9;&#x6837;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x679C;&#x4E24;&#x4E2A;IDC&#x7F51;&#x7EDC;&#x65AD;&#x6389;&#xFF0C;&#x8FD9;&#x5728;&#x5E7F;&#x57DF;&#x7F51;&#x4E0A;&#x5F88;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x9009;&#x4E3E;&#x4E2D;&#x63D0;&#x5230;&#x53EA;&#x8981;&#x4E3B;&#x8282;&#x70B9;&#x548C;&#xFFFD;&#xFFFD;&#xFFFD;&#x7FA4;&#x4E2D;&#x5927;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x65AD;&#x5F00;&#x94FE;&#x63A5;&#x5C31;&#x4F1A;&#x5F00;&#x59CB;&#x4E00;&#x8F6E;&#x65B0;&#x7684;&#x9009;&#x4E3E;&#x64CD;&#x4F5C;&#xFF0C;&#x4E0D;&#x8FC7;mongodb&#x526F;&#x672C;&#x96C6;&#x4E24;&#x8FB9;&#x90FD;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4F46;&#x662F;&#x9009;&#x4E3E;&#x8981;&#x6C42;&#x53C2;&#x4E0E;&#x7684;&#x8282;&#x70B9;&#x6570;&#x91CF;&#x5FC5;&#x987B;&#x5927;&#x4E8E;&#x4E00;&#x534A;&#xFF0C;&#x8FD9;&#x6837;&#x6240;&#x6709;&#x96C6;&#x7FA4;&#x8282;&#x70B9;&#x90FD;&#x6CA1;&#x529E;&#x6CD5;&#x53C2;&#x4E0E;&#x9009;&#x4E3E;&#xFF0C;&#x53EA;&#x4F1A;&#x5904;&#x4E8E;&#x53EA;&#x8BFB;&#x72B6;&#x6001;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x5947;&#x6570;&#x8282;&#x70B9;&#x5C31;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5047;&#x8BBE;3&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x53EA;&#x8981;&#x6709;2&#x4E2A;&#x8282;&#x70B9;&#x6D3B;&#x7740;&#x5C31;&#x53EF;&#x4EE5;&#x9009;&#x4E3E;&#xFF0C;5&#x4E2A;&#x4E2D;&#x7684;3&#x4E2A;&#xFF0C;7&#x4E2A;&#x4E2D;&#x7684;4&#x4E2A;&#x3002;&#x3002;&#x3002;</p>
<h3 id="&#x5FC3;&#x8DF3;">&#x5FC3;&#x8DF3;</h3><p>&#x7EFC;&#x4E0A;&#x6240;&#x8FF0;&#xFF0C;&#x6574;&#x4E2A;&#x96C6;&#x7FA4;&#x9700;&#x8981;&#x4FDD;&#x6301;&#x4E00;&#x5B9A;&#x7684;&#x901A;&#x4FE1;&#x624D;&#x80FD;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x8282;&#x70B9;&#x6D3B;&#x7740;&#x54EA;&#x4E9B;&#x8282;&#x70B9;&#x6302;&#x6389;&#x3002;mongodb&#x8282;&#x70B9;&#x4F1A;&#x5411;&#x526F;&#x672C;&#x96C6;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x6BCF;&#x4E24;&#x79D2;&#x5C31;&#x4F1A;&#x53D1;&#x9001;&#x4E00;&#x6B21;pings&#x5305;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5728;10&#x79D2;&#x949F;&#x4E4B;&#x5185;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x5C31;&#x6807;&#x793A;&#x4E3A;&#x4E0D;&#x80FD;&#x8BBF;&#x95EE;&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5185;&#x90E8;&#x90FD;&#x4F1A;&#x7EF4;&#x62A4;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x6620;&#x5C04;&#x8868;&#xFF0C;&#x8868;&#x660E;&#x5F53;&#x524D;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x662F;&#x4EC0;&#x4E48;&#x89D2;&#x8272;&#x3001;&#x65E5;&#x5FD7;&#x65F6;&#x95F4;&#x6233;&#x7B49;&#x5173;&#x952E;&#x4FE1;&#x606F;&#x3002;&#x5982;&#x679C;&#x662F;&#x4E3B;&#x8282;&#x70B9;&#xFF0C;&#x9664;&#x4E86;&#x7EF4;&#x62A4;&#x6620;&#x5C04;&#x8868;&#x5916;&#x8FD8;&#x9700;&#x8981;&#x68C0;&#x67E5;&#x81EA;&#x5DF1;&#x80FD;&#x5426;&#x548C;&#x96C6;&#x7FA4;&#x4E2D;&#x5185;&#x5927;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x901A;&#x8BAF;&#xFF0C;&#x5982;&#x679C;&#x4E0D;&#x80FD;&#x5219;&#x628A;&#x81EA;&#x5DF1;&#x964D;&#x7EA7;&#x4E3A;secondary&#x53EA;&#x8BFB;&#x8282;&#x70B9;&#x3002;</p>
<h3 id="&#x540C;&#x6B65;">&#x540C;&#x6B65;</h3><p>&#x526F;&#x672C;&#x96C6;&#x540C;&#x6B65;&#x5206;&#x4E3A;&#x521D;&#x59CB;&#x5316;&#x540C;&#x6B65;&#x548C;keep&#x590D;&#x5236;&#x3002;&#x521D;&#x59CB;&#x5316;&#x540C;&#x6B65;&#x6307;&#x5168;&#x91CF;&#x4ECE;&#x4E3B;&#x8282;&#x70B9;&#x540C;&#x6B65;&#x6570;&#x636E;&#xFF0C;&#x5982;&#x679C;&#x4E3B;&#x8282;&#x70B9;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x8F83;&#x5927;&#x540C;&#x6B65;&#x65F6;&#x95F4;&#x4F1A;&#x6BD4;&#x8F83;&#x957F;&#x3002;&#x800C;keep&#x590D;&#x5236;&#x6307;&#x521D;&#x59CB;&#x5316;&#x540C;&#x6B65;&#x8FC7;&#x540E;&#xFF0C;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x5B9E;&#x65F6;&#x540C;&#x6B65;&#x4E00;&#x822C;&#x662F;&#x589E;&#x91CF;&#x540C;&#x6B65;&#x3002;&#x521D;&#x59CB;&#x5316;&#x540C;&#x6B65;&#x4E0D;&#x53EA;&#x662F;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x624D;&#x4F1A;&#x88AB;&#x5904;&#x7F5A;&#xFF0C;&#x6709;&#x4EE5;&#x4E0B;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4F1A;&#x89E6;&#x53D1;&#xFF1A;</p>
<ol>
<li>secondary&#x7B2C;&#x4E00;&#x6B21;&#x52A0;&#x5165;&#xFF0C;&#x8FD9;&#x4E2A;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#x3002;</li>
<li>secondary&#x843D;&#x540E;&#x7684;&#x6570;&#x636E;&#x91CF;&#x8D85;&#x8FC7;&#x4E86;oplog&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x8FD9;&#x6837;&#x4E5F;&#x4F1A;&#x88AB;&#x5168;&#x91CF;&#x590D;&#x5236;&#x3002;</li>
</ol>
<p>&#x90A3;&#x4EC0;&#x4E48;&#x662F;oplog&#x7684;&#x5927;&#x5C0F;&#xFF1F;&#x524D;&#x9762;&#x8BF4;&#x8FC7;oplog&#x4FDD;&#x5B58;&#x4E86;&#x6570;&#x636E;&#x7684;&#x64CD;&#x4F5C;&#x8BB0;&#x5F55;&#xFF0C;secondary&#x590D;&#x5236;oplog&#x5E76;&#x628A;&#x91CC;&#x9762;&#x7684;&#x64CD;&#x4F5C;&#x5728;secondary&#x6267;&#x884C;&#x4E00;&#x904D;&#x3002;&#x4F46;&#x662F;oplog&#x4E5F;&#x662F;mongodb&#x7684;&#x4E00;&#x4E2A;&#x96C6;&#x5408;&#xFF0C;&#x4FDD;&#x5B58;&#x5728;local.oplog.rs&#x91CC;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;oplog&#x662F;&#x4E00;&#x4E2A;capped collection&#x4E5F;&#x5C31;&#x662F;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x65B0;&#x6570;&#x636E;&#x52A0;&#x5165;&#x8D85;&#x8FC7;&#x96C6;&#x5408;&#x7684;&#x5927;&#x5C0F;&#x4F1A;&#x8986;&#x76D6;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x9700;&#x8981;&#x6CE8;&#x610F;&#xFF0C;&#x8DE8;IDC&#x7684;&#x590D;&#x5236;&#x8981;&#x8BBE;&#x7F6E;&#x5408;&#x9002;&#x7684;oplogSize&#xFF0C;&#x907F;&#x514D;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x7ECF;&#x5E38;&#x4EA7;&#x751F;&#x5168;&#x91CF;&#x590D;&#x5236;&#x3002;oplogSize &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x2013;oplogSize&#x8BBE;&#x7F6E;&#x5927;&#x5C0F;&#xFF0C;&#x5BF9;&#x4E8E;linux &#x548C;windows 64&#x4F4D;&#xFF0C;oplog size&#x9ED8;&#x8BA4;&#x4E3A;&#x5269;&#x4F59;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7684;5%&#x3002; </p>
<p>&#x540C;&#x6B65;&#x4E5F;&#x5E76;&#x975E;&#x53EA;&#x80FD;&#x4ECE;&#x4E3B;&#x8282;&#x70B9;&#x540C;&#x6B65;&#xFF0C;&#x5047;&#x8BBE;&#x96C6;&#x7FA4;&#x4E2D;3&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x8282;&#x70B9;1&#x662F;&#x4E3B;&#x8282;&#x70B9;&#x5728;IDC1&#xFF0C;&#x8282;&#x70B9;2&#x3001;&#x8282;&#x70B9;3&#x5728;IDC2&#xFF0C;&#x521D;&#x59CB;&#x5316;&#x8282;&#x70B9;2&#x3001;&#x8282;&#x70B9;3&#x4F1A;&#x4ECE;&#x8282;&#x70B9;1&#x540C;&#x6B65;&#x6570;&#x636E;&#x3002;&#x540E;&#x9762;&#x8282;&#x70B9;2&#x3001;&#x8282;&#x70B9;3&#x4F1A;&#x4F7F;&#x7528;&#x5C31;&#x8FD1;&#x539F;&#x5219;&#x4ECE;&#x5F53;&#x524D;IDC&#x7684;&#x526F;&#x672C;&#x96C6;&#x4E2D;&#x8FDB;&#x884C;&#x590D;&#x5236;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4ECE;IDC1&#x7684;&#x8282;&#x70B9;1&#x590D;&#x5236;&#x6570;&#x636E;&#x3002;</p>
<p>&#x8BBE;&#x7F6E;&#x540C;&#x6B65;&#x8FD8;&#x8981;&#x6CE8;&#x610F;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF1A;</p>
<ol>
<li>secondary&#x4E0D;&#x4F1A;&#x4ECE;delayed&#x548C;hidden&#x6210;&#x5458;&#x4E0A;&#x590D;&#x5236;&#x6570;&#x636E;&#x3002;</li>
<li>&#x53EA;&#x8981;&#x662F;&#x9700;&#x8981;&#x540C;&#x6B65;&#xFF0C;&#x4E24;&#x4E2A;&#x6210;&#x5458;&#x7684;buildindexes&#x5FC5;&#x987B;&#x8981;&#x76F8;&#x540C;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x662F;true&#x548C;false&#x3002;buildindexes&#x4E3B;&#x8981;&#x7528;&#x6765;&#x8BBE;&#x7F6E;&#x662F;&#x5426;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x6570;&#x636E;&#x7528;&#x4E8E;&#x67E5;&#x8BE2;&#xFF0C;&#x9ED8;&#x8BA4;&#x4E3A;true&#x3002;</li>
<li>&#x5982;&#x679C;&#x540C;&#x6B65;&#x64CD;&#x4F5C;30&#x79D2;&#x90FD;&#x6CA1;&#x6709;&#x53CD;&#x5E94;&#xFF0C;&#x5219;&#x4F1A;&#x91CD;&#x65B0;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x540C;&#x6B65;&#x3002;</li>
</ol>
<p>&#x5230;&#x6B64;&#xFF0C;&#x672C;&#x7AE0;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684;&#x95EE;&#x9898;&#x5168;&#x90E8;&#x89E3;&#x51B3;&#x4E86;&#xFF0C;&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;mongodb&#x7684;&#x8BBE;&#x8BA1;&#x8FD8;&#x771F;&#x662F;&#x5F3A;&#x5927;&#xFF01;</p>
<p>&#x540E;&#x7EED;&#x7EE7;&#x7EED;&#x89E3;&#x51B3;&#x4E0A;&#x4E00;&#x8282;&#x8FD9;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;</p>
<ul>
<li>&#x4E3B;&#x8282;&#x70B9;&#x6302;&#x4E86;&#x80FD;&#x5426;&#x81EA;&#x52A8;&#x5207;&#x6362;&#x8FDE;&#x63A5;&#xFF1F;&#x76EE;&#x524D;&#x9700;&#x8981;&#x624B;&#x5DE5;&#x5207;&#x6362;&#x3002;</li>
<li>&#x4E3B;&#x8282;&#x70B9;&#x7684;&#x8BFB;&#x5199;&#x538B;&#x529B;&#x8FC7;&#x5927;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#xFF1F;</li>
</ul>
<p>&#x8FD8;&#x6709;&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x540E;&#x7EED;&#x89E3;&#x51B3;&#xFF1A;</p>
<ul>
<li>&#x4ECE;&#x8282;&#x70B9;&#x6BCF;&#x4E2A;&#x4E0A;&#x9762;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x5168;&#x91CF;&#x62F7;&#x8D1D;&#xFF0C;&#x4ECE;&#x8282;&#x70B9;&#x538B;&#x529B;&#x4F1A;&#x4E0D;&#x4F1A;&#x8FC7;&#x5927;&#xFF1F;</li>
<li>&#x6570;&#x636E;&#x538B;&#x529B;&#x5927;&#x5230;&#x673A;&#x5668;&#x652F;&#x6491;&#x4E0D;&#x4E86;&#x7684;&#x65F6;&#x5019;&#x80FD;&#x5426;&#x505A;&#x5230;&#x81EA;&#x52A8;&#x6269;&#x5C55;&#xFF1F;</li>
</ul>
<p>&#x8F6C;&#x81EA;&#xFF1A;<a href="http://www.lanceyan.com/tech/mongodb_repset2.html" target="_blank" rel="external">http://www.lanceyan.com/tech/mongodb_repset2.html</a></p>
  
	</div>
		<footer class="article-footer clearfix">
<div class="article-catetags">

<div class="article-categories">
  <span></span>
  <a class="article-category-link" href="/categories/transcribe/">transcribe</a>
</div>


  <div class="article-tags">
  
  <span></span> <a href="/tags/MongoDB/">MongoDB</a>
  </div>

</div>



	<div class="article-share" id="share">
	
	<div class="share-jiathis">
	  
<div class="jiathis_style_24x24">
	<a class="jiathis_button_tsina"></a>
	<a class="jiathis_button_weixin"></a>
	<a class="jiathis_button_renren"></a>
	<a class="jiathis_button_qzone"></a>
	<a class="jiathis_button_googleplus"></a>
	<a class="jiathis_button_douban"></a>
	<a href="http://www.jiathis.com/share" class="jiathis jiathis_txt jtico jtico_jiathis" target="_blank"></a>
	<a class="jiathis_counter_style"></a>
</div>
<script type="text/javascript" >
    var jiathis_config={
    data_track_clickback:true,
    sm:"copy,renren,cqq",
    pic:"",
    summary:"",
    
  </script> 
<script type="text/javascript" src="//v3.jiathis.com/code/jia.js?uid=
1696217" charset="utf-8"></script>      

	 </div>
	
	</div>


</footer>

   	       
	</article>
	
<nav class="article-nav clearfix">
 
 <div class="prev" >
 <a href="/2015/07/06/19bec83/" title="MongoDB 数据库管理（不定时更新） -">
  <strong>上一篇：</strong><br/>
  <span>
  MongoDB 数据库管理（不定时更新） -</span>
</a>
</div>


<div class="next">
<a href="/2015/07/06/19d7805/"  title="MongoDB 3.0 用户创建 -">
 <strong>下一篇：</strong><br/> 
 <span>MongoDB 3.0 用户创建 -
</span>
</a>
</div>

</nav>

	


	<!--���ٰ�-->
	<div id="SOHUCS"></div>
	<script charset="utf-8" type="text/javascript" src="http://assets.changyan.sohu.com/upload/changyan.js" ></script>
	<script type="text/javascript">
		window.changyan.api.config({
			appid: 'cyrNEabSF',
			conf: 'prod_034326b8fb64167667674dc334104436'
		});
	</script>
</div>


      <div class="openaside"><a class="navbutton" href="#" title="显示侧边栏"></a></div>

  <div id="toc" class="toc-aside">
  <strong class="toc-title">文章目录</strong>
 
 <ol class="toc"><li class="toc-item toc-level-3"><a class="toc-link" href="#Bully算法"><span class="toc-number">1.</span> <span class="toc-text">Bully算法</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#选举"><span class="toc-number">2.</span> <span class="toc-text">选举</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#选举触发条件"><span class="toc-number">3.</span> <span class="toc-text">选举触发条件</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#奇数"><span class="toc-number">4.</span> <span class="toc-text">奇数</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#心跳"><span class="toc-number">5.</span> <span class="toc-text">心跳</span></a></li><li class="toc-item toc-level-3"><a class="toc-link" href="#同步"><span class="toc-number">6.</span> <span class="toc-text">同步</span></a></li></ol>
 
  </div>

<div id="asidepart">
<div class="closeaside"><a class="closebutton" href="#" title="隐藏侧边栏"></a></div>
<aside class="clearfix">

  
<div class="categorieslist">
	<p class="asidetitle">分类</p>
		<ul>
		
		  
			<li><a href="/categories/transcribe/" title="transcribe">transcribe<sup>587</sup></a></li>
		  
		
		  
			<li><a href="/categories/日志/" title="日志">日志<sup>1</sup></a></li>
		  
		
		</ul>
</div>


  
<div class="tagslist">
	<p class="asidetitle">标签</p>
		<ul class="clearfix">
		
			
				<li><a href="/tags/ZooKeeper/" title="ZooKeeper">ZooKeeper<sup>80</sup></a></li>
			
		
			
				<li><a href="/tags/Node-js/" title="Node.js">Node.js<sup>75</sup></a></li>
			
		
			
				<li><a href="/tags/Memcached/" title="Memcached">Memcached<sup>71</sup></a></li>
			
		
			
				<li><a href="/tags/JVM/" title="JVM">JVM<sup>65</sup></a></li>
			
		
			
				<li><a href="/tags/io-js/" title="io.js">io.js<sup>35</sup></a></li>
			
		
			
				<li><a href="/tags/Spring-MVC/" title="Spring MVC">Spring MVC<sup>33</sup></a></li>
			
		
			
				<li><a href="/tags/数据库/" title="数据库">数据库<sup>32</sup></a></li>
			
		
			
				<li><a href="/tags/Gulp/" title="Gulp">Gulp<sup>29</sup></a></li>
			
		
			
				<li><a href="/tags/Linux/" title="Linux">Linux<sup>28</sup></a></li>
			
		
			
				<li><a href="/tags/Nosql/" title="Nosql">Nosql<sup>27</sup></a></li>
			
		
			
				<li><a href="/tags/C/" title="C++">C++<sup>24</sup></a></li>
			
		
			
				<li><a href="/tags/MongoDB/" title="MongoDB">MongoDB<sup>23</sup></a></li>
			
		
			
				<li><a href="/tags/开源/" title="开源">开源<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Java/" title="Java">Java<sup>16</sup></a></li>
			
		
			
				<li><a href="/tags/Redis/" title="Redis">Redis<sup>14</sup></a></li>
			
		
			
				<li><a href="/tags/Dubbo/" title="Dubbo">Dubbo<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/程序员/" title="程序员">程序员<sup>13</sup></a></li>
			
		
			
				<li><a href="/tags/Net/" title=".Net">.Net<sup>11</sup></a></li>
			
		
			
				<li><a href="/tags/源码分析/" title="源码分析">源码分析<sup>10</sup></a></li>
			
		
			
				<li><a href="/tags/MySQL/" title="MySQL">MySQL<sup>9</sup></a></li>
			
		
		</ul>
</div>


<div class="weiboshow">
	<p class="asidetitle">新浪微博</p>
	<iframe width="100%" height="550" class="share_self"  frameborder="0" scrolling="no" src="http://widget.weibo.com/weiboshow/index.php?language=&width=0&height=550&fansRow=2&ptype=1&speed=0&skin=1&isTitle=1&noborder=1&isWeibo=1&isFans=1&uid=1289635200&verifier=e6bef170&dpc=1"></iframe>
</div>


  <div class="linkslist">
  <p class="asidetitle">友情链接</p>
    <ul>
        
          <li>
            
            	<a href="https://coderq.com" target="_blank" title="一个面向程序员交流分享的新一代社区">码农圈</a>
            
          </li>
        
          <li>
            
            	<a href="http://wuchong.me" target="_blank" title="Jark&#39;s Blog">Jark&#39;s Blog</a>
            
          </li>
        
    </ul>
</div>

  


  <div class="rsspart">
	<a href="/atom.xml" target="_blank" title="rss">RSS 订阅</a>
</div>

</aside>
</div>
    </div>
    <footer><div id="footer" >
	
	<div class="line">
		<span></span>
		<div class="author"></div>
	</div>
	
	
	<section class="info">
		<p> Hello ,I&#39;m Larry Page in Google. <br/>
			This is my blog,believe it or not.</p>
	</section>
	 
	<div class="social-font" class="clearfix">
		
		<a href="http://weibo.com/512316815" target="_blank" class="icon-weibo" title="微博"></a>
		
		
		<a href="https://github.com/sblig" target="_blank" class="icon-github" title="github"></a>
		
		
		
		
		
		
		
		
		
	</div>
			
		

		<p class="copyright">
		Powered by <a href="http://hexo.io" target="_blank" title="hexo">hexo</a> and Theme by <a href="https://github.com/sblig" target="_blank" title="fblog">fblog</a> © 2015
		
		<a href="/about" target="_blank" title="edwin">edwin</a>
		
		
		</p>
</div>
</footer>
    <script src="/js/jquery-2.0.3.min.js"></script>
<script src="/js/jquery.imagesloaded.min.js"></script>
<script src="/js/gallery.js"></script>

<script type="text/javascript">
$(document).ready(function(){ 
  $('.navbar').click(function(){
    $('header nav').toggleClass('shownav');
  });
  var myWidth = 0;
  function getSize(){
    if( typeof( window.innerWidth ) == 'number' ) {
      myWidth = window.innerWidth;
    } else if( document.documentElement && document.documentElement.clientWidth) {
      myWidth = document.documentElement.clientWidth;
    };
  };
  var m = $('#main'),
      a = $('#asidepart'),
      c = $('.closeaside'),
      o = $('.openaside');
  c.click(function(){
    a.addClass('fadeOut').css('display', 'none');
    o.css('display', 'block').addClass('fadeIn');
    m.addClass('moveMain');
  });
  o.click(function(){
    o.css('display', 'none').removeClass('beforeFadeIn');
    a.css('display', 'block').removeClass('fadeOut').addClass('fadeIn');      
    m.removeClass('moveMain');
  });
  $(window).scroll(function(){
    o.css("top",Math.max(80,260-$(this).scrollTop()));
  });
  
  $(window).resize(function(){
    getSize(); 
    if (myWidth >= 1024) {
      $('header nav').removeClass('shownav');
    }else{
      m.removeClass('moveMain');
      a.css('display', 'block').removeClass('fadeOut');
      o.css('display', 'none');
      
      $('#toc.toc-aside').css('display', 'none');
        
    }
  });
});
</script>

<script type="text/javascript">
$(document).ready(function(){ 
  var ai = $('.article-content>iframe'),
      ae = $('.article-content>embed'),
      t  = $('#toc'),
      ta = $('#toc.toc-aside'),
      o  = $('.openaside'),
      c  = $('.closeaside');
  if(ai.length>0){
    ai.wrap('<div class="video-container" />');
  };
  if(ae.length>0){
   ae.wrap('<div class="video-container" />');
  };
  c.click(function(){
    ta.css('display', 'block').addClass('fadeIn');
  });
  o.click(function(){
    ta.css('display', 'none');
  });
  $(window).scroll(function(){
    ta.css("top",Math.max(140,320-$(this).scrollTop()));
  });
});
</script>










<link rel="stylesheet" href="/fancybox/jquery.fancybox.css" media="screen" type="text/css">
<script src="/fancybox/jquery.fancybox.pack.js"></script>
<script type="text/javascript">
$(document).ready(function(){ 
  $('.article-content').each(function(i){
    $(this).find('img').each(function(){
      if ($(this).parent().hasClass('fancybox')) return;
      var alt = this.alt;
      if (alt) $(this).after('<span class="caption">' + alt + '</span>');
      $(this).wrap('<a href="' + this.src + '" title="' + alt + '" class="fancybox"></a>');
    });
    $(this).find('.fancybox').each(function(){
      $(this).attr('rel', 'article' + i);
    });
  });
  if($.fancybox){
    $('.fancybox').fancybox();
  }
}); 
</script>



<!-- Analytics Begin -->





<!-- Analytics End -->

<!-- Totop Begin -->

	<div id="totop">
	<a title="返回顶部"><img src="/img/scrollup.png"/></a>
	</div>
	<script src="/js/totop.js"></script>

<!-- Totop End -->

<!-- MathJax Begin -->
<!-- mathjax config similar to math.stackexchange -->


<!-- MathJax End -->

<!-- Tiny_search Begin -->

<!-- Tiny_search End -->

  </body>
</html>
